[
    {
        "id": 1,
        "text": "Down in south Philly for a meeting at my daughter's school, we were looking for a place to eat before. We drove by this place and noticed the signage from Passyunk. I like chicken but was not in the mood for it. But I decided to compromise with my husband. \n\nWhen we walked in, I immediately noticed the minimalist interior/seating and liked that you could see where/how they were preparing the food. I was SO excited when I saw this was Korean fried chicken and not just regular fried chicken. We ordered a fried chicken wing combo (with crinkle fries and a drink), calamari, beef sticks and a chicken nugget combo (with fried and a drink) for my daughter. There was a long list of sauces you could try with your food. \n\nI wasn't that into the calamari but the owner told us he was trying them out for the first time and asked what we thought. I appreciated that he asked for our feedback. The beef sticks were delicious, as were the chicken wings. I even liked my daughter's nuggets. \n\nWe spent approx. $25 for everything which I thought was good for all we got. I really liked that the high-top tables faced the windows so you could look outside. Definitely a cool new spot."
    },
    {
        "id": 2,
        "text": "This place popped up on one of my food delivery apps and always eager to try new places I decided to give this place a try. It was close to my house so I decided to go in person for my first visit. I ordered the Korean wings with the Korean hot and sweet chili sauce and a few skewers that were only 1.50 each. The prices are more then reasonable and the food was delicious. I enjoyed both sauces very much. I was impressed and couldn't wait to order again. A couple weeks later I decided to order delivery through my food delivery app. I was super excited to see the menu had expanded. As much as I wanted to get wings again, I decided to get something different. I ordered chicken fingers this time with the same 2 awesome sauces, chicken and beef teriyaki and fried scallops. The food arrived quickly and It was exquisite. This place has made my short list in record time. I would not hesitate to recommend this place. You won't be disappointed. I wish the owner best of luck and hope this place sticks around for a while."
    },
    {
        "id": 3,
        "text": "Hi! \n\nI'm interested in your beautiful commercial building! I'm not sure if you are the owner or if you are subleasing the place but I'm looking to take over the lease for you ASAP! We have a successful established takeout restaurant already and we're looking to expand into your building as a second new location. Please contact me ASAP hahzai@gmail.com. Or 215-200-8138 thank you!\n\nHannah A."
    },
    {
        "id": 4,
        "text": "So excited to know that we have a new Korean Fried Chicken nearby. I love fried chicken, especially Korean one! Thinking no need to go to Chinatown to get it, sounds really great for me.\nI went there on Saturday night and it were only us. So I decided to take out.\n\nThe place nice and clean, and new! Not too much variation on the menu. I picked party fried chicken wings for 20 pieces with 3 sauces. They didn't put the sauce together like others Korean Chicken. By the time I got home, the chicken is still crispy. But it taste like usual fried chicken. It's good, but it's definitely not Korean style. The korean sauce is okay but again it's not really Korean style. Lol. However I still love fried chicken. I will be back if I want some crispy fried chicken tho"
    },
    {
        "id": 5,
        "text": "This place just opened near my house, so of course I had to try it. Glad I did, because the wings are really good. They aren't your traditional buffalo style wings, more of a Korean style, so they are big, crunchy and juicy. I had the House hot sauce and the Korean hot sauce with my 10 piece order, but ended up putting Frank's on them, as I always do with wings lol. After eating 4 wings and a small fry, I was pretty full, if that gives any indication of the size of the wings. They offer fish sandwiches, seafood platters (fried) and a couple of sides, like fries, mozzarella sticks and calamari. I'm going to have the chicken sandwich next time! Enjoy!"
    },
    {
        "id": 6,
        "text": "I've wanted to try this spot since I saw the \"Grand Opening\" sign they've only been open in south philly for about 2 months according to the owner. I ordered the 20 piece wings with French fries, and mozzarella sticks . I have to say this place is unique because it's Korean  fried chicken not regular fried chicken and they have a huge variety of sauces ! They give you the option of picking 3 sauces with any meal I chose Teriyaki, honey mustard, and honey BBQ. They also offer platter such as chicken teriyaki, beef teriyaki , fried tofu with rice etc. Definitely worth checking out ! Lastly super friendly staff!"
    },
    {
        "id": 7,
        "text": "They serve you fried chicken chicken without the sauce and give you the sauce on the side .\n\nI had the Korean spicy sauce and honey bbq that came with my 10piece w/ fries  combo (fries or a soda) \nThe Korean spicy sauce wasn't too spicy had a little spicy in my opinion and the honey bbq sauce tasted like just regular bbq sauce \n\nWhen you're eating just the dry chicken , the batter has a strong taste of black pepper , it's very crispy but the hard kind of crispy , so it wasn't too pleasant . I even just peeled off the fried batter .\n\nNot a place I recommend since it's  supposedly be Korean style wings"
    },
    {
        "id": 8,
        "text": "The Fat ChickeN, hmmmm what caN I say! THEIR FOOD IS DELICIOUS, just down right GOOD!!! I call and come all the way from North Philly to purchase their dishes. They prepare the chicken right when you order, the flavor and crunch is their OwN. LoVelY."
    },
    {
        "id": 9,
        "text": "Was looking for a quick lunch that's not fast food and we stumbled upon this gem. Very small shop but delicious wings and other friend goodies. We split the 10 piece wings with fries ($9.95), I tossed in 2 beef sticks at a whopping $1.50 each haha, and an order of fried calamari for $2.00. The wings we're delicious and the house spicy sauce was incredible! The grilled beef sticks were also super good, and you can't beat that price! The calamari was okay, the owner did tell us that he was trying a new brand hence the low price. All in all this is a great little chicken shop (they also have fish and shrimp) if you're looking for the quick wing joint with a twist."
    },
    {
        "id": 10,
        "text": "First time here and did takeout. Chicken was still crispy on my 15 minute car ride home. Love the crunchiness, fully cooked and  juicy. Sauces are bomb! Got the Korean hot, sweet chili and bbq. Would definitely go again!"
    }
]