[
    {
        "id": 1,
        "text": "Cute Japanese restaurant in Old City. Fresh sushi and amazing ramen. Wonderful customer service! This is my new favorite go to for sushi and ramen. There is a great selection on the menu."
    },
    {
        "id": 2,
        "text": "I was craving for Ramen when I found this gem, but it wasn't the Ramen that I'm rating here (it falls a bit short comparing to the Ramens I've had in NY). That Steven roll!!! That was one of the best rolls that I've had! Good thing I was pretty hungry and asked for roll recommendations. I was definitely not disappointed. I would love to come back once I visit Philly again."
    },
    {
        "id": 3,
        "text": "This is simply great Japanese restaurant. Great foods and service. It is surprisingly clean and spotless. I had one of the best Ramen here. I definitely will come back next time I visit Philadelphia."
    },
    {
        "id": 4,
        "text": "Delicious!!\nWalked in late, on a Saturday night but we were welcomed with as nice smile.\nThe atmosphere is nice, a bright little restaurant that shows attention to the details. \nNow to the food....\nThe pork buns are amazing! Not fried, light and super tasty, a great starter! \nThe unagi sushi was really really good, same for the Margherita roll.\nThe best for the end...the ramen is exquisite! Bold flavors but not greasy or heavy, the pork is super tender, the ramen at the perfect consistency and the broth....simply amazing! \nGreat to have this little gem in Old City!\n\nPS. BYOB, so don't forget your beverages!"
    },
    {
        "id": 5,
        "text": "Overall a good experience! The interior and decorations are really nice and service was good.\n\nWe had an early dinner around 5 and it was pretty empty but filled up as it got closer to 6.\n\nWe ordered two ramen bowls, two sushi rolls, and a vegan poke bowl for four people and were satisfied. The ramen was a great price point ($11) and was pretty good. Thought the flavor of the broth could be richer, but can't beat that price in this area. The sushi rolls were good although I didn't try nigiri or sashimi so didn't get a good feel for the raw fish itself. The vegan poke bowl was unique, the vegan tuna in it could've tricked me if I hadn't known beforehand!\n\nCute spot with good food at a good price!"
    },
    {
        "id": 6,
        "text": "Tomo is my favorite sushi place Old City! This place ticks all of my boxes: great food, great service, and great ambience. It is so rare that you find a place that does all three things so well. The food is top notch! The sushi is fresh with complex flavor: the Tomo and Margarita rolls are not to be missed. The wait staff is attentive and warm which makes Tomo a place you want to come back to time after time. The design of the space is clean, modern, and hip without being off putting and the aquatic life murals on the walls are gorgeous. Tomo is a neighborhood sushi place with prices and food that can't be beat!"
    },
    {
        "id": 7,
        "text": "Went back after the first time, same great atmosphere and outstanding service.\nThis time we tried the Chirashi and the Hako Roll, both are outstanding.\nThe Chirashi (gigantic!) is very tasty, the great variety let you try different fish (all delicious) and for sure, you'll not walk out hungry!\nThe Hako Roll, a house specialty, is incredible.\nI'm quite traditional regarding food (been half Japanese, and half Italian, I grew up with incredible flavours surrounding me and I love the clean, traditional flavors) but the pairing of strawberries, unagy, and other incredible fish is so well balance, fresh, sweet, tangy that will blow your mind!!! Kudos to Tomo's chef!!"
    },
    {
        "id": 8,
        "text": "We popped in Tomo tonight and we were so vert pleasantly surprised.  Decor spot on, service fantastic, sushi amazing!  \nBYOB is an extra bonus.   Sushi was very fresh, experience preparation and presentation. Rolls are inventive. Great addition to the neighborhood!!   We will be back!!!"
    },
    {
        "id": 9,
        "text": "Simply put, the sushi is outstanding!! We're so happy to find a new old city mainstay. The restaurant is beautifully decorated, the staff are super friendly and accommodating, and the chef owner is an absolute artist. The plates come out looking beautiful and he's always trying new creative takes. Try the tuna guacamole - you won't be disappointed. The special rolls are great and the sashimi is even better. A friend also had the ramen and said it was next level."
    },
    {
        "id": 10,
        "text": "Great spot! We had dinner on a Friday night, service was great and so was the food. I had the tonkatsu ramen and was pleasantly surprised, I'm a noodle snob. My friends all had sushi and said it was awesome as well."
    },
    {
        "id": 11,
        "text": "Really good, fresh specialty rolls with interesting combinations. Very attentive service, plus awesome that it's BYO!"
    },
    {
        "id": 12,
        "text": "A very welcome addition to the neighborhood! Service was excellent (even if it was just for take out). The margaretha and spicy tuna with salmon rolls and traditional ramen were delicious. I look forward to exploring more of the menu."
    },
    {
        "id": 13,
        "text": "Stopped by here for a quick dinner. I was impressed with the neat interior design. We were able to be seated right away without reservation. This place has both sushi and ramen. My friend and I shared a California roll, it was actually very delicious and fresh! The ramen was ok, a bit salty, smaller portion than I expected. The service was excellent. Will definitely return for more sushi!"
    },
    {
        "id": 14,
        "text": "Great sushi at a good price, especially when compared to the other new sushi place in Old City. Service was fantastic and the space is relaxing."
    },
    {
        "id": 15,
        "text": "Very good sushi and ramen happy very near my Apt and fresh vegetables  good service good price"
    },
    {
        "id": 16,
        "text": "This will be a new Old City staple... the pork buns were delicious and the ramen is authentic. Very zen vibe and friendly staff, and BYOB is a HUGE plus! Will be back."
    },
    {
        "id": 17,
        "text": "I went this place yesterday night two black from my house I love it!!!\n\nClean and nigiri is delicious!!\nAnd ginger salad is good!!\nLike home made !!\nI will be here very open!!!"
    },
    {
        "id": 18,
        "text": "Tomo was incredible! Everything about the place was spectacular. The ambiance, the staff and the food. The place is byob with no corkage fee. My friend and I started with a seaweed salad and sashimi appetizer. Everything was fresh and light. I got one speciality roll (margarita) and a regular roll (yellowtail). The speciality roll was like nothing I have ever tried before. Who would have thought to put lime on sushi? Man it was good.  My friend got the ramen and loved it. Compliments to the staff and head sushi chef Andy! Can't wait to go back and try more rolls!"
    },
    {
        "id": 19,
        "text": "Decent sushi spot with super fresh fish, reasonable prices.\n\nGreat clean, sleek and modern interior design with a great sushi bar in the back. Love the Old City location and it was a nice change from all the other sushi places in Center City.\n\nDefinitely want to go back and take advantage of their BYO."
    },
    {
        "id": 20,
        "text": "Really excellent food. I had the chicken ramen and the noodles were outstanding, chicken was tender and broth was flavorful. Service was outstanding and prices so reasonable."
    },
    {
        "id": 21,
        "text": "Mixed reviews about this place. The sushi was extremely overpriced for the tiniest amount, 6 pieces for almost $8? That's ridiculous. It wasn't even that good, neither was the gyoza appetizer. However, my friend is a ramen connoisseur and she says this ramen was great. If you're looking for sushi, I would say this is a no go, but if you're in the mood for ramen I guess this would be an okay place."
    },
    {
        "id": 22,
        "text": "This is my second time coming here. This place is ideal-- great service, fresh ingredients, cute area, and the food is priced well. \n\n- We got the seaweed salad, gyoza, sashimi sampler, and 1 bowl of ramen. Everything was delicious. Ramen needed more broth. \n- The server prebussed and was very fast. They weren't busy, so food came out fast. \n- The atomosphere is beautiful. I love the lighting and décor."
    },
    {
        "id": 23,
        "text": "Dropped in for lunch apres sightseeing in the area. Great sushi (we went for the lunch specials and the sashimi) and wonderful service. Quite kid friendly, which is not what one can say about all sushi joints! We'll be back!!"
    },
    {
        "id": 24,
        "text": "Great addition to the neighborhood. Rolls are small and a little on the pricier side but taste fresh. Try the marguerite roll and ramen.\nService is always great.\nPlus, there's a beer store next door if you want to do a last minute BYOB."
    },
    {
        "id": 25,
        "text": "This place had some of the best sushi I ever had. The place is small but decorated very serene and nice."
    },
    {
        "id": 26,
        "text": "Great food and service. It is BYOB so we stopped at the deli/grocery next door, which has a very extensive beer selection. We started with edamame and dumplings followed by ramen bowls. My husband had the sushi rolls which were fresh and very good. We will return for sure."
    },
    {
        "id": 27,
        "text": "I have wanted to try this place, since I first noticed it open. I ordered take out from Tomo on a Tuesday night, and was not disappointed! Very solid sushi.\n\nRed dragon roll was fire. Spicy tuna and eel and avocado. Very good.\nAvocado salad was a plentiful size. Great ginger dressing.\n\nI will be back to sit inside next time and try more stuff :) It's a cute place - cozy, somewhat intimate yet casual. \n\nWould recommend! \n\n#tomotuesdays #takeouttuesdays"
    },
    {
        "id": 28,
        "text": "Loved our quick lunch stop!  The sushi is very fresh and their service is fantastic!  Highly recommend!"
    },
    {
        "id": 29,
        "text": "Stopped here on a whim for dinner. It's BYOB which was exciting. We got a few pieces of sushi and then ramen for dinner. The pickled mackerel was delicious! The chicken ramen was pretty tasty and filling. The service is pretty average and isn't super attentive, but it goes with the atmosphere. If you're in the mood for good sushi, it's worth the stop and reasonably priced."
    },
    {
        "id": 30,
        "text": "Everything was wonderful. We had ramen, sushi and shrimp shumai. My picky 9 year old ate and loved everything, including the sushi rolls. Service was great too. The place is small so have a reservation or prepare to wait. We got there right after they opened so were seated immediately without a reservation. Within 30 minutes the place was pretty full and they were holding tables for reservations. Big win for me in feeding my kid and me!"
    },
    {
        "id": 31,
        "text": "Yeah. It's delicious. I didn't try the ramen but the sushi was very fresh and the rice was a nice texture."
    },
    {
        "id": 32,
        "text": "My hub and I are visiting our son in Philly and staying at the Wyndam nearby.  The atmosphere is hopping and the wait staff are friendly and respectful.  We sat at the counter and watched platter after platter of beautiful, mouthwatering sushi leave the kitchen.  We started with pork buns and they were huge and delicious.  Next was the sushi and I loved them all but my fav was the Philly.  Our son had a ramen bowl and he loved it.  If we lived near I'm sure this would become one of our favorite places."
    },
    {
        "id": 33,
        "text": "Amazing sushi and wonderful service. Byo sushi and ramen joint that you can't miss! Perfect for date night or a night out with friends."
    },
    {
        "id": 34,
        "text": "Fantastic byob spot in Old City. Super cute and comfortable inside. Service was great. Finally a sushi spot in the city that has amazing and creative vegan options as well as vegan ramen! The spicy vegan tuna roll was out of this world. Reasonably priced. Cant wait to come back!"
    },
    {
        "id": 35,
        "text": "Delicious sushi, great lunch specials. I ordered lunch two days in a row it was so good. All of the nigiri was tasty and fresh.  Highly recommend if you are in Old City for lunch"
    },
    {
        "id": 36,
        "text": "Seriously the best ramen I've ever tasted! Everything about this restaurant was wonderful! I took my mom, daughter, and several of her friends for lunch here during a trip to Philly, and we were not disappointed! The staff was very good. They seated us right away at the sushi bar area. My mom has never had sushi.  She ordered the Shrimp Tempura Roll. The server helped her to customize it to here liking, and she loved it! My daughter also had the Shrimp Tempura Roll and Miso Ramen and she enjoyed both. I had the Chicken Ramen, and it was amazing! It seemed that all of the girls enjoyed their meals. I would definitely recommend this restaurant to others. If I find myself in Philly again, I know I'll be stopping back here!"
    },
    {
        "id": 37,
        "text": "This little gem was a great find. The staff was friendly, and the sushi was fresh and amazing!  We also appreciated the modern but warm atmosphere. This place does not serve alcohol, but you can walk 3 doors down and get a beer from the mini-mart and bring it back."
    },
    {
        "id": 38,
        "text": "Tomo is awesome -What a cute spot in old city!! Living a bit far away, it took me awhile to make it to Tomo but if was definitely worth the trip! \n\nThe atmosphere is very relaxed and I love the lights outside. This place is BYOB and the servers are all very polite and attentive but not overbearing. Owners here are awesome!! Great people!! \n\nFood wise, everything I had was delicious from dumplings to salmon bites apps and every single sushi roll was slamming!! \n\nI would definitely recommend Tomo and will be back soon!!"
    },
    {
        "id": 39,
        "text": "We came here with my coworkers and friends on a Thursday night to celebrate my birthday early. We have heard great things about this place, we decided to try it. The place serves sushi, cooked sushi, and vegan options (very cool). Everyone had raw sushi varieties, miso soup, seaweed salad, and we also brought our own wine. It's byob! Their salmon and tuna sushi was VERY fresh and high quality. And because it was my birthday, my friends all decided on ordering the mochi ice cream variety with a little candle on a piece of wasabi to stick on. I thought it was super cute of them to do. The staff was very attentive, kind, and made great suggestions. Best service I've ever had, honestly. Everyone is so warming and friendly. I saw that they also have outdoor seating and treat dogs so well, bringing a bowl of water, petting the pups. I can see myself coming back for dinner or doing restaurant week. This place deserves more than 5 stars!"
    },
    {
        "id": 40,
        "text": "Great sushi, BYOB, very intimate atmosphere.  Make sure you make reservations for a busy night"
    },
    {
        "id": 41,
        "text": "Been here twice with my friends and we can't get enough. It's a pretty small, relatively new place that's perfect to BYO. The servers are really knowledgable and very friendly, willing to walk you through anything you don't recognize on the menu or work with any of your dietary restrictions (one of my friends has celiac and got to try gluten-free ramen for the first time here).\n\nAny of the specialty rolls are amazing, but so far I've loved the Red Shrimp, Tomo, and Hako rolls most. A lot of other sushi places I've been to in Philly pack their rolls with a lot of rice and barely any fish, but Tomo does exactly the opposite and that's why we love them so much: you feel like you're getting what you paid for. If you're in the mood for ramen, the tonkotsu broth is creamy and delicious. You honestly can't go wrong with anything on the menu. Looking forward to our next visit!"
    },
    {
        "id": 42,
        "text": "Philly's sushi game has been growing strong over the years, not least with the arrival of Tomo Sushi & Ramen in Old City last summer. This place is perfectly located because I was able to stop by one of my very favorite pastry shops next door for dessert!\n\nI'm glad I stopped by early (at around 5pm) because diners were filling up the seats very quickly. I got a seat at the sushi bar and ordered the sashimi deluxe. It came with a miso soup and 7 different kinds of sashimi. Everything was fresh, beautiful, and delicious. \n\nI still have yet to try the ramen, but this place got a solid 5-stars from me for the sashimi!"
    },
    {
        "id": 43,
        "text": "The vegan options here were awesome.  The vegan rolls were much more interesting than the standard veggie rolls you would get at other places.  We also have a vegan bun appetizer and vegan mochi for dessert.  I will definitely come back for more."
    },
    {
        "id": 44,
        "text": "I came here specifically for the ramen. It came out ok to be honest. Not bad by any means, however just not busting with flavor. The decor and ambiance is nice. My only complaint is the little broth they gave. Just a tad more would he perfect. I hope they see this review and change things a little bit. Also they don't have a spicy ramen option which is disappointing."
    },
    {
        "id": 45,
        "text": "I came in expecting a good experience right away from the great ambiance inside. It took a long time (at least 15-20 mins) to get our miso soup and salad starters, which was confusing because we came at peak lunchtime and there was only one other table sitting down. The food was all very good, but the prices are very high for what you get - portions were on the very small side (5 small pieces in a \"roll\"). Was most disappointed when at the end there was a giant upcharge on my lunch special for replacing a roll that I was not informed about and made no sense with their pricing structure. Will not be returning. You should walk a few extra blocks out of your way to get more sushi at a better price and similar quality!"
    },
    {
        "id": 46,
        "text": "Sooooo good! I'm a vegetarian and my family is not. It's always hard to find a good sushi place that also has creative vegetarian sushi options. I had the veggie gyoza and the veggie on fire roll. Both were amazing! My family had the chicken udon, tuna tataki and philly roll. All 5 stars! Best ramen they've had hands down."
    },
    {
        "id": 47,
        "text": "I'm here on vacation/business and they are across the street from the place I'm staying at. Lovely staff, service was great for a Sunday night and the food was delicious. \n\nI recommend the pork buns and the chicken ramen.  I'm taking away one star because of the tiny space and the BYOB policy. I also ask for no egg in my ramen (I don't like eggs) but they left it in the soup. These things are minor though. \n\nWhen I return again the Philly, this place will be visited again."
    },
    {
        "id": 48,
        "text": "Tomo is the real deal. It's a small but intimate restaurant -- get a reservation or be prepared to wait a little bit! -- with absolutely delicious food. Bring a bottle of sake, good wine, or cheap beer with you, as it's BYO. We sat right at the sushi bar and ordered rolls, nigiri, and ramen; everything was delicious, and the sushi in particular was delicate and buttery and delicious. Very clear that everything is done with care. And they also do pickup if you want the same great food without the wait!"
    },
    {
        "id": 49,
        "text": "100% F@#!ing delicious! came back for a second time with my wife for her birthday and it was a great dinner. Service was on point and the food was perfect. This place has become our favorite place for sushi and ramen in the city! Go to this place... Do it."
    },
    {
        "id": 50,
        "text": "Excellent sushi. The service was top notch and the vibe was very relaxed. I highly recommend The Brian and The Margarita special rolls but everything was good. We made reservations and I'm glad we did because the every table was filled. Great place. Definitely going back."
    },
    {
        "id": 51,
        "text": "Wow! Amazing sushi! I definitely want to go back to try the ramen. But their veggie buns & sushi was amazing. \n\nWe had reservations for 7 but arrived 10 mins early. We were seated right away. We got our food fast & everything was amazing. \n\nI would suggest making reservations since it is a small spot & it did get packed. It's also BYOB which is awesome. Definitely recommend"
    },
    {
        "id": 52,
        "text": "Okay no lie- get to this place ASAP! \n\nWe were in our old neighborhood for a Saturday night out and we were looking into new places to take our friends that were in town from DC and I think we nailed it. We used to live on this block so we're happy to come back to a familiar area but to find a new restaurant was unexpected and great.  we loved the food and raved on and on about the service even though we ended up getting a late night reservation and it was already crowded. Everyone in our party got ramen bowls and all three were FANTASTIC. I got a seared tuna roll which I could have water 4 of they were so amazing. We'll definitely be back and well prepared with a bottle\nOf wine for our next visit. Thanks for giving us such a great experience!"
    },
    {
        "id": 53,
        "text": "Went here last night and the sushi was fresh and tasty! I'm pretty pick when comes to sushi. Have to say their ramen very light and delicious. Will come here again."
    },
    {
        "id": 54,
        "text": "Back again!!! ToMo roll, shumai, baby octopus and shoyu ramen with hot oil!!! For my birthday my husband took me to all my favorite places to eat!!! First stop for the birthday girl"
    },
    {
        "id": 55,
        "text": "God, I love this place. I am lucky enough to live in the neighborhood and go often. Food is consistently delicious, staff is always wonderful, the BYOB option is lovely. I highly recommend for vegetarians and vegans as well, as there are many (delicious) options to try!"
    },
    {
        "id": 56,
        "text": "I didn't know about this restaurant until I passed this restaurant. \nI already liked when I stepped in the restaurant with very fancy and modern interior and quite nice ambiance. \n\nI order Tonkotu Ramen and my friend order Chirashi Sushi. Both were so delicious. \n\nI would love to go back to the restaurant if I visit Philly again!"
    },
    {
        "id": 57,
        "text": "I am so grateful Philly has become home to Tomo.\nI find myself craving Tomo quite frequently specifically their uni and fresh wasabi.\nBYOB and one the nicest staff."
    },
    {
        "id": 58,
        "text": "BYOB. Delicious and delicate flavors. I recommend the Hako, Aka-Yuki, and Tomo rolls. The Mayu tonkatsu ramen is also so good! The nigiri was delicious. Ask for what is fresh that day and the servers will not steer you wrong. My new favorite Japanese restaurant!"
    },
    {
        "id": 59,
        "text": "Omg great sushi fusion ... tomo tuna definitely a must . Love the atmosphere a little too small but cozy . Great service definitely coming back"
    },
    {
        "id": 60,
        "text": "Love love this place! Good fresh sushi in a nice atmosphere! It's not extravagant but it's everything you want in a sushi place! It's BYOB, has nice outdoor seating and very nice and polite service staff! We go here often because it's in our neighborhood, it's one of our favorite sushi spots! Their food is creative and tastes super fresh! Their service is on point, the waiter we have is so nice and friendly and always makes good suggestions! You should definitely try it!!"
    },
    {
        "id": 61,
        "text": "BEST RESTAURANT EVER!!! My boyfriend and I love it here so much, it's our favorite date spot (we go there at least once a week lol) - the food is AMAZING and the service is THE BEST! If you like good sushi, good service and good ramen this is the place for you!"
    },
    {
        "id": 62,
        "text": "Came here for date night after eyeing it from afar for weeks. It's a small place, so we weren't able to walk-in without a long wait on a weekend night. We made a point to make a reservation and return for date night, and it was definitely worth it! My husband and I are both vegetarian and we were intrigued by the unique vegetarian sushi menu. It was as good as it looked. We started with the veggie gyoza, and then shared the Veggie on Fire, Vegan Tomo, and Chao vegetarian rolls. They were all different in their own way and it was exciting to finally eat vegetarian sushi that wasn't just a simple cucumber roll. For spice lovers, the Veggie on Fire was our favorite and had a great kick. The Chao roll was also delicious and creamy, and featured vegan cheese. As an added bonus, this place is BYOB so we enjoyed some refreshing rosé with our meal. We will definitely be back."
    },
    {
        "id": 63,
        "text": "I so want to keep Tomo as my own personal secret - but considering it is always pretty busy, my wishes are just a dream.  The staff here are super friendly and engaging - front of the house, back of the house (behind the sushi bar) - it is such a refreshing and welcoming vibe.  \n\nNice intimate, chill environment that focuses more on the food than fuss / fancy decor.  And when the food is a fresh, delicious and well prepared - there is no reason to distract with interior design.  \n\nI love this place, am crazy about their menu - their sushi is perfection.  My current obsession is their Ramen - specifically their Miso Ramen made spicy.  \n\nThis is a great Old City neighborhood place - that you will absolutely return to again and again!\n\nCraving some Ramen now!"
    },
    {
        "id": 64,
        "text": "This is one of the nicer, clean, simple Japanese restaurants in Philadelphia.\n\nWe took our new-hire out for lunch with a group of 9.  A nice change of place for a work outing as we typically go to Cooperidge closer to our office.  The place is a little on the smaller side, but you don't want your typical sushi restaurant to be a large production.  They didn't have seating at time for all of us so we all ate at the bar, a little impersonal but the best we could do.  I ordered the Sirashi bowl with a side of edamami.  Everything was fresh, well presented, the price is comparable to other places.  \n\nOverall, just a solid Japanese restaurant.  I really appreciate the cleanliness and simple atmosphere."
    },
    {
        "id": 65,
        "text": "I've wanted to try Tomo for quite some time, and Vegan Restaurant Week presented the perfect opportunity. \n\nCovid-19 safety wise, they do a great job of spacing the tables outside and their pick up window is very convenient and safe. We opted to pick up take out and eat at home.\n\nWhen I picked up the order, I thought the platter looked too small for 2 people - but I was wrong. It was a pretty perfect amount with the addition of the salad on the side. The salad with tofu was so delicious, it mimics the imitation crab meat salads and the flavor was perfect. \n\nI often make veg sushi at home, but Tomo blew me away. The flavors and textures are elevated to a level that I can only hope to inspire me to make at home. It's hard to choose a favorite between the shitake avocado, spicy \"tuna\" and the \"eel\" but if I had to choose - I loved the spicy \"tuna\" for flavor profile and texture. The shitake had a great flavor and texture, much better texture than I make at home haha. Overall I had such a great dinner and I will definitely be returning in the future!\n\nAlso, service was very nice. Alex was very kind and personable on the phone when I placed the order. All around I highly recommend you give them a shot - vegan or not!"
    },
    {
        "id": 66,
        "text": "This is a clear no frills, newer sushi/ramen bar in old city that's got Japanese sushi/sashimi and ramen.\nThe food is a bit pricier but I think reasonable enough for the presentation, we got the sashimi skewers(15), the unagi platter(18), and Katsu ramen($11). \n\nThe ramen was a bit too salty for our liking and lacked enough broth. Also service was all right, it may be a mistake but we realized after the order that they never gave us any seasoning toppings for the ramen that we should be accustomed to but we saw someone else get it so that was a little disappointing. \n\nHowever, the sushi was spot on and the fish tasted fresh. It's not some high end sushi spot with omakase or anything but the sushi rice was good, the avocado eel sushi was amazing, presentation was spot on in fact beautiful to say the least. See the photos taken!\nI actually found the skewers to be the most interesting part definitely unique and the mixing of taste for authentic Japanese pickles with sashimi and even lime and such on a skewer is not an easy task and we could say it was a tad pricy but well worth it.\n\nA star off for the loud atmosphere, salty and lack of broth ramen with no condiments, and tad higher prices but I would still recommend and come back if I wanted some good sushi!"
    },
    {
        "id": 67,
        "text": "Ordered vegan sushi and it was delicious. I loved the substitution of cucumber for rice. The spicy vegan and the avocado roles were very good. The vegetarian buns were also very tasty."
    },
    {
        "id": 68,
        "text": "I got the tonkotsu ramen. It was pretty good! Broth is creamy. They make the pork really well. The shoots were also seasoned well. They had the side fried garlic and sesame which is a plus for me. \nI like that we can make reservations.\nGreat service."
    },
    {
        "id": 69,
        "text": "Very great sushi and ramen restaurant. Appetizers, Sushi, and Ramen are all great quality and flavor. They have a very generous amount of Vegan options, none of which prevent a full, bold, flavorful experience. The staff is experienced and very friendly. \n\n100% for Vegan Option. \n100% for Environment. \n100% for Staff Accordance.\n100% Left A Happy Customer."
    },
    {
        "id": 70,
        "text": "My friend and I went for Vegan Week and it was out of this world! So freakin delicious and fresh! Our waiter was very knowledgeable too. We will definitely be back very soon!"
    },
    {
        "id": 71,
        "text": "Vegetarian Ramen and vegetarian gyoza were excellent! Had one of the special rolls-Margaretha [sic]-which was fresh. We are looking forward to returning to try other selections! \n\nWent on a Sunday night. There were about 6-8 other parties there so not overly crowded but quiet enough to have a conversation. Great decor and ambiance. Server and chefs were professional and friendly."
    },
    {
        "id": 72,
        "text": "Great sushi place it just has that vibe. The sushi itself is amazing and the staff are very friendly.  I recommend any of the sushi and ramen as well"
    },
    {
        "id": 73,
        "text": "I've been wanting to come here for a few months because of their beautiful veggie rolls!\n\nI decided to order the Midori roll, the Lime Sinko, the Straw-Veggie and the Vegan Spicy Tuna (that I saw originally on Instagram.) \n\nIt was a beautiful display! The straw-veggie was sweet but vinegary from the pickled vegetables. The lime sinko reminded me of a sushi key lime pie. It was filled with a creamy avocado and cucumber, which made the lime sinko topping shine. The midori was creamy from the avocado topping and salty from the pickle vegetable filling. The vegan spicy tuna was out of this world! Initially it tastes like a savory sesame taste and then the juicy tomato kicks in. It has a texture very similar to tuna but is it's only thing. The spicy kicks in at the end. \n\nFor $42 of sushi, we weren't full. So we ordered a bowl of vegan miso ramen to share. It was delicious! We loved the noodles, the sweet tofu, the juicy mushrooms and the amazing umami broth! Would love to have a bowl in the winter. \n\nTomo is a culinary experience, definitely a little pricer than expected but worth it. Check them out!"
    },
    {
        "id": 74,
        "text": "Got the Yellowtail Tartare (incredible - heaven), pork buns (meh), and Mayu Tonkatsu (meh). Good service and nice atmosphere. \n\nTartare - OUT OF THIS WORLD. 10/10 recommend.\n \nBuns were fine - not the best, recommend Bao Bar in Chinatown. \n\nRamen - total let down. Broth was weak, addition of ginger slices was odd. Didn't have the authentic taste that I expect from a tonkatsu broth. Noodles had a decent bite, but were more thin than I'd prefer.\n\nProbably stick with sushi if you go here. Maybe I'm a ramen snob - to to Chinatown if you want a good bowl. Terakawa or Megumi would crush this bowl."
    },
    {
        "id": 75,
        "text": "While I can't comment on the takeout option process because someone else in my household handled that, I CAN say that their sushi is nothing short of phenomenal. It will rock your socks off. Make sure to order the tomo roll -- they sure know what they're doing there! It's the freshest tasting tuna, not sure how they do it! Hope to be back shortly!"
    },
    {
        "id": 76,
        "text": "Excellent excellent place, relaxing atmosphere with grate food! Came here with wifey, she also enjoyed the food and the ice cream!"
    },
    {
        "id": 77,
        "text": "Ordered through caviar based on the positive reviews. Disappointing. Ramen broth was completely bland, the pork isn't tender at all I didn't even eat it although I ordered extra. Noodles aren't that good. The seaweed salad tastes off. There were bones in my eel rolls. Gyoza was okay."
    },
    {
        "id": 78,
        "text": "Wow! What a treat. I was going to a play at the Arden and was looking for something close by. This fit the bill. I ate outside on a beautiful night. The service was outstanding as was the food. I have celiac disease so I'm usually limited in the noodle Dept. Tomo was able to accommodate me using potato noodles in my ramen bowl. The flavor profile was excellent and the price even better. Run to this place but do t tell your friends, otherwise you won't get a table and I won't be able to eat my delicious ramen."
    },
    {
        "id": 79,
        "text": "I've been waiting for a real winner to emerge in my search for the best sushi in the city. Tomo is that winner...and there's not a close second. \n\nEverything about their sushi is correct. The rice has the perfect amount of vinegar. The nori is fresh, and moist. The sashimi is actually sashimi grade, and the rolls are creative in a way that pleases the mouth...not just the eyes. I would be happy to consume any of their offering for every meal of every day. \n\nMaybe you only want to spend a tenner for lunch...no problem. Why not try one of their authentic, and delicious ramen options? The Shoyu is my personal fav., but they're all good...and ramen is just fun to eat. \n\nThe dinning room is clean and cozy, with only a few tables and a sushi bar, but its a very pleasant space in which to dine. I like to sit at the bar and watch the chefs dole out their mastery on fish and vegetables alike. Listening to the hipsters go on about the vegan options is annoying a.f., but I certainly can't fault Tomo for their undernourished ramblings. The staff is a friendly and attentive group; they are a pleasure to interact with. \n\nTo recap, if you're tired of middle of the road, this is where you need to go for your upgrade. A+"
    },
    {
        "id": 80,
        "text": "Came in for vegan restaurant week and was blown away with Tomo.\n\nIt was a little crowded when we got there and some people were turned away so I highly recommend getting a reservation.\n\nWe were seated at a small table but this place is super cute. Good for a date or a night with friends. Tbh, I'd even take my parents here. It's BYOB so make sure to bring something if you want to drink.\n\nMy favorites were the veggie buns, veggie on fire roll, and the straw veggie roll. As a vegetarian I'm used to basic avocado cucumber rolls so Tomo really impressed me with their creative options. I'd recommend eating veggie on fire and following it with straw veggie - they compliment each other so well. Also, each roll is 8 rolls so the portions are generous.\n\nI'd highly recommend Tomo to anyone and I definitely want to come back."
    },
    {
        "id": 81,
        "text": "First impression my friends and I all shared was that the decor is very cute and stylish. The lighting, wood tables with live edges, shelving with succulents. It's a very nice atmosphere, plus its BYOB.\n\nI tried a bunch of the vegetarian/vegan options: a shitake roll, veggie on fire, a lime cucumber roll. I cannot remember the exact fillings of each one but I enjoyed all of them except the shitake one. The lime cucumber was surprisingly more tasty than its description. We also had the veggie gyoza which was great.\n\nService was very good. The only thing I deduct a star for is that it's not super filling, after spending ~$40 a person (w/ tip and tax) we all got hungry soon afterwards."
    },
    {
        "id": 82,
        "text": "Hell yes! I freaking love this place. Across town but I don't care. It's the only place I go to get sushi now. I love their creative vegan rolls like the one with Chao cheese. I think Andy is the brains behind these inventions so props to him! Man oh man, oh man. I'd eat here every day if I could. Restaurant week also did not disappoint. Make a reservation if you can because they have a huge fan base. I am literally shocked that they just have 4.5 stars instead of 5 on here."
    },
    {
        "id": 83,
        "text": "Have tried both the ramen and sushi here and LOVE both!! The sushi was really delicious...kind of pricey, but you can tell it's fresh and well made. The ramen is really affordable and super yummy. Also go for the black garlic ramen...suuuuper flavorful and well done. Service is really great - left my scarf once and they kept it for me! They also have outdoor seating in the summer! Grateful hubby and I live super closeby :)"
    },
    {
        "id": 84,
        "text": "Unfortunately I did not get a picture of the food, when you get here you'll understand. The service is amazing and the food is spectacular. There is honestly nothing more to say about this place. Just come and try it for yourself!!!!"
    },
    {
        "id": 85,
        "text": "Easily the best ramen and sushi I've had, ever. Not just in Philly. I recently moved to Philly from Pittsburgh, and have eaten at quite a few places around the world. I've now had Tomo two days in a row-- it's fresh, tasty, and all around appetizing."
    },
    {
        "id": 86,
        "text": "Old City BYOB gem! Their sushi is my favorite in the neighborhood. It is very fresh and authentic without being ridiculously large like some other places. The staff is amazing and very friendly. The chicken ramen is delicious! We love coming to Tomo for a nice, romantic date night. They have recently added outdoor seating with string lights hanging above. My favorite sushi place!"
    },
    {
        "id": 87,
        "text": "A great place for Japanese food. We ordered a Chef Selection sushi combination and a tonkatsu ramen. The quality of the food is top among Japanese restaurants I have tried in the US. The fish is fresh and tastes good. Ramen soup has a rich flavor. I enjoy sitting at the bar to see the Japanese chef making sushi. He is very professional. The price is not high. We spend less than we expected."
    },
    {
        "id": 88,
        "text": "Talk about Vegan Sushi Heaven.  \nTomo Sushi & Ramen is my absolute favorite place to eat. \nThere is nothing better than taking a bite of that sweet and spicy Vegetable Bun. \nThe sushi rolls are the most delicious and fresh tasting sushi I've had - vegan or not. \nIf you've been teetering with the idea of visiting this restaurant, JUST DO IT. You won't regret it."
    },
    {
        "id": 89,
        "text": "This is my favorite sushi spot in Philly. They're a cozy BYOB spot with great service and great food. The vegan rolls and options are amazing here, and you will not be disappointed. The servers are friendly and accommodating as well. Can't recommend Tomo enough!"
    },
    {
        "id": 90,
        "text": "I love sushi, and Tomo is close to my workplace--so I want to love it. But  the speciality rolls I ordered--especially the Veggie on Fire roll--were so drowned in sauce that I couldn't even taste the fish or vegetables. \n\nIf I go back, I'll try their ramen and simpler sushi offerings."
    },
    {
        "id": 91,
        "text": "Ordered pick up on a Tuesday night. Super easy to order on their website (don't need to create an account). Pick up was quick and efficient & great Covid precautions!  Pick up from an outside window. \nWe ordered the pork buns, a variety of rolls and a tonkotsu ramen. Pork buns were delicious! Loved the variety of sushi rolls offered. We ordered Red Shrimp Roll, Rock & Roll, Philly Special Roll all really delicious and flavorful!  (Although our favorite is the Red Shrimp Roll!)\nRamen was tasty but I wish I would have reheated it (on the stove) to soften the noodles. \n\nHighly recommend! Excited to be able to dine in post covid!"
    },
    {
        "id": 92,
        "text": "Wanted to grab a little sushi before 8 p.m. curfew in Philly.  Toni's curbside takeout during Covid-19 restrictions was in effect.  I ordered a Tomo roll with spicy tuna, avocado, cilantro, topped with seared tuna and sweet miso sauce.  Maybe best roll I've ever had.  I'm one of those fans of cilantro and it enhanced the roll.  The tuna on top must have been seared with a blow torch and the flavor was exquisite.  The hamachi roll (yellow tail and scallion) was also great.  \n\nAlso been here for ramen which they do very well.  If I lived in the city instead of Roxborough, I'd probably go broke ordering from here all the time."
    },
    {
        "id": 93,
        "text": "I decided on Tomo based on Yelp reviews. I was in Philadelphia for work and was looking for some delicious ramen. I started with the crab salad. They were so kind when I told them I couldn't have mayonnaise so they switched to a vegan mayo and it was delicious. I ordered the vegan ramen. It was very slow to come out. I waited longer than usual. It was very quiet in the restaurant so not sure what took so long. It was just ok. Wasn't as flavorful as I have had. Maybe they were just having an off night."
    },
    {
        "id": 94,
        "text": "It's not often you can find a Japanese restaurant that does both sushi and ramen AND does them well. Well Tomo does! My wife loves sushi and I'm a huge ramen fan. So we can both get our favorites when we come here. They have a nice selection of sushi (not overwhelming, though) and some classic options for ramen. In my opinion, I think the ramen is better than the sushi, when you compare both to other restaurants in the city. They also do a really great job of packaging up the food to-go so that it stays hot and fresh. Definitely our neighborhood place for Japanese since we live so close. Highly recommend, especially if you're looking to get sushi and ramen from one place!"
    },
    {
        "id": 95,
        "text": "Came here for the all vegan sushi menu and was not disappointed! It's hard to find good vegetarian sushi but Tomo knows exactly how it's done. The menu is next-level imaginative and you won't be able to find rolls like these elsewhere. The Harvest Roll was AMAZING-- who knew sweet potato could taste so good in sushi! Their vegetarian miso ramen was equally flavorful. Our waiter was outstanding and I'm so glad we stumbled upon this hole in the wall restaurant. Ask for some extra spice on the side if you want some chili oil, garlic, and chili paste to go with your meal. Looking forward to trying out more of the vegan sushi menu and highly recommend all of my fellow vegetarians to do the same!"
    },
    {
        "id": 96,
        "text": "Great service, fresh ingredients, lots of variety to choose from and great decor. We tried Tomo rolls, California rolls, Pork Gyoza, Edamame, Brian rolls, Spicy Tuna with grilled onions. Everyone enjoyed their food and the experience!"
    },
    {
        "id": 97,
        "text": "Tomo is a really nice option for sushi or ramen in Old City.  It has a clean, modern interior in a cozy space with seating geared for singles (at the sushi bar), couples, and small groups of 4 people.  However, larger groups would be hard to accommodate.  When we arrived for a 5:30pm dinner reservation, it was not crowded, but by the time we left at 6:45pm, the place was nearly full on a Thursday evening.  \n\nMy wife, two sons (13 yrs., 11 yrs.) and I ordered the chirashi ($28), sashimi deluxe ($35), ramen ($11), and a few a la carte sushi items.  The octopus was infused with lime juice (which was unusual), but the white tuna had a pleasant, smoky flavor that was nice.  Of the various dishes, the chirashi seemed to offer the best value.  If you have a group of 4 or more people, I would strongly recommend making a dinner reservation."
    },
    {
        "id": 98,
        "text": "Ramen and sushi are my favorite food groups, Which is why Tomo has been on the top of my list for a while.  I was super excited that they had both veggie Sushi and veggie Ramen. We started with vegetarian Bao buns and a veggie miso Ramen with spicy sauce on the side, it was delicious and full of flavor. The miso ramen was some of the best vegetarian ramen that I've had. We then ordered a veggie on fire roll and a vegan tuna roll. We also had a salmon roll just to try out what their normal Sushi taste like. The veggie on fire roll was my absolute favorite and I will crave it forever. Thw vegan tuna blew my mind because it was so close to the real thing.   the salmon roll is good but the veggie rolls were definitely the stars of the meal. So far all my vegetarian friends put this on the top of your list. And for everyone else  This place is delicious so you should Come here regardless. \nPro tip: make a reservation as this place is small"
    },
    {
        "id": 99,
        "text": "This was the 4th time we ate here, and it seems to be going downhill for us. It is very noisy and hectic while eating inside. They are super busy with takeout orders and our sushi rolls seemed to reflect that. Ours were sloppily made and shorter than usual. Food was good, but the dining experience lacks any bit of peace. The staff literally runs around to keep up."
    },
    {
        "id": 100,
        "text": "I was having a rough day and came in here in for some comfort food in ramen. Kind service and nice host and waiter (adrian i think???) I'll remember this moment. Pretty sure I was basically sniffling over my ramen bc I was emotional but the warm ramen was perfect and restored me. When i go out to restaurants I think about my feelings and emotions so yes 5 STARS.\n\nEnjoy my photo below!"
    },
    {
        "id": 101,
        "text": "I was pretty disappointed in my experience at Tomo tonight. The service was poor. We arrived right on time for our reservation at 7pm and were ignored while we stood there for at least 5 minutes. Wait staff ran around clearing and setting the tables but no one came over to greet us or ask if we were there to dine. Eventually one waiter came up and asked if we'd been helped, then seemed embarrassed when we said no. We were escorted to a table then waited... and waited ... and waited for menus, water and some kind of attention. Finally, after another apology we got menus, then waited some more - at least 10 minutes, for someone to check to see if we wanted a beverage (we were never asked, nor were we provided with tea). Finally the waiter, noticing our wine bottle, asked if we wanted glasses (um - were we supposed to drink it out of the bottle?) and he paused long enough for us to convince him to take our order.  Our shumai came out cold, there was another long wait for the gyoza, then at least 45 more minutes for our sushi to arrive.  We barely finished and were paying the bill when the waiter hustled over and said, \"Excuse me, but we have someone waiting for your table, their reservation is in 15 minutes.  What???? I haven't been treated so unprofessionally for a long long time. The sushi was tasty but the restaurant was very loud, the food took way too long, the service was inattentive at best."
    },
    {
        "id": 102,
        "text": "After checking it out during vegan restaurant week, Tomo is my new favorite place! Most sushi places have your standard vegan options, like an avocado or veggie roll, but Tomo goes above and beyond! They dont just accomodate vegans but actually offer creative and exciting vegan options. The chao roll and veggie on fire are my favorite but it's all delicious. Plus, since it's BYOB, I find it to be more affordable (my wife and I can easily spend a ridiculous amount of money on wine at dinner). I'd recommend reservations, as the place is small and very popular!"
    },
    {
        "id": 103,
        "text": "I'm no expert on ramen, but this place has by far the best ramen I've ever had. Great price point too. Tiny and quaint but a little claustrophobic, but that's kinda normal for most BYOBs. Service was good but there wasn't enough waiters for the amount of tables so it was a bit slow, though very attentive. Will definitely be coming back."
    },
    {
        "id": 104,
        "text": "Ate here a few times and so far the food was great. The ginger dresssing on the green salad was great and it was a nice size portion. I tried the spicy tuna, margaritha and tomo rolls  and they were totally mind blowing. For pork lover, tonkotsu ramen and pork bun were magical, the broth was excellent and the meat well seasoned, in my opinion \"perfect\".    Overall, excellent food, great atmosphere & service. I will definetely be back!"
    },
    {
        "id": 105,
        "text": "Great tasting food at a reasonable price. Proper covid precautions for takeout are in place"
    },
    {
        "id": 106,
        "text": "Such a fantastic spot! The food is AMAZING and it's  so cute inside. The veg shoyu ramen was delicious, and they have a  vegan \"spicy tuna\" roll that was one of the best vegan subs I've ever had! \n\nGreat options for everyone and a great deal as well. We will definitely make this a new regular spot."
    },
    {
        "id": 107,
        "text": "Great great food. I can rarely find to sit down unless I reserve, but that's a testament to how good their sushi and ramen are. Highly recommend"
    },
    {
        "id": 108,
        "text": "Been here twice. This is some of the best sushi around. Unique combinations of excellent flavors and beautiful presentation. Our favorite is the Brian roll. And reasonably priced. BYOB"
    },
    {
        "id": 109,
        "text": "Ordered delivery through Caviar.\nMy order: 2 spicy tuna rolls, pork gyoza, pork buns, Tonkatsu ramen and 15 pcs deluxe sashimi.  \nFirst issue is that they forgot the sashimi deluxe.  The Ramen broth was pretty good but the noodles were stuck together but that's almost expected from delivery so it's ok.  The spicy tuna rolls were just tuna rolls, there was no sauce.  The pork buns seems like the pork was over cooked and not fresh.  Maybe the experience is because this is delivery, but i would not go to try in person after this."
    },
    {
        "id": 110,
        "text": "Second time coming to this place since going a long time ago when they first opened and it was absolutely delicious, yet again! It's not exactly hard to find vegan sushi, but it is extremely rare to find a place that goes far beyond just your average cucumber and avocado roll. Tomo makes an unbelievable vegan \"tuna\" that tastes/smells/feels so much like the real thing. Along with that they have a full page of vegan and vegetarian rolls, vegan ramen, and more delicious vegan dishes on their menu. Very pleased with the service, and the food was absolutely delicious! Thank you Tomo!"
    },
    {
        "id": 111,
        "text": "Tiny place with fresh sushi and good ramen, servers are very nice with good attitudes. Remember to call ahead or make reservations when you decided to go in during holidays."
    },
    {
        "id": 112,
        "text": "I just went here for vegan restaurant week, and I have to say, I am so impressed. I've been hearing about this place and I should have gone sooner!\n\nFirst off, this is my favorite kind of place--they are an omni restaurant that serves \"regular\" sushi and ramen, but they also have an extensive vegan menu--in fact I think they have a vegan version of 70% of their menu. However, the vegan offerings are so good that I saw plenty of omnivores getting them--including my companion, who came here for tonkotsu ramen, and needed up ordering the vegan bao buns and chao roll as a side.\n\nSecond off, their vegan rolls are seriously a step above. I love regular vegetable rolls--vegetables are delicious! But it was really great to be able to get deluxe rolls of the kind I usually never get the chance to try, and innovative and unusual ones at that. Using marinated eggplant as an alternative/substitute to eel is genius. The texture and slight sweetness work so well as a counterpart to the same flavor profile. (I don't think that's part of their regular menu--seems to be a current specialty item--but it should be).\n\nI don't know what they use for their spicy vegan \"tuna,\" but it tastes surprisingly like fish, without being too fishy (since I don't want to actually eat fish). I guess I would say it had similar notes, while still being its own thing.\n\nMy companion's ramen was silky smooth. The bao buns were fluffy and savory and pleasantly filling.\n\nBut the thing that really put my opinion of Tomo over the top was their attention to detail. Their restaurant presentation is gorgeous (and the rolls are like works of art), but that's true for many nice sushi restaurants. However, I asked to take some of my meal home in a to-go box, and when I got home, I got a really pleasant surprise--they had carefully assembled my food to look like a brand new order instead of leftovers. The remaining rolls were neatly re-arranged, there was a little soy sauce container, and they included a fresh serving of wasabi and pickled ginger. I think there was a little flower, too. Such a nice extra touch."
    },
    {
        "id": 113,
        "text": "Great local sushi and ramen spot in Old City! \nThe employees are fantastic and the decor is really nice (casual chic), everything from the lighting to the tables are handmade and very creative by the owner!"
    },
    {
        "id": 114,
        "text": "It was a Wednesday night and we were just looking for a neighborhood spot to pop into and wouldn't break the bank.\nI thought most places would be dead, one it's a Wednesday and two, COVID-19 was stirring up the country. \nIt was busy with maybe one or two tables open, and we got seated At the sushi bar which I actually enjoy. \nWe ordered spicy Kani salad, which was actually topped over a green ginger salad. Very good but a bit too much sauce, just a personal preference. The 'sushi sashimi' entree which you can substitute the tuna roll for anything else paying the price difference so we got spider roll. \nAnd a spicy scallop and an uni hand roll. Ugh, we always order while we're starving..\nEverything was so good hand rolls must be eaten right away or the seaweed softens, and the spicy scallop was generous and so delicious. I don't often find spicy scallop in many places let alone a tasty one. It was fresh and definitely spicy \nThe sushi and sashimi was so fresh(only $40 for the whole platter), my favorite was probably the yellowtail. It was just the perfect amount of butter texture and sweet yet mild flavor. Spider roll was definitely on point, not too much rice which I really appreciate \nDefinitely a must if you're in old city! \nI didn't have any noodle soups or dessert \nAnd it's byob which is a bonus !\nOur server was hella nice but i forget his name, everyone there was nice and friendly which isn't always the case in the food Industry, I know. \nOh, and their green tea is legit, nice roasted barley,green tea flavor."
    },
    {
        "id": 115,
        "text": "The Absolute B E S T . . . exquisite, clean, pure and perfect food all prepared and handled by the loveliest people in Philadelphia.   What more needs to be said?"
    },
    {
        "id": 116,
        "text": "This was me and my fiancé favorite place to get something quick and delicious this past summer. The Chicken Ramen was some of the best i ever had i definitely recommend getting the Pork Buns which has become a quilt pleasure for the both of us. The outdoor eating was out favorite on a nice sunny day i definitely recommend trying this place if you want some great Ramen"
    },
    {
        "id": 117,
        "text": "This place is absolutely amazing. Me and my partner was running late for our reservation. But the team was able to work with us and get us seated as quickly as possible although we're were late.\nThe food was absolutely amazing. I order several vegan sushi rolls and the vegan ramen and I loved it. The one roll that stood out was the vegan spicy tuna roll. The tomato was marinated so well and it was SPICY, just how it should be. \nMy partner ordered several rolls and the sashimi deluxe and he enjoyed everything. I would recommend this place to anyone that loves sushi and especially for vegan sushi lovers."
    },
    {
        "id": 118,
        "text": "Such a good sushi place with the BEST lunch specials. And their sushi is always fresh"
    },
    {
        "id": 119,
        "text": "I've eaten in a lot of great sushi restaurants but this is one of the very best I have eaten in. Beautiful clean flavours, phenomenal knife work, and great personality. I grabbed the shrimp shumai and Tomo roll for lunch and both were delicious. This should be on your list of must-visit spots in Philadelphia."
    },
    {
        "id": 120,
        "text": "We picked this place because of the outdoor seating. The combination of the nice breezy weather, cute neighborhood and the food made it a perfect date night. The outdoor seating is right outside the restaurant, on the tiny sidewalk, but it was extremely cute, about 6 tables, all properly distanced. \n\nThe server was super attentive even though he was running in and out of the restaurant. I feel bad for servers at this time, hope you're all tipping well! The menu is online, all you have to do is scan the QR code. I appreciate this because the less I touch, the better. \n\nI ordered the tonkatsu ramen and the salmon roll, while my friend ordered the udon. The food came out in 5 minutes. I loved the wooden boards they use to plate their food, it makes something so simple that much more elegant. Although the soup base for my ramen isn't the usual strong flavor that I'm used to, I still enjoyed it. There was a generous amount of noodles and veggies, with an egg and three pieces of pork. The salmon was surprisingly fresh as well! The restaurant also does take out, and it seems like you can order via online delivering services. Support your small businesses!"
    },
    {
        "id": 121,
        "text": "Second time coming here, and everything has improved. Which is pretty good because almost everything was great last time. Since my last visit, I've been to a few other ramen shops, and I'm pleased to say this is still my favorite. Service was excellent, food was excellent, price point is excellent. I really don't know what else I would ask for. Bonus: the sushi is very good too, and I wouldn't expect that.\n\nWe got the Margarita roll and the Shoyu ramen. Both were very good."
    },
    {
        "id": 122,
        "text": "Due to the pandemic, I've only gotten take out from this restaurant. Seafood is always fresh and high quality. Interesting flavor combinations."
    },
    {
        "id": 123,
        "text": "If we could give six stars, we would!\n\nBooked a 630 reservation on a Friday evening and this place was certainly a crowd favorite. They are Covid conscious and all the staff are wearing masks still. There's a gender neutral bathroom and screen protectors in between each table. \n\nYou can't go wrong with anything on the menu but we ordered quite a few things! Chef Andy has a way of putting together unique ingredients that all tied together really nicely!! It was nice to have both sushi options and vegan sushi options. And they also have Ramen!\n\nThe rolls we ordered were: Chao, lime sinko, tomo, and hako. \n\nThe Hako is famous for that strawberry on top! It's Devine!!!!! And very good for a next level in sushi. I have only really had eel and avocado before so this was a step up from that! Highly recommended for those who aren't super daring with sushi but are open to a spin on a good favorite. This is taking your basic sushi life up a level! \n\nThe Lime Sinko was delicious! That citrus finish of the lime slice on top was soooo yummy! Highly recommended and in a more mild class of sushi. Also great for average sushi-go-ers! \n\nThe mochi for dessert is also really delicious and the green tea ice cream is one of a kind."
    },
    {
        "id": 124,
        "text": "Best BYOB sushi place in Philadelphia. Smaller pieces of sushi but very high quality. The place is very small so best for a couple of group of 4 but not a larger group. Charming atmosphere!"
    },
    {
        "id": 125,
        "text": "RAMEN  like the saimen drive inns in Hawaii.  Noodles were the best I've ever had in the states.  Pork buns was delicious.  I literally wrapped the one I had left and popped it in my purse.  Like a real boss. Lol.  Had the Tomo sushi roll as an appetizer.  Omg!!! The spicy tuna with the seared tuna on top and laced with cilantro leaves and more.  Wonderful food experience.  \n\nI'm usually very.disappointed with every ramen house I have visited in the past.  This place...  Blessing to my soul!!!  I was home on the island for a few moments.  Thank you"
    },
    {
        "id": 126,
        "text": "One of the better sushi spots in Old City. The inside is nicely culturally decorated and quaint. You may be seated at nice wooden tables or across from the sushi bar. This is a BYOB restaurant, no corkage fee. We started our meal with the miso soup -- salty, umami, classic. The edamame is salted and standard. My wife loved the vegan Chao roll (topped with creamy vegan cheese and shiitake in the center). In fact, this is an excellent location for vegetarian or vegan diners including an entire vegan roll menu and vegetarian ramen bowls (although I am not a huge fan of these). I tried the Tomo which easily fell apart and was just average in taste topped with fresh sushi grade tuna. The Rock & Roll was more tasty with eel, avocado, and shrimp. I typically get the standard rolls such as Alaska, Spicy Tuna, Spider, and Dragon rolls which are always fresh and worthwhile. The salmon belly nigiri is also delectable. A nice spot to bring a date regardless of their dietary restrictions."
    },
    {
        "id": 127,
        "text": "This place has a great atmosphere for dining in. I was so impressed with the amount of vegan options they had available! I tried three of the vegan rolls, and the miso ramen. The rolls were all fantastic the \"tuna\" that was in them was the perfect taste and texture. The ramen had some of the most flavorful broth I have tried. The waiter was also really helpful and accommodating to my friend and I who both have dietary restrictions (we are both vegan, she is gluten free). Two of the rolls were able to be made GF, and the ramen was as well."
    },
    {
        "id": 128,
        "text": "This is probably one of my favorite Japanese restaurant in the city! The sushi is always fresh and the Garlic ramen is amazing! We had the salmon bite, which blew my mind. The tuna tataki sashimi which was smoky, peppery and fresh. The Uni was nice and creamy. The scallops sashimi with the lime slice paired very well. Everything we ordered was delicious and the best part was that it's BYOB! What more can you ask for!!!"
    },
    {
        "id": 129,
        "text": "Tomo was so good but not any longer. The service was clumsy-two waiters came out every two minutes to take our order. One waiter dropped the soy sauce. But, worse, the food was dull and seemed bad. Rancid.\nDisappointing."
    },
    {
        "id": 130,
        "text": "As a vegetarian who LOVED sushi before this place was sooooooo goooood. I got the vegetarian green dragon roll and it was the closest thing to a real dragon roll I'd tasted in over two years. So delicious and their vegetarian bao buns were also AMAZING. Would highly recommend to vegetarian and not vegetarian sushi lovers."
    },
    {
        "id": 131,
        "text": "Not a fan of ramen but this ramen was soooo good. The sushi was delicious too, and the employees are really friendly."
    },
    {
        "id": 132,
        "text": "Very vegan friendly!  Had the vegan on fire and vegan udon soup.\n\nThe vegan on fire sushi was the highlight and standout. It was a decent portion but had HUGE flavor. If you're sharing as an app think at least 1 per 2 people. \n\nThe udon was okay but a big let down in terms of size/portion. Not enough food to be a meal or main dish. The ramen dishes seemed to be bigger portions via what my friend received. So order that"
    },
    {
        "id": 133,
        "text": "Okay...this place is amazing!!! It's on the pricey side but definitely worth it.  Nice atmosphere, great servers, fantastic food. If you're vegan, this is hands down the best sushi menu to choose from. They have really interesting rolls and even vegan mochi ice cream. I also had a server call me 3-4 times to check in and confirm about my reservation/ reservation mixup. Very thorough and taken care of.  No complaints and I will continue to return!"
    },
    {
        "id": 134,
        "text": "The BEST veggie ramen in the city - so many incredible options and the broth is delicious. The veggie bao buns are also great!"
    },
    {
        "id": 135,
        "text": "It started with the seaweed salad, yes you know the average seaweed salad that is pretty much everywhere and while it's good it's not exactly anything you remember. Well I'm\nwriting about it here so you can deduce that it was memorable. I was  expecting  just your standard seaweed salad and yet the nuanced flavors elevated the dish. Same thing happened with the vegetable gyoza- was expecting the standard gyoza you get just about everywhere and was pleasantly surprised by Tomo's approach. Yes familiar, but far superior to the norm. And then the sushi. I've long considered the sushi scene lacking in Philly until tonight. Superb quality and execution. Kudos to the Tomo Crew. Great spot."
    },
    {
        "id": 136,
        "text": "This place has very unique special rolls. Met up with a friend as we were feeling sushi and looked ahead of time at the menu and had a rough time choosing between several special rolls. Went w the Red Dragon, Shrimp on Fire, Bugz, Spicy Tuna and the Torch Peno. The Red Dragon was my favorite along with the Bugz. Service was great and very friendly. The food came out in a timely manner and we ate till we were more than full. \n\nIf you're looking for a sushi spot that's a bit different and interesting, def come try this spot out. Excited to go again sometime soon to try out other rolls we didn't get on this past trip."
    },
    {
        "id": 137,
        "text": "First visit to Tomo and I have to say this was a great restaurant. Wonderful service and great fresh sushi! The O-toro tuna was amazing. Definitely a great addition to the area. I will be returning!"
    },
    {
        "id": 138,
        "text": "Vibes: casual, modern, relatively small sushi joint with jazzy instrumental covers of pop songs playing overhead; counter and small table seating good for a date or a few friends\n\nTasting notes:\nChao: loved the sweet, soft shiitake slices that dominated the flavor of the roll; vegan cream cheese was soft, almost fluffy, not too rich or tangy\nVegan tomo: tomato was more savory than sweet, just right in firmness; loved the subtle torched flavor\nVegetarian miso ramen: nitamago was perfectly cooked; wavy noodle were al dente; broth was umami rich, not too salty or thick in consistency\nRed bean ice cream: served as two scoops, on the milkier side, with smaller, more scattered bits of red bean throughout than I am used to; red bean flavor comes through more to the nose than the tongue\n\nOther thoughts:\n-Fried garlic, chili oil, shichimi powder, toasted sesame seeds were brought to our table for the ramen\n-Service was fairly quick, very friendly and attentive\n-Wine glasses were on the table before we were seated\n-Very pleasantly surprised by the quality of the food as I am usually pretty skeptical of Japanese restaurants that serve both sushi and ramen"
    },
    {
        "id": 139,
        "text": "amazing service, very attentive and non intrusive to your dining experience. great spot if you're looking for ramen as well, they have a decent selection and I was able to try the miso and black garlic tonkotsu, both were solid broths and noodles. the toppings were flavorful for the ramen as well.\n\nwe also had spicy tuna which was very flavorful and a decent size, and some at our table ordered the combo unagi (eel) and other combo rolls, which they enjoyed. \n\nI would go back and try out their vegan ramen just to see if the broth is water or if they worked hard on developing a decent flavor with it. The spot is small enough for a group of 4 but any more than that, then find a different spot."
    },
    {
        "id": 140,
        "text": "This is my second review because the first one got sucked into the black hole that is yelp.\n\nFirstly we used to live a block away from Tomo. Since the first time stepped in, we've been returning. We used to come here every other week!\n\nWe love the ambiance, it's cozy and warm. Now, most important thing: Fish is always incredibly fresh and delicious! They have all your standards and more (uni from Japan) Used to do omakase but Tomo has converted us and now we do so many a la carte in lieu which taste just as good or better!\n\nSome of our favorites are the sashimi deluxe, the Steven roll, ika is on point with a drizzle of sesame oil. Mmmm I'm getting hungry just thinking about this and we were just there this past weekend.\n\nThe chefs are great, you can see them working diligently behind the counter. The staff is attentive and nice. They come by and check on your water and clears the table quickly. \n\nPs check out the ramen! Om nom nom nom and how can I forget its BYOB!!!!! Bring a bottle of sake and friends or dates."
    },
    {
        "id": 141,
        "text": "One of the few things I've missed since becoming vegan a few years ago is sushi. Sure, I can get a california roll, avacado and the like, but I miss that salty, chewy taste and texture of old school sushi. I was skeptical of whether anywhere could pull off a real vegan sushi that was worth coming back for, but Tomo really nailed it. The vegan toona was my personal favorite."
    },
    {
        "id": 142,
        "text": "This is an ABSOLUTE neighborhood gem. The service is attentive, the fish is fresh and the atmosphere is everything you are looking for in a small, quaint sushi bistro. I've now been 5 times and it's better ever time!"
    },
    {
        "id": 143,
        "text": "The best Gyoza we have ever had. It's clean, smooth and not too heavy. \n\nTomo is one of our favorites. Fantastic service and great vibes, the food never disappoints. Our go-to place for ramen (~$11)."
    },
    {
        "id": 144,
        "text": "Absolutely stunning meal. My friends and I stopped by tonight for a meal to remember. Our server Anthony was nothing short of spectacular. He was extremely knowledgeable about the menu items and was quick to answer our questions about the food. From the the quaint size of the restaurant to the twists on classic dishes, this place and its staff are top notch. Ambiance, food and service.. 5 stars."
    },
    {
        "id": 145,
        "text": "This is one of my most favorite ramen places in Philly. Really good sushi too. We try to go at least once during our stay when we are in the city. Their ramen is fantastic and even the vegan one. Reservations recommended since the place is fairly small. It is a byo so bring your favorite adult beverage. Forgot? Swing by sassafras market for some beer. If you haven't been, stop by and give it a try."
    },
    {
        "id": 146,
        "text": "This spot is amazing- went on a Sunday afternoon during COVID and they made it very easy to get a great meal. Everything we ordered was phenomenal and the service was even better. Get the veggie bao buns- definitely going back!"
    },
    {
        "id": 147,
        "text": "I'm so thankful for Tomo. After having Covid, I've become very sensitive to anything with gluten, rice, or whatever causes inflammation, and these guys really took a lot of time to make the sushi in a way that I can easy and enjoy it. THANK YOU so much!"
    },
    {
        "id": 148,
        "text": "Absolutely love Tomo!\n\nStaff is friendly and food always comes out quick. There are plenty of vegetarian options which is so nice. \n\nThe Chao + Spicy Scallop roll are fantastic. Other favorites are the miso soup & the dumplings. \n\nCan't recommend Tomo enough!"
    },
    {
        "id": 149,
        "text": "Really cute place and amazing speciality sushi rolls. Stopped by for lunch and tried Tomo, Shrimp on Fire, Brian, and Salmon Yaki. Loved the flavors and very fresh. Ended with Mango mochi which was good too. Great service. Nice Ambiance. Decent price. BYOB."
    },
    {
        "id": 150,
        "text": "amazing restaurant and service. the tomo roll + vegetarian shoyu ramen were both heavenly. we'll be back forsure!"
    },
    {
        "id": 151,
        "text": "My favorite sushi place in Philly. Whats truly stunning is that I don't even come here for their fish, I crave this place for their INCREDIBLE vegetarian sushi. \n\nThey're extremely creative with their various vegan specialty rolls. You can't go wrong with any of them but some of my favorites are the lime sinko, veggie tomo, and vegan dragon rolls. They also have great appetizer buns and fish forward sushi.\n\nHighly recommended."
    },
    {
        "id": 152,
        "text": "Excellent sushi. I'm not vegan but they have a great selection of vegan and vegetarian sushi options. I decided to try the vegan dragon roll and it was so delicious. It was light yet had impactful flavors that was reminiscent to real fish. Eggplant to imitate eel and tomato to imitate tuna. The vegan \"tomato tuna\" was flavored so well I encourage non vegan eaters to try it ! I'm so impressed with the flavors they brought out in the vegan sushi dishes. In addition I got the Steven roll which had such a delightful smoky taste from the salmon skin. I also ordered the veggie bao bun and the Spanish mackerel nigiri which I would pass on... it was ok would not get it again. The Spanish mackerel was too cooked for me and lacked that distinct mackerel taste I love.  Overall the sushi rolls here needs to be tried by sushi lovers near and wide. Tomo definitely has a special place in my heart and stomach."
    },
    {
        "id": 153,
        "text": "If I could give 10 Stars I most certainly would. The sushi is so tasty and fresh, not to mention the staff , best customer service I've had in a long time! This place is one my favorite sushi spots in Philly! It's a byob but went next store and picked up a Sapporo 6 pack."
    },
    {
        "id": 154,
        "text": "Tomo is a sushi and ramen place that does both nicely, but neither in outstanding fashion. The sushi was fresh, and the selection was decent, though fairly common. Nothing too out of the ordinary, though they did have Japanese Uni for $12 per piece, that was above-average. They have a great selection of rolls, as well, and a few different special combos. I found the rice they use to be far too cold for my taste. \n\nThe Ramen menu features a few different broths, and toppings. The shoyu/pork version I got was well seasoned, and the noodles were just firm enough. Good Ramen, indeed. \n\nThe service was very good, and the decor is modern, with some retro flare. \n\nOverall, a good location that has both Ramen and Sushi, and a place I'd definitely some back to, but not one I'd necessarily go out of my way for."
    },
    {
        "id": 155,
        "text": "Best vegan sushi ever! The vegan sushi was incredible! The guacarollie and chao rolls were amazing. The vegan \"tuna\" was so delicious. I only tried the vegan rolls but I'm sure the non vegan rolls are also amazing. I simply must stan."
    },
    {
        "id": 156,
        "text": "I ordered takeout from Tomo the other night. I'm surprised I never came across it before. I had the veggie ramen, the spicy tuna roll, and tuna avocado roll. Everything was delicious and the tuna was nice and fresh. Highly recommend and will be ordering again!"
    },
    {
        "id": 157,
        "text": "By far the best ramen in the city. We order take out from here at least a few times a month, but you really can't beat the in person experience. The intimate dining room has an almost romantic feel and the food is even better. Excellent price point as well for a mid ranged meal or a cute date night."
    },
    {
        "id": 158,
        "text": "They are good great rolls and vegan ramen it has great choices for vegans \nYou must eat there it is great it is a must go.                  \n You must eat there asap nooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooow"
    },
    {
        "id": 159,
        "text": "Living only a block away, I love coming here when I'm in the mood for a sit-down sushi restaurant that isn't crazy expensive. Out of the other couple Japanese restaurants within a couple blocks of here (Tuna Bar, Kisso), the food at Tomo has been by favorite and it's affordable. It's also a great place to get some good ramen. Plus it's BYOB!\n\nMy favorite roll here is the Tomo roll. The fish is always super fresh, and the cilantro on the roll gives an interesting touch. I've also tried the Alaskan, spicy salmon, and spicy scallop rolls. All of these have been fresh and delicious. In terms of appetizers, they have a great miso soup and avocado salad. I've also tried their miso ramen, which comes as a pretty big portion and leaves you full. It's not the best ramen I've ever had, but it's definitely a great option if you don't want to travel to a different part of the city to some of the more well known ramen places.\n\nI love having Tomo so close to my apartment; it's a great addition to the neighborhood!"
    },
    {
        "id": 160,
        "text": "I eat here every time I'm in Philly. I've been a sushi lover for my whole life, and vegan for about a decade. I've had a lot of incredible vegan dishes around the country and let me tell you-- Tomo is easily in my top 3. I've loved everything I've tried there, but the Midori roll and the Vegan Tomo roll are my favorite. It's awesome to see a sushi place infuse this much creativity and care into their vegan menu items. When i eat here, I get an upscale sushi experience in line with my pre vegan San Diego days, but within my ethical guidelines. I'm sure the fish options are amazing too, and I look forward to trying the ramen next time. In addition to all the culinary goodness, the staff here is genuinely delightful. I always receive excellent service at Tomo!"
    },
    {
        "id": 161,
        "text": "This place is one of the few offer vegan options, esp. when it comes to sushi, and for this reason, we visited a couple of times pre-pandemic time. We thought the food was decent, and the service was pleasant. However, our take-out last night was such a dismal experience that we have completely crossed it off our to-go list. This place is one of the few offer vegan options, esp. when it comes to sushi, and for this reason, we visited a couple of times pre-pandemic time. We thought the food was decent, and the service was pleasant. However, our take-out last night had us crossed it off our go-to list completely. We ordered six rolls thinking that would be enough for the four of us not too big eaters: vegan Tomo (8 pcs), vegan green dragon (8), harvest (8), sunset (8), spider (5), and regular Tomo (8) rolls. The wait was ~20 minutes, we were told. It wasn't exactly a warm welcome when we showed up to pick. No greetings or \"I will be with you in just a sec\" ok, it was fine as they were busy, we rationalized. As it turned out, that was the best part of our evening meal. When we unpacked the two small boxes (8.5x5 inch sushi boxes), I was utterly astonished and couldn't believe my eyes that it was $80 worth of rolls! All 45 skinny rolls squeezed tightly in the two boxes, separated by vegan and non-vegan (at least they made an effort to do that). We said to ourselves, \"well, here is our meager ration. We'd better not be hungry\". There stood in front of us are 45, the thinnest rolls with the most meniscus diameters that I have ever seen! If you could even call them \"rolls.\" Curious, I had to take a measurement, and they vary between 0.75 to 0.9 inches in thickness and  ~1 to 1.25 inches in diameters. Ok, fine, let's hope they taste good. I bit into one of the rolls and thought it was something else because it was just a mushy (rice) and tasteless thing. One word that came to mind was \"insult,\" and it's a true insult to all the rice in the world, let alone sushi rice! It was so mushy and watery that I nearly spit it out. The taste wasn't anything exceptional either as I couldn't tell one kind (sunset) apart from another (Tomo). After tasting one of each of the non-vegan kinds, 4-5 total, which is also the same number of bites (as they are just petite in size), I couldn't stomach more. I don't believe I was the only one still hungry after our \"big\" miniature sushi meal! I, or rather, we all have had lousy sushi before, but for the rice to be this unpalatable was the first time! And this would be the last time for us at Tomo, never again!"
    },
    {
        "id": 162,
        "text": "Love that they had a separate vegan menu! Food was delicious & service was great too!"
    },
    {
        "id": 163,
        "text": "Absolutely exquisite, fresh, clean food offered at the new Tomo Sushi & Ramen in Old City Philadelphia at 228 Arch Street.   The menu is very extensive and, of course, the kitchen open.   The owner, Andy, is behind the sushi counter and both he and his staff could not be more welcoming and gracious.   Beautiful, rustic decor . . . lovely ambience . . . BYO bottle of freezing Pinot Grigio and you'll have a memorable time at this wonderful new neighborhood addition."
    },
    {
        "id": 164,
        "text": "Cannot recommend this place enough!  Have been working my way through their vegan sushi selection and haven't yet come across a roll that I don't like.  Favorites so far have been the Harvest Roll and Strawveggie.  Vegan spicy tuna is amazing too!!  \n\nDeliveries arrive promptly and correctly every time in my experience so far (only twice).  Their in house customer service is great too!  It's a smaller restaurant so things feel very intimate and the staff and friendly and attentive.  Would highly recommend to anyone, vegan or not.  Great date night spot!"
    },
    {
        "id": 165,
        "text": "Nice and cozy restaurant with a welcoming and knowledgable staff! We ordered the harvest roll and it was the best vegetarian roll I have ever had hands down.\n\nThe classic avocado roll was also very good. Overall, great experience would recommend."
    },
    {
        "id": 166,
        "text": "I am a vegetarian. It's not always easy to find creative sushi for vegetarians. I was very pleasantly surprised with all the flavor combinations. Delicious! I highly recommend their sushi."
    },
    {
        "id": 167,
        "text": "Hmmmm....meh\n\nWe were really excited about this place but overall just not really satisfied. \n\nThis place is located in the heart of Chinatown and they have both indoor and outdoor seating available. \n\nWe had ordered on their online platform and then did a pick up to bring the food home. \n\nWe chose the their lime sinko and veggie on fire rolls and also ordered their vegetarian shoyu ramen. \n\nWhen picking up, everything was packaged well and they provided updates along the way as the order moved to completion. \n\nOverall, I just found the rolls to be pretty bland and also the not packed well enough. The additional frustration was the single use chopsticks they provided were warped so having to maneuver a loosely packed roll with uneven chop sticks was cumbersome. \n\nThe ramen also was not tasty. I was expecting more flavor but just tasted like broth without any spice or savory notes. \n\nMaybe we picked the wrong items, maybe we ordered on an off night, but just found the whole experience unexciting."
    },
    {
        "id": 168,
        "text": "Was really excited to try this place after struggling to get a reservation that fit my schedule. I arrived at 7 and the restaurant was packed. \n\nThe good - the food was great. I ordered the tonkatsu ramen, the shoyu ramen, spicy tuna rolls, and the Steven specialty roll. They also gave us complimentary mochi ice cream for dessert because they had to move us for another party. The ramen portions are generous, broths are rich with flavor, and it's relatively inexpensive for the quality. The rolls were amazing too. I'm usually not a fan of fish but I would eat them again. The mochi was soft and was a good touch after the ramen. They have screens between tables and the staff all wore masks as well.\n\nThe bad - not much to say here except the restaurant felt very cramped and loud. I was seated next to the entrance and they were extremely busy with takeout orders so people would be up against my chair sometimes. \n\nWould definitely recommend."
    },
    {
        "id": 169,
        "text": "I came here because of the really high reviews on Google but honestly left feeling a bit... whelmed. I guess it was due to my high expectations coming in, but didn't really think they were met (but wouldn't say the food was bad). I'm typically a sushi kinda guy and opted for the ramen this time around, and the broth was decent but not outstanding, and didn't really stand out to the other ramen shops in the city. Perhaps I shall come back sometime for the sushi and I'll update my review if that is the case."
    },
    {
        "id": 170,
        "text": "Loveeeee it! Came here for outdoor dining and was not disappointed. Sushi & apps were great. Sashimi was high quality and we appreciated the variety. The combinations in the rolls worked well together, the wasabi tobiko was a creative mix. Pork buns were delicious - especially the sauce. If only they were bigger. Overall a great meal, definitely a little pricey in comparison to other spots but the quality is here. Would love to try the ramen next time!"
    },
    {
        "id": 171,
        "text": "Let me start with the good, I commend them on not making people show their \"vaccination passport\" papers like Royal Izakaya does, because that is fascist, unconstitutional 1943 Germany type behavior, so good for Tomo, boo for Royal. It is also in a great part of town, in Old City and has a nice ambiance. With that being said, I was rather unimpressed with the food, especially with the prices they charge. I got the steamed vegetable gyoza to start. They were extremely mushy, over steamed and soggy. They come with a sauce that is in a plastic container with a top, which feels cheap and lazy. If they can serve the food on glass plates, why not put the sauce in something nice and not throw away plastic? Reminded me of grocery store sushi in that manner. Then I ordered the shitake inari. There were way too many mushrooms (which were too chewy and tasted odd) that fell out as soon as you took a bite. I also ordered a simple acvocado roll, and the ends of the nori did not even connect to make a complete roll. Folks, this is sushi rolling 101!! It's called a roll, not a 3/4 roll. The rice was also a bit soggy. I also ordered the \"Veggie on fire\" sushi. Again, the rice was overcooked and soggy, the rolls fell apart when you picked it up with the chopsticks. The vegetables on top of the rolls were soggy and plopped on in a giant messy mound. They were also topped with fried onions, which I could almost swear were Durkee brand onions people use at Thanksgiving. I am a chef and if I get a great meal out, I will promote the place to no end, but it felt like this was someones first attempt at making sushi for a social media post or something. I have been here twice, and both times I was unimpressed. There are many better and even more affordable sushi spots in Philly."
    },
    {
        "id": 172,
        "text": "I only had Tomo delivery before and I didn't feel like I could honestly review it until I had the grub fresh. And I am glad that I waited, because I have to say I wouldn't have been being fair. \n\nWe had to go run some errands and noticed they were open for some outdoor socially distanced seating with heaters - so we decided to go for it. And I am so glad that we did. It was delicious. The staff was amazing. And we felt safe. \n\nWe had 5 rolls between us and some edamame. Each of the rolls were delish. Prices were more than fair for how tasty everything was. The hubby loved the Tomo roll, and I especially loved the naruto sashimi. It was all great, though. Seriously. \n\nGo, enjoy some delicious apps and sushi (we didn't do ramen yet), and tip well. I would be devastated if the neighborhood lost Tomo. We will definitely add this to our take out list, too."
    },
    {
        "id": 173,
        "text": "First thing about this place is that the decor is very calming and peaceful. From the large fish mural on the wall with the soft lighting and small touches of green from the plants, it's definitely a comfortable setting to be dining in. Of course that may not be true when it's packed but there was only one other couple there when I went. You could either sit at the bar or there were a variety of other small tables. \n\nWent with the intent of getting ramen but was sucked in by the lunch specials. Ultimately decided on the chirashi bowl that came with a salad for the lunch special cause I'm a sucker for raw fish. The ginger dressing on the salad is just like I remember it, from many other Japanese restaurants and definitely has a comforting feel. The chirashi bowl was delicious. It came with five different kinds of fish and octopus with a healthy side of wasabi and ginger to cleanse the palate.\n\nAlthough I will say the regular menu is a bit heavy on the wallet, I'll definitely be back to try more stuff on the lunch special or the ramen (which was my original intent)."
    },
    {
        "id": 174,
        "text": "The staff is great! The place is great- the prices are reasonable and the food was great (definitely the ramen). And it's BYO!"
    },
    {
        "id": 175,
        "text": "I learned about Tomo via Philly Vegan Restaurant Week! This place is so Zen and welcoming. It's a little smaller so I wouldn't recommend this place for a large group. They do offer outdoor seating but that's also very limiting. DEFINITELY make a reservation. \n\nI've been thinking about that ginger dressing on that green salad for two weeks. I can't wait to go back. The ramen was great but I think I'll opt for a different broth. My boyfriend got his spicy and it had a lot more flavor. \n\nOverall, I will definitely be back."
    },
    {
        "id": 176,
        "text": "Delicious.  The staff was so helpful with their recommendations and I appreciated that.    Sushi and ramen are newish to me.     I will be back."
    },
    {
        "id": 177,
        "text": "Glad I tried it! \nI tried this place, based on their unique menu. I got 3 rolls, Unakyu (Eel Cucumber, 3), Spider (3) and the Margarita Roll (5). The eel in the Unakyu had hard bits of what I assumed to be bone in it and the spider was underwhelming and lacking crab. The Margarita Roll was great (and pretty), and I loved the uniqueness with the lime. I did feel all the rolls were small, making them not worth the price. Lastly, the service was prompt & friendly. The restaurant has good covid precaution in place and the pick up was still very simple, which was appreciated. \nOverall, it's not my favorite sushi place, but I'm glad I tried it."
    },
    {
        "id": 178,
        "text": "The best vegan ramen I've had in a LONG time. Order the the vegan yasai ramen. Does not disappoint!!! Sushi was very fresh as well. Will be back. 10/10 experience"
    },
    {
        "id": 179,
        "text": "Great atmosphere and the staff is completely courteous. I would add another star once they offer more selections as I've tried everything from their delicious menu"
    },
    {
        "id": 180,
        "text": "Everything was delicious...only thing we didn't like was the sweet tamago....but sashimi tasted very fresh, rolls were delicious. Their garlic ramen was delicious as well. They're BYOB so we had a bottle of wine and sake to go with our meal...nice cozy atmosphere. Perfect place for a small group gathering or date night."
    },
    {
        "id": 181,
        "text": "A group of us came here for dinner. I ordered the Tonkotsu Ramen and other people ordered sushi and the poke bowl. I think everyone would agree that their dishes that were ordered were good. I have to say, if you are ordering the ramen you should have an appetite."
    },
    {
        "id": 182,
        "text": "I just happened to want to try this place by looking at sushi places on Yelp and I am so glad I came because it was not a disappointment! The ambiance of the restaurant is very intimate and romantic. When I went around 3pm there was barely anyone (since they open at 3) so it felt really calming to be the only party there. \n\nMy boyfriend and I ordered the chicken ramen, shoyu ramen, Steven roll, and the shrimp shumai. The shumai was better than other shumais I've tried. Didn't smell too rubbery or egg-y. The Steven roll was really delicious. Each bite was heavenly. It was seared to perfection. The chicken ramen was very creamy, but not too much. The shoyu ramen's broth was also very clear and clean. It wasn't too oily and too salty. It was so perfect! The ramen noodles for the chicken and shoyu ramen were different too so that was very interesting (in a good way!) We felt like each dish had so much care put into it because we tasted the difference in the ramens. \n\nThe service there was also very good. Water refills without asking and not too much \"in your face\" type service. I would come here again! Highly recommend!"
    },
    {
        "id": 183,
        "text": "Finally found probably the best vegan/vegetarian ramen joint so far in Philly. So so good. It was packed with flavour. 4 stars because the sushi was underwhelming, especially the nigiri. It was dry and lacked flavour. Sever had good recommendations though."
    },
    {
        "id": 184,
        "text": "Cozy in size, big in flavor, Tomo offers a new play on traditional style sushi. Would definitely recommend a reservation due to size of the restaurant. Overall attentive service and good quality food. Pro tip - BYOB!"
    },
    {
        "id": 185,
        "text": "Tomo has been on my radar for months and months. I finally had the opportunity to dine in. The food was excellent. The Philly Special roll was my favorite. Steven Roll and Harvest Roll a close second. Ramen delicious as well. The service was good but could have been better. We were left without water for a while. But I did appreciate the precautions taken with COVID. We had a nice private experience with our personal table shield."
    },
    {
        "id": 186,
        "text": "Always nervous ordering sushi delivery but Tomo didn't disappoint! I forgot the other rolls I tried but definitely try the Tomo roll. I can't wait to try the ramen next time."
    },
    {
        "id": 187,
        "text": "Went here on a Saturday in February. They are offering both indoor and outdoor seating. We elected to sit outside next to the heat lamps. It was cold, but not to the point where it was uncomfortable. \n\nThey are BYOB which is a plus. If you forget to bring someone (or run out like we did ) there is a beer store only a few shops down. \n\nThe food and the service were all very good. I definitely suggest the pork buns. Admittedly I have had my fair share of pork buns and these definitely come close to the top. I don't know what sauce they put on it but I've never had ones with it before and it's absolutely bomb. For my meal I went with the mayu tonkatsu ramen and added their spicy sauce. I really enjoyed it. My only gripe would be I wish there was more burnt garlic flavor, but otherwise no complaints. Sushi is not really my thing, but the three other people I was with got a whole bunch of things and they were very happy with it. My one friend gets sushi literally everywhere and said this was some of the best he has had. I did try the tuna guacamole. I wasn't sure what to expect but it was fantastic and tuna was so fresh. \n\nI really enjoyed this place and will be heading back."
    },
    {
        "id": 188,
        "text": "Great food. Service could be a bit more effective but considering evth happening these days.... All good. Will come again for sure."
    },
    {
        "id": 189,
        "text": "Tomo sushi and ramen in Old City is worth a try! Vegan options and BYOB were some of the highlights. Dining in was a bit hectic and felt rushed. The waitress notified us of a two hour limit and the quantities are sized for a child at steep prices. Favorites include the Tomo roll, Stephen roll, Yellowtail torched tartare, Shrimp on Fire roll, Scallop and Salmon Belly nigiri, Seaweed Salad, Spicy Tuna. Good for quick take out."
    },
    {
        "id": 190,
        "text": "Very good, respects allergy notes (including avocado allergy!)\n\nWill be ordering from here again. Try the unagi! :)"
    },
    {
        "id": 191,
        "text": "Sushi takeout has been my savior through quarantine and I've tried a lot of places. \n\nThis is definitely one of the go to places for a variety of sushi rolls, nigiri, sashimi as well as ramen. Prices are reasonable although passable sushi takeout can never be said to be cheap. \n\nI got the salmon combo that's comes with two salmon nigiri, salmon roll, and a salmon inari. For rolls i also go the red dragon roll and the shrimp tempura. The shrimp tempura wasn't my favorite, kinda bland and tasteless so I would pass on that one. \n\nOnline order and pickup through the window is super easy. They do have a couple tables for outdoor dining, but I don't think they'll be doing indoor 25% of a small place would be super inefficient. \n\nDefinitely a place for repeat takeout orders for that sushi craving."
    },
    {
        "id": 192,
        "text": "My wife and I have had some amazing vegan sushi and Vegan Ramen before Tomo, or so we thought. I had one bite of my roll that had vegan cream cheese in it and immediately panicked. Of course, this place gave me real fish and real cream cheese. Of course. Great......I called the waiter over and asked if there was a mixup with our order and to my relief, there actually wasn't, that's just how good this place is. We were blown away. They have mastered their craft with their vegan options and we are so grateful!!! Vegans rejoice. Your vegan sushi saviors have arrived."
    },
    {
        "id": 193,
        "text": "Amazing sushi, and great service! The seaweed salad and vegetable gyoza were solid, but didn't have anything unique/special about them. Every roll that I tried lived up to what I expected though. The shrimp on fire, salmon yaki, and red shrimp rolls are worth ordering!"
    },
    {
        "id": 194,
        "text": "Great ramen, great sushi, really nice interior and service. So happy to have a ramen place in Old City!"
    },
    {
        "id": 195,
        "text": "Stopped by this place in its first week of opening for dinner. It has a really nice atmosphere (quiet), with some cool fish murals on the wall.\n\nMy wife and I ordered two different specialty rolls (See photo). I really liked the Tomo roll which had tuna and cilantro with a nice sour sauce on it, but wife preferred the eel and avocado roll. My father-in law doesn't eat sushi so he tried to pork ramen, which I had a taste of, and the meat was really tender and broth was really good.\n\nWe will definitely come back again and try out some more sushi and probably grab a whole bowl of ramen for myself."
    },
    {
        "id": 196,
        "text": "Vegan sushi..... they got it down. Now you don't have to be the whimpering person in a room full of meat eaters. Tuna Bar (next block over) is way over priced for what they offer, arrogant, and actually gave me a roll with WHOLE peanuts.... um crush it maybe so I don't chip a tooth. Before converting I tried all of Tomo's rolls and ramen through the years and it is just consistently delicious here. Price is right where it should be and the staff are the kindest people I met so far in a restaurant. That 'I wanna be from brooklyn' attitude doesn't fly when I'm giving you money. Be kind like Tomo and we will keep coming back."
    },
    {
        "id": 197,
        "text": "I live in the neighborhood so I order takeout from here a lot and it's always great. The Mayu Tonkastsu ramen with spicy sauce and the pork buns are my favorites. Staff and service have always been great."
    },
    {
        "id": 198,
        "text": "Vegan philly cheesesteak roll was fantastic!  Great concept and flavorful execution.  Vegan ramen was also great. Definitely worth a visit if you're in the area."
    },
    {
        "id": 199,
        "text": "Been wanting to try this place for awhile, finally did when they opened at 3pm for dinner, first customers in there at that time, the staff looked too busy to greet us or asked if we were dining in. We ordered the miso ramen, the ramen lacked flavor and the broth was really salty and tasteless. The portion was small as well, can't believe this little bowl is almost $14, I've had better ramen in Chinatown. If you want great ramen, go to terakawa in Chinatown or kyuramen in cherry hill."
    }
]