[
    {
        "id": 1,
        "text": "We tried Izumi last night after reading the great reviews from here. It was a great eating experience. The place was small but had a comfotable feel and the waiter was great. He explained everything in an upbeat fashion and his recommendations were stellar. \n\nWe got various sushi dishes such as the Rainbow Roll, Passyunk Roll, Spicy Tuna and California Roll. Which was the best Sushi I had in the city to this point. We will be returning soon to try different offerings."
    },
    {
        "id": 2,
        "text": "Let me start out by saying that I am a nut for good sushi. Out of probably 200 sushi bars I have been to, there are only 9 places in the world that I have been to that meet my criteria to be called a \"good\" sushi bar. Three are in Japan, 2 are in Los Angeles, 1 is in San Francisco, 2 are in New York, and then there's this place in sh*tty old Philadelphia, a 5 minute cab ride from my apartment in Center city. Izumi is nothing short of excellent in every way.\nAny good food starts out with good ingredients. Making good traditional sushi is very simple: use good quality rice, prepared properly, excellent fish, and a dab of some good home-made \"wasabi\". Most places suck at all or some of these things. Not this place.\nSmall restaurant with maybe 4 staffers including one in the front-of-house. Hardest working people in the restaurant industry, those FOH guys. Probably only 30-35 seats, but when the place is full, they are running around like crazy, serving food, taking orders, busing tables, and seating new parties. The wait can be long, but it is worth it.\nAll of the fish I have had there (virtually every fish on the menu) has been perfect as sashimi and sushi, and their maki rolls are good as well. Special shout-outs for the tuna, salmon, super-white tuna (don't eat too much because of high wax content and digestive issues), and the oh toro. All are excellent in texture, quality, taste, and preparation. If you like spicy tuna rolls, you won't eat them again at your local neighborhood sushi joint. Each order is prepared individually from a filet of tuna scraped with a spoon. There's no giant tub of tuna scraps in the back mixed with mayo and a little sririacha served all day. \n\nThe good food doesn't stop at the sushi, though. Their slow roasted beef shortrib is nothing short of \"oh-my-goodness this is amazing\".\n\nWe first visited Izumi by accident about 2 or 3 months ago, and now find ourselves there once a week. It's that good."
    },
    {
        "id": 3,
        "text": "I wanted to like Izumi but didn't. The host/waiter certainly was accommodating so service was not the issue. For the price I found the portion size to be very small.  When paying $13 for a roll I expect it to be much more hearty in size than an appetizer type roll that is more like a side dish than an entree.  The sea weed salad was nasty - although I felt like the waiter prepared us for the - others must have complained. The ginger chicken took a long time to cook but I am not sure why as when it came out it was still pink.  The flavor was ok but for $21 I would have expected to get more than an appetizer size portion of chicken. It was accompanied by a risotto which was flavored as salt. The saltiness was so overpowering that you couldn't taste anything else.  As someone who lived in Japan for four years and studied the language and culture for eleven I was underwhelmed by izumi."
    },
    {
        "id": 4,
        "text": "The food here was, simply put, amazing. I came here with three other people and we were able to get a reservation just a few hours beforehand (although it was a very cold night, so maybe it was an unpopular night for that reason). I'm pretty picky about sushi (and my boyfriend is even pickier) and we both loved it. The rock shrimp tempura was outstandingly fresh with a mild wasabi sauce and melt-in-your-mouth shrimp. The Izumi roll, scallops, and sashimi sampler were all great, although I've had slightly better tuna at other restaurants. Don't skip dessert here! The \"un donut\" dessert was unexpectedly delicious--almost like a cider donut, served fresh, hot, and crispy on the outside, soft in the middle. Considering the portion sizes you get in a typical sushi restaurant, I thought they were quite generous (the veggie tempura is a meal in itself).\n\nIt was a slow night at the restaurant and service was a bit slow (I think there was only one waiter), so I could see how that could be a problem when they are very busy. But, it wasn't enough of an issue to knock a star off."
    },
    {
        "id": 5,
        "text": "I want to like this place since it's right around the corner from me, but it's just less than mediocre sushi and way overpriced. The rolls are undersized and the fish is not very fresh. Good location, bad sushi, worse prices."
    },
    {
        "id": 6,
        "text": "My roommates and I came in here for dinner this past Friday and we were all pleasantly surprised about how good it was. We had never been there before and were all thought that is was going to be over priced with little to show for it. We all left very full and agreed we would go there again.  The quality of the fish was good and the service was good too."
    },
    {
        "id": 7,
        "text": "Came for lunch and had to say that despite the loud music, the food, atmosphere and location are great!  The food was in particular outstanding!\n\nWe started with their daily special - baby octopi in a sesame aoili - delicious! Tender, bright red baby octopi with a sumptious taste of raw octopi and sesame oil.\n\nThen we had the sashimi sampler off the regular menu; I must say we quite enjoyed the grilled squid, tako, salmon, something else my coworker enjoyed and some very delicious white fish with a fantastic taste and texture we didn't recognize.  \n\nWe had the special maki roll - tuna & tobiko inside; crab outside - delicious!  They did not skimp on the tuna nor the real crab meat.\n\nHmmm... then we finished with a small plate of sushi which I must say was outstanding.  The fish tasted and felt fresh, tender & moist.  The accompanying spicy tuna roll was very very good; more tuna with a light kick than the standard unrecognizable super spicy mostly sauce spicy tuna you find at some places.  I'm not a fan of spicy anything roll because of this, but Izumi definitely put spicy tuna rolls back on my mind!"
    },
    {
        "id": 8,
        "text": "I'm pretty apathetic about sushi and still loved my experience at Izumi. First of all, it's byob. Second, it's a nice atmosphere and somewhat upscale, which is not always the case with byob's. \n\nWe went with a big group of seven and were struggling about how much to order, what to pick etc. Our waiter gave us a couple typical options, then offered to just select dishes for us and course it out - he promised to be fair with portions/prices, which I was pretty skeptical about, but it turned out amazing. He brought a sashimi appetizer, gyoza, tuna with avocado & ponzu sauce (EXCELLENT), a selection of maki (there was a special monster roll with soft shell crab on top that was great), then finally a selection of sashimi. It's not exactly what we would've ordered had we just done it ourselves, but everything was delicious and we each ended up paying around $25. Not tons of food, but definitely enough. \n\nNot bad at all"
    },
    {
        "id": 9,
        "text": "What a great place!  I am not a fan of Sushi etc, but I have to say this is the first Japanese restaurant I've gone to where there are enough non Sushi items on the menu that I had a hard time choosing.  My choices were great.  Awesome tempura vegetables to start and then a ginger glaze short ribs (had to take some home they gave me so much) for entree.  I went with 2 friends who ARE into sushi etc and they both loved what they ordered.  It's a great place to go if there are suhshi fans and non fans in your group.  Everyone enjoyed"
    },
    {
        "id": 10,
        "text": "Excellent customer service!!!  Service was  great and the food was very good!  The sushi was good"
    },
    {
        "id": 11,
        "text": "We've eaten here a few times and had to stop and thank the Chefs every time. Try the Benny Roll (lightly fired and topped with Bonito flakes) and the Scallop small plate (served atop a slice of mozzarella and sauteed mushrooms). Excellent service in a nice setting too. Will definitely be continuing to eat here. Wish they were open later!"
    },
    {
        "id": 12,
        "text": "Delicious the gyoza and rock shrimp tempura apps were amazing and the small sushi & sashimi was a perfect portion for two make sure to bring your own booze and enjoy the freshness and great service"
    },
    {
        "id": 13,
        "text": "Last night, the Boy and I ventured down to the Philly Night Market in South Philly and like so many others, once we saw how long the lines were, we decided to find a restaurant to eat at instead, and just enjoy the ambiance. \n\nWe've heard quite a bit about Izumi, and we're always on the lookout for GOOD sushi (not that many choices in this city), and since they were able to seat us right away at the bar, this seemed just perfect!\n\nFlash forward 2 hours and 40 minutes later, we'd consumed roughly 6oz of food apiece. The kitchen had botched our order 3 times; the only way we managed to get any food whatsoever was when our concerned waitress wandered over every 40+ minutes to cock her head to one side and muse \"oh, did you not get your such-and-such yet? I'll go check!\" Only to put the order back in the kitchen's queue, not at the front of the line, where it should have gone. \n\nI take full blame for not standing up for myself and pointing out how ridiculous their multiple errors were. I'm not complainer by nature, but this was beyond any mistake I've seen in a restaurant. At the end of our stay, when the waitress sheepishly informed us that our last dish was \"still cooking....slowly. Do you want to just get your check?\" I told her to just forget it. We then saw them pull a raw piece of meat out of the oven and throw it away. We would have been there for another 45 minutes, at least. \n\nWhat infuriated us the most was the lack of offering to take something off the check, let alone comp the whole dinner. Or at least bring over something as a \"while you're waiting\" apology. I don't feel as though the world owes something to me, but I do believe in restaurant etiquette. The restaurant was crowded, but there wasn't a line out the door - it was just \"normal full\". As the tables around us were efficiently fed and turned over, I resigned myself to leaving a 0% tip (NEVER did that before!) and promised to  never darken their doorway again.\n\nI give this place one star for 2 reasons: 1.) Yelp doesn't let you give zero stars 2.) The food that they did give us (a hastily ordered salmon-and-avocado roll and a spicy tuna roll - not exactly what you go to a destination sushi place to eat - just to have something to chew on!) was actually pretty good. Thanks for a lot of nothing, Izumi. Maybe I'll come back the next time I have a 3+ hour car inspection waiting time."
    },
    {
        "id": 14,
        "text": "Went here with a large group and we had a spectacular experience.\n\nThis Japanese BYO is a great idea and very well executed. We got the \"one of every maki on the menu\" special for $70 as a group appetizer, a nice selection of sushi and sashimi and three more non-fish entrees, shared all of it among a group of 8, and it came to something like $40 a head including tax and tip!\n\nAdd in the cool atmosphere, the great East Passyunk location, and the fun friendly service and this is a no-brainer for 5 stars."
    },
    {
        "id": 15,
        "text": "They really aren't kidding when they tell you that their seaweed salad is \"different.\" It's different, and not in a positive way. It tastes as if it was soaking alongside fish. It tastes worse than seawater. It tastes like fishy water. If you like your seaweed, I assure you that you won't like this version. \nOther than that, the beef negimaki is tasty, but the sushi sashimi wasn't anything to brag about. I've had better sushi elsewhere."
    },
    {
        "id": 16,
        "text": "We love this place! From the open air setup and outdoor seating to the deliciously unique rolls and friendly wait staff... this is my friends and I's South Philly go-to. Though they're busy we can always get a good table on a Friday night.\n\nThe special roll is always a hit and my personal favorite is the Remy roll. The vegetarian/ vegan sushi is also amazing! If that's your thing... ask them to make you an avocado and sweet potato roll with benito flakes. \n\nWhat's really special though is their seaweed salad. This is no average run of the mill seaweek, and nothing like the typical you get at sushi joints. Their seaweed is FRESH and served in mellow vinegar and lemon. Absolutely delicious! Even my apprehensive friend was Wowed and loved it. The only reason why we didn't give Izumi 5 stars is we figured there are even more insane sushi spots we have yet to try... but for now, this is our favorite =)"
    },
    {
        "id": 17,
        "text": "Might be the best sushi I've had since moving to the city over a year ago.  The waiter was helpful and we loved the atmosphere.  Already have another reservation."
    },
    {
        "id": 18,
        "text": "Excellent BYOB. I highly recommend the sushi. My favorite is the dragon roll. Each piece is a nice size portion."
    },
    {
        "id": 19,
        "text": "We like coming here once in awhile for date night. Service is always fantastic. Try the Passyunk, Paradiso and Izumi rolls. Honestly, try everything, it's just THAT good."
    },
    {
        "id": 20,
        "text": "I made reservations for a Tuesday evening at 7pm, but it was unnecessary as the restaurant was fairly empty. Our waiter forgot our green tea, and when we reminded him, he kindly made it on the house for the inconvenience. The food was delicious and fresh - my friend loved her Uni (which she had been craving) and Rock Shrimp, and I was delighted by the quantity and quality of fish in my Chirashi. After a great meal and good service, Izumi is now one of my top places for sushi in Philly."
    },
    {
        "id": 21,
        "text": "This place is a bit overrated. While the service was great, I think you can find better sushi almost anywhere you go. I didn't dislike my yellowtail canopy roll....but I also wasn't impressed by it. The yellowtail canopy was finely chopped rather than the normal whole pieces of fish, which I worried was hiding bad quality fish. I ended up removing it and basically just eating a spicy salmon roll. We also had the sashimi sampler (meh) and the pork dumplings which were actually very good. \n\nI probably wouldn't come back if not for our very attentive waiter."
    },
    {
        "id": 22,
        "text": "Good date spot, with solid sushi.  This past weekend I had a wonderful experience at Izumi.  The service was lovely, and the food was very good.  I am kind of a sushi snob, and I was overall impressed.  We ordered the Izumi Roll, Spider Roll, and Remy Roll, as well as a seaweed salad.  I went with someone who is not a big sushi eater, so we tried to select a variety of rolls.  The Remy Roll was by far my favorite.  The white fish was very fresh and tasty.  The other rolls were more standard with mostly cooked ingredients, but were delicious regardless. I loved the atmosphere.  We sat  outside and brought a couple of bottles.  The service was a little slow, but the staff was very nice and accommodating.  We were not in a rush and did not mind.  Overall, great dinner and I look forward to returning."
    },
    {
        "id": 23,
        "text": "Phenomenal food. Freshest sushi, delicious flavors. We got Izumi roll catepillar roll monster roll and yellowtail canopy and all were so flavorful and fresh. The seared scallops were also excellent. One of my new favorite sushi places."
    },
    {
        "id": 24,
        "text": "The first time I was here, it was a little crowded and I was the first to arrive for a party of 6. They didn't act like this was a problem at all and moved a few tables around to seat us, then right after we ordered a larger, more comfortable table opened and they moved us over. They acted like they were inconveniencing us and apologized a million times, then sent over an order of rock shrimp tempura on the house. Our waitress mentioned that the tuna was excellent that day so I had some sashimi, and she was right! I also shared the special roll of the day and some tuna and avocado rolls, and everything was really fresh and satisfying. Everyone at the table seemed to enjoy what they ordered and the service was great. I just made a reservation to go back for my birthday!\n\n\nUPDATE: My birthday was an amazing success. Our server was so sweet and again the fish was so fresh and beautiful. This time the rock shrimp tempura was served in a wasabi aioli and was even better than last time. Also they are participating in foie gras week, and one of my friends did order that dish - I didn't try it but everyone who did seemed to like it. Izumi is now my go-to sushi spot, they make me so happy."
    },
    {
        "id": 25,
        "text": "\"Woohoo! As good as it gets!\"\n\nI've been hearing good things about this place for awhile so I decided to take the trip down to check it out for myself, and I was NOT disappointed. I just use yelp for its goods and never write reviews myself but this place was THAT good that I opened up an account to make sure everyone knows how great this place is!\n\nAll the specialty rolls (Passyunk, Tuna Canopy, and Caterpillar) were all AMAZING and filling. My party and I decided to do family style, so we order a Hot Entrees and YOU MUST try the ribs. We didn't even have to ask for a knife because the meat was that tender and it literally melted in my mouth. \n\nI believe our waiter JOE was taking care of all the tables in the place,  along with the hostess but I never felt like I was waiting around for his service. His recommendations were on point, especially the LYCHEE CREME BRULE, which was the perfect end to our meal.\n\nLooking for another reason to treat myself out, so I can go back! :)"
    },
    {
        "id": 26,
        "text": "Love this place! Everything tastes so fresh. Ordered the sashimi sampler platter and was blown away by how great everything was."
    },
    {
        "id": 27,
        "text": "The guy was great, he was a good server. \nserver: we are know for our \"UNI\" he brag bout it then, after i order he said we only have it on weekends. \n\nRemove it on your weekday menu if you only have it on weekends. \n\nOther than that nothing special except its BYOB. \n\nAmbience was good, its located on the belt of Passyunk restaurant street."
    },
    {
        "id": 28,
        "text": "Awesome BYO in a great location. Were promptly seated for an 8pm reservation on a Friday night and our outdoor request was honored - huge plus, as it was a beautiful night. Service was good, not great - didn't see our waiter too much. Rolls were delicious as was the seaweed salad, which featured 3 different types of seaweed. Not the best sushi in Philly, but very reasonably priced and beautifully presented. Will definitely return regularly!"
    },
    {
        "id": 29,
        "text": "I have been here three times. My first visit, shortly after the restaurant opened, was mediocre. I decided that I did not need to go back unless there was a good reason. Well it turns out I had a reason as my friend wanted to take me here, so I agreed to give it another go. I brought a bunch of wine, you know, in case the food was still not so great. However, I was pleasantly surprised by the quality and the deliciousness of the rolls. I have since been back a third time and I enjoyed my meal again. As a note: I would not order the seaweed salad again as it is seaweed leaves. I have never ordered an entrée or desert here, but I never do at sushi restaurants. All in all, the atmosphere is nice, the service is good and I would go back."
    },
    {
        "id": 30,
        "text": "I suggested Izumi to my friend to see if we could disprove her theory that there isn't very good sushi in Center City.  It was very easy to get to via SEPTA and she had no problem finding street parking near the restaurant (the one-way streets can be a little frustrating so bring a GPS if you have one!).  \n\nWe came on a Thursday night at around 7 and found the place busy, but not full.  There was no wait and we had our choice of being seated inside or out.  Overall, we both really enjoyed everything we ordered and our server was friendly.  My only complaint was that there were so many \"specials\" that night that it was pretty hard to keep track as our server rattled that off.  Perhaps the good folks who run the restaurant might consider printing out the specials so patrons don't have to rely on their leaky memories.  We definitely look forward to returning and trying some of the entrees next time."
    },
    {
        "id": 31,
        "text": "We brought an out-of-town visitor to Izumi, who loves sushi and he was duly impressed. There's no doubt that Izumi is a good place to satisfy cravings for better sushi. And they are proud of what they do, as evidenced by the server's enthusiasm. \n\nIzumi has good superior sushi, but the price is a bit of a sucker punch. I used the strategy to sample a la carte sushi from offerings I never had before. That kept the price down (a bit) and also made the experience more special. It's a great place for celebrations or special occasions. The atmosphere is conducive to conversation and is BYO, which makes it more fun and affordable."
    },
    {
        "id": 32,
        "text": "We have dined there before but tonight I was absolutely crushed and disappointed. Do not book them on Open Table. We went to our reservation at our appointed time. They tried to seat us at a counter with no backs on the seats. This was unacceptable especially as it was my husband's 50th birthday and I had put it in the notes as such. It's Open Table not open half counter. The host told us there were no tables. We were not late for our reservation so obviously they are overstating their table allotment. Furious! Luckily we were on East Passyunk where many excellent restaurants are steps away. Will never book there again!"
    },
    {
        "id": 33,
        "text": "I Live directly across the street from Izumi and, because I had to suffer through the early morning construction for what seemed to be an eternity, I expected to hate it.  It's true, what can I say, 8 am buzzsaws make me very cantankerous.  I was even more concerned when I read about their plans to put tables around the fountain in the intersection in the warm weather months, as P'unk ave drinkers sometimes tend to forget that people do, in fact, live here and can be a little over boisterous at 2am.  In light of all that, I agreed to try the place out very reluctantly.  I'm really glad I did.\n\nMy boyfriend, one of my friends and I decided to give Izumi a whirl on a warm Friday night about a month ago or so.  They had not yet gotten clearance from the neighborhood association to expand their outside seating to the fountain and the place was packed.  The server who met us at the door cheerfully informed us that there would be an hour wait for seating and that they are a BYOB, but that Paradiso has take out if we wanted to grab a six pack to bring back with us.  She also listed all of the bars along the Ave that would be good places to hang out while we waited and offered to call our cell phones when our table was ready.  Needless to say, Izumi had me at \"Hello\".   Where else can you get such VIP service without actually having to throw money around like you're a high roller?\n\nWe returned home to have a beer and wait for the call, which came pretty quickly with an offer to sit at the counter if we wanted, or to wait the full hour for a table.  We elected to sit at the counter and within mere minutes, we were happily seated with full wine glasses and were enjoying the show of sushi chefs adeptly carving through jewel like pieces of fish.  \n\nNow, I have to admit here that I am not the most adventurous  of sushi eaters and I typically stick to California rolls and veggie rolls.  However, the boyfriend was very excited that they had sea urchin on the menu and he went to town ordering a ton of ala cart sashimi and a few pieces of sushi.  I stuck to my old standby of California roll and tried Izumi's Passyunk Ave Roll, which is shrimp tempura with some kind of spicy crab salad.  What truly impressed me was this, the California roll was less expensive than any of the take out and fast service sushi places throughout the city and it contained REAL CRAB.  With a C, and not a K!   An hour later we were all happily stuffed to the gills and ready for a nap.  I will return to Izumi for sure.  And, now that they do have those fountain side tables set up, I have been happily reassured that they are not creating a neighborhood nuisance, but a charmingly local place that seems to bring a lot of relaxed smiles to the Ave!"
    },
    {
        "id": 34,
        "text": "This place wasn't bad but compared to doma vic's or other sushi places its not that great. The best thing we had was the soft shell crab appetizer which had a really good lobster sauce. Sushi and fish were decent"
    },
    {
        "id": 35,
        "text": "This place is wayyy overpriced and the sushi isnt all that great. Ordered the spider rolls tempura, and an eel roll.Service was alright and nice setting.  I've had better at smaller sushi places such as  Terryinn. I wouldnt bother coming here again. Only reason was of the outside seating next to the fountain and because i live in walking distance."
    },
    {
        "id": 36,
        "text": "My group and I were asked to leave because they had to make room for more people. I will never eat here again. I hope the manager sees this. They should be ashamed!"
    },
    {
        "id": 37,
        "text": "Very good food and fast and polite service. However, for the price it would be nice to have more room and more atmosphere. I made a reservation for 8pm on a Friday and showed up on time but had to make the choice between waiting for a table or sitting at the bar. I do not recommend sitting at the bar seating because it feels like you are at a lunch counter with the cooks passing food over your head to the servers. So what is the point of making a reservation then?"
    },
    {
        "id": 38,
        "text": "I've been coming here for a while now. Tonight we came on a Tuesday night and there was only one server with no busboy to help him. Granted, he was very quick and efficient but there was no way he could take care of 10 tables without sacrificing on service. I'm giving it a 3 star tonight for the long wait. Maybe this will prompt them to at least get a busboy to help."
    },
    {
        "id": 39,
        "text": "Omgggg I have been to almost every Japanese restaurant in Philly, Izumi is by far the best japanese restaurant in Philly! All their dishes are awesome. \nAlthough their location is quite remote from the city center making it a little inconvenient, but their quality of food makes up for this!!! \n\nService: very professional and made great recommendations. \n\nHere are some of my favorite menu:\n1. Special monster rolls (my favorite. It is so good that we ordered the second one) \n2. Tuna (in small platter section)\n3. Surf and turf ( this is a special menu and it was awesome!!! It consist of perfectly cooked medium rare wagyu beef and seared scallop) \n4. Seared scallops (in small platter section)\n5. sunomono (good for light appetizer but some may think that it is not that great compared to other alternatives but I still like it) \n6.uni sashimi is awesome. (But if u don't like sashimi then u might want to skip this. Their scent can be strong for those who are not used to uni) \n7. Pan seared scallop (large plate section. I think this menu is good but not great as compared to other menu I just recommended but if u are a scallop fan like I am, you will like this menu too since the scallops are served with mashed taro blended with potato and some vegetable purée which is so good) \n\nHowever, there are some menu which I think is so so:\n1. Passyunk avenue roll\n2. Tuna wasabi salsa\n\nAs for dessert, their chocolate bread pudding served with coconut ice cream is superbbbb. Love it!! \nWe also ordered lychee creme brûlée, which is also good but a little too sweet in my opinion. (But please note that I like not-too-sweet dessert so my standard of how sweet things is might not be accurate compared to most other people haha)"
    },
    {
        "id": 40,
        "text": "My friend decided to do her birthday dinner here and I must say that she made a good pick! Aside from the sashimi, maki and special rolls, which were all great, we also ordered fresh uni/sea urchin. It was my first time having it and boy was it good! After hearing stories of others first time experiences eating uni, I'm glad mine was a good one! \n\nThe place has a warm feel to it when walking in, with modern decor and cool lighting under the bar. The staff was very accommodating as well. One thing I really liked was that the server took the time to tell us what each roll or item was after bringing it out. A lot of times I'm left figuring out what was what that I ordered at sushi places. Oh and might I add, it's BYOB:) Will I be back?! You can count on it!"
    },
    {
        "id": 41,
        "text": "Izumi has some of the most creative sushi and entrees in the City.  The inventiveness and combinations are outstanding.  The service is excellent.  I recommend it highly"
    },
    {
        "id": 42,
        "text": "I was very impressed with the quality of the fish and the craftmanship of their sushi chef.  The Oh Toro and the Amber Jack ( a type of yellowtail) came enveloped in a very fine delicate seasoning and melted like butter in my mouth. We had the Izumi roll which had freshly roasted seaweed that were crisp which enhanced the taste of the fish. The yellowtail and scallion maki rolls were also delicious. \nWe ended of meal with house made green tea ice cream that had just the right amount of bitterness to give it a kick. \nThe fact that it's a BYOB makes it so much more affordable.  I'm definitely going back for more."
    },
    {
        "id": 43,
        "text": "We visited Philadelphia and were looking for good Japanese restaurant.  We went to Izumi since Yelp's reviews were good.  However we are so disappointed at their nigiri.   We are native Japanese living in California, so probably higher standard than normal, but we could not believe their sushi.  My colleague thinks that they used one day old rice.  Rice was hard and ruined the taste of fish.  We ordered $50 sushi set and for that price, we expected to get something much better."
    },
    {
        "id": 44,
        "text": "Walked out after waiting 20+ min with no server offering to get us drinks or take our order. There were at least 2 servers, one of them passed us several times and never told us that she would need a minute and the other made direct eye contact, saw we hadn't been helped, and still did nothing.  The place wasn't packed (2 tables free and several seats at the bar) and another table that was sat after us was already being helped.  This was a Friday at 9pm. \n\nWorst service I've experienced in a long time."
    },
    {
        "id": 45,
        "text": "This is a nice sushi place. By 'nice' I mean classy decor/ambiance and fancy-looking food in minuscule portions. \n\nI understand this is sushi, and sushi comes at a price. But when you spend $60 for two people and still have to stop at Wendy's on the way to the movie theater afterward, the tiny amounts of food better be pretty amazing to be worth it. The $25 sashimi platter comes with precisely 15 small and pretty thin but artistically cut slices of 5 kinds of fish. Two were your standard salmon and tuna, and the other three were fluke, mackerel, and something like snapper or yellowtail, I don't quite remember. While the sushi here was marginally better than many less-expensive sushi restaurants, I'm not sure it was worth the price markup. For me, there's a threshold where, once sushi is reasonably good, I care more about being able to get full without breaking the bank over minute improvements in fish quality. \n\nThat being said, the sushi here is pretty tasty (especially the spicy tuna maki and the mackerel sashimi). If you want to impress someone with a fancy sushi place and spend a lot of money in the process (I would guess ~$100 per couple to get full), then this is your place (or Morimoto, I guess). If you just want tasty sushi at a reasonable price, there are plenty of better options in Philly."
    },
    {
        "id": 46,
        "text": "First time here, and I enjoyed my experience very much! It's BYO, so make sure you bring something if you want to drink. We brought a six pack, since there's a nice bottle shop right across the street. The server very graciously said, \"Let me take care of those for you,\" and put all of our beers in an ice bucket. He took the time to observe what we had brought and came back to the table asking us what we would like to start with, naming the beers we purchased. That was such a nice touch!  Our server was very polite, very professional, ready to make suggestions, and not intrusive at all. I would give the service six stars if I could!\n\nThe food was nice and there was a lot of variety! I am very new to sushi, so I probably can't say whether it was the best sushi ever, but I liked the rolls we chose! My favorite was the caterpillar role.\n\nWould recommend if you're in the neighborhood :)"
    },
    {
        "id": 47,
        "text": "This place is situated in the heart of Passyunk. I need to stop parking at the Acme lot when I come here but the street parking really dries up after 7pm. \n\nThis place was packed for 9pm on a Wednesday, it is byob so feel free to get loaded off of your favorite drinks. \n\nWe ordered the braised beef short rib, Izumi roll, remy roll, and lychee creme brûlée. \n\nThe sushi came out first. The sushi was very average. I did not know the remy roll was going to be deep fried or I would not have ordered it. This should definitely mentioned on the menu. Also it was only 5 pieces so be prepared to starve. \n\nThe braised beef short rib was also very good. The portions were tiny. \n\nThe server should have offered up his knowledge of the menu and suggested 3 rolls minimum per person. \n\nThe lychee creme brûlée saved this place from a 2 star back alley beatdown. This was absolutely delicious. It was really ugly as they did not dress this dessert up at all with any garnish or special plating but the flavor was out of this world. \n\nI'll be back for the lychee creme brûlée. But I am hoping to find it at another restaurant so I never have to come back here."
    },
    {
        "id": 48,
        "text": "I can't even. As far as sushi in Philly goes, if you love it and don't eat here immediately I fear for your sanity. Seriously. I have been hearing about this place for quite some time and finally got around to trying it out. I'll be back every chance I get and get the cured eel dish each of those times. Oh man, and the sashimi? To die. That caterpillar roll is like a texture tsunami that floods your taste buds with awesome. Did I skip the part about it also being hugely vegetarian friendly? Because our server (the service was great all around and our server was a gem) suggested some off menu options to my veg BF and darn it if those weren't some tasty rolls. \n\nBasically, go here. A lot. Try stuff, ask questions, relax because the staff will help you and it will be glorious."
    },
    {
        "id": 49,
        "text": "Found Izumi after passing by on a whim. I just recently moved to Philly and got off of work early and decided to stop by. The service was excellent and it was the servers first day. Being a chef it is hard to find a place with great service but is is more difficult to find a place with great service from a new server. Sushi was exceptional. I have had sushi in Tokyo, Yokohama, and Hiroshima, and it was a pleasant reminder of how great sushi should be. Two thumbs way up. Check it out"
    },
    {
        "id": 50,
        "text": "One night my husband and I decided on a whim to go to Izumi.  Again, I am out of my comfort zone, but enjoying doing this more and more.  When we arrived, there were no tables available, but the young man that greeted us said he could seat us at the sushi bar, which was fine with both of us.  We were lucky enough to have the seats right near where the cooked dishes are done and able to talk to the chef.  Now I have not been eating sushi for very long and I have been less than adventurous with what I have chosen.  Tonight was a bit different.  Along with the selections I usually choose, Philly Roll, California rolls, we tried some other selections suggested by the server.  He was very helpful and able to explain the different dishes and how they are prepared very well.  We made our selections including dishes with eel sauce (eek) and kobe beef (which of course I ordered well).  The eel sauce was yummy, I was surprised.  All of the sushi selections were very delicious.  Getting to the kobe beef dish.  I did order it well, I don't like pink meat.  The chef asked if he could make a suggestion saying that this cut of beef doesn't fare well when cooked in this manner, but assured us if that was what I wanted he would do it.  I decided to throw caution to the wind and told him to cook it the way he thinks it should be done.  I don't think I have ever had a better tasting piece of beef.  It was a while ago, so I don't quite remember what the desserts were, but they were extremely yummy.  We had no leftovers of anything!  I'd like to go back to the service we received.  On this Thursday night the restaurant was full, as was the sushi bar.  There was one server who also served as busboy.  We received the most amazing service!  Not once was he neglectful, he did not fail to fill our water glasses at all times and food was served timely.  What a wonderful experience and I look forward to another visit to Izumi sometime soon!"
    },
    {
        "id": 51,
        "text": "Wonderful food and service. I've been there around 10 times and it never ceases to amaze me how good the sushi is! Byo and one of my favorite sushi restaurants in the city. The servers are awesome and I love the smokey taste of the sushi rice. The donut hole dessert with caramel sauce is excellent!"
    },
    {
        "id": 52,
        "text": "Izumi is the best sushi joint I have been to in south Philly. You can count on their food always being very fresh and well prepared. This place is not overpriced! The value is great and the whole venue is very clean and trendy."
    },
    {
        "id": 53,
        "text": "Holy hamachi this place still kicks ass. Mackerel? Bring me 2 of 'em!"
    },
    {
        "id": 54,
        "text": "We went here last night and thought it was some of the best sushi I have had in the city. The prices were on par with what I expected to pay. Its a small restaurant and we had to wait about 20 minutes for a table for our party of four.  But we did sit at the bar and opened our wine to enjoy while waiting. I am already planning a visit back."
    },
    {
        "id": 55,
        "text": "Great meal, and I've come to expect it from this place.  Took a 6-pack of Fleur de Lehigh, which the waiter poured into wine glasses for us to make us feel fancy.  Got the $30 sushi/sashimi plate and the rock shrimp tempura.  Rock shrimp was tender and perfectly fried.  Our combo plate had a delicious assortment of very fresh slices of sashimi, a crunchy/spicy tuna roll, and an assortment of sushi pieces.  Perfect for 2 people, delightfully fresh and clean, and I've never had bad service here.  Highly recommended."
    },
    {
        "id": 56,
        "text": "I came here with a bunch of friends for my girlfriends birthday on a fun Saturday night.  Our server was really nice and adorable and the food was so bangin.  I had the Izumi roll and a little piece of salmon sushi and it was soooo good! I also had a bite of the Paradiso roll and the Remy roll and it was all so sensational. The fish was wondi-ful, and the most important part was that my friend started her birthday partying off right.  She had a blast so I did too. I can't wait to go back, I really did enjoy the food."
    },
    {
        "id": 57,
        "text": "I had dinner there on New Years Eve. Very bad choice. The next day I woke up sick. No it's not drinking. Don't drink at all. Woke up from constipation and being woken throwing up in my bed.\nAdd this to fact the sushi is twice the price of elsewhere in Philly.\nNothing special plus the room is sort of like The Sardine Bar in Chicago (cramped) without the great food and Jazz"
    },
    {
        "id": 58,
        "text": "I am always on the lookout for new sushi places in the city, and somehow Izumi was listed in my \"Memo\" application on my cellphone in my \"List of Restaurants to Try.\"\n\nI hate to admit this, but I don't venture into South Philly as often as I should, so when getting together with a friend who lives south of Washington, I took this as an opportunity to try Izumi.\n\nWe started with the Seaweed Salad, which had a variety of seaweeds and was quite obviously very fresh.  Next we tried the Izumi Sashimi Sampler, consisting of the typical sashimi platter options (tuna, fluke, salmon, squid, and clam) with complimentary condiments sitting nicely on top.  This was probably my favorite dish of the night.  Next round was specialty rolls, which unfortunately, I didn't find that special.  They weren't bad per se, but not anything that stood out.  Last but not least was dessert.  We got the chocolate cake with meringue and toasted coconut, and it was the perfect palate pleaser.\n\nIf you're in the mood to change up your sushi dining options, give this place a shot.  And remember, it's BYOB."
    },
    {
        "id": 59,
        "text": "Came here on my boyfriend's birthday and I had a wonderful experience.  The food was delicious  and the ambiance was spot on.  Even though my server seems a little overzealous, he clearly loves his job and was beyond helpful.  Protip: don't order uni unless you know what you're getting into."
    },
    {
        "id": 60,
        "text": "Sat outside last night with a friend and had a wonderful meal.  For the two of us we ordered the edamame, tempura shrimp, scallop with crepe and two rolls.  Everything was delicious.  I was surprised by the large serving of shrimp tempura, we couldn't even finish it. The shrimp were delicious with an amazing sauce over.  The rolls were fresh and delicious.  The service began slow, took about 8 minutes for someone to get us drinks and tell us about specials, but then we had three people checking on us thoroughly the night.  It was a very busy Friday night.  We forgot wine, but were offered complimentary sangria...we had to glasses each, it was delicious.  I will definitely go back."
    },
    {
        "id": 61,
        "text": "Place rocks! The tempura was amazing and the fresh fish was delicious. The server was highly educated in the world of sushi and my uncle remarked that he has only seen the fish offered at Izumi in Japan. PRETTY COOL Izumi is a staple for us and we continue to come back. The specials are amazing. I can't wait for the warmer months so we can take advantage of the outdoor seating!"
    },
    {
        "id": 62,
        "text": "Ugh.  I hate having to downgrade Izumi because I still believe the sushi is amazing.  My husband even raved about his dish and the sashimi.  I think my main concern is that they don't understand their ingredients.  If you're someone with a dietary restriction, that's a big problem (if you don't have any food allergies, then feel free to ignore my review).  We listed my allergies on our reservation and the chef approached me immediately, which I truly appreciated.  But, then it got weird...he recommended tamari for me despite the fact that I listed a soy allergy (tamari is made from fermented soybeans).  I know that it doesn't always cause reactions for certain people, but I really didn't want to risk it.  He insisted that it would be safe, though, since its \"wheat-free.\"  Huh?  I'm not gluten intolerant, so I was really confused by his statement.  He then advised that I order their spicy tuna, even though I'm fairly certain that's made with mayonnaise (egg is another allergy for me).  I ended up ordering vegetarian rolls just to stay on the safe side and it worked out fine, but the ordering process and meal definitely made me nervous.  This is a great spot if you don't have any limitations, but I can no longer recommend this place if you need detailed information about each dish."
    },
    {
        "id": 63,
        "text": "Why, oh why, can't we have better sushi in Philadelphia. I'd give Izumi 3.5 stars for Philly, but only 2 stars overall. How hard is it to make good rice? \n\nIzumi, like most places in Philly, ruins their rice. It's bland and sticks together with none of the texture of true sushi rice. \n\nThe fish is good, but it's pretty much the same as you get at any other sushi place and the price is a bit much for what arrives on the plate."
    },
    {
        "id": 64,
        "text": "I'm delighted to have a sushi restaurant so close to home. It seems I'm usually crossing a bridge or going on an interstate of some kind to get my sushi fix of late. \n\nThis is a beautiful spot first of all. Very sleek and elegant, but small and not even a bit pretentious. I would easily roll up here in jeans and a coffee-stained t-shirt or a dress without anyone batting an eye. \n\nWe started with a seaweed salad which was different than what I'm used to. They give you three different types of seaweed, none of which were the typical green spaghetti-shaped variety. They wouldn't get a second try from me but I'm glad they offered me something different. \n\nOn to the main event. The sushi was extremely fresh and a good portion for the price. My only complaint was the sushi construction. Each piece immediately fell apart when I picked it up. Not a biggie, but not a mark of a top-notch, hallelujah kind of sushi experience either.\n\nI will be back to Izumi for sure. Can't wait for the summer when the front of the restaurant will be open to the breeze off Passyunk Square's fountain. But I don't think Izumi will scratch my top-5 list of sushi spots either."
    },
    {
        "id": 65,
        "text": "I want to thank our waiter first for his exceptional service. We were a party of 4 adults and 2 children for early dinner. \nHe was patient, attentive  and extremely considerate of my friends children. \nThe sushi was fresh and delicious. We had a sampling from spicy rolls to scallop sushi and a little in between. \nWe'll definitely be back soon for a kid free night ;)"
    },
    {
        "id": 66,
        "text": "How rare is it to have a sushi restaurant that has very attentive wait staff, creative menu and lovely traditional choices as well. I'm just glad that this rare gem is within walking distance from me."
    },
    {
        "id": 67,
        "text": "Really good sushi.  The staff is really attentive.  Nice ambiance with outside seating in the summer.  Love the spicy tuna roll!  BYOB."
    },
    {
        "id": 68,
        "text": "Best sushi in the Philadelphia area by far. I have been wanting to find a good sushi restaurant in the area at least something comparable to those in new york or the west coast. Isumi is definetly a hit. We had Otoro as a special delicate fatty tuna, then a big plate of sushi and sashimi. Their fish is very fresh, well prepared and delicate not like these sushi you find in the typical Korean or Chinese run japanese restaurants. The fish pieces were prime cuts. We also had white tuna and extra white tuna sashimi.\nThey also have homemade green tea ice cream. Definetly one of the best if not the best Japanese restaurant in Philly, and a byob so it cuts the cost down."
    },
    {
        "id": 69,
        "text": "I've pasted izumi a bunch of times since it opened last year. I finally went here for a meeting. Everything we ordered was great! Our server was really knowledgable  and the overall atmostphere was excellent. I can't wait to go back!"
    },
    {
        "id": 70,
        "text": "I have been to Izumi several times, and have always enjoyed the food. Delicious and affordable! \n\nMy experience last night, however, altered my opinion a bit. One of my best friends had gotten engaged, and a few of us were out to celebrate. After ordering several courses of food, we had paid and were finishing our glass of wine. A chef came up to our table and told us we needed to finish up and go because people were waiting for our table. We were surprised and offended by his rudeness, and while I might recommend this place for the food, I do not know if I will be back as a paying diner."
    },
    {
        "id": 71,
        "text": "Frequented this place numerous times.  Good food, nice atmoshepre and I like how you can bring your own Sake.  Waiter was very attentive even though he spilled Soy Sauce on my jacket.  Almost overly nice but I would rather that than ignoring me like they do at Umai.  \n\nI was just there again Saturday night and actaully got something other than Sushi...Lobster Tempura with three different sauces.  Hot the spot and price is very very fair."
    },
    {
        "id": 72,
        "text": "I love this place. Having tried a lot of sushi places in Philadelphia and other cities, and having been to Japan I have to say that this is some of the freshest sushi you can get in the city. They often have great specials and service is quick.\n\nRolls are well decorated and not overwhelmingly elaborate and large like some places (Raw) and when ordering Sashimi or sushi they ask if theirs anything in particular you dislike, which I think is great.\n\nThey are a little pricey but I think its well worth it. I think this and Blue Fin (Plymouth Meeting, Pa) are some of the best sushi I've had in the region."
    },
    {
        "id": 73,
        "text": "Service was decent but food was mediocre... there's much better sushi options in the city."
    },
    {
        "id": 74,
        "text": "Great ambiance, BYOB, great friendly service, okay food.  \nOverall Rating 3.5 \n\nWent here for dinner on a weeknight. We had the Fresh Uni, Sweet Shrimp, Soft Shell Crab Tempura with mixed mushrooms, Izumi rolls, Chirashi. \n\nThe best dish was the Uni. It was served in the Sea Urchin Shell. It does taste fresh eventhough, the Uni is not open/prepared to order. I was told the chef, cleans it beforehand and served to order. (4.75 out of 5)\n\nThe Sweet Shrimp Nigiri was okay, nothing wow...maybe because the rice was a little too hard and sour to my tasting. You get the fried shrimp heads too (3.5 out of 5)\n\nSoft Shell Crab Tempura breading was a little too thick for my tasting; pairing it with mixed mushroom was an interesting touch. It's different. It doesn't harmonize well the soft shell crab. I can see it, the mushroom as a separate side dish/appetizer because it has its own distinct taste. It's good alone. (3 out of 5 as a combo.  However separately; the crab was a 2.25 out of 5, the mushroom was a 3.75 out of 5)\n\nIzumi rolls - It's a little too small for the price. Not sure if that combo works well with each other. Note: I'm bias when it comes to Sushi roll. I'm more of a purist when it's sushi. (2.5 out of 5)\n\nChirashi - Not worth it, as I said before, the rice was too hard and sour for my taste. The little thin cuts of fish weren't really good/fresh. It also lacks presentation. It's just pieces of fish lay on top of rice. Yes, a Chirashi by definition are \"pieces of fish lay on top of rice\", but normally it's better placed with some artist flare. Izumi's Chirashi are just placed on top.  (2.5 out of 5)"
    },
    {
        "id": 75,
        "text": "I was excited to have a sushi place in P'yunk Square, though it took me a while to get around to trying it. My boyfriend and I ended up going here for our anniversary at the end of February and were sort of underwhelmed by the food. It wasn't bad at all. It's just that the decor and the prices had me expecting something a little more memorable.   \n\nTo start off with, the place is cozy and charmingly lit. It's a great date place, for sure.  The server was very competent and reasonably friendly. \n\nFor appetizers we had the yellowtail tartar, which had a nice flavor from them charring the top a little, and tasted fresh, but was not really that exciting otherwise.  I am not sure if this is due to the fact that we asked for everything without scallions, because my boyfriend can't eat them. We also got the special baby octopus appetizer. It wasn't bad; it just had a one-dimensional sesame oil flavor. \n\nWe ordered the sushi platter for two and the Izumi roll (crabmeat, eel, cucumber, avocado, sesame seed and nori) and my boyfriend got an extra couple of pieces of ikura (salmon roe). The sushi was decent, but the only thing that stood out to me was the salmon. It tasted really high quality. The rest of the sushi was just okay, and the rice had a little too much vinegar in it. \n\nThank god this place is BYOB! For the $100 or so that we spent for sushi, I feel that we could have had just an equivalent meal at a number of other places in the Philly area, minus the ambiance, which was really nice."
    },
    {
        "id": 76,
        "text": "Like the other 96% of the population, I love sushi. Like really really love it. If I had the option of eating it for the rest of my life, I would. That being said, I'm always open to trying new sushi restaurants so I was pretty pumped to join my friend for a lovely dinner. Unfortunately, I just wasn't impressed at all. \n\nThings just started off kind of bad. I got there first, and was welcomed by 3 servers who seemed annoyed that we hadn't made a reservation. That's fair, it was a Saturday night and I probably should've thought that through prior to going. They were able to give us a table, which I definitely appreciated, but they informed me that they needed the table for an 8:30 reservation. Uhm, excuse me? That was just so uncalled for because I spent the entire meal checking the time and feeling like I had to rush out. To be fair, that was the only bad part about the service. Every other aspect about that was superb. The servers were unobtrusive, were very prompt about refilling our water and wine glasses, and were really nice too. \n\nFor the prices that they were charging, I expected the food to be out of this world and frankly, it wasn't. The maki roll that I ordered (I think it was the Paradiso roll?) was extremely salty, which is saying a lot since I salt EVERYTHING. The seaweed salad was SUPER fishy, which makes sense since yeah, it's seaweed, but I guess I'm just partial to the regular, not fancy kind. The sushi and sashimi combination dish that we got was infinitely better, but I feel like I could've had that same quality of dish elsewhere for cheaper. The one dish that stood out the most was the rock shrimp tempura with a wasabi aioli. It was PHENOMENAL. It wasn't super greasy and the tempura remained crisp the entire time, despite being tossed in the aioli. I would be tempted to go back again for that alone. \n\nIzumi, I really wanted to like you. It sucks living in South Philly because there isn't any sushi down here at all, and going to Vic's isn't always an option. But your food just isn't worth the price. Sorry :/\n\nOh, and as for all those reservations that made the servers tell us about needing the table for 8:30? The restaurant was half-empty when we left at 8:15."
    },
    {
        "id": 77,
        "text": "Very good sushi. Probably the best in the immediate area. But a little pricier than I feel like it should be.  I like it when they set up tables across the street by the fountain on nice days."
    },
    {
        "id": 78,
        "text": "I heard that Izumi was a top sushi joint in Philly so I decided to try it my first time in town. I eat sushi in different cities around the country, and the salmon in my salmon avocado roll was delicious! The quality of the sushi prepared is excellent. I was very impressed with my meal as sushi is usually always the same, but the rolls I ordered were better than the usual. The restaurant is also a BYOB joint so that was also a plus if you drink. I highly recommend this restaurant to any sushi lover!"
    },
    {
        "id": 79,
        "text": "Rock shrimp tempura was fantastic. Nice atmosphere, clean set up and friendly staff. The Izumi roll was a bit sloppy, but every other dish was very tasty. It's also great for outdoor seating during nice weather. I would definitely come back."
    },
    {
        "id": 80,
        "text": "I hope this place is around for a very long time. It's not easy to find excellent sushi in south philly but this place serves it up. Fish is deliciously fresh. Atmosphere is fancy yet casual. The service is excellent and it's a BYOB with no ridiculous corking fee. It's my new local go-to for sushi."
    },
    {
        "id": 81,
        "text": "I'm stupid when it comes to sushi. I know absolutely nothing. I know I LOVE California rolls. That being said i informed the waiter that  our party knew nothing about the menu. He very graciously informed us of the differences between \"sushi, sashimi, and maki\" I ordered the Maki (california roll of course) a friend got a salmon roll, another the avocado roll and my date got the duck special... everything was amazing. The Duck was a special it had a wasabi aoli (sp?) and sat on a bed of different types of mushrooms. The Mushrooms alone were to die for. Everything tasted very fresh and our waiter went above and beyond to make sure we were comfortable. (water and wine refills every few minutes non intrusive and very gracious)\n\nwe sat until closing while finishing our wine and they did not for even a moment make us feel rushed. Upon leaving we apologized for making him wait and his statement was \"think nothing of it it was our pleasure to have you\" .. wow.. hospitality? in PHILLY!? I'm hooked. \n\nThe bill was $45 for 4 people all having their own meals (which were very shareable!) Overall a great bargain, and i'm told they have lunch specials that are very filling for $10-15/ person! \n\nI will definitely return and tell everyone i know. Izumi is an AWESOME find!"
    },
    {
        "id": 82,
        "text": "We ordered take-out sushi & found that the portions were not equal to a usual sushi place and their specialty rolls were extremely small, especially for the price. Overall it was mediocre & didn't leave us wanting to return again. We were hoping for more with all the positive reviews, but were disappointed."
    },
    {
        "id": 83,
        "text": "Overpriced.  Miso Soup - $5.  Green Tea - $5 Single small piece of nigiri - $3-3.50.  Standard small rolls - $6 or more.  Fancy Special (but still not very big) roll - $12 or more.\n\nI am surprised more people here are not outraged by the prices.  I'm accustomed to spending about $20 on a couple rolls, edamame/miso and feeling full and satisfied.  When I ordered $30 of food and still didn't think it would be enough, I commented that this would probably be some fantastic fish.  The Miso was tasty, but the $5 price has to be a scam.  My 2 pieces of nigiri were about the smallest cuts of fish I've ever had.  They tasted great, but nothing special.  The Izumi roll was also great, but small and $12.\n\nThe vegetable rolls are very small, but more reasonably priced ($4).  My boyfriend ate for much cheaper than I did.\n\nMy guess is that this place is great for bringing a bottle of wine and spending a lot of money on the entrees and more experimental dishes/specials.  (There are a LOT of specials)  I assume that they hike the prices because there are no other sushi options within walking distance.  It seems to me though that more reasonable prices on standard sushi fare (nigiri, sashimi, rolls) would influence more people like me (with a smaller budget) to use their weekly sushi allotment there.  On a lovely Tuesday night at 7, there were several tables open inside and outside.  The food was just fine, but I've eaten similar quality for cheaper.  If the prices were more reasonable I would say 4 stars."
    },
    {
        "id": 84,
        "text": "I want to give this restaurant a 3 and a half star but i'll add the other half because i like the atmosphere (it's small and cozy inside) and during the warm weather you can sit outside. \n\nI've tried the sashimi salad it was good. For small plates i had:\nIzumi Sashimi Sampler - from what i remembered i think there were one or two things i didn't like, it was gooey and chewy so i couldn't eat it. Yellowtail Tartar and White Tuna Tataki was delish! Buta Kakuni was different but good. Yellow Tail Miso ni is okay. And there was one dish i can't remember what it was i think it was a seafood pancake or something, it was nasty. It didn't look appetizing but i had to give it a try and never again."
    },
    {
        "id": 85,
        "text": "I have been to Izumi SEVERAL times its just one of those places that whenever we get the opportunity to get out last minute we always just choose Izumi...well if i wrote this review before my last visit it would of absolutely got 5 stars...i will get to why in a second...\n\nThe food is phenomenal really...SOo Sooo good every time we have ever gone we usually just order all the specialty rolls they usually would give us a deal like $10 off or something well the last time we went with friends apparently they have added to their specialty menu but we still assumed we would get some sort of deal for ordering all of them as well as a couple of appetizers...well we didn't which is our fault for not asking....Anyway every single roll was amazing we also ordered the rock shrimp tempura which was fabulous and a scallop appetizers which was just Ok ....They also have really good dessert!\n\nThe food is amazing the ambiance is awesome! In the summer they have outdoor seating around the fountain which makes for a great night. The only fault of this restaurant is that they seem to have large turnover in wait staff and their prices are a bit steep however I am sure we will be there very soon because i really love this place:-)\n\nNOTE IT IS A BYOB..."
    },
    {
        "id": 86,
        "text": "Spicy Tuna and Rainbow Roll = PERFECTION\nService is perfect. I am in love with this place. BYOB. I can't wait to go back."
    },
    {
        "id": 87,
        "text": "I like you, Izumi, and here's why: aside from the fact that you have some really excellent, fresh fish, you also employ staff that can talk in great detail about the flavors of each dish.  As if that wasn't enough to win me over, you guys can cook up some amazing hot appetizers and entrees.  \n\nWe stopped here during Restaurant Week and naturally, the place was packed.  The host was so polite, though, and told us that while he wouldn't be able to provide us with a reservation for that night, he'd really love for us to come back and give them a chance.  I truly appreciated the fact that he didn't just brush us off because they were busy, so we knew we had to take him up on his word.  Izumi really delivered on their promise.  Their standard rolls were very enjoyable and guess what?  They whipped up some truly creative dishes for us to try (the tuna wasabi salsa was awesome). \n\nWithout question, this is a new favorite sushi restaurant of mine.  I absolutely can't wait to come back and try more."
    },
    {
        "id": 88,
        "text": "I like it here a lot, it has become a weekly ritual!  Good sushi, service and ambiance all within walking distance, what else could I ask for.  It can get a little pricey though when compared to other Japanese/sushi places.  But I have not been disappointed in anything that I have ordered over a course of the past six months.  This place is becoming an asset to the neighborhood."
    },
    {
        "id": 89,
        "text": "We were harrassed by the chef when we decided to leave before being seated. It wouldn't have been a big deal. We just didn't want to sit by the door. He seemed to think that made us entitled and mean, and came outside to tell us as much as we were heading off."
    },
    {
        "id": 90,
        "text": "This place continues to be the best sushi in town. The service is still great. The outside seating and the open windows make it great for summer. And they have added a waiter with quite the singing voice!"
    },
    {
        "id": 91,
        "text": "The food might be AMAZING, but I have no way of knowing.  We were seated and then promptly ignored.  We were seated in the square, so we expected that service might be a little slower, but it was ridiculous.  A VIP couple came and sat down after us.  Our server spent several minutes telling them about the menu, giving them all kinds of attention, and didn't even acknowledge us.  It looked like it might have been the owner/friend of the owner at the next table over and I get it, sometimes you give more attention to a friend of the restaurant, but after waiting for about 15 minutes with nothing but water and our menus in front of us, we decided that it was enough and decided to find somewhere else to eat."
    },
    {
        "id": 92,
        "text": "Since sushi options in Philly are usually limited to center city, it was interesting to see Yelp spit out Izumi in the middle of South Philly. The location is sort of out of place, but we decided to give Izumi a try. They have outdoor seating near open archways, which makes me think of Europe or something. The food is expensive, if not too expensive. I mean, I know sushi/Japanese places tend to carry higher-than-average prices, but really some of the prices were just ridiculous. Five dollars for tea? No thank you. Nine for a roll that usually costs me five? It was off-putting for sure, but the food itself was very good. I think next time I'll skip sushi in S. Philly and just take the journey to center city, where my options are wider and considerably cheaper, without sacrificing quality, and gaining more atmosphere. If you live in S. Philly, go ahead and try it out, but nothing worth traveling down there for."
    },
    {
        "id": 93,
        "text": "I've been here at least 6 times now and can gladly say, they are deserving of all 5 stars! Unfortunately, we didn't get Ben as our server, but the new guy did a very good job. The food here is great and always consistent. The chef has great presentations and there's always a special of the day. I would highly recommend the sashimi appetizer, such a wonderful presentation, the pairing of flavors, well done! Also, be sure to have the catapillar roll, it's awesome too!"
    },
    {
        "id": 94,
        "text": "Rolled in with the girlfriend and a bottle of white on a Tuesday night at 6:30 to an empty place (only 1 other table occupied). The place was soon full much to my suprise and delight (great to see E. Passyunk supporting itself). Service was good, the fish and dessert were good and I enjoyed the atmosphere. I plan to return for my next sushi craving."
    },
    {
        "id": 95,
        "text": "Izumi never fails! The rolls are creative and delicious. The staff is knowledgeable and organized. If you haven't tried Izumi, put it on your list. The rock shrimp tempura are a must and any of the specialty rolls. My husband loves the generous sashimi. And because it's a BYO, you can enjoy more sushi!"
    },
    {
        "id": 96,
        "text": "One of my favorite sushi spots. The outdoor seating is perfect for a dinner date or even for a family outing. The rolls and entrees are equally amazing."
    },
    {
        "id": 97,
        "text": "The food here is delicious.  Try the daily specials.  Love that it's BYOB.  I thought that this place was pretty expensive as far as sushi goes.  Service was quick and attentive."
    },
    {
        "id": 98,
        "text": "The sashimi sampler was delicious - very fresh , enjoyed the catepillar roll-  disappointed with the spicy tunal roll- no taste- nothing spicy about it.   Nice to have a variety in this part of the city"
    },
    {
        "id": 99,
        "text": "I didn't want to write a review of this place only because I liked it so much that I wanted to keep it to myself. And that should tell how how nice it is.\n\nFood 4.5/5\n\nIt's truly the freshest sushi I've ever had. I've been to plenty sushi places and unfortunately I have only recently started reviewing. But this is the best. I ordered a few different rolls and some sashimi. The salmon, when available, is melt in your mouth. The fatty tuna is nothing short of delicate. The portions could be bigger but otherwise it's great. \n\nService 5/5\nNo complaints. Not one. The server I had was very knowledgeable and professional. He accommodated any requests I made. \n\nAmbience 5/5\nHere's why I like this place. It's clean, it's small and most importantly it's intimate. I don't think this place could seat more than 30 people. But there's a value in that. The sushi chefs prepare your meal a mere few feet from you. If you plan on taking your significant other on a date, this is the place. You'll be knocking boots in no time. \n\nFinal thoughts, I need to go back. The only issue you can have is if you have a big party, they physically can't accommodate more than 6 in one table. It's BYO so bring your best (I'd recommend good quality sake!) and the only issue, if any, is that parking is a real pain in South Philly. But that's not a reflection of this place. Go!"
    },
    {
        "id": 100,
        "text": "I like going here because the food is pretty good and the prices aren't at bad. I don't usually have a bad time except for the one time a few weeks ago. My friend and I decided to go to Izumi for dinner. They seated us outside and it was nice to sit outside on a summer evening. \n\nOur waiter was named Andy and we felt as if the whole time he ignored us for a bunch of blondes next to us. He quickly rattled through the specials, not really giving us time to decide and would disappear for longer than necessary. But he was always at the other table's beck and all.  Probably because they were a bunch of nice blonde girls. He brought them out free samples and generally just chatted them up. There was even a few times that he sat down at their table to chat some more. \n\nWhen we asked for the check, Andy casually threw the check on our table and walked away. \n\nThe food here is great but beware of some bad employees. But it's fine if you're a pretty young thing."
    },
    {
        "id": 101,
        "text": "Philadelphia doesn't have a huge, reputable, sushi scene. So when looking for a decent sushi spot, I wanted something that was fairly close and doesn't close at 10pm. I walk by this place most days and have been curious about it for some time. Finally got around to checking it out this weekend and I'm so glad I did. At first, you think it'll be hella expensive due to its ambiance and decore, but I'd say it's on par with everyones favorite Passyunk Ave mexican spot - Cantina Los Cabalitos - if not cheaper. \n\nThe service was absolute perfection from the moment my friends and I got in there. Our wine (it is BYOB) was opened for us as soon as we sat down and the waiter was attentive, thorough, and respective. \n\nThe food was delicious and they have a little bit for everyone - vegetarians/vegans included. \n\nHighly recommended. 10/10 would go back again - but only after payday."
    },
    {
        "id": 102,
        "text": "They nailed it. I took Gina here for her birthday sushi craving on a quiet Sunday night and will certainly be back. We ordered a few small things, all of which were delightfully presented, delicious, and unique.\n\nThe seaweed salad had four different varieties and some interesting flavor combinations. The sashimi sampler was similarly amazing, five items with subtle sauces and unique flavors. Now the pork belly with conche... earth shattering. Taste it yourself!\n\nOh, and all that, with green tea, rang in at under $40. East Passyunk strikes again"
    },
    {
        "id": 103,
        "text": "Definitely  a let down.  The sushi here just isnt good.  None of it.  The beef negimaki was essentially overcooked steak-ums around over cooked scallions.  The only redeeming factor here is that it is a BYOB.  \n\nIf you dont trust my judgment and decide to check it out, make sure they dont seat you next to the open flames of the kitchen.   I roasted for an hour and even the a/c vent on me could not cool me down."
    },
    {
        "id": 104,
        "text": "Ok, so...my husband and I have been here 5 times now. We LOVE this place. The service is amazing, the staff is AWESOME, super friendly but not disingenuous. The atmosphere is cozy but not cramped by any means. It's very clean.\n\n The quality of the fish is off the charts. We highly recommend whatever they have as a special(the specials change, I'm guessing due to whatever is freshest on the market/available). \nI seriously can't say enough good things about this place. \n\nHIGHLY HIGHLY HIGHLY RECOMMEND DINING AT IZUMI."
    },
    {
        "id": 105,
        "text": "Izumi is pretty new so I'm going to give it the benefit of the doubt.  I had my usual sushi pieces, which tasted fine, albeit small.  I also had the Izumi Maki and the Spicy Tuna Maki, and like Marisa said, they're ok.  \n\nThe Miso soup is in fact very good.  You get a good sized bowl too.  While the sushi is mediocre, it does the job for when I don't want to venture out to Blue Fin or Sagami.  Also, I'm a big fan of East Passyunk in general, so that's a bonus.  \n\nI'll most likely give it another shot, even if only because it's close to home."
    },
    {
        "id": 106,
        "text": "I had heard from a friend that this place was overpriced and not too good so I'd stayed away, but I had a craving and it was close so I said, what the heck, I'll give it a try. I was very, very impressed. \n\nI know Japanese food and Sushi quite well. I have lots of experience with it and have eaten some of the best examples of it. This place, while not the best ever, was very serviceable. What it isn't is creative but that's ok with me. The dishes are quite traditional (Negimaki, Rock Shrimp Tempora, etc.) but very well made.\n\nI started with the Miso and it was served perfectly (piping hot like the tea was). Next up was the Negimaki which was served with a nice pickled side that added some nice flavor to the perfectly seared meat. \n\nI then tried the O-Toro (not the best, but quite good) and had some Nigiri and a few maki rolls. The rolls weren't very impressively prepared (knive/presentation wise) but tasted great. The Nigiri however was made of very high quality fish and I was pleasantly surprised since this wasn't a very traditional looking sushi place. \n\nOverall, I really liked this place. I will go again as long as it's consistent."
    },
    {
        "id": 107,
        "text": "My husband and I love this place. Everything we get is fantastic. Their outdoor seating is wonderful, window seating inside is romantic, and bar seating is great for watching fresh prep. Staff is beyond friendly, fish is fresh and tasty, and it's in a great neighborhood. Our go-to date stop."
    },
    {
        "id": 108,
        "text": "I wrote a fairly detailed post about my experience, and I am not sure what happened to it.  Long story short,  Izumi does it right.  I have been here a few times, and they have done a fantastic job.\n\nFor Valentine's Day they offered a four-course menu, or full menu.  It's always nice to have the option. The kitchen was extremely quick, getting our first course out in a few minutes. The staff is friendly and pays attention to detail.\n\nThe scallop entree is a particular favorite of mine, and I would suggest it to anyone who enjoys shellfish. It's perfectly seared and the flavor is great.  I will be back soon!"
    },
    {
        "id": 109,
        "text": "The staff at Izumi is friendly, polite, and very knowledgable about the menu. The ambience is intimate and the sushi bar is very comfortable to sit at and enjoy a meal. The menu is diverse with many options for specialty rolls, sushi, sashimi, as well as other dishes. The fish is fresh and very flavorful. Sushi dinners can be expensive so we love that Izumi is BYO.\n\nThe only complaint, is both times I visited Izumi the sushi rolls were not properly rolled and most of the pieces fell apart while we were eating them. This was a big disappointment since it makes enjoying the flavors difficult. I mentioned the issue to the server and he was receptive to the criticism but it is not encouraging that we experienced the same problem during our second visit.\n\nOverall, if you are in the Passyunk Square area or looking for a new BYO sushi restaurant, Izumi is definitely worth a try."
    },
    {
        "id": 110,
        "text": "food was tasty...but seriously...portions were way too small for the price...and service was mediocre...not going back..."
    },
    {
        "id": 111,
        "text": "Tied for first as my favorite sushi place I've been to in the city (the other is Zento).\n\nI really can't find anything to complain about here.  I think it differs from others in that their focus doesn't seem to be on the rolls, but on inventive dishes like a tuna salsa, avocado/salmon thing that was on special, live uni...plus a whole bunch of inventive sashimi options.  Also different in that things seem particularly delicate here - created with surgeon-like precision, yet with flavors that punch you (gently) in the mouth.  Really impressive stuff.\n\nAlso of note here is service - our waitress was PUMPED to talk to us about the menu, how things were prepared, etc.  Obviously loved working there and sharing knowledge with us, even shared some sangria since we didn't have time to stop and get any alcohol beforehand.  All-around a great quick meal."
    },
    {
        "id": 112,
        "text": "I am a die-hard fan of Sagami.. and found that most sushi restaurants in Philly & NJ pale in comparison. Well.. I finally experienced Izumi.  WOW!  The spicy tuna roll was out of this world.  The soft shell crab roll was one of the best that I have ever had between here and Asia.  The salmon avocado roll was so flavorful. As far as peices..the fatty tuna was the stuff you dream about.  Hand's down.  When making comparisons.. the Eal, Yellow Tail, & Tamago will always be the BEST at Sagami.  The service was a bit slow at Izumi, and I had to ask the waiter on more then one occasion for  refill of my water.  At most authentic Japanese restaurants, service is exceptional, and water is re-filled every time you put down your glass.  Over all, this was a such a pleasant surprise.. and I am excited that I live so close to such amazing sushi! Bring a bottle.. and enjoy!"
    },
    {
        "id": 113,
        "text": "I posted a not so great review about izumi a long time ago and I have to take it back because I love Izumi and eat there almost every 1.5 months."
    },
    {
        "id": 114,
        "text": "We recently moved to the area and had a terrific date night there recently. We split an order of edamame I ordered the cucumber sushi and my boyfriend and I split the Passyunk Avenue Roll Shrimp Tempura with spicy Crabmeat  which was fantastic! It's BYOB so that's always a plus, and the service was quick and friendly. We made a reservation ahead of time, which I always recommend. What's great too is Capogiro is right around the corner and can provide a great dessert to end the evening. I'm excited to try this place for lunch and their Bento box soon! \n\nPros: \n-delicious food, reasonably priced\n-the restaurant had a nice feeling to it\n-service was pretty excellent\n\nCons:\n-restaurant is a little small so unless you're planning ahead, I'd advise groups with  more than 4 guests to call a day in advanced to arrange a table situation."
    },
    {
        "id": 115,
        "text": "The sushi here is only so-so, nothing to rave on and on, or write home about BUT we ordered specialty rolls, not simple basic ones. (We make simple rolls at home that are as good if not better sorry that was me humble tagging, I'm just so proud that we've nailed at home sushi.) However, the service was spot on and friendly, the miso was excellent with a depth and richness of flavor uncommon in your typical, average or homemade miso. The sashimi sampler was really something else, with the most delicious, carefully chosen accompanying sauces for each fish, and the fish was fresh. But sushi is just average, pricing is average leaning a little steep. BYOB, nice atmosphere and outdoor seating push this place from two to three stars but just barely. Meh.\n\nOlder white gentleman in the kitchen (open to view) doing entrees, which sounded really good, and apps and two young-looking Asian dudes doing sushi. One of the guys was like constantly on his phone and when we tried to ask him a question we couldn't hear a word he said. Whatever, no big. Would go back and try an entree or two rather than the specialty rolls we had."
    },
    {
        "id": 116,
        "text": "i AM definatley going to say that I never had a bad time eating here. The service was nothing but friendly and the setting was very nice and clean.  I do think for what theyre doing there the food is great as well. Also their desserts are really good as well. Green Tea Creme Brulee? yum."
    },
    {
        "id": 117,
        "text": "I finally got a chance to try this place out, i was pleasantly surprised. I had the sushi & sashimi sampler it was amazing!  So good in fact I had to order another spicy tuna roll.  Everything was fresh and the service was great.  I definitely found a good alternative to blue fin.  Major plus is that it is only 2 blocks from my house ;-).  Hopefully they will stick around its a good change from all the mexican places that have popped up over the past few years.\nThey are only open for dinner atm (opens at 4pm) but they assured me that they will start doing lunch in a few months as well.\n\nDefinitely a must try if you in the area."
    },
    {
        "id": 118,
        "text": "One of my fav sushi places in the city. Cozy and intimate place. Service is great- waiters always know their sushi! They usually have some amazing specials- I had some special eel once that they marinated three days in three different sauce...it was worth it! The sushi is always fresh and delicious. Some are a bit pricey, but worth it. Love this place."
    },
    {
        "id": 119,
        "text": "BYOB Sushi Spot with Outside seating, rolls were good but I feel like they lacked variety. All the rolls had similar ingredients, the same fish was often repeated in many rolls, not very special. They were also overpriced."
    },
    {
        "id": 120,
        "text": "Nice BYOB on the square. They will bring you a standing ice bucket for wine/beer. Servers are very friendly and the fish is always really fresh. A little pricey but the freshness is worth it. They also offer outdoor seating in spring and summer."
    },
    {
        "id": 121,
        "text": "This place has pros and cons.  Overall, there is nothing terribly wrong with it, but my personal preference would be to go somewhere else for my sushi fix.\n\nPRO:\n- Trendy, nicely decorated\n- Good date spot\n- Service is good.  Host got me a last minute reservation on Valentine's Day.  Score.\n- BYOB\n- The food is tasty and you can see it being prepared as much of the prep/cooking space is open to the restaurant\n- Get the rock shrimp tempura.  I don't care if you like shrimp or not.\n\nCON:\n- Restaurant is small.  You should make a reservation if you're trying to go at a peak time.\n- Others around us were audibly being offered some kind of prix fixe menu, and we were not.  This may have been because we were 2 women, but for one thing, this is East Passyunk, and for another, regardless of whether we were a couple or not, we should have been offered the same as the other diners.\n- Portions are small.  You will still be hungry after 2 sushi rolls.\n- Prices.  They aren't outrageous, but they aren't cheap, either.  There is definitely sushi of the same caliber available elsewhere for less money.\n\nOverall, I liked what I ordered and I can't say I had a bad time.  I may return to have the rock shrimp tempura again, and try something from the large plates portion of the menu.  But if I'm craving serious sushi, this won't be my first choice."
    },
    {
        "id": 122,
        "text": "Delicious!\n\nThe only negative was that they wanted us to sit outside on a very hot and humid night because that is what Open table defaults too for the reservation. After that, Izumi was great from start to finish! We started with the house salad and shared 4 rolls, everything was delicious! Kobe Beef roll was the best because it was so unique. Ended the night with their donuts, perfect! And its BYOB! We will be back again!"
    },
    {
        "id": 123,
        "text": "I have been trying to get here for the longest. Tonight was the night i came with my kids and friend. Parking was a little hectic but we found one. Izumi is small but very cozy and retro. This is the best spot to view East Passyunk Ave and enjoy the warm weather.\n\nThis place is byob. They have specials for dinner. Ben gave us very detailed descriptions of their specials and menu items. We had the octopus salad; this is a must try. Edamame purée, mango, octopus (tender) and some other stuff... Excellent flavor combination. Izumi salad was also very different in flavor but very good. Really enjoyed the fresh unique taste of the salad. The sashimi sampler was great. Small portions that packed a fresh and deli stable taste to your palates. Great starters.\n\nOur main course: Catipillar, dragon and salmon avocado roll. Absolutely amazing. Who knew that this small place would have such fresh and tasty sushi. We added more rolls to our order. Philly roll, spicy salmon and spider roll. The philly roll we asked for regular salmon instead of salmon. I use to hate the philly roll but I am now a new fan of the philly roll. Loved-it... The spicy salmon roll was good but the spider roll was so fresh and hot... I don't even know how to describe the taste. The freshness of the sea and the crispy warm soft shell crab deep fried in tempura was oh so yummy.\n\nI am such a foodie that this place will become my new regular spot. Love love love. This is the place you must find parking and eat at. The best South Philly sushi spot! Our waiter Ben was also very attentive and knowledgable about the different courses we ordered tonight. Dude, you rock in the service area. Fast, polite, knowledgable and welcoming. Thank you for the great service."
    },
    {
        "id": 124,
        "text": "BYOB cool but portions are tiny AF. Ordered a spicy tuna and I hated how they put the tempura crunchies in there as filler without specifying it on the menu. It wreaked havoc on my gut. Probably for the price better off going to Doma or Double Knot"
    },
    {
        "id": 125,
        "text": "Best classic and delictable sushi ever. Clean, delicious, and almost orgasmic. Best sushi in Philadelphia."
    },
    {
        "id": 126,
        "text": "This restaurant advertises itself as being handicap accessible and it is not. Really unfun to make reservations with a person in a wheelchair, take the trouble to drive and park in the busy Passyunk area on a Friday evening, and then find this out. If you're not going to adjust your restaurant so that it can be accessible for everybody, then at least take the time to convey accurate information about it."
    },
    {
        "id": 127,
        "text": "I guess for Philly this is a choice but having lived elsewhere the prices are high unless you plan on eating before or afterward.  The food we had was very good but my main complaint was the server who rattled off all the specials and the prices (seemed weird- it isn't a diner, AKA \"Flo\") and when one of our dishes arrived he announced, \"here is your $25 platter\".....never had that happen..anywhere.  Also when he picked up signed check he opened it up at the table and said oh that's ok.  Good food weird service!  I think they need to up the quantity or lower the prices and get some ideas from Japanese Sushi places in other cities.  If you want a taste it's ok but for dinner not my choice. First time-last time!  I'll keep on going to Center City (15th Street)-that's a real Japanese restaurant."
    },
    {
        "id": 128,
        "text": "Nice sushi spot in the middle of all the restaurants in south Philly. I came here with my gf for date night and we both enjoyed our time. We ordered sashimi platter and a bunch of different special rolls. Everything was very fresh and we enjoyed it with our wine. Huge + is the cheap valet parking outside. I will def come here again. Great sushi byob!"
    },
    {
        "id": 129,
        "text": "Finally went here after eating everywhere else in the neighborhood several times.  My gut was always telling me that this place was nothing special, probably mostly because nobody ever talks about it in my foodie circles. \n\nSo we went and it was pretty disappointing.  The portions were small, the flavors ok, and the prices too high.  In addition to some sushi selections and other special rolls we tried a ramen/pork belly special and it was so-so.  The pork belly was tender and delicious but the broth and noodles were not worth more than a couple bucks (the bowl was $16).  \n\nGood place for people stuck in South Philly with a bottle of wine craving sushi; mediocre place for someone with options outside of the neighborhood.  I'm surprised this place gets four stars average on yelp; could be because I was there on a bad night, and/or Philly has low standards for Japanese restaurants....."
    },
    {
        "id": 130,
        "text": "I really want to love Izumi, but there are too many sushi places that do it better.\n\nFirst, the food. It's good. Not amazing, but good. We ordered: rock shrimp tempura (it was tasty but a bit too much mayo), two rolls (they were all right), seaweed salad, and a special. The seaweed salad is different than the typical; this is a mix of four different types of seaweed in a light dressing. It was lovely, but the portion was tiny. The special was Live Uni, which came to us as slabs of sea urchin meat on top of the hollowed out sea urchin. A+ for presentation, and it was divine.\n\nNow on to the service. We had two servers and a water-pourer in a half-empty restaurant. Despite this, we had to repeatedly ask for water and never got the soda that Boyfriend ordered even though it showed up on the bill. Since we were at the bar and had limited space, I would have expected to receive one part of our meal at a time, but they had no issue piling everything up in front of us all in oversized serving pieces. Awkward.\n\nThe thing that bugged me the most was the uni. It was described as being 5 pieces. We got 4 pieces. So we flagged down one of our many waitstaff, and as we started to ask the question, one of the cooks behind the counter chimed in to inform us that they cut 4 on purpose but it's the same amount of meat. If you're going to charge $25, be honest with what you're going to serve. Could be 4 or 5 depending on how it's cut, but you're getting a whole urchin. Heck, they could have just said, \"We are going to take a sea urchin and gut it and serve it to you, and it is going to look all spiky and totally bad ass.\"\n\nOverall, my experience was OK, and I would go back if I were feeling too lazy to walk somewhere else. I would give some of the other rolls a fair shake."
    },
    {
        "id": 131,
        "text": "Another delicious BYOB sushi spot in Philly. This time, in the heart of E Passyunk Ave. \n\nI got a specialty roll and a classic shrimp tempura. I was super pleased. Also started with the edamame, duh!\n\nI love the trendy and upscale aesthetic. The service was prompt and our waiter was friendly as hell. \n\nA great place to grab dinner and bop across the street to Stateside for a drink, which is exactly what we did!!!"
    },
    {
        "id": 132,
        "text": "I love you Izuuumi, oh yes I do\nI love you Izzzummi, and I'll be true\nWhen you're not near me, I'm blue\nOh Izzuuummi, I love you.\n\n\nI feel like that's all she wrote, ladies and gents, a nice little mashup of my favourite sushi restaurant and my favourite musical. \n\nUnfortch for me, Izumi is far away. Well it's past Washington, past Broad, and those are usually my limits...Only because I like to walk everywhere and it's so cold these days...\n\nBut once you are there, you are in heaven. \n\nThey have real seaweed salad, which is amazing because nobody has it anymore. There is no comparison of the green stringy overdressed \"seaweed salad\" to this luscious taste of the ocean. \n\nMy favourite is their rock shrimp tempura. Hands down one of my happiest foods in the city. I guess they fry it with a lining of wasabi and the shrimp is just so sweet and oh wow, I just love it.\n\n\nAll of the maki is good. I love the remy roll, which is just like a burst of amazing in your mouth. I could probably order 6 orders and eat all of them. \n\nI suggest you try it out for yourself. It's a byo and the rush is pretty intense on the weekends and even some weeknights, so make a reservation, head on down past Washington and Broad, and maybe stop for a drink at The Dolphin when you are done."
    },
    {
        "id": 133,
        "text": "Izumi is a great gem on the Avenue. I had walked by here many times, and was always greeted with a friendly smile by a server on the sidewalk. One crisp summer night, I finally decided to try it. Boy, I'm glad I did!\n\nThere were lots of daily specials, but a wide variety on the regular menu, too. I chose the seaweed salad and a salmon roll. The seaweed came in a rainbow of colors (not the plain, dark green type I was accustomed to) - each with their own flavor. The salmon in the roll was so fresh, it simply melted in my mouth! My friends were each very happy with the meals they chose as well. \n\nWe did dine on the sidewalk by the fountain, which is somewhat of a \"see - and be seen\" location. We didn't feel rushed by the servers at all, and really enjoyed a relaxing evening here. One last tip -- be sure to BYO!"
    },
    {
        "id": 134,
        "text": "So I don't usually do reviews but I had to say something about this place. Is it the most authentic Japanese food you'll have? Probably not. But the food is definitely great. And the atmosphere and service as well. All top notch.\n\nI ordered the sashimi sampler to start with. In addition the extremely well presented plate, the server also made sure to introduce each fish on the plate. This is the attention to detail a fine restaurant should have. On that note though, don't be fooled by the $$ rating. This is an expensive place even by the standards of Japanese food.definitely great for special occasions.\n\nI also had the braised beef short ribs and monster roll they had on special (this was a very hungry night). The beef was extremely tender and served over mashed potatoes with a side of tempura onion rings. It was very rich in flavor, which I liked but mat be overpowering to some.\n\nThe monster roll was good too, although I will say that I would not order a specialty roll here again because these kinds of rolls can be found in any old sushi joint. I'd say the fresh sashimi is definitely the main attraction here.\n\nFinally though, I do have one small gripe that keeps me from giving this place 5 stars. It's the disposable wooden chopsticks they place at each table. For the price they are charging and the atmosphere of the restaurant, I would expect a proper set of lacquered chopsticks. This isn't a hole in the wall takeout joint. It's a small detail, but really, I shouldn't have to check for splinters on chopsticks at such a fancy restaurant."
    },
    {
        "id": 135,
        "text": "Great BYO addition to south Philly. \n\nVery yummy, above average sushi. \n\nI had eel & cucumber, Spicy Tuna, Gyoza, & Seaweed Salad. All were excellent and reasonably priced."
    },
    {
        "id": 136,
        "text": "Philadelphia isn't exactly known as a \"sushi city,\" but lately the city of brotherly love has been improving on that. Yes, we've had Morimoto for a while, and yes - it's very, very good... usually. Izumi is on par with some of the better sushi I've had in New York and Los Angeles. The staff is incredibly knowledgeable and helpful, great for small or large parties - I've been here with both, and wonderful location."
    },
    {
        "id": 137,
        "text": "Just dined here last night after wanting to go for so long and I was severely underwhelmed. Everything that came out was significantly worse than before. I didn't even eat my sushi because it was awful and was like chewing rubber. Really, really disappointing considering I live in the neighborhood and was hoping for a new sushi spot but I guess I'll keep looking!"
    },
    {
        "id": 138,
        "text": "Not bad at all. Japanese food is hard to mess up for me. I always tend to like it. The dinner I had here was pretty darn good. We sat outside and it was pretty to look across the street at the fountain. We ordered seaweed salad and a bunch of rolls. Tasty. I felt the place a little boring that's all. Maybe the bar has been set too high now and I'm spoiled by all these really fun places popping up left and right. The waitress was a plain Jane and overall I was just satisfied and not thrilled."
    },
    {
        "id": 139,
        "text": "WORST CUSTOMER SERVICE EVER!!!!\nI am a big sushi fan! I've been everywhere from Zento to Raw to Sagami to Kisso. When I heard about this place, I thought I just had to try it. At first I did some research on Yelp and found good reviews on it. So I decided, why not make reservations for 3? I invited two other people for a new sushi restaurant experience that night. I was really excited as I skimmed through the menu before i arrived...\n\nAs soon as we arrived to the restaurant, we were approached in a kindly matter. Five minutes into enjoying the decor and menu, we were approached by a waiter asking us if we could move to another table fit for 3 people so that they can make room for a table of 6. We did not mind it at first but as they got our \"second\" table ready, they had to move the table sideways so that it looked and felt awkward compared to the rest of the restaurant. To make matters worse, they gave us a stool instead of a real chair to sit on. \n\nThe main waiter was extremely rude in moving our seats around twice! I have never felt so embarrassed and awkward at a restaurant before than that night. Furthermore, I told my friends that this place had good reviews. Boy was I wrong and disappointed with the service. I hope they are nicer to their future customers. I would not go back again!"
    },
    {
        "id": 140,
        "text": "The food at Izumi was excellent. We ordered the pork gyoza, cucumber rolls, and short ribs with Okinawan potatoes. Each dish was shareable and delicious, and the food arrived quickly after ordering.\n\nWe didn't experience the best service. When we arrived on a Friday night without a reservation, we were told the wait would be 20-25 minutes. We weren't able to wait inside, so we grabbed a bench near the Singing Fountain outside the restaurant. After waiting for 40 minutes and getting chilly, we popped our heads in to check and were told it'd be 5-10 more minutes. Twenty minutes later, they called with seats for us at the bar. It took 5-10 minutes to get a glass of water, and perhaps 10 more minutes for a server to take our order. \n\nAll told, we waited an hour to be seated and 15-20 minutes to order. Without a reservation, I can understand an hour wait time--but not when we were told it'd be just 20-25 minutes. I'd recommend making a reservation if you plan to visit Izumi, as their waitstaff wasn't able to provide us with an accurate estimate of how long it would take for a table to be ready."
    },
    {
        "id": 141,
        "text": "Although it is a new restaurant on the ave. I have to say that the food here is amazing. The maki sushi here is amazing. You can tell that the fish they use is fresh and unlike other places, they are very innovative to which they even created their own rolls (Passyunk Avenue Roll!). You won't be disappointed. The view is especially nice too since it is right across from the Fountain."
    },
    {
        "id": 142,
        "text": "4.5 stars...but I'll round up to 5, because everything at this restaurant was so on point.  Izumi is what dining out is *supposed* to be - quality ingredients that you wouldn't necessarily throw together at home, moderately priced for the quality/quantity of food, comfortable and classy, friendly service, outdoor seating, BYOB.\n\nWe went for an omakase on a Tuesday night.  4 courses for $35.  Let me start off by saying that the portions were HUGE.  After the two appetizers I could barely finish my entree.  So yes, $35 was well worth it.  \n\nThe sashimi was so(ooooooooo) good.  Yellowtail, tuna, salmon, fluke and mackerel (which was marinated in a special house sauce) - each piece was better than the next.  I can't wait to go back and order some of my favorite rolls a la carte.\n\nAlso of note was the dessert: a rasberry white chocolate bread pudding with a scoop of white chocolate gelato on top.  The gelato stopped me in my tracks - I was not expecting it to be that good.   \n\nThe chefs have a wonderfully diverse repetoire, from italian-style fluke carpacio in ginger oil to seared tuna over a bed of good ol' American corn.  I will be back asap to try their other offerings."
    },
    {
        "id": 143,
        "text": "Favorite sushi in the city so far. We tried a really fancy place in Center City for restaurant week, too, but we keep coming back to Izumi. Lovely service and atmosphere, and I like the BYOB and the option to sit outside. And the food is fresh and well-seasoned. An East Passyunk staple."
    },
    {
        "id": 144,
        "text": "I went to Izumi for a birthday dinner and I can definitively say that the service was top notch.  We had a large group (which is not always an easy task for a server) and everything went very smoothly, even considering that our server had to cross the street to get to us!  We were able to reserve an outdoor table in the triangle with the fountain across the street from the restaurant, which was quite enjoyable.\n\nAs far as the sushi, I stuck to the basics.  The fish was fresh, tasty, and reasonably priced.  (Plus, it's a BYO, so you can save there!)  My only suggestion would be for more details on the menu.  Our server was more than willing to answer our questions though and I now know what kampyo is.  (It is a tasty and somewhat sweet vegetable, btw...)"
    },
    {
        "id": 145,
        "text": "Incredible! I was in search of a good japanese restaurant in philly and my coworker recommended this place. The sushi is so fresh! The toro., omg, you have to get the toro! It just melts in your mouth. Amazing! The service was excellent. The waiter was very nice and smiled the whole time, from beginning to end. Made my visit there very comfortable. I didn't feel rushed and the waiter knew the answers to all my questions and even gave great details on their specials. I would definitely come back again.. and again.. and again."
    },
    {
        "id": 146,
        "text": "This place left me wanting more - not that the fish was spectacular, but because the portions were not proportional to the price and the fish was average.  Ordered chirashi (layer of sushi rice is about 1 grain thick), and two rolls (one of which was a specialty roll). \n\nOn the plus side, the place is a BYOB and the atmosphere is adorable. The waiter we had was also super informative and attentive."
    },
    {
        "id": 147,
        "text": "I wish more people knew about Izumi because the sushi/sashimi here is excellent. The chef has created a traditional Japanese menu but also creates some amazing specials with ingredients that you cannot find elsewhere in Philadelphia. Do not hesitate to try something new or ask the chef to recommend something. The fish is fresh and they even have fresh wasabi! I especially love the tuna sashimi  topped with jalepeno and drizzled with sauce the chef made especially for me a few times. Also LOVED the spicy tuna don. Here the food is simple but the focus is on craft and ingredients.  I have been here on many occasions and have never been disappointed."
    },
    {
        "id": 148,
        "text": "I really like this place. The food was great. The service was supar, and the staff were very friendly. I went there with my 2 year old daughter. We didn't want anything too fancy because we had a child, so we just wanted something quick and good. The place is in a cute upcoming neighborhood. They were really nice to my daughter and gave her cute little sushi rolls for her size. She had so much fun there. They also gave us some extra stuff for free. Other than that, we had a great time as a family and will be there again to visit."
    },
    {
        "id": 149,
        "text": "One of the few places in philly that serves fresh uni! Other than that, I'm not a fan of the other items on their menu. The fish is okay but the rice is not seasoned well and sometimes even tastes stale."
    },
    {
        "id": 150,
        "text": "I was hoping to try some new kinds of rolls or something exotic, but it is pretty standard when it comes to sushi. I did not try any of the non-sushi dishes, but I can say that some of those sounded interesting. The serice was ok. The waiter forgot my green tea, and we had to ask twice for water. The staff was nice, and the atmoshphere was very nice. We sat at the sushi bar. We went without a resevation on a Saturday night, but they were accoomidating. I liked that it is byob, and I liked they they provded the japanese and english translation for the maki. Over all, not very excited. Nothing new or special about the place."
    },
    {
        "id": 151,
        "text": "I have been 3 times now and the food is really superb.  Very attractive but small space.  Service is good, casual not overly attentive.  But the food is what really shines.  Best and most creative Japanese food in the city.  Last night as every other time I have been we got the Seared Scallop appetizer which I think is the best app I have ever eaten.  Also had the Sashimi sampler which was five pieces of fish with various sauces.  Tasty.  1/2 dozen Japanese oysters were also very good with an intersting smoky sauce.  Wife had a combination of sushi and maki all of which was very good as usual.  I had the halibut with cockles and udon noodles, this was fantastic.  All in all extremely satisfying and pleasant experience every time we go.  Wish I could eat there every night."
    },
    {
        "id": 152,
        "text": "The food was incredible.  Melt in your mouth sushi and short ribs.  Great service and atmosphere."
    },
    {
        "id": 153,
        "text": "Great sushi! The Uni is fantastic if they have it when you're there! The servers are very professional and the chef is very personable and accommodating! We ordered the sushi-sashimi platter and it was fantastic! (Half eaten in the pic sorry)"
    },
    {
        "id": 154,
        "text": "Absolutely delicious....this place is kind of unnoticeable at first, and I sort of wish it were that way still....because i just want to wander in there and inhale the sashimi and sushi and the shrimp tempura.\n\nFor those who want to add a little diversity to their seafood portfolio, there is a mackerel dish that comes with cucumbers and miso paste. AMAZING. I could go Godzilla on this place and eat an entire fishery's worth of fish if prepared by the chefs at Izumi."
    },
    {
        "id": 155,
        "text": "teriyaki duck was friggin' amazing. Eat it!"
    },
    {
        "id": 156,
        "text": "Sat outside last night with a friend and had a wonderful meal.  For the two of us we ordered the edamame, tempura shrimp, scallop with crepe and two rolls.  Everything was delicious.  I was surprised by the large serving of shrimp tempura, we couldn't even finish it. The shrimp were delicious with an amazing sauce over.  The rolls were fresh and delicious.  The service began slow, took about 8 minutes for someone to get us drinks and tell us about specials, but then we had three people checking on us thoroughly the night.  It was a very busy Friday night.  We forgot wine, but were offered complimentary sangria...we had to glasses each, it was delicious.  I will definitely go back."
    },
    {
        "id": 157,
        "text": "not horrible, but also not great. the seaweed salad was awful and unlike the traditional salads you'll find in almost all other sushi places. it tasted like the ocean and not in good way. the portions were small and service was mediocre. i won't rush back."
    },
    {
        "id": 158,
        "text": "this is a terrific spot for sushi. we sat outside and began to sample the sushi/sashimi; we tried sashimi platter (awesome), spicy tuna roll(blah), izumi roll(okay) and caterpillar roll(awesome). everything was fresh and flavorful. reasonable prices and friendly staff. if in the area worth checking out."
    },
    {
        "id": 159,
        "text": "I didn't like this place a little bit. My girlfriend and I sat outside, it was nice out and this restaurant is good for people watching. It was a Wednesday and there were only two other tables. The waiter was nice but service was really, really slow. I don't really understand the four star rating because we spent $65 here on two apps & three sushi rolls and we left hungry. I guess it's priced a couple dollars higher because it's a byob but I didn't even think the sushi rolls were that great? The quality didn't strike me as anything better than standard sushi. There are too many other places on Passyunk to eat here."
    },
    {
        "id": 160,
        "text": "Our experience at Izumi was great! These people pay good attention to details. I couldn't find anything bad about the place, service, their system. My husband and I went to Izumi on a Saturday night with good weather. The place was full. The wait was reasonable, and the way we were treated made us feel welcome.\n\nThe food was excellently prepared, presented and reasonably priced. Overall, a great place. Great service, great looking place, great Japanese food."
    },
    {
        "id": 161,
        "text": "Sushi or Sashimi? These are the questions I ask myself when I decide I want to go to Izumi. My friend and I can never seem to decide between the many delicious options on the menu. Our most recent journey led us to a sashimi fest with their Chirashi and Tekkadon. The selections were a combination of the chef's favorites and some of the staples (salmon and tuna). If you are interested in trying sashimi, these are great options. They are large plates, so you will likely want to share with someone--unless you have an appetite that just won't quit. \n\nBecause we always seem to go when we are at our hungriest, we get the octopus and/or gyozas. The Pork Gyozas are my favorite appetizer they offer. A nice way to prep for the pending meal. \n\nI have made room for dessert the last two visits and they were not disappointing. The first time I couldn't decide and got all three options: chocolate bread pudding with coconut ice cream, creme brûlée, and the coconut rice pudding. When in doubt, get them all! I was less of a gluten with the last visit and only ordered the chocolate bread pudding--just as wonderful as the last time. A filling yet light dessert. \n\nYou won't go wrong with anything on their menu. I have yet to meet an option I didn't love."
    },
    {
        "id": 162,
        "text": "Hands Down, best sushi EVER.... My fiance and I wen to Izumi this past weekend after reading some of the reviews.... Honestly, we already have a favorite sushi restaurant in the city that does not compare to any other place, so we weren't that excited.... Well, we have a new favorite place for sushi.... We had the best dinner ever. They had a 5 course tasting for $45 so we both decided to get that.... Every course was better than the last..... I was so full by the 4th course, that i had to get my dessert wrapped up.... We loved it so much, we already made reservations for this Friday to go again!!! \n\nOnly downfall, when you only have 2 people, it's hard to get a table, they usually make you sit at the counter which isn't bad but I normally prefer a table.... I requested a table for this Friday, hopefully we get one!!"
    },
    {
        "id": 163,
        "text": "Happened to be walking down the street and seeing the place I happened to get a sushi hankering. Heads up it is BYO but there's a bottle bar half a block down so no problems.\n\nI got both the Kobi Beef and Yellowtail rolls both really good. Kobi beef was outstanding. Girl got the salad and enjoyed the snow peas too. Services was friendly, helpful and fast. To quote myself, \"oh we'll be back\"."
    },
    {
        "id": 164,
        "text": "Came here for the sashimi and was blown away by the kitchen entree. Ordered sawara, ika, and saba.   Sawara sashimi was properly made and tasted incredible. I ordered chutoro earlier and the waiter claimed that they do not have it today. Disappointed by the unavailability of chutoro, I decided to order their kitchen special entree instead. \"Grilled Ribeye\" was their special kitchen entree of the day and man, it was one of the greatest ribeye I have had. The meat was cooked to perfection, tangy sauce on top and the asian slaw on side was the bomb! Seems like this place should be renamed closer to their perfection of kitchen cooking. I will definitely refer and come back to this place mainly not because of their sushi, but for their excellent kitchen entrees. \n\n2/17/2016\nComes here for the second time with my gf for our late valentine dinner. I order the exact Ribeye again. After couple bites, my gf loved the ribeye and quoted that \"the ribeye and its sauce is amazing.\" She had been to Bobby Flay's steak houe down in NJ and said that we don't have to travel all the way to Jersey if we can get an amazing ribeye in philly. The salmon carpaccio is also amazing!"
    },
    {
        "id": 165,
        "text": "I am so surprised more people don't know about Izumi.  I think its some of the best sushi in Philadelphia AND BYO to boot!  The ambience is great, especially when its warm and the windows are opened.  This is a must try!"
    },
    {
        "id": 166,
        "text": "Food is incredible \nPrice is average (is all about quality not quantity)\nChefs is friendly \nEnough said.\nWe will comeback for sure"
    },
    {
        "id": 167,
        "text": "This is the BEST sushi in both Philadelphia and the greater Philadelphia area.  \n\nMake sure to BYOB, and choose a seat either outside close to the Singing Fountain, at one of the indoor tables, or at the sushi bar.  The staff is attentive and accomodating, and the atmosphere is soothing with its indoor Asian-inspired decor and fountains.  They have a nice selection of moderately priced sushi as well as more elaborate and creative handrolls as well as tasty appetizers and specials. \n\nMy only complaint is that sometimes the seating indoors feels a little cramped, but that's because it sometimes gets a little crowded, and they are trying to accomodate as many patrons as possible."
    },
    {
        "id": 168,
        "text": "I live a few blocks away from Izumi and over the last three months my wife and I have stopped into Izumi quite a few times.\n\nService is always very good and the sushi is fresh. I recommend the salt water eel or the soft shelled crab tempura with shitake mushrooms is another good choice when they have it.\n\nOutdoor seating during the summer is always a plus and even if you eat inside the ambiance is pretty modern and nice.\n\nOverall, my wife and I have enjoyed quite a few meals here and will continue to do so as long as we are living in South Philly."
    },
    {
        "id": 169,
        "text": "POOR EXPERIENCE/NON-EXISTING SERVICE. We booked a reservation in advance on OpenTable and upon arriving was told my choice of seating was outside (64 degrees and windy) or at the sushi bar. There was an open table and I was told they were holding it for a reservation for 3 (which could have also been seated at the sushi bar.)   I was told a reservation only guarantees 'a seat' not a table and not even necessarily inside - crazy!\n\nAs a result, I do not anticipate returning or giving a favorable recommendation to try dining to this establishment.  With so many other great options in the Passyunk area there's no need to go here-- we dined at Noord close by which was our first choice anyway and it was fabulous!"
    },
    {
        "id": 170,
        "text": "As far as sushi and sashimi go, Izumi is tops. The staff is always super friendly and accommodating. And it's a BYOB, which makes it even better. They almost always have a rock shrimp tempura as a special. The first time I tried this dish, it was graciously comped by the chef because the waitstaff asked us to move tables. Now it the dish a staple, ordered every time I go. It is melt-in-your-mouth good. The tuna sashimi is always incredibly fresh.\n\nThe atmosphere is relaxed and casual. I like dining there in the summer when the windows are open and Passyunk Avenue is bustling. Izumi is consistently very good."
    },
    {
        "id": 171,
        "text": "Based on reviews I was expecting an amazing experience, but I was rather disappointed in the quality of the sushi. First, the restaurant is lying to you about having a \"Kobe beef\" sushi roll. We all know there are only 8 restaurants in the US that actually sell certified Kobe. So, they fact they choose to lie about serving real Kobe beef is disappointing to see. Second, all of the special rolls I tried were just overpowered by sauce that was smothered over the rolls. Waaaay too much. Let the fish shine, no need to hide it drenched in sauce. Lastly, the seaweed salad was downright dreadful. It tasted sour, foul and just dreadful. The doughnut dessert was amazing, but left dissatisfied and disappointed."
    },
    {
        "id": 172,
        "text": "WOW! WOW! WOW!\n\nOn Friday night our BFF and favorite third wheel wanted to know what we were up to. Of course the answer, as it is so many times, was to grab a bite to eat and indulge in a few (almost too many) adult beverages with her--our favorite kind of Friday night.\n\nOriginally we were going to go to one of our regular passyunk avenue hipster bars but at the last minute we decided a lovely outdoor dinner at Izumi would be a nice change of pace (plus I'm a sucker for a BYOB).\n\nWe made a reservation through Opentable.com and headed over with one magnum bottle of red and one sparkly bottle of white (for me). Our reservation was for 9pm and the place was packed. We were a few minutes early so we waited on a bench across the street at the ever-so romantic singing fountain. Because I made my reservation through OT they called me when the table was ready just a few minutes later--a nice touch!\n\nI wish I knew the name of our server so that I could write him a personal thank you card for being so fabulous. He answered all of our questions (mostly mine--I was trying to branch out) and was incredibly thorough with his descriptions of what came with what (he knew his stuff!!).\n\nWe ordered: the Beef & Scallion Negimaki and Gyoza Pork Dumpling (small plates) and the $60 Sushi/Sashimi platter (for them) and the Braised Short Rib Entree (for me). If I had to make a complaint about anything it would be that the small plates and entrees came at the same time--for those of us eating 2 hot dishes (ahem--me) it just made it hard to decide which to eat first. In reality though, we would have been there forever had it been in two separate fires.\n\nI think that we would all agree that the Negimaki and Gyoza were good. Tasty. Maybe not what we were expecting exactly, but good nevertheless. I KNOW we would all agree that our entrees were some of the best food we have eaten in a long, long, lonnnnnng time.\n\nMy short rib. Was. SENSATIONAL. Never have I eaten meat that has been so perfectly braised. It literally melted in my mouth. I am dreaming of it now and salivating. WOW. And the mashed potatoes were out of this world. YUM!\n\nI am not a sushi or sashimi or seafood person....but I know--just based on the silence from the other 2/3 of the table--that they were in raw fish heaven. If I do recall there was a comment about \"delicious spicy tuna\" and I definitely remember some \"Mmmm\"ing over Octopus. Overall I would say they were both impressed.\n\nTotal bill with dessert (which I forgot to mention because we ate it so fast) tax and tip: $140 for 3 people.  Needless to say, we are ALL looking forward to our next dinner at Izumi!"
    },
    {
        "id": 173,
        "text": "BYO.  \n\nDelicious seaweed salad (and totally different than what I've ever had before).  \n\nOutdoor seating.  \n\nApparently the food took a little longer than usual to come out (I hadn't even noticed) and the waitress/hostess(?) apologized for it at the end of the meal.  Very thoughtful.\n\n~$55.00 for 2 (4 maki, 1 gyoza, 1 seaweed salad)."
    },
    {
        "id": 174,
        "text": "You've gotta get the rock shrimp tempura. These shrimp are plump and battered to crispy perfection, which is a wonder since they're practically swimming in an indescribably excellent Asian style glaze sauce that's mildly sweet, super zesty and just gooey enough for you to lick the bowl afterwards."
    },
    {
        "id": 175,
        "text": "Super disappointed in my experience here. I've been wanting to go for a long time and finally made it in early on a Thursday night. It was somewhat busy, the restaurant wasn't packed but there were groups here and there. Unfortunately, the one server was completely overwhelmed and took over 20 minutes to just get us water. \n\nI wish we had just walked out because that was indicative of the rest of the night. We ordered an appetizer and two rolls and everything took longer and longer to arrive. When they did, it was undersized, bland, and hapazardly put together. I mean this sincerely when I say I've had better sushi from Wegmans or Whole Foods."
    },
    {
        "id": 176,
        "text": "Very rarely do sushi restaurants impress because good sushi is simply good fish. Many places try to stand out with creative specialty rolls, but they often try too hard and go overboard. But none of this is the case at Izumi. \n\nWe came in for date night during East Passyunk Restaurant Week, so this review is for that menu. Upon stepping in, there's definitely a very intimate feel with the dim lights, sleek furniture and votive candles. Thankfully, we made a reservation and were seated right away at the bar, which was great because there is zero standing room in this cozy spot (which we overheard someone complain about on the way out). \n\nFor the first course, we chose then crab spring rolls and pork belly starters. The long crab spring rolls were uniquely wrapped in seaweed and then a dough wrapper. They were accompanied by spicy mayo and citrusy avocado sauces. The pork belly was deliciously glazed and flavorful, served atop Japanese risotto that resembled creamy polenta with a couple of sliced mushrooms thrown in. \n\nNext was a sushi sampling that was well-presented and consisted of tuna dressed in a sauce with like zest, a whitefish (I believe) with a black sesame sauce, and salmon with a sweet foam. The first two were delicious and creative without being over-the-top, while I was not a fan of the overly sweet foam on the salmon. We both agreed that the black sesame was our favorite part. \n\nThe third course is a shrimp and asparagus tempura maki roll with lightly seared salmon and wasabi aioli on top. It's not really fancy, but it really exceeded our expectations. The plump shrimp was cooked well, and the asparagus is a nice touch. We were skeptical of the cooked salmon as part of a roll, but it was sooo good! \n\nDessert was a dish of cinnamon sugar donuts and salted caramel dipping sauce. It was kind of an afterthought for me, but it was still good. \n\nThe service was friendly and never too overbearing. We liked watching the steady (and very calm) action at the kitchen. Can't wait to return and try some of their regular menu."
    },
    {
        "id": 177,
        "text": "The sashimi sampler is a must. The fish is very fresh and beautifully presented and perfectly paired with seasonings. Try the special rolls too; I had a spicy tuna with spicy scallop topping and it was fantastic. Dont leave without getting dessert. The chocolate cake covered in coconut gelato is to die for. Quite literally too since it is a heart attack in a pretty package.  Well, just wait for me with an ambulance at the door, then."
    },
    {
        "id": 178,
        "text": "Try the specials! The Kumamoto oysters that tasted just like the one's I had when living there. Also the sashimi was pretty good but I would stay away from the Saba, it's just not the same. The miso soup and quality of rice made up for it.\nThe price is not too expensive about 60-70 for 2, and a great neighborhood is an added bonus."
    },
    {
        "id": 179,
        "text": "Really good sushi but kind of overpriced. There aren't an abundance of great sushi restaurants in Philly so they get away with charging a premium. That being said it is one of the best in Philly."
    },
    {
        "id": 180,
        "text": "Fantastic! Went there Saturday night for the first time and was very impressed. Nice atmosphere and great on a nice fall evening with sliding window for total open air dining. The special appetizer of soft shell crab and shitake mushrooms was killer.\nThe sushi and sashimi was ultra fresh and rolls were creative and delicious. Service was friendly and on target.\nWe will be back."
    },
    {
        "id": 181,
        "text": "I love this place! i can't say I'm a connoisseur of sushi but everything I've eaten at Izumi has been excellent. The quality of their fish is very high. Try the Avocado Tuna, it is as beautiful as it is delicious. The specialty Maki rolls are lovely and the Miso is perfect. Great prices for the quality and the staff is wonderful especially Meli"
    },
    {
        "id": 182,
        "text": "Its closed, permanently!\nWe were very disappointed that yelp didn't indicate this.\nDon't waste your time."
    },
    {
        "id": 183,
        "text": "The sushi is amazing! The service is very welcoming and it's very clean and nicely decorated. Every different thing that I've tried on the menu was banging! I'll be back with my girlfriend very soon!"
    },
    {
        "id": 184,
        "text": "Disappointed. I love live uni and when I saw it on the menu I had to try it out. The uni did not taste fresh and for the price, I felt ripped off. I ate fresh uni many times and the taste was definitely off. I got some negiri as well. They were priced per piece, expensive and tiny. If it was good quality I'll happily pay it but definitely nothing spectacular. I felt like I can have the same quality elsewhere in philly for the same price. Will not go back."
    },
    {
        "id": 185,
        "text": "The sushi reigns supreme but everyone already knows that. I'm just here to say.. Get the $@):$\"/ pork belly (sweet baby Jesus!) and the scallops (perfectly seared) and, if they have them for dessert, the awesome cinnamon sugar donut centers with salted caramel"
    },
    {
        "id": 186,
        "text": "This is probably the worst ramen restaurant I've ever been to. Very disrespectful employees, probably because the managers treat the waitress in a very demoralizing way. Very unprofessional. The food takes forever to come out took 30 minutes to come out with practically no one there."
    },
    {
        "id": 187,
        "text": "I will give Izumi a 3.5. It started off a little rough when we arrived for our 8:15 reservation and were not seating until 8:40 since we did not want to sit outside. Save your indoor seats for those with reservations!\n\nI did enjoy the atmosphere, decor and service. The sushi, while flavorful, is overpriced and in my opinion, the portions are way too small. I have been to other places that are comparable in flavor but are much more generous in portion sizes.\n\nI would go back to Izumi perhaps on a weeknight when it is not jam packed."
    },
    {
        "id": 188,
        "text": "This place has great food all around, but the portions are small and some items overpriced. Everything is fresh and well presented, but the service needs some work which is why I took away a star. I've had great experiences here whenever Ben was my server. Parking is difficult, which is why I'm asking myself why do I come back here...\nOverpriced, no parking, hit & miss service"
    },
    {
        "id": 189,
        "text": "I was super impressed and honestly, a large reason why this gets 4 stars is for the atmosphere alone. Their dedication to Japanese culture was detailed, from the green tea all the way to our awesome entrees. The tea came in a teapot that reminded me of the artisanal ones you may find on the shelf of Rikumo or Omoizakka. I believe it was Sencha tea they poured, but I didn't get confirmation. \n\nMy boyfriend and I got the Gyoza, Ginger Chicken, and Braised Beef Short Ribs to share, and they were all pretty amazing. The gyoza themselves were fine, but the amount of detail in the cucumber garnish really enhanced the flavors! For the entrees, in a perfect world, we would have put the ribs on top of the \"Japanese Risotto\" of the chicken dish and sold it off as our own because the two individually were really good. I felt like there was too much of the whipped potato on the short ribs dish and the chicken didn't pack as much flavor as the ribs did. For dessert, we got the Lychee Creme Brulee, and it had the perfect balance of sweetness without becoming overwhelming.\n\nThe price of this restaurant is a bit steep, but for the quality of the food and the service, it's very hard to be too picky about it."
    },
    {
        "id": 190,
        "text": "I visited Izumi for the first time last week with 4 friends to celebrate Restaurant Week. Let me start off by saying that the food was delicious but the overall Restaurant Week experience there was not. Four out of the five of us opted out of the RW menu as it seemed like we would get more for our money ordering off the everyday menu. That turned out to be true! Our friend who chose to eat off the RW menu paid the most for her meal and had the least amount of food. Not only was the RW menu disappointing but the service was as well. I understand that it is a busy week but more waiters/waitresses should have been working that evening. There were only two waiters on the floor for the entire restaurant (which was packed). As for the food, I shared the large sashimi plate which had an array of different fish(chef's choice), yellowtail canopy, tuna canopy, salmon/avocado roll and the spicy tuna roll. Everything was amazing! Since the service was so slow, we got offered dessert on the house, which we obviously took advantage of. I got the chocolate bread pudding, roasted banana gelato which was okay but the lychee creme brule' was where it was at!!! I should have listened to the waiter and ordered that slice of heaven. The free dessert made our experience a much better one then it would have been. I would 100% go back again but not during Restaurant Week."
    },
    {
        "id": 191,
        "text": "Came here for the sashimi and was blown away by the kitchen entree. Ordered sawara, ika, and saba.   Sawara sashimi was properly made and tasted incredible. I ordered chutoro earlier and the waiter claimed that they do not have it today. Disappointed by the unavailability of chutoro, I decided to order their kitchen special entree instead. \"Grilled Ribeye\" was their special kitchen entree of the day and man, it was one of the greatest ribeye I have had. The meat was cooked to perfection, tangy sauce on top and the asian slaw on side was the bomb! Seems like this place should be renamed closer to their perfection of kitchen cooking. I will definitely refer and come back to this place mainly not because of their sushi, but for their excellent kitchen entrees."
    },
    {
        "id": 192,
        "text": "i've been wanting to try this place so i'm glad i finally got a chance during restaurant week. this place has good quality sushi, but smaller portions than you're probably used to and steeper prices.\n\nwe started out with the pork belly and the spring rolls. both cooked very well, i loved the japanese risotto that was served with the pork belly, it's almost like congee but had a very subtle and rich cheese flavor that i loved. probably my favorite dish of the night\nthen we got some sushi samplers from the chef, they were good, i loved the salmon with the corn salad the best. \nwe then each got a roll to have, the pieces are smaller than i'm used to but i actually like smaller pieces of rolls, as long as it's still big pieces of fish, i don't need that much rice. \n\ni also loved the dipping caramel sauce that came with the donuts at the end, incredible.\n\ni was only annoyed because a couple that came 20 minutes after us that was sitting next to us, ordered all the same things we did and got all their food way before us, we waited about a good 25 minutes after our apps for the entree while the couple next to us got it right away. i brought this to the attention of the waitress as it was obvious she forgot about our orders. \n\nbesides that, the rest of the meal was great and i'd recommend it to others but don't expect to get a bunch of rolls for a low price, this place definitely makes good quality sushi for the price it's worth."
    },
    {
        "id": 193,
        "text": "Had dinner on a friday night with a few friends. All other reviews were correct in that the service was outstanding! Very attentive and nice enough to explain the menu in great detail. We tried a variety of selections. The rock shrimp, edamame and caterpillar roll all which were great. Sashimi was fresh. The beef nagami appetizer was the only item I would steer clear of. Very dry and chewy. We had the donuts for desert which were amazing!"
    },
    {
        "id": 194,
        "text": "100th review, baby!\n\nI gave a lot of thought to what i wanted to review for my 100th, and I decided to pick a place that would be a treat, and one that I had been meaning to try for a while. I eventually decided Izumi was all of those things, plus sushi is E's favourite and I've been craving it lately. When I called first they were on vacation for a week, so i waited patiently for them to reopen and booked a table for the next night.\n\nWe considered asking for an omakase but I decided I wasn't hungry enough for it. We each selected a few rolls, a few types of sushi, and miso soup plus a special crab spring roll to start. The spring roll was delicious, packed with tons of crab and perfectly seasoned. I almost wished it had a little more wrapper- there was one thin layer holding it all together and I wished for a bit more of a crunch on the outside, but I'm gluten-intolerant and shouldn't have eaten it anyways, so my tummy was glad there wasn't much wrapper. The miso soup was overly salty to the point I couldn't eat it, and I love salty so that says something. Minus one point for screwing this up and charging $5 for it.\n\nI couldn't have been more pleased with my selections. The yellowtail scallion roll, always my favourite, was perfect. The salmon roll, however, was even better! The salmon was melt-in-your mouth and tasted so fresh, plus there was a lot of it. No rice-heavy rolls here. I also indulged in a few pieces of E's Tuna on Top roll, shrimp tempura inside with spicy tune and crunchies on top. I'm not usually huge on spicy sushi, the mayo/mushy aspect of it usually grosses me out, but this was delicious. I also got an order of yellowtail sushi after being told that the fatty tuna was only available on the weekends. The fish was phenomenal, and I thought it was perfectly portioned to be one bite, but there was wasabi hiding under the fish and I hate wasabi. Ruined it a bit for me, but once I was already halfway through chewing.\n\nE also got a rainbow roll and two orders of sushi and ate every bit. We were stuffed to the brim by the end of this feast! The bill was $74 including tax, which isn't half bad for such good quality sushi. Service was attentive (although I had to ask for water refills) and decor was very nice. It did get a bit loud, since the space is pretty tiny. We'll be back, but I think I like Zama just a bit better."
    },
    {
        "id": 195,
        "text": "Phenomenal service and the food was top quality! Would recommend to anyone local or outside of Philly!! We got the caterpillar, izumi, and spider roll plus the beef short ribs and tempura shrimp. Lots of variety in food and love the ambiance of the indoor and outdoor seating."
    },
    {
        "id": 196,
        "text": "Defiantly a cute spot on Passyunk with indoor/outdoor seating, dog friendly, ALSO byob (which is pretty convenient w Bottle Co across the street) however, the menu was severely lacking. Yes they have staples like dragon rolls and their own specialty rolls like the monster roll we got, but they're sooo overpriced. Any roll that isn't a California or spicy tuna (also over at $8/$9) is $14/$15. Maybe that's to make up for no liquor sales or the higher rent in that area but they're nothing special for that price point. \nThe servers were nice, both the host and waiter were polite and answered questions and checked in on our table several times. \nFood came out relatively quickly after we ordered them. \nI definitely reccomend ordering their specials if they have have them so you can have a somewhat unique experience. Otherwise any sushi takeout would be able to give you what Izumi has to offer on their menu (edamame, sad sashimi pieces, and I had to order off-menu Bc I wanted hand rolls and they didn't make them) but they were accomodating none the less."
    },
    {
        "id": 197,
        "text": "Ambiance is great and the food is tasty. I like the creativity of the rolls. I am giving them 3 stars because our whole group got sick the day after our dinner there on NYE."
    },
    {
        "id": 198,
        "text": "One of my favorite sushi places in the Philly metro. As others have noted, portion size is a bit small and service can be slow, but you really should be here for the food. It is also BYOB, and is a fun experience to go with a small group of friends here. Have been her a good number of times, and can recommend the sushi plates and many of the maki rolls (this is the place to go for fancy rolls IMO, along with Morimoto and Zama). Probably one special maki with a traditional maki or an appetizer is enough for a meal. Not best idea to come here for hot entrees, but this is really a sushi place mostly.\n\nIt is in a tough area for parking (all of E. Passyunk can be tough), and the restaurant can be somewhat loud as it is small with hard floors/walls.\n\nRecommended Items:\n\n\nSoup: Miso ($50)\n\nSmall Plates: Izumi Sashimi Sampler ($12), Rock Shrimp Tempura ($12), Yellowtail Tartare ($10), Snapper Tataki ($14),  Seared Scallop ($10), Buta Kakuni (pork belly-$10)\n\nSushi & Sashimi (a la carte): Toro (fatty tuna-$6), Uni (Sea urchin-$4.50), White Tuna ($3), Sawara (Spanish mackerel-$2.75), Unagi (fresh water eel-$3), Maguro (tuna-$3.50)\n\nMaki (traditional rolls): Spicy Tuna ($7), Tuna ($6), Eel ($6)\n\nSpecial Maki: Izumi Roll ($13), Paradiso Roll ($15), Remy Roll ($15), Passyunk Avenue Roll ($15), Yellowtail Canopy ($16-my favorite)\n\nLarge Plates: Sushi ($25), Sashimi ($25), Sushi & Sashimi ($25-$50 for two for all of these), Ginger Chicken ($20), Chirashi ($22).\n\nDesserts are pretty good, as I think (could be wrong on this) they own Paradiso as well and get the desserts from there (Modern Italian restaurant)."
    },
    {
        "id": 199,
        "text": "Wow!  When one block in Philly gets both a Capogiro and a fancy sushi place, you know that the real estate is getting pricey.\n\nI went to check out East Passayunk after NYTimes did the article about the 'hood.  \n\nThe sashimi platter was the star of my dinner.  It was inventive and the delicate flavors were brought out by clever sauces.  I was too hungry to make more notes- but the lightly charred calamari was dreamlike.\n\nOutdoor seating near the fountain makes this a picturesque place.  \n\nI'm keeping an eye on this neighborhood.  I sense many new, interesting developments."
    },
    {
        "id": 200,
        "text": "I will NEVER come back here again. The food was good but the service was horrible. First we had to wait 30 minutes for our reservation because they had \"people at our table who come here often so we can't kick them out\". They told us to wait at Paradiso until our table was ready. We were not going to walk in the snow to another restaurant so we told them we would sit at a vacant table until ours was ready. Then at dinner, the waiter had no clue who ordered what, continually asking us what didn't come out and who ordered what. Everything came out bit by bit. Then to top it all off, the owner/chef came out at the end of the meal upset with us because we were complaining about the service. He said \"I heard you saying you weren't coming back after tonight so why I should do anything to for you\". He obviously doesn't care about keeping any customers. Don't come to Izumi!!"
    },
    {
        "id": 201,
        "text": "the 4 stars was for the following:\n\n1. Sea urchin (uni).\n2. You can bring your own alcohol.\n3.  I didn't about 2. So the execute chef gave me some of his personal Sake.\n4. The Latina waitress was a babe lol\n5. The ambiance."
    },
    {
        "id": 202,
        "text": "My friend and I have been wanting to go on a date here for the longest time after seeing that we could sit next to the fountain. We finally went tonight but couldn't sit by the fountain because of some event but that's okay, we still got to sit outside.\n\nOur waiter Joe was really friendly and we had a nice conversation with him about cameras and his tattoos.\n\nThe sushi was pretty good and the price was pretty much right for sushi. It was definitely one of the better sushi places around here.\n\nWe are planning on making this our new \"usual\" date place. =)"
    },
    {
        "id": 203,
        "text": "I have been to Izumi several times, most of which I'd say were decent because of the ambiance and the fact that it's the only sushi place in south Philadelphia. I had reservations for Friday night, unexpectedly we were seated at the sushi counter because they were full, not what I expected with a reservation. I was then given a dirty wine glass which was also disappointing. Finally we received a menu and then I remembered how small their menu is, a place like Doma or Sakura has a much more extensive menu. When the sushi actually arrived it was decent, not great, just decent. I really would like some competition in the area because Izumi is decent for passyunk but definitely not a great sushi restaurant as compared to most others in Philadelphia."
    },
    {
        "id": 204,
        "text": "This is our go to local sushi place for non-takeout sushi. They always have fun rolls on special and being a byob is always a plus."
    },
    {
        "id": 205,
        "text": "Really enjoy it here. A little twist on classic sushi and the Udon with Pork Belly is awesome! It's a bit on the small side so definitely make a reservation and not great for bigger parties."
    },
    {
        "id": 206,
        "text": "Top notch atmosphere and service for my weeknight dinner.  The intimate dining room was blissfully uncrowded, and the server was very attentive.\n\nIt's a little pricey, so I absolutely love that this BYOB accepts credit cards.\n\nFood was also excellent and promptly served, so it was easy to add on.  Our server gave us a helpful run down of each item on our sushi and sashimi samplers and recommendations for how to best enjoy them.\n\nThe tuna canopy roll was out of this world delicious, crunchy and spicy!"
    },
    {
        "id": 207,
        "text": "ate at izumi for the first time last night.\nmmmm.\n\npluses and minuses\n\n1)big bowls of miso served correctly!+\nand perfect savory.\ni know i'm a know it all. but it annoys me when i go to japanese food and they ruin it by killing off the miso first thing! miso is alive like bacteria in yogurt or like yeast. if you boil it, it dies...and destroys the beneficial healing properties it has. if your miso is still alive- it moves, you can see the \"cloud\" rolling in on itself!\n\n2) light crunchy textured citrusy seaweed salad. not the kinda slimy -almost sweet - drenched in sesame - version your used to. (+)total bonus\n\n3)no edamame???! no agadashi dofu (- -) : ( \n\n4) no sake (-) thumbs down for that.\nbut thumbs up to you if you have the planning and foresight to purchase your own bottle beforehand and bring it byo style. \nit was sunday and we decided last minute to eat there, so we went dry.\n\n4) but not too dry... thanks to large green glasses of iced tea!\nstrong green cold and refreshing.+\n\n5) the music was kinda corn ball. like asian fusion lounge 1995.(-)\n\n6) but the view of p'unk ave, the people watching, the pretty interior and the nice breezy openness of the space made up for it.+\n\n7) the sushi, sashimi and maki were all superior.\nsimple clean and handsome. + i liked the fact that they stuck to the basics and didn't have too many wacky rolls like \" the surfer on acid roll\" with ham and cheese and tempura fried whatevers. +\n\n8) ++++ for great service.\n\ni think that's 10+ vs. 4-\ni'll totally be back."
    },
    {
        "id": 208,
        "text": "Nice BYOB sushi spot in south philly. Small, cozy place with plenty of parking options around the area. Service was prompt and the food was decent. The entrees were on the pricier side but nicely done. The sushi & sashimi entree was average. The scollops were very good."
    },
    {
        "id": 209,
        "text": "Service was excellent. Good ambiance. Their rock shrimp is amazing. Negatives were that we had to wait a bit for our table and the sushi platter is mostly sashimi with very few rolls (would have preferred a higher ratio of rolls to sashimi). Great location/close to other bars to grab a drink before or after. Also love the fact that its BYO."
    },
    {
        "id": 210,
        "text": "Yum, sperm sac on special, right from Japan. We passed on that.  Amazingly detailed explanations of the specials. Good humored staff. The quality was good but the portion sizes were ridiculously small. The rolls varied in size, some of the more expensive specialty ones being smaller. The duck confit and foie gras dumplings were flavorful but kind of muddy consistency. Unfortunately over rated. Our bill was over $80 for three people and we pretty much chalked it up to an appetizer course."
    },
    {
        "id": 211,
        "text": "I dont know what the other people are talking about, this place is as good as or maybe even better than Sagami (plus no tolls). \nI went with three other people and two bottles of wine (Its BYOB). \nWe ordered about 20 pieces of sushi and sashimi, plus miso, seaweed salad, a few appetizers and an entree, I believe. \nThe Sashimi Sampler was so fabulous! The lime tofu sauce with the tuna and the octopus (or squid, cant remember) was so delicious. Miso was a hit. Salad was ok. Beef Negamaki and its accompanying side was yummy. The Live Scallop app was superb. \nAfter two bottles and the first round of food, we wanted more. \nWe ran out for two more bottles of wine and reordered the sashimi sampler and few other favorites and added on the Paridisio Roll, and it was spectacular!! \nAll in all, in was wonderful and our faux-Japanese server was adorable. \nToo expensive to go every week, but we will definitely be back, within the month"
    },
    {
        "id": 212,
        "text": "The food and service were fantastic. I woke up thinking about eating more sashimi.\n\nHeading back soon!"
    },
    {
        "id": 213,
        "text": "Fresh ordered sushi sitting on the counter for 15 minutes before it gets to the table makes it NOT so fresh. The server barely checked on my table as we're low on dopamine, our glasses are less than half filled, and our impatience level rose. We stared in torture at the sushi we ordered just sitting so deliciously on the counter. You would think that such a small restaurant such as this would be easy to maintain, but apparently it wasn't for these servers and they weren't even packed. Ha!\n\nBefore our drool almost hit the table, we finally got our sushi...*hallelujah*\n\n**drumroll**\n\nThe sushi rolls were nothing spectacular. *womp*womp* If you ask me, they were bland. It tasted like spaghetti with no sauce. Incomplete. I had to soak it in soy sauce & wasabi to taste anything at all.\n\nLet's just say I wouldn't come back here again. It's pricey and not worth it."
    },
    {
        "id": 214,
        "text": "Fine sushi, nice setting, reasonably priced.\n\nI recently dined here with some friends.  We got a table outside, which puts you very much in a see and be seen spot, so seat yourself accordingly.\n\nIt's BYOB, but we did not, womp womp.  Will have to remember that for next time.\n\nThe three basic maki rolls I got had plenty of fish in them, which was nice, and tasted fine, though not particularly memorable.  Perhaps I should have tried some of the special rolls for that.  There was a disappointing dearth of veggie makis; a well-made veggie tempura roll on the menu would have been nice.\n\nService was friendly and attentive.  Our water glasses were regularly filled without asking.  \n\nThe decor is dark-wood modern-ish with nice place settings and their chopsticks are the better kind, in case that matters to you."
    },
    {
        "id": 215,
        "text": "I've had takeout from Izumi a couple times now and I really love it. The food is always packaged very nicely and everything tastes great. I love that they label the sushi on the clear lid so you know which rolls are which! The gyoza are huge, delicious and come with an awesome cucumber salad. Probably my favorite gyoza in the city. I've still never dined in but I would love to do that sooner than later!"
    },
    {
        "id": 216,
        "text": "Favorite sushi joint in the city! Cool atmosphere- definitely a great date night spot or a fun place to go with a group of friends. BYOB too! Their sushi is so fresh and their chef does an amazing job of putting flavors together. They have some different types of sushi rolls which I like because it keeps it interesting and different from most traditional sushi restaurants."
    },
    {
        "id": 217,
        "text": "Izumi is a Japanese/Sushi restaurant in the Passyunk Square neighborhood.  It's not large, and can get a bit tight, but it's worth it.  They have a sushi bar ringed with high-top chairs, as well as tables.  The menu is both hot and cold, so there's plenty of options for non-sushi folks.  The sushi is the standout, however, with very fresh ingredients, and expert preparations.  We enjoyed a variety of nigiri and sushi rolls, as well as a few hot appetizers.  Everything was very good, no issues at all.  Reservations are suggested during peak times, as the wait can be lengthy."
    },
    {
        "id": 218,
        "text": "This place is as good as everyone says, but with a few minor problems.\n\nFirst the good!\n\nThe stars of what I ordered where the rock shrimp tempura and the house salad with ginger dressing.  The tempura has to be the best I've ever tasted... Not too heavy or oily, and they glazed it with something sweet as a finish. They practically melted in my mouth! And the homemade ginger dressing on the salad was great, as was the addition of avocado to mixed field greens. Unexpected in a Japanese restaurant.  If sushi is your love, three people at my table ordered the caterpillar roll, and they all raved about it!  And for dessert, make sure you get what they call the un-doughnuts.  A play on munchkins with a salted caramel sauce. Delicious!\n\nService was outstanding and very attentive. They were able to answer questions, offer recommendations, and made sure to check in regularly.\n\nA couple of Meh moments...One was the coconut Gelato for dessert. Two of my friends ordered it, and all they got was a micro scoop.  We did complain, and they took it off the bill. Also, my cucumber maki was unmemorable. I have had much better Maki at hole in the wall, cheaper places."
    },
    {
        "id": 219,
        "text": "Great food!! A bit on the pricey side, but we had the sampler twice in one sitting because it was so delicate and fresh. Geniusly put together. Also had some of the classic sushi, which was super fresh. Sushi is sushi so I can't really go into depth with it lol. \n\nJust a side note : However!!! the guy who was working take out or entrees (tall, white gentleman) wasn't practicing sanitation very well. The kitchen is open and I saw him use his bare hands to swipe his nose a few times and then touched food in the raw right after, fixing the plate. \n\nOverall, great BYOB place for a date! Or just a random outing. Place is super clean (besides that ^) and delicious. Some of the best sushi I've had. Definitely get the sampler!!!"
    },
    {
        "id": 220,
        "text": "So Last Night was my first time at izumi , i have heard all great things about it before. But living on the other side of town i usually do not head to south philly  to eat . but let me tell you something this was by far the best dinner i have had in a really long time. i mean everything was just so fantastic. I heard it was a sushi place which normally i steer away . but there is so  much more then that , i had never had a steak cook so perfectly before and yes i know philly is know so its steak houses, but this just doesn't compare , especially with that sauce that comes with it. the whole time the whole table couldn't stop saying wow this is so yummy! and it also helped that our waiter was super friendly and nice. his name was sun, he was so patient and explained the meals just right! so thank you izumi for giving me such a great dining experiance i will be back!!!!"
    },
    {
        "id": 221,
        "text": "Not great. Not terrible. Needs work. The high top tables are really uncomfortable.  They could also the cleaned. The beverage choices are limited. The food was better-than-average, but not worth a repeat visit. The desserts TERRIBLE.  It did not help that the chef really looked irritated, like he did not want to be there.  And the music was like a really trashy gay disco in Scranton.  It is another reminder of how disappointing Philadelphia is."
    },
    {
        "id": 222,
        "text": "They were a little pricier than what I'm used to and on the cozy side, but, were great.\n\nI went here for dinner with a group of 7 other people last night  before heading out for the night and the service was still quick and courteous. Very good food. I decided on the miso soup while the majority of my party got sushi or the ginger chicken along with edamame. Everybody was satisfied with their meal, though.\n\nBill came to about $90, which, is about $12-something a head . \n\nThe bottle service for BYOB was also on point. \n\nWould definitely come back."
    },
    {
        "id": 223,
        "text": "I'm not a big fan of ell and sea urchin, but what we had was really good.\nPork dumplings with jalepeno and cucumber relish were great. Rock shrimp tempura was hot and light, not heavy and gooey like you get at some other places that attempt tempua.\nLobster tempura was a large plate with sweet lobster and tons of tempura veggies with a cone of white rice. Not sure who has room for the rice once you eat the tempura portion. Baby Back ribs were as good as I've had for a long time. Sweet, fall off the bone tender, and will go back for and order more if I have a taste for ribs.\nBYO, major credit cards and very friendly servers.\nAnother hit on Passyunk."
    },
    {
        "id": 224,
        "text": "I used to love coming to this place, however my last experience was terrible. They list on open table that they comp valet parking across the street. The valet guy has no clue about this. After our meal we asked how we get this comped and the owner and head chef said that they do not comp and that it shouldnt be on their website. He basically said we were lying.\n\nWe let it go until he comes back and says..yes you are right it is on the website. When asked if he would comp....he replies NO this was a mistake. The owner is ignorant. The food is OK, but extremly overpriced. I also wouldn't give this guy my business again."
    },
    {
        "id": 225,
        "text": "Thank you Izumi for being a wonderful restaurant in Philadlephia not that far from where I'm moving.\n\nI was also there for the Omakase on a Tuesday evening.  I agree with Hayley's review saying that it was a good portion of food for the price.\n\nI thought the duck they made was something spectacular.  It was cooked three ways!  I remember having a piece and thinking \"this is too complex of a flavor for only one cooking method.\"  They didn't tell us exactly how they made it other than it was (1) rendered, (2) seared, (3) roasted.  I would have gladly accepted just one of these.  To do all that to the duck and still have it medium rare and as tender as it tasted was so great.  I can't even rememeber the side.  I know it was great, but my mind keeps running back to that duck and the one fleeting piece I had of it.\n\nSuper great service and a very nice decor.  Such a great little spot for sushi."
    },
    {
        "id": 226,
        "text": "It's a very quaint little BYOB- I would say good for date night or a small group. The menu selection is extremely limited and the portions are pretty small in comparison to other sushi restaurants we've loved. Two key takeaways ...if you make your reservation on OpenTable later in the evening, be sure to call and find out what time the kitchen closes. Their website seems to be down and their OpenTable profile is not accurate. We made reservations for 9:30 p.m. and immediately felt rushed after arriving as we were told the kitchen was closing at 10:00 p.m. We ordered quickly, and since we were there for our anniversary, the server did bring us a complimentary dessert with a candle, which was extremely thoughtful. What was surprising, and disappointing to hear, the table beside us just finishing their dinner had expressed interest in dessert and the server responded \"Sorry, the kitchen is now closed\" since it was exactly 10:00 p.m. I find that pretty unprofessional on management's part to turn down customers already dining. Additionally, they should not allow reservations past a certain time to be made in order for customers not to feel rushed once they arrive. \nThe food and presentation were good, but the overall experience and value were  pretty disappointing and not ones that would have us rushing back to this particular restaurant. \nAlso- parking is extremely difficult. Their google page mentions valet, however, there was no valet option, only street parking. You might want to give yourself an additional 20-30 minutes on a weekend to find street parking or a parking garage less than a mile walking distance."
    }
]