[
    {
        "id": 1,
        "text": "First time ordering here, pad thai was a bit dry but still good. They packed a lot of beef into the beef pad thai which is rare. Beef was nice and soft and not chewy. Chicken wing nice and crispy and Seafood salad was flavorful. Came on time and nicely packaged. would order from here again."
    },
    {
        "id": 2,
        "text": "CLOSED! DO NOT ORDER! Ordered food one week, took 90 minutes to show up. Ordered food this week online (thanks Yelp!), and it turns out Asian Star has closed. Not picking up their phone, food never showed."
    },
    {
        "id": 3,
        "text": "This is a GREAT new place that JUST opened up in the same location as an old crappy Chinese take-out place. The interior has been completely renovated with comfortable seating and a great atmosphere. The food is some of the best in the area, and it's great to have a nice new place to go out for dinner. I've had a couple Chinese dishes and a variety of rolls and everything has been great. Their wonton soup is outstanding! After frequenting this establishment a few times the owner, Jay, introduced himself to me. Now when I go in, I let Jay surprise me with a roll of his choice, and they're always delicious! He even can make my favorites from other sushi restaurants that I enjoy. This is my new go-to place for all my Asian favorites!"
    },
    {
        "id": 4,
        "text": "Great new restaurant in our neighborhood serving Chinese, Japanese  and Thai cuisine!  My husband and I went with friends Saturday night to try it out. Great food,  very nice portion size,  reasonably priced. It's BYOB which we love!  Newly decorated, clean and a  friendly staff. They also gave us a complimentary dessert which the 4 of us shared and loved.  So happy to have an eat-in restaurant like this near us. (also does take out). Definitely will be back soon!"
    },
    {
        "id": 5,
        "text": "This joint started out great but within a couple months their quality dropped. They also stopped serving sushi, which was half their menu and 90% the reason I was frequenting this establishment to begin with. I should have updated this review months ago, but I had forgotten about it since I stopped ordering when they decided not to sell what I liked anymore! The last few times I drove by it looked like they had closed down, but I haven't tried calling to check. In a market that's already flooded with mediocre Chinese take out, most of these new places don't last very long."
    },
    {
        "id": 6,
        "text": "Good food. Yes they stopped serving sushi which was dissapointing,  but their Chinese options are still great and best I've had local to us. My only major criticism is that they do not have consistent hours. We tried numerous occasions to order dinner on weeknights like 6-7:00 but no one is around to answer because they randomly close."
    }
]