[
    {
        "id": 1,
        "text": "My husband and I went here on a Friday evening. A woman cut right in front of us as we walked up to the hostess stand and got her party of four promptly seated. We then walked up to the hostess. They had six tables open as well as people finishing their meals at several other tables. Yet they insisted they could only seat us outside (it was a torrential downpour with thunder and lightning) or at the sushi bar. When we asked about how long it would be to wait for a table they first said about 30 minutes which we agreed to (despite there being 6 open tables) yet then a moment later the manager came over and said it was not possible to wait for a table.\n\nWhile I can not comment on the quality of food I can say their service is absolutely horrendous. I can not fathom why it was impossible to seat us at a table despite the 6 open tables or allow us to wait for one yet we could sit out in the storm or at the bar. I will not be returning here."
    },
    {
        "id": 2,
        "text": "Armed with a LivingSocial deal, we came by for dinner before heading to the Avenue of the Arts just 1 block away.  Don't judge the quality of the sushi by it's slightly sketchy looking website or less-than-sleek store sign - the sushi is great.\n\nWe got a variety of standard rolls, which had generous portions of fresh fish.  The Reverse Maki (rice on the outside) tend to have more fish than the Hoso Maki (seaweed on the outside), so opt for the former. The Salmon/Avocado was particularly good, although the Yellowtail/Avocado and the Spicy Tuna were also solid choices.  \n\nI'll be back to try one of the sushi entrees!"
    },
    {
        "id": 3,
        "text": "I live downtown but have been making the trip to Makiman in the Northeast because the sushi is fresh and delicious and reasonably priced compared to every other place downtown, so you can imagine my excitement when I heard they were opening a spot in the city.  \n\nI love going here on Mondays for the all you can eat sushi.  It's a great deal and you definitely leave feeling like you got your money's worth.  Their rolls are also to die for.  The yellow stallion and ne viking are two of my favorites.  \n\nIf you're looking for great sushi at a reasonable price with great service I would definitely stop in here!"
    },
    {
        "id": 4,
        "text": "Tried this place for the first time on a Saturday for a late lunch/early dinner. \n\nLOVE LOVE LOVE the low carb Naruto Roll, but it only comes with 5 pieces :( .... I would adding more healthy rolls wrapped in cucumber and soy paper like this to the menu. The Sashimi prices are a little high...\n\nAll in all we loved the mix of Japanese/ Korean food and the service, although the choice in music wasn't up to par."
    },
    {
        "id": 5,
        "text": "sushi was great, service was great and best of all it is BYOB.  They have a lot of specialty rolls including the regular rolls."
    },
    {
        "id": 6,
        "text": "This is possibly my favorite sushi place in Philly. The ambiance isn't awesome, but the service is attentive, and the food is great. They have a bunch of interesting/creative rolls, and the fish is fresh and tasty. Plus the rolls are pretty large."
    },
    {
        "id": 7,
        "text": "I dig totally dig this place!  This place has TONS of custom hand rolls and everyone I've tried was delicious! \n\nIf you like it raw is their motto, and yes I do like it raw!  Their fresh fish (sashimi) is delicious!  They have great cuts of fish, they have additional items on their menu if you're willing to try something different.  This place is a combo of Japanese and Korean dishes so they provide great options.\n\nI normally get take-out here which is always ready when they promise.  My casual go to sushi place."
    },
    {
        "id": 8,
        "text": "One of my go-to places for fresh sashimi. I have had quite a few things here and they have consistently been good. I usually get a sashimi deluxe but have tried their fusion rolls (the naruto, spider, caterpillar and rainbow rolls) and shared a 66piece sushi boat with 5 other people, which was enough for everyone."
    },
    {
        "id": 9,
        "text": "I tried Makiman for lunch and with a living social deal. We had the hirame carpaccio for appetizer (I think) and it was amazing. We had a few rolls for our entree and they were all very good. They are all of high quality, fresh, tasty AND huge. It was not the best I've had but I would definitely come back again. However, without the deal, it can be quite pricey."
    },
    {
        "id": 10,
        "text": "this is my go-to place for sushi since i'm not in one of those sugar baby/sugar daddy relationships that all the rage right now per the news stations. $$ sushi is alright by me since $$$$ sushi is a pipe dream. \n\ni LOVE the mm naruto roll and the 911 roll. #1 because both are really delicious but #2 because they are absolutely gluten-free.  how do i know this? because the waitress i had the very first night i came here made sure to point out all the gluten free rolls after she spoke to the chef. \n\nthe mm naruto roll is the perfect roll for summer. it's a bunch of raw fish wrapped in cucumber. (if you're trying to remain gluten-free, ask them to hold the crabstick.) the 911 roll is baked salmon and cucumber with some sort of peppery kick. i'm salivating a la pavlov's dog just thinking about these rolls.\n\none star off for lack of consistency in roll size.  at dine-in one night, my mm naruto and 911 rolls were really tiny, but on one of my take-out orders, the same rolls were enormous. \n\nbonus: outdoor seating for when the weather is nice."
    },
    {
        "id": 11,
        "text": "We love makiman. It's one of the best low key sushi places in center city. Their food is always fresh and it's nice it's a BYO if you want to get out for a bit. Their delivery is always on time and they're priced well."
    },
    {
        "id": 12,
        "text": "Went there after watched the show. Place was half empty and we saw people were eating Korean bi bim bop in hot stone bowl. Maybe it's Korean owned sushi place or at least be of chefs is Korean. \nI got sashimi salad and roll without rice. Sashimi salad was sooooooooo spicy even to me. I can handle some spicy but this was just pure go chu jang ( Korean red chilly pepper paste) I had to take out most of sauces and ate them. Sashimi was ok but their sauce already burned my tongue couldn't taste anything."
    },
    {
        "id": 13,
        "text": "I came here Saturday night with the wifey with high hopes of finding our go to sushi place. Unfortunately I think our search must continue. \n\nA deeper dive into the rating would show two and a half stars for the sushi and four and a half stars for the service. \n\nWe each got the Sixers Roll and a regular roll. As much as I appreciate the roll names referencing my favorite past time (being a long suffering Philadelphia sports junkie) the flavor was just a bit underwhelming. The regular roll on the other hand was extremely fresh, the white tuna melted in my mouth and their spicy sauce was to die for. \n\nOur waitress wasn't that great and forgot our appetizers and our drink requests however each time she failed to come through for us one of the other waiters would ask us if everything was ok despite the restaurant being packed and you could tell that everyone took a lot of pride in making sure all the patrons had a good experience. \n\nI would probably go back from take out and I wish them all the luck in the world. I may try them again in a few months to see if they have made any new innovations."
    },
    {
        "id": 14,
        "text": "The sushi is decent here, but the service could be better! My boyfriend asked for diet coke a couple of times and never got it--finally he gave up after we were halfway done with our sushi. We had a groupon for $30 worth of sushi so we decided to go all out and order the following: Nutty Roll, McNabb, Sweet paradise, New volcano roll, and Godzilla roll. We figured we'd just take home whatever we couldn't finish. Well, when our server brought out the rolls on a big boat that was too big for our table, our server said, \"oh yeah, guess he thought it was a big table with all the rolls you ordered!\" Way to make us feel guilty lol.  Anyways, besides that, the rolls were decent. The Sweet Paradise was definitely the best roll out of our selections. It tasted fresh. This place is BYOB and can sit large groups so those are pluses. But I think we concluded we'll  go here for big parties,  but when it's just us two, we'll definitely keep going to our other regular sushi places."
    },
    {
        "id": 15,
        "text": "Ordered from here twice. Poor customer service and unimpressive fish. \n\nThe sushi was very meh the first time, but my roommate and I decided to give them one more try based on reviews. I think a lot of people leaving the good reviews have never had good sushi because Makiman is definitely sub par. \n\nAnyway, the second time I ordered some kind of fancy/special shrimp tempura roll and a salmon avocado roll. I don't know how hot the tempura roll was when they packaged it, but it made the salmon roll really warm. Not the rice, but the whole thing. Warm raw fish is not good and it grossed me out to where I couldn't eat it. I could have let this slide, but they also gave me a regular shrimp tempura roll instead of the one I ordered and paid for that cost double. I gave them a call about the roll and mentioned the warm salmon. The guy was super rude and told me that he's \"been packaging sushi for 10 years and no one ever complained about this.\" Ok, jerk. I've been eating sushi for 10 years and never complained about this because it's never happened. \n\nHe told me he would credit the extra $7 for the shrimp tempura from my next order. Told him there would be no next order after the conversation we just had and he said OK and hung up."
    },
    {
        "id": 16,
        "text": "Thought you were looking for Japanese food? Do you like Korean food?  This place has both, not just Japanese plates. Full menu of fusion sushi rolls, Udon, sushi, and other Korean specialties, such as kal-bi and bul-go ki. Excellent Don Buri.  I had the salmon stone pot, which was loaded with fresh vegetables, brown rice, and salmon cooked perfectly.  I would highly recommend. Pricing very reasonable compared to other restaurants nearby. I will be back."
    },
    {
        "id": 17,
        "text": "from the outside and their website, Makiman Sushi looks like a take-out place.\n\ndimly lit, snappy decor. they were playing singles you would hear on xpn.\n\nrolls are tasty and creative. the night we went, they had about 10 specials.\n\nif you are accustomed to a traditional place where the chef serves your sashimi with the right drop of soy sauce, Makiman's fish may taste bland at first. \n  \nthe test: mackerel, eel, tako, uni, salmon roe - all fresh and excellent the night we went.\n\nif our first night is a usual night at Makiman, we'll come here every other sushi night."
    },
    {
        "id": 18,
        "text": "Every time I'm in the area, I go to Makiman. Compared to other sushi places in the area, I find them to be one of the best. My favorite is Pete's roll. \n\nAlthough the service is not great, especially because the place is usually empty. But if you're just coming in to eat then it's not a deal breaker. \n\nThey also have a lot of different rolls to choose from and the  decor is really nice and modern. \n\nIf you have room for dessert then get the fried ice cream."
    },
    {
        "id": 19,
        "text": "Love Makiman. I come here at least once a month and have never been disappointed with the food or service. It's not some posh or swanky sushi bar, but the sushi is some of the best in the city (I eat sushi 1-2 times per week). They've got a huge variety of really great fushion-rolls. Must try: NE Viking, Cap'n Crunch, Sixers, and Caterpillar. It's surprisingly affordable for the quality of the sushi, and it's a BYOB. What's not to love?!"
    },
    {
        "id": 20,
        "text": "Solid sushi and sashami. Has become my go-to take-out place for raw fish and rice."
    },
    {
        "id": 21,
        "text": "Came here with a groupon tuesday night and it was mildy busy. We were seated quickly and we were recommended a party boat for it was our first time trying sushi. Everything was amazing!! To finish our night we had green tea tempura fried ice cream. Will definitly be back again. Our waiter alex was the best!!!"
    },
    {
        "id": 22,
        "text": "Makiman is good, but a bit pricier than other sushi places in town if you don't have some kind of deal. I've had various fish and vegetable rolls, which have all been decent, and the vegetable tempura is good. Service is average."
    },
    {
        "id": 23,
        "text": "Solid sushi at an affordable price. Went as a large group (9) and place was perfect for what we were looking for. The McNabb, Sixers, Tropical, and Spicy Tuna and spicy salmon were all exceptional, as well as one of their limited appetizers (forget the name, essentially deep fried spicy tuna roll). BYOB so it's a bit more pricey than a normal sushi, but the food is top-grade. Service isn't exceptional- but there was two parties of 8+ in there so perhaps that is a factor. Would definitely recommend."
    },
    {
        "id": 24,
        "text": "Came here for the first time on a relatively quiet Sunday afternoon for an early dinner , and I enjoyed every minute and every bite.  The waitress was super friendly and attentive, but more importantly, I REALLY enjoyed my sushi.  After much deliberation, I settled on the Cosmo Roll (sweet potato tempura and crabstick tempura) and a shrimp tempura roll.  Definitely worth it, and I'd love to bring a group of friends or my family here sometime--the atmosphere and menu selections are great for all!"
    },
    {
        "id": 25,
        "text": "Had yellowtail and salmon maki sushi. The rolls were tasty, and decently sized, but the fish ratio was dwarfed by the cucumber ratio. Also, you only get 6 pieces of sushi per roll. Can we say, lame? Overall the place was a ripoff as most sushi places in Philly seem to be. I won't return. \n\nFood Quality/Taste =  4 Stars\nPortion Size Given Price = 2 Stars\nPrice = 2 Stars\nService = 3 Stars\nExperience with Staff = 3 Stars\nDecor = 3 Stars"
    },
    {
        "id": 26,
        "text": "Picked up the same lunch special I enjoyed in the restaurant this past Saturday on my way to the Bolt Bus and was very disappointed. The salmon was spoiled and inedible and the yellowtail was questionable at best.\n\nThe miso soup was tasty, and the spicy tuna roll was great again, but going 1/3 is certainly not a win in my book.\n\nWill return again because of my positive first experience, but may have given up on take-out for now."
    },
    {
        "id": 27,
        "text": "\"Oooh baby I like it raw/\nYeah baby I like it rawww!\" - Ol' Dirty Bastard\n\nSo to answer Makiman's tag line, \"Do You Like It Raw?\" (voted totally the coolest sushi tag line by Philadelphia's 6th graders), with words from the late poet ODB, yes I do. And to borrow from Peter Frampton -- who, let's be honest, was the original Ol' Dirty Bastard -- oh baby I love your way, Makiman.\n\nSushi: 3 stars. Creative and fresh with no need to drown your rolls in soy sauce, close to 4 stars. \n\nValue: 4 stars. Three fusion rolls, soup, and an app for just north of $30. \n\nThe dark wood and deep colors give this a nice interior behind the cold, slightly strip mall feel of the exterior, but a wait staff clad in t-shirts felt a bit disjointed, lending itself to a dive bar kind of feel. But no matter, I'd still recommend this is a good, no fuss date/group spot. You'll feel comfortable uncorking a bottle of (BYO!) wine and lingering for a bit."
    },
    {
        "id": 28,
        "text": "Currently, Makiman makes me angry, but I would be willing to give them another chance.  It was a Friday night, and Katrina C. and I wanted to grab a quick dinner before a party.  We were in a hurry, so we figured if we ordered take out it would be faster.  I asked the hostess if that was true and she said yes.  They had several specials with crab in them, and I had a groupon so I was willing to splurge on the fancy sushi.  We ordered and then sat down to wait.  Probably 25 minutes go by and the waitress comes over to tell Katrina they are out of crab, and she has to pick a different roll.  Now, they didn't say anything to me, so we figured I must have gotten the last of it.  Well, about 10 minutes later the waitress came to let me know that two of the rolls I ordered were no longer available.  I replaced one with something different, and requested that the other just have the crab changed to something else.  About 15 minutes after that, we finally got our food.  It took about 45 minutes for this process to go down, which caused us to be really late for the party, so we actually requested to just sit at a table and eat our food instead of taking it with us.    We specifically told them we had to be somewhere before ordering, so they should have just said they couldn't accommodate us.  Also, probably not a good idea to make crab the ingredient in every roll, and then not have enough.  I have no major complaints about the sushi, although apparently the spicy salmon was lacking in spice.  It didn't wow me though, and without a groupon, I won't be back."
    },
    {
        "id": 29,
        "text": "Service was fine and it's nice that it's a BYO but I was super disappointed with the sushi here. It all tasted like it had seen better days- even the spicy tuna which generally can hide sub par fish with the spicy sauce. There are much better BYO sushi places in Philly, I would for sure skip this one."
    },
    {
        "id": 30,
        "text": "Pretty good sushi! My boyfriend and I decided to try this cause we got a living social deal and it was well worth it. Our deal was for $30 and we got 4 rolls, and 2 miso soups and paid $30 after tip.\n\nWe got the viking roll, the Eagles roll, the blind date, and another roll I can't remember the name of. Sushi was really fresh and made very quickly. We had great service and I felt like I was always being assisted, but not suffocated. My favorite roll was the Eagles roll, anything tempura and I'm happy :)\n\nAlso, it's a byob. Drink up"
    },
    {
        "id": 31,
        "text": "This place is great.  I haven't had a specialty roll that wasn't good yet.  It's kinda pricey but isn't everywhere in center city? They constantly have groupons and yelp deals so use em!  Oh, and it's byo.\n\nLoses a star because I was overcharged for a tip the first time I was there.  They corrected the problem within a few weeks though.  Save your receipt.\n\nIf you want fresh sushi with a nice dinner atmosphere where you can have a drink then this should be your place."
    },
    {
        "id": 32,
        "text": "Makiman is better than average sushi places in Philly. It is not quite the authentic Japanese sushi, and the rice is not quite the right consistency or flavour. Some die-hard sushi connoisseurs may not enjoy this because the rice is not perfect, but I give it an above average score because the fish is really fresh. Overall, the flavours are good, service is friendly and attentive, and the price is right. Plus, it's a BYOB.\nIf I could go to Zama every time, I would, but I can't.\nMakiman will possibly become my staple?"
    },
    {
        "id": 33,
        "text": "YUM! My friend and I split the spicy tuna crunch, eel roll, some other crunchy type roll and a california roll, and everything was delicious. I had a groupon, so that's why I chose to go here, and I would like to go again, but the prices are a tad bit too much for me, but probably about as cheap as you're going to find in the city."
    },
    {
        "id": 34,
        "text": "I'm not exactly sure how I feel about this place just yet. \n\nIn summary I'd say - Sushi (not the uni, but that's just bc it's not my thing) and rolls were great and my waiter, Malik, was awesome. Their desserts definitely needs work - order the fried banana w/ ice cream. Something just wasn't right... maybe bc the banana wasn't riped enough? Overly battered? Too much of that cherry topping? It was just a no for me. And finally minus points for the hostess who ignored me upon entrance. Mind you, it was empty at that point so she cannot say she was busy.\n\nI'd definitely give it another bc all in all I'd say the food was pretty delish AND I just  purchased their Groupon!"
    },
    {
        "id": 35,
        "text": "So glad we tried this little gem in the city. Considering it seems like a franchise with another location somewhere in the N.E Philadelphia area,but it was right up to par with there delicious food! From sashimi to the tasty creative rolls. Price aren't bad considering in the city. Will be back again. Until next time :D\n\nWould highly recommend to friends."
    },
    {
        "id": 36,
        "text": "Delicious food, good prices, and very nice service :) All that plus BYOB made Makiman quite an enjoyable restaurant!"
    },
    {
        "id": 37,
        "text": "Came here with my Groupon and I have to say, it was totally worth it!  The sushi was delicious and very fresh.  The viking roll was amazing.  I will definitely be going back."
    },
    {
        "id": 38,
        "text": "Love LOVE love the Ben&Jerry spicy tuna hand rolls and the ice cream fried tempura"
    },
    {
        "id": 39,
        "text": "A-OK indeed. Nothing blew my mind at Makiman, especially at the semi-steep prices.\n\nAgain, cue the Groupon. $10 for $20 of raw fish and the like at the very center city location of 13th and Spruce. Walked in, was seated in the middle of the waitress' takeout phone call, started poring over the menu.\n\nDecided to \"do something different\" for an appetizer, which meant no shumai, agedashi tofu ($6.95, are you serious?) or dumplings. Zack and I were excited to try the spicy tuna tartare, which I envisioned to be thinly sliced tuna, perhaps drizzled with a spicy sauce. \n\nInstead we received a massive pile of spicy tuna roll innards.\n\nWe should have known? Bad call? Duh? \n\nWhile the flavor hit the perfect level of spicy, I can't deny that I was a bit disappointed. How could I look forward to our Raw Viking roll (spicy tuna topped with salmon, roe, and eel sauce) now?\n\nWell, we managed just fine. We also consumed a salmoncado roll and a veggie tempura roll (sweet potato and more!) which was delicious. \n\nLesson learned: stick with your faves."
    },
    {
        "id": 40,
        "text": "There are times when you want to savor every delicate bite of perfectly cut sashimi.  That's what Morimoto is for.  Then there are times when you want to stuff your face with big tasty rolls.  That is what Makiman is for. \n\nWent on Saturday night with a groupon in hand and reservations for 8pm.  I'm not sure that we really needed those reservations, but I'm working towards that big $10 opentable giftcard (after a mere 6 years, I'm about 2/3 of the way there!).  I started with some miso soup and then the spicy tuna tartar.  The tuna tartar was better the last time I dined at Makiman. It wasn't as spicy this time around and I bit into something hard.  I had a moment of omg-what-the-fuck-was-that-some-sort-of-fish-gristle!?!?!?! panic and then realized it was just  a chunk of tempura.  Weird.  Hard chunks do not belong in tuna tartar and I hit 2 of them. Also my plate had a big chip in it.  Ghetto.  Throw out your chipped plates. I sampled my boyfriend's rock shrimp tempura.  It was good but not the best I've had (Zento's is much better).\n\nI ordered two rolls.  The raw viking roll was my favorite.  It was fresh and tasty.  I also had the yellow stallion which was pretty good.  The specialty rolls are HUGE. I was stuffed after dinner. \n\nOur server was great and the food came out very quickly. I still can't decide if their motto \"Do you like it raw?\" is a double entendre ode to ODB or an unintentionally funny, innocently fobby question. Either way it's pretty amusing.  The sushi at Makiman isn't bad, just not as high quality as some other places.  I'd maybe return with another groupon deal, but would not seek it out as a sushi destination."
    },
    {
        "id": 41,
        "text": "I visited Makiman on a Thursday night with a group of friends.  We were seated quickly as the place was pretty empty.  However, we had to go up and ask for menus after being seated for a few minutes, which was a little annoying.  After that, the service was pretty good. The waitress was friendly and attentive, and accommodating of our large group.\n\nThe sushi is decent and the prices are reasonable, considering the location in Center City.  I had a miso soup, yellowtail scallion roll and the caterpillar roll.  The fish was fresh and was presented nicely.  I especially enjoyed the caterpillar roll because it wasn't overly stuffed with ingredients but still had a nice combination of flavors.  I also sampled a friend's Vegetarian Bi Bim Bop which I also enjoyed.  It's a large platter with a nice mix of ingredients and flavors.  It's great if you have a big appetite. \n\nWe did not take advantage of the BYO this time but its definitely a plus when visiting this restaurant.  Overall, Makiman is average compared with other sushi restaurants in the city. Nothing too special, but it definitely hits the spot if you're craving sushi and not looking to spend too much. I will definitely visit again when in the area and in need of a sushi fix."
    },
    {
        "id": 42,
        "text": "Came here on a Groupon... and I'm glad I did.\n\nPhiladelphia has started to see better sushi lately. We were a table of four. I looked at other yelp reviews before we sat down so I kinda knew what I wanted to order.\n\nTuna nachos - awesome.  I've noticed a trend on sushi menu's lately to have spicy tuna on top of some crunchy vessle.  These tuna nachos are spicy tuna on top of avocado goodness on top of (what seemed to be) freshly fried chip.\n\nSixers roll - this was all over the yelpers quick tip - I completely see why.  I agree this was a great roll. \n\nI will say that I'm surprised to see a \"McNabb\" roll on the menu - it might be time for an update.  Not sure if they should go with a \"Vick\" roll or start looking at the Flyers/Phillies lineup. \n\nMy next trip I want to try the Tuna Bi Bim Bop.  Has anyone had the Burrito I'm very curious on reviews and feedback.\n\nThey were appropiately priced, friendly staff and clean.  I hope Makiman is able to stay here."
    },
    {
        "id": 43,
        "text": "Just went in for the Saturday lunch special (10/14) and ordered the two roll special - 2 spicy tuna rolls, a salmon avocado roll, and an eel avocado roll. The avocado was ROTTEN. I immediately informed the waitress (although how the sushi chef served that is beyond me) - it was disgusting and we could have easily gotten food poisoning if I hadn't noticed it. It has made me question the quality of all of the ingredients they use. On top of that, it took the sushi chef an additional 20 minutes to make us our sushi rolls again (we were the only people in the restaurant). And the icing on the cake is that there was no discount, comp, free appetizer, ANYTHING offered to make up for serving us rotted food. Will never go here again."
    },
    {
        "id": 44,
        "text": "BYOB. \n\nThe Monday all you can eat thing is a great deal. It's not everything on the menu, but it's very thurough. You can order three things at a time and they'll come back for another order when you can prove you can finish what you got. Careful - they'll charge you a bit if you order more than you can handle. \n\nThey have some creative (and all the standard) rolls on the menu, and the sashimi is very tasty. \n\nAdd to that the Yelp check-in deal and you're set."
    },
    {
        "id": 45,
        "text": "Very nice place. I came here twice for hot dinner entrees. We got soup and salad with an entree, and both times food was delicious. Salmon and chicken  Bi Bim Bop were extremely well prepared. \nPlace is quiet, clean, and service is very good."
    },
    {
        "id": 46,
        "text": "We used our groupon last night and I had low expectations because of the mixed reviews I read. We enjoyed our meal and thought that the food was really good. Service was excellent and the waitress was helpful in pointing out which dishes she really likes.  Kept our water glasses filled, which we appreciate too.\n\nWe started with an appetizer which had yellowtail and vegetables wrapped in seaweed, then tempura batter and deep fried. It was really good! And a different kind of appetizer than the usual dumplings.  For rolls we got the Viking Raw, Blind Date, White Tuna, and Shrimp Tempura. All were really good. The majority of the rolls came with spicy tuna (which i like) with slight variations.  Our bill came to $45 before the groupon discount which I think is very reasonable.\n\nIt is byo. Reasonable prices. Has outdoor seating. Good location right off broad (plenty of places to go for another drink). They give you metal chopsticks - not the cheap wood kind, which is a nice touch.  \n\nThe only drawback was the music they were playing. It was a mix of techno and electronica that was kind of loud.  They should adjust that and play more dinner-type music because the decor and inside of the restaurant is really nice, updated, and modern.  \n\nI would go back! :)"
    },
    {
        "id": 47,
        "text": "I've tried several sushi restaurants in center city but did not very satisfy with them. Makiman serves in sufficient quantity, fresh meat, and its a BYOB! I usually have three appetizers, sashimi combination and a sushi boat with four to five friends. I love their appetizers like Bang Bang Shrimp and Tuna Nacho (I'm not sure about the name). You must try them. I have nothing to say about their sushi and sashimi cause they are so good. Also, Makiman's desserts are great. MUST TRY. Don't forget to bring your favorite wine. :)"
    },
    {
        "id": 48,
        "text": "Went here for a friends birthday last night, I haven't had quality sushi in a long while so I was excited to check this place out. \n\nI'll start with the food. I started with the miso soup, and continued and got the sweet potato roll, the salmon avocado roll, and the spicy tuna roll. The quality of the food was great, and fresh but the portions seemed a bit small than other places I've been to in the area. But over all the food was good. And its BYOB, who doesn't love that?!\n\nThe service on the other hand was a little feeble. First it took the girl over 5 minutes to bring us water, which she didn't even ask if we wanted anything else. When she took our order, one of the other girls I was with stated she \"might\" have wanted something on the appetizer menu, and she jumped the gun and wrote it down anyway almost like she was in a hurry, but we had her take it off. Second she didn't give us as much attention as I thought a server should. It looked like some of her friends had come in and she was spending a lot of time at their table. We just felt like every time she did pay attention to us it was an inconvenience to her."
    },
    {
        "id": 49,
        "text": "Went here with a group of 11 for my birthday and couldn't have been happier. The service was excellent and they were very accommodating with our larger party. We ended doing the larger sushi boat and got some extras to go with it. Sushi was great and especially loved the seaweed salad. Awesome that it's BYOB. They even gave me a free t-shirt!"
    },
    {
        "id": 50,
        "text": "Really solid place! Great variety and super fresh. A ton of creative tools and lots of sashimi plates. All the fish they use is incredibly fresh and tastes amazing. The service was flawless. Dessert options are great too including tempura ice cream. Give it a try, the best in that area for sure."
    },
    {
        "id": 51,
        "text": "Great place to go if you're looking for a laid back night with your friends or significant other. I tried the special MM Naruto roll and absolutely loved it. The ambient atmosphere was peaceful, as well as the presentation of the restaurant. Highly recommended, especially to those who live by the area!"
    },
    {
        "id": 52,
        "text": "Solid sushi with great service and a good atmosphere (BYOB) for the price of takeout/delivery.  Salmon maki had a generous amount of fish for a $5 roll and I really enjoyed the Sixers roll.  The Spider roll had lettuce in it, which I wasn't crazy about, but that's my fault for not reading the description carefully.  Also, the shiny metal chopsticks are fun.  I'll definitely return!"
    },
    {
        "id": 53,
        "text": "I'm a fan!  We bought the living social from a few weeks back ($15 for $30 to spend) and tonight we finally cashed it in.  We decided pretty last minuted to go out to dinner and called them a little after 7pm (on a Friday!).  They sounded crazy busy on the phone but said we could come at 8:30.  We showed up a few minutes before and the place was pretty full (and they were setting up for a large group which took up 3-4 tables).  We had to wait about 15min for some tables to clear out and we ended up at the sushi bar.  \n\nThe menu is pretty huge and they have sushi and non sushi options (bi bim bap,udon, terriyaki etc).  We went for sushi so that's what we spent the most time pondering.  The place was super busy and it took them a little bit to take our order, but one of the sushi makers was super on top of things and had someone come over as soon as he noticed we were no longer absorbed in the menu choices.  We started with the veggie tempura which was well done and the dipping sauce was really tasty (more like a broth than a sauce).  There was carrot, sweet potato, asparagus, onion, broccoli, and cucumber.  Yum!  \n\nFor the sushi we got: Raw Viking Roll, The Stallion Roll, Sweet Potato Tempura Roll (I loveee sweet potatoes), and a normal yellowtail roll.  I have to say they were all well done.  I hadn't had torched sushi before so the Stallion was my first time, I was a little wary since I generally prefer raw fish to cooked fish but it was soooo good!  \n\nSo after this great experience, we decided to keep it going and ordered the tempura vanilla ice cream.  It was HUGE.  At $8 I was a little wary of ordering it since I figured it would be small, but goodness did they give us a ton.  It was gorgeously presented with fresh cut strawberries, and giant mounds of both tempura ice cream and whipped cream.  I can't believe we finished it, but I'll admit that we did.  I wish we had taken pictures of everything, but we both left our phones behind so that we wouldn't get distracted (ok really I just forgot my damn phone!).  \n\nAfter all of this the bill was only $60 ($55 pre tax).  After the living social was applied it was only $30, yayyyyyy.  Had it been a little less busy it would have been perfect.  We found out at the end that they were down a server for the evening which had a lot to do with the chaotic nature of the place that night.  \n\nWe don't live far from Makiman and will DEFINITELY be back when we're craving another night of sushi (or maybe for lunch if we want some bi bim bap!)."
    },
    {
        "id": 54,
        "text": "Went here for the 1st time the other night w/ Kristin H. We were able to sit outside (yay spring!) for a really nice dinner.\n\nEverything was SUPER tasty! I had seaweed salad, veggie dumplings, a kampyo roll, & 2 pieces of inari (tofu) sushi. Everything was SO AMAZING that I'm pretty sure that this is going to be my official sushi go to place.\n\nThe service, while friendly & well-meaning, was super slow, I mean, almost ridiculously so. We had to get up & go inside to find out server. Three times. \n\nI was torn about how many stars to give because the service was SO bad & the food was SO good. I went with 4 stars because even though the service was slow, they were still really nice.\n\nAlso, 10% off w/ your first yelp check-in."
    },
    {
        "id": 55,
        "text": "I'm pretty anal when it comes to sushi...and there are only few places in Philly area that I would go...price, ambiance, quality, and level of service has led me to give 4star rating.  It's not a good spot for authentic Japanese food like Sagami...but if you are craving tasty makis, then this is must...and it's BYOB!."
    },
    {
        "id": 56,
        "text": "Went to Makiman tonight for the first time, mainly because I had a Groupon for dinner. I hate to write a bad review, mainly because the servers were great  (very attentive and friendly), unfortunately, the food was pretty bad. The miso soup was watery and flavorless, the ginger salad dressing was ok, but not great and even the green tea was disappointing. They made a whole pot of tea with one tea bag, so it basically was like drinking hot water. My main dish was the Salmon Stone Pot. The salmon was fine but the dish overall really lacked flavor despite dousing it with the two sauces served with it. My date had sushi and a special spicy tuna tempura appetizer. The sushi was mediocre but she really enjoyed the tuna appetizer. I think that appetizer and the service were the only good things about the meal! I won't be going back."
    },
    {
        "id": 57,
        "text": "This is the first  and more than likely the last time I will order from Makiman Sushi.  Simply put, I was very disappointed and felt totally ripped off!  Never have I paid so much for so little  that was so average."
    },
    {
        "id": 58,
        "text": "I've been here twice. First time was better than the second. The waitress was nice and attentive. The nigiri sushi I ordered had a few pieces that seemed slightly off. Also, I didn't really like their metal chopsticks. Not terrible but not great either."
    },
    {
        "id": 59,
        "text": "First off, I gotta say how happy I am they moved to their new location. We used to go to their NE location when we could, but given the drive, it made it hard to enjoy their BYOB option. Now that they're in the city, game on!\n\nThe sushi is fresh, the rolls are creative and delicious (Sixers Roll is my favorite). What I really like about this location are they're creative options like their Tuna Nachos, which is a great way to start your meal. The BYOB option is clutch and I'm looking forward to taking advantage of their Monday All-You-Can eat deal. \n\nIf you're looking for unpretentious sushi joint in the city that has great food and good service, definitely worth a try."
    },
    {
        "id": 60,
        "text": "Came to Makiman yesterday with a livingsocial deal. I have to say my experience this time was much better.  We got the McNabb roll, which was surprisingly twice the size as the one we got during my last visit. Perhaps it was a different sushi chef (or maybe they listened to their yelp reviews?! :)) Regardless, the rolls here were very filling this time. I also tried the salmon avocado roll and the white tuna roll, both of which were fresh and sizable. I hope these well sized rolls remain; I'll definitely be back!\n\nThe service was again very good."
    },
    {
        "id": 61,
        "text": "Quick service, has Japanese and Korean food, and good lunch specials."
    },
    {
        "id": 62,
        "text": "I contemplated five stars, but i wasn't 100% happy. We got take out...\n\n Cons: There were WAY too many bonito flakes on the agedashe tofu. Also, the sauce wasn't on the side, so by the time we got home the batter was a soggy mess.\n\nNo low sodium soy sauce.\n\nWasn't thrilled about the ginger dressing, but it wasnt terrible\n\nPro: Sushi was so so good. The rolls were huge, the fish was fresh and I was really pleased. Even my picky boyfriend was happy.\n\nBYO. We didn't eat in, but when picking up I noticed that they were a BYO and it was decently busy for a Friday night. \n\nOur order was ready in 20 min, and the staff was friendly at the restaurant.\n\nI'd order from here again or eat in. I wish they delivered to my house!"
    },
    {
        "id": 63,
        "text": "I went to Makiman tonight.  Service sucked, sushi was, at best, mediocre.  I don't know what possessed me to get \"Mama's roll\", but it was inedible.  I did manage to eat the rest of the other rolls.  The sushi was just kinda sloppy and definitely didn't taste fresh.  Best part of the dish was the pork dumpling soup as an appetizer.  I have high standards because Umai Umai is my favorite place on earth...this wasn't in the same league.  Will not go back."
    },
    {
        "id": 64,
        "text": "My friend suggested Makiman as a lunch spot between Philadelphia Dance Day classes this past Saturday. I love sushi and saw they have a lunch special so I was game. \nWe sat down around 1:00 and the place was pretty empty. We may have been the only customers in the restaurant at that time. With that being said, our waitress was very attentive. \n\nWe both went for the 3 roll lunch special. For $9.95 we each received 3 rolls of our choice and a bowl of miso soup. I went reverse maki for all 3 picks- the spicy yellowtail, the eel cucumber & avocado, and tuna and avocado rolls. All three were pretty tasty and the price was definitely right.\n\nI've been there before during dinner time and have had the pleasure of sampling some of the more fancy rolls. Those are absolutely worth checking out but if you are looking for a filling, delicious sushi for a reasonable price, this is your place."
    },
    {
        "id": 65,
        "text": "Definitely my go-to sushi place. The service has always been excellent and the food does not disappoint. There are many vegetarian options, as well."
    },
    {
        "id": 66,
        "text": "Good spot before the theater. Great selection of creative rolls & entrees, fresh sushi.  reasonable prices- check out 50% off special menu items on Tuesday (one per customer) The staff was dressed more for a pizza joint than a sushi bar (with an atmosphere to match- and not in a good way) and they blasted HORRIBLE club music. Next time I'll ask them to change the station."
    },
    {
        "id": 67,
        "text": "I've walked by this place several times, never thinking it'd be someplace I'd enjoy. I was certainly wrong. The upbeat vibe was a surprise and the staff were very friendly and helpful.\n\nI ordered the Chicken Teriyaki Stone Pot Bi Bim Bop and was excited with the sizzling bowl hit the table. I the brown rice was crispy on the bottom, the veggies were fresh and there was an abundant amount of tasty chicken morsels.  Soup and a hearty salad preceded....\n\nGo try them out!"
    },
    {
        "id": 68,
        "text": "\"I like it raw!\"\n\nI'm a picky sushi eater and this is the best sushi restaurant in center city, hands down.\n\nI'm a big fan of their fusion roll list.  The different combos of sushi all wrapped into one mega sushi----OH. MY. GOD. Heaven :)  (Sixers Roll is a must!)  After going through every sushi roll twice, I decided to try their entrees.  Not too bad--I've had the Bul Go Ki which is a marinated beef with an arrangement of steamed vegetables/rice/soup&salad. \n\nThe owner and waitstaff are so friendly and make each visit feel very personal.  Throw in that this is a BYOB and pricing is extremely reasonable for amazing sushi and you got yourself a great night out!"
    },
    {
        "id": 69,
        "text": "I want to talk about this place all the time, but sometimes I hesitate.... 1) because I am not sure if I should say \"mah-kee-mah-n\" or \"mah-kee-man\" (as in MAN, I sure is hungry) and 2) I don't want it to get over-run with people. \n\nNo matter, perhaps I shall head over there again to ask the staff... because I will  just take any excuse to go and indulge in their delicious selection of creative rolls that explode crunchy, spicy, creamy avocado-y, savory, sweet, tangy flavors in your mouth.   \n\nPersonally, I am a fan of spicy crunchy things so some of my faves include the sixers roll, the mcnabb (def the roll, ambivalent about the football player), the viking (VICTORY~!) roll, and the yellow stallion. \n\nI like the Spider roll here, but it's not one of my faves. Definitely a solid offering - upside, you get 6 pieces which is more than most sushi places, but downside is it's smaller. IMO, when the softshell crab is that small, you start to lose the flavor of the crab and get more of the soy-based sauce and/or avocado. \n\nLovely things: BYOB, attentive and friendly staff, speedy food delivery, takes rezzies, relatively inexpensive for sushi and they don't rush you out. \n\nSushi aside, I really enjoyed the agedashi tofu - Makiman's version of this dish comes with a LOT of bonita flakes. However, the dolsot bibimbap was just okay. There was so much sesame oil mixed in that towards the bottom 1/4 of the bowl, there was a pool of spicy oil drowning the remaining veggies and rice."
    },
    {
        "id": 70,
        "text": "When I worked in Jenkintown, we used to take a jaunt down to Northeast Philly to Makiman on those days when we needed a pick-me-up. So, when I saw that Makiman opened a location in Center City--that would deliver to me--I was more than thrilled. \n\nSince they opened, I have ordered at least once every two weeks and have never been disappointed. Their sushi is fresh, inventive and absolutely delicious. My favorite roll is the Sixers Roll.\n\nIn short, stop in, order takeout or have it delivered. The food is outstanding and you will become a repeat customer."
    },
    {
        "id": 71,
        "text": "Delicious sushi, reasonable prices, and BYO; Makiman is great!"
    },
    {
        "id": 72,
        "text": "This place has an incredibly extensive menu with some very American-leaning fusion items.  Although I can't remember our exact picks, we tried some of those as well as some more traditional food.  I was more satisfied with the traditional stuff."
    },
    {
        "id": 73,
        "text": "Really the sushi isn't so bad. Although they seem to drench everything in spicy sauce, many of the rolls were quite tasty. The real disappointment (and the reason for the 3) was the Pork Tonkatsu. It was god awful! The pork was a soggy mess with a sad sad egg placed on top. I love Tonkatsu for the cripsy tempura coating on the pork, but here it was just a soggy mess. Don't think I'll return for any sort of entree item, but if you like your sushi with a bit of sauce, than this is the place for you."
    },
    {
        "id": 74,
        "text": "After getting this menu in my mailbox, for some reason I didn't throw it away. I'm glad I didn't because it is now one of our favorite sushi spots for take out and eat in. The makiman combo is a great deal since you get to choose your 3 fav rolls and it comes with soup or salad. Their sixers roll and love for tuna roll are awesome as well! The portions are big and the Sushi is always fresh. Plus its byo..... 2 thumbs up"
    },
    {
        "id": 75,
        "text": "I LOVE LOVE LOVE THIS PLACE!!! \n\nSome of the most fun rolls and its BYO! :) I like to sit at the bar and watch the guys rolling.  \n\nMY favorite rolls are the Sixers, NE Viking, Spicy Capt'n Crunch oh the list goes on... dynamite roll is a winner too.. \n\nYou MUST get the rock shrimp tempura - nice and spicy! :) yum!!!"
    },
    {
        "id": 76,
        "text": "Great sushi at reasonable prices.  Their Sixers roll is out of this world.  They need to change the Donovan McNabb roll's name to the Mike Vick roll.\n\nGreat staff and I love that they incorporate the Philly sports teams in their menu.  It is very unusual for a sushi place to do so, at least from what I have seen.\n\nKeep up the good work and I will keep on coming back!"
    },
    {
        "id": 77,
        "text": "Shumai was delish! Rocky shrimp was pretty tasty, not the best ever, but no complaints. The best part was how fast they delivered! Less than 20 minutes! AMAZING"
    },
    {
        "id": 78,
        "text": "Nostalgic, voluminous, but somewhat basic Japanese food.\n\nThis is a small sushi place in center city Philadelphia.  The interior is surprisingly nice, but I got take-out.  I'd definitely eat in here if I had the opportunity.\n\nI tried the Makiman's Pancake and the Chicken Katsu Don.  The former was basically a seafood pancake in the Vietnamese style, and - like the many seafood pancakes I've had at other places - was really darn good.  The Chicken Katsu Don was accurate to what I ate in Japan, but a bit basic - the breading and egg were a bit weirdly moist, but nonetheless were pretty good."
    },
    {
        "id": 79,
        "text": "Great fusion rolls, solid service, nice seats by the window, and real quality ice buckets.  A great sushi find for groups or dates!"
    },
    {
        "id": 80,
        "text": "I had sushi delivered from Makiman.  I used the online ordering system and it worked well.  My order was delivered on time and the gentleman was very nice.  I opened the package and found everything I would need - napkin, chopsticks, soy.  \n\nThe seaweed salad was blah.  No cucumbers or carrots, just seaweed nothing great.  I ordered two rolls and 4 pieces of nigiri.  I love unagi so I ordered and unagi roll with avocado and 2 pieces of unagi.  My first bite into the nigiri unagi was not good.  It was fatty and tough - not how unagi should taste.  I tried the roll and couldn't eat the whole thing due to the poor quality of the unagi. \n\nThe Hamachi nigiri was also tough and I feel was cut very thin and small.  The raw Viking was a nice roll but it is advertised as having green and red tobiko on top but it only had red tobiko on it.  \n\nOverall, I wouldn't order from Makiman again.  The quality and value aren't there."
    },
    {
        "id": 81,
        "text": "Ah, Makiman, my favorite superhero. Defender of Justice, always ready to roll at the first sign of anything fishy. (Sorry, I'll not stop with the puns now.) \n\nFirstly, it's BYOB, so bring your favorite boxed wine that pairs well with sushi (I hear this year's vintage of Franzia is excellent). The servers will graciously bring you some ice and some glasses when you get there. \n\nThe food is very good. We started with the tuna nachos. Yes, you read that correctly. I can't recommend these enough. They were made up fresh, raw tuna chopped up in a spicy sauce on top of a crispy chip (I think you get 4 chips). Each one is pretty big and delicious. Seriously, get these. They also have a huge roll selection with some pretty creative options. I think we had the Viking Roll and a few others. Also, the rolls are very reasonably priced compared to other sushi places. \n\nSo thank you, Makiman, for everything you do for this great metropolis."
    },
    {
        "id": 82,
        "text": "Consistently good. Everything from the apps to the sushi has been wonderful. The staff is friendly, the byob adds a fun element to a traditional sushi dinner and the menu options other than sushi are creative.\nDo not miss the Ramen Burger: pork belly covered in hoisin sauce topped with lettuce and tomato sandwiched between two ramen \"patties\". For the ultimate Asian food lover. \nI also discovered the sushi bento box today- not only do you get 5 pieces of nigiri, you also get two pieces of cali roll, a ginger salad, edamame, shumai, dumplings and rice.... and miso soup. FOR ONLY 11 dollars.\n\nThe only reason why Makiman takes 4/5 is that their sushi could be cheaper. 6 rolls for $6 is meh."
    },
    {
        "id": 83,
        "text": "Stop by a few months ago had excellent service and the food were great also. Would recommend this place to friends and family"
    },
    {
        "id": 84,
        "text": "I came here with 4 girls and we ordered the party boat 3, which was perfect for us.  It wasn't too full so we had enough to drink later at the bars.  Best of all it's BYOB!  Great service, great food.  Highly recommend and I'll definitely come back next time! \n\nI can only put 4 stars because I have no yet experienced a \"jaw-dropping\" sushi restaurant yet."
    },
    {
        "id": 85,
        "text": "Excellent food and service. BYOB is great, too."
    },
    {
        "id": 86,
        "text": "There isn't much to say about Makiman. Their prices and food are just very average for a sushi place. If you're looking for sushi in this area, Sumo Sushi (Broad & Pine) is similarly priced but the sushi tastes much fresher."
    },
    {
        "id": 87,
        "text": "Their Bi Bim Bop/Stone Pot is AMAZING!\n\nI don't eat sushi but the friends I have eaten with here say it's awesome.  Very fresh.\n\nThe staff is very accommodating and helpful.  \n\nGood for parties, also.  I attended a birthday dinner here and it was very well done.  We had lots of space and the waitstaff was very attentive throughout.  \n\nI go here several times a month and HIGHLY recommend it for anyone who likes sushi or Korean fare."
    },
    {
        "id": 88,
        "text": "I really liked this place a lot. Made a last-minute reservation only to find plenty of open tables available to us when we walked in.\n\nIt's BYO with no corking fee. Our waitress was great and even let us know about a deal based on what we'd ordered that made more sense for us to get.\n\nSolid sushi that left me full and so happy. I'd definitely go back!"
    },
    {
        "id": 89,
        "text": "I came here for a quiet dinner on a Tuesday evening.  It wasn't very full and was pretty quiet in terms of decibel levels (perfect for what I was looking for).  Makiman offers good sushi, but it was not spectacularly memorable. \n\nThe rolls are pretty creative, but a little on the small side.  I got two of the special rolls and a regular roll to split.  The sushi is a good ratio of rice and fish.  I can't remember exactly what I got, but I remember thinking they are good rolls. They give a good portion of the seaweed salad.  The service was good.  \n\nIt seems like coming for the all you can eat sushi deal is a great idea. I may have to try it out."
    },
    {
        "id": 90,
        "text": "Absolutely Disgusting.  I foolishly bought a groupon for this place, and recently redeemed it.  \n\nI ordered the sashimi sampler.  The fish was so old, discolored and nasty I could only eat about half of it.  Nasty is actually an understatement... this fish was downright scary.  \n\nThe yellowtail tuna was nearly grey, with a disturbingly fishy taste.  The salmon had no overtly disgusting  flavor (making it one of the better bites on the plate) but instead had absolutely no flavor whatsoever, as well as a weird off putting texture.  You have no idea how much I regret even sampling the mucous-y, overwhelmingly fishy squid.  This meal was so bad I really didn't even feel like revisiting it in order to write this, but I thought you, dear reader, deserved this public service announcement.  \n\nAvoid Makiman at all costs.  I would tell you to go to Vic's instead, but really, go anywhere instead.  I've never had worse sushi in my entire life."
    },
    {
        "id": 91,
        "text": "My friend and I wanted to eat sushi and really checked many places before deciding on trying this one. We called in and had no problem ordering (sometime, the language barrier makes it difficult to order) and we were told we should expect our food in 40 minutes. They delivered on time but the delivery man took a little while to find the apartment building (which is really not hard to find) but he was nice and apologized for letting us wait when he came in.\nMy friend had the MM Naruto roll and an order of squid and I had the tropical roll and the lobster tempura roll. My order was just really good and I always am a big fan of mangoes in sushi so I was really happy with the tropical roll. I will order from there again."
    },
    {
        "id": 92,
        "text": "At first look, Makiman doesn't look like any thing special. I agree with Jon W. that it looks like a take out Chinese restaurant in between a deli and a parking garage and I walked by it countless times with out even noticing it was there. We got a recommendation from a friend saying this was the best sushi in the city so we had to try it out. I'm not a huge sushi eater so I can't say if its literally the best or not but everything I had there was great! \n\nMy favorite is the caterpillar roll with seaweed salad and that they have Groupons all the time! They also have fee delivery so Makiman is now my go-to if I'm in the mood for sushi. You can also say their clever little slogan (Do you like it raw?) that they have on everything, adds to the fun."
    },
    {
        "id": 93,
        "text": "Apparently, bad service and customer service in general is a hallmark of this place.   We will not be going back."
    },
    {
        "id": 94,
        "text": "Makiman sushi was a nice minimal restaurant with a serene ambiance and a menu of Japanese and Korean cuisines. The Miso Ramen was a little bland but it tasted better after adding a bit of soy sauce to the broth. The waitress that served my friend and I was very kind and checked in with us to make sure that we were enjoying the food. I will definitely be back to try the Ramen Burger, which piqued my interest."
    },
    {
        "id": 95,
        "text": "Delicious Makiman pancake with spot on service and excellent atmosphere!\n\nThe fried banana the a perfect ending to a nice Saturday lunch."
    },
    {
        "id": 96,
        "text": "Only place in town to serve the ramen burger!  Delicious!!!!  You need to try it! Food and service is excellent. Some great Korean dishes along with sushi. Owner is a world class runner!  Ask him about his 50k!"
    },
    {
        "id": 97,
        "text": "I finally went to Makiman because we got a groupon deal. I had some high hopes because my friends told me it was not-so-bad place.  I would say,, Makiman is not-so-bad if you have a deal for it. Most sushi places are pricey and if I had  to make a choice, I would go to a different sushi restaurant that has more \"flavor\". \n\nThe fish were fresh enough..but I just didn't get the WOW impression on the appetizer and 2 rolls. Also, I can get full enough with 3 things ordered at other  sushi places, but at Makiman I left w an unsatisfied belly. I did like how they didn't try to stuff the sushi with lots of rice just to fill up the customers and make the rolls look bigger.\n\nIf I could say something good about it, the sushi variety you can choose from is great. It made it harder for me choose what I wanted to order, but if you're the type of person that wants a huge list, Makiman has it. The interior was nicer than what I expected. \n\nIf you want to go to a BYOB sushi place, I guess Makiman could be an option. But if you want to spend your money on real good sushi, I wouldn't recommend it. If another groupon deal comes out, maybe i'll go again. It was just one of those places \"Yeh I'll go if you really want to go\"."
    },
    {
        "id": 98,
        "text": "My husband and I visited Makiman before seeing a ballet at the Academy of Music. It was completely dead for lunch and we were the only people at the restaurant. This is a Korean and Japanese restaurant so there is Japanese cuisine like sushi and ramen, and Korean cuisine like kimchi and bibimap. I order the miso ramen, my husband ordered the stone bowl bibimap. Service was slow, especially considering we were the only ones at the restaurant. When we received our meals, I was disappointed. The ramen was not very good, the hard boiled egg was incredible hard and chewy. The pork belly was too thick and fatty. My husband's stone bowl bibimap was barely hot. Usually the bibimap sort of cooks in the bowl but this was just bibimap thrown in a barely warm stone bowl.\n\nThe price was fine but I was just overall disappointed with the food and experience."
    },
    {
        "id": 99,
        "text": "If you are into the basic rolls, they have great lunch specials here.  My only complete is the Northeast location lets you pick between salad or soup and the center city one you automatically get soup."
    },
    {
        "id": 100,
        "text": "The restaurant is currently closed. The website is still live and you are able to place online orders through the site, your food will obviously not be delivered. Your credit card will still be charged. Be aware, don't order online."
    },
    {
        "id": 101,
        "text": "Hubby and I went to Makiman on Spruce on a double date (which we rarely do) one Saturday evening. The couple we were with are new to the wonderful world of sushi, and gave us the liberty of ordering for them. Hallelujah!! Surely it would've been catastrophic to come here and be subjected to California rolls all night with narrow-minded company...but they were cool. \n\nWe started off with the Tuna Nachos. In a word: Divine. We also got the Sixers, Cap-N-Crunch, Shrimp-N-Eel, Rainbow, Lobster Tempura, and Sweet Potato Rolls. Everyone raved about the freshness and quality of the rolls as we dug in and were really enjoying the experience. I was almost stuffed and had one roll yet to try: The sweet potato.\n\nWait a minute. Where's the sweet potato roll, guys? You ate them all?? Everyone (except me) claimed to have one each =3. I inquired with the server how many pieces it's usually cut into and she replied \"5 or 6\". Er?? Well, I'm no mathematician but I'm pretty sure 3 is not equal to 5 or 6. The server then insisted that we must've mistaken one of the other rolls for the sweet potato and then walked away. \n\nYou're kidding me, right?? Well damn, I'm obviously not Japanese and eat more fried chicken than sushi, but I think I know Lobster tempura from sweet potato tempura...feel me? On top of all this, we were overcharged for two of the rolls, which the server corrected AFTER I brought it to her attention. (Sheesh, I'm glad I have a photographic memory....I hope you do too if you go here)\n\nSN: My double date friend called me today to tell me she loved the sweet potato roll so much she ordered it for lunch today and had it delivered...Although she said it was quite tasty, I don't need to tell ya that it wasn't 5 or 6 pieces when it arrived, do I??... Arrrgghhh, mayyybe one day I'll get to taste that roll....\n\nOverall, I would go back...preferably if someone else was paying. It was good to step out of the box and see Center City's sushi offerings as we normally have our raw fish in the 'burbs."
    },
    {
        "id": 102,
        "text": "Good experience here, I got the sixers roll and sweet potato roll both great, sixers roll is a must try! It's a byob so make sure to bring some wine to wash ur sushi down! Overall good food, good service."
    },
    {
        "id": 103,
        "text": "This is our go-to sushi place. Love sitting outside and that it's BYO. And inside seating is also great. Servers are always so nice and attentive. Delivery is always super fast as well if you don't eat there."
    },
    {
        "id": 104,
        "text": "Great sushi. I usually get the Sushi Deluxe, but the fusion rolls are good too. Try Pete's Roll or the Sixers Roll. Just tried the pork belly bun- also very good."
    },
    {
        "id": 105,
        "text": "Very unassuming restaurant. I was skeptical at first simply because the outside façade seems super cheesy. The inside is nice, and the menu is even better. So much selection and so good! I wish I could remember what I ordered, but it was still good. Sushi was fresh and presentation was great. I also saw a neighboring table that ordered an enormous sushi platter that came out on a boat (literally) so I'm willing to go back and give that a shot. \nAlso: BYOB!"
    },
    {
        "id": 106,
        "text": "We went on a Monday night for the all you can eat sushi.  It was good but when we went to give them our Living Social coupon they said it can't be used on the all you can eat special even thought it says nothing on the all you can eat rules card at the table or on the coupon itself about not being able to use it for specials.  This was extremely irritating.  Now we have to go back sometime just to use the coupon."
    },
    {
        "id": 107,
        "text": "This is one of, if not my absolute favorite place to get sushi in Philadelphia. The service is always phenomenal, and the sushi itself never disappoints. They have a great sweet potato roll which is hard to come by in a number of places, if that kind of thing is your taste.\n\nI have gone in here a variety of different times of day and days of the week and have never had trouble getting a table. They even have outdoor seating when the weather is nice. If you're picky when it comes to sushi, you must give this place a try!"
    },
    {
        "id": 108,
        "text": "Very bad. Nothing really good to write about. The girls working there have no idea what they're doing, the food is really not that good, everything kind of taste like either hot or cold mush. Too bad it so conveniently close."
    },
    {
        "id": 109,
        "text": "I have been to this place a few times to dine in and enjoyed their specialty rolls but today I placed an order for take out and ended up throwing away half of my meal because I got sick from the other half!!!! I used to recommend this place to my friends but never again!! I ordered the yellow stallion and something else for take out. the yellow tail on top of the roll looked half cooked and fish looked greyish red. TOTALLY NOT FRESH!! I have ordered this same roll before while dining in and it looked totally different!  I am so disappointed because I enjoyed this BYOB place before I experienced their take-out service."
    },
    {
        "id": 110,
        "text": "This is my go-to take-out and delivery spot.  \n\nI always get the sixers roll, IT IS SO GOOD. Ive also had the seaweed salad, which was ok. Dumplings (steamed and fried) both decent.  \n\n\n\nDelivery is usually relatively fast, and ahead of grubhub's ETA.  Take-out takes all of 10 mins, I call them when I'm on my way home and its ready for me to pick up. \n\nBonus: Its open late"
    },
    {
        "id": 111,
        "text": "I've been to Makiman multiple times.  It's sort of in a weird place at the bottom of a big building next to a convenience store.  Went again last night because, though I'm no sushi expert, the sushi has always been fresh, it's affordable and BYOB and you never need a reservation.  Generally when we've been here we've tried the fusion rolls.  It's not traditional maki but the combinations are often amazing.  Last night we had the \"Sixers\" roll.  It's shrimp tempura rolled with a piece of spicy tuna on top drizzled in a spicy eel sauce.  The presentation was beautiful (see my photo) and it was delicious, just a little bit of kick (No wasabi needed! Usually I'm throwing wasabi all over every bite.).  A bit of crunch, a bit of soft sushi for that complex mouth feel.  We also tried vegetarian Bi Bim Bop in the stone pot last night and it was good, but generally I would stick with the interesting fusion rolls and traditional nigiri.  Service has been mixed but always pleasant.  Again, worth trying for consistently good rolls, affordability and BYO in a center city setting."
    },
    {
        "id": 112,
        "text": "the worst sushi i have ever had in my entire life, including a chinese restaurant down in south philly. WAY over pricedfor the quality, fish was not fresh and super fishy tasting (in rolls not as sashimi)"
    },
    {
        "id": 113,
        "text": "I really like Makiman. It's a few blocks from my office and I've gone for both lunch and dinner. The lunch bento boxes are a great value. For dinner there are about a million roll options and the appetizers are yummy - my favorite is the hot oil carpaccio (may be getting that name wrong), which is unlike anything I have ever eaten. A great find!"
    },
    {
        "id": 114,
        "text": "This place is such a hidden gem in the city, and one of my favorite places for sushi- if not my favorite.  I just went there with a large party on Tuesday night for a farewell dinner for a great friend... and the meal really couldn't have been better.\n\nFirst of all, its a BYOB.  This is HUGGGEE in my book as a lot of sushi restaurants have kind of a strange selection of booze.  I enjoy a good saki, but sometimes i just want a light beer or a glass of wine, and this puts me in the driver seat... which is just where i like to be.\n\nSecond of all, i love the seating options.  On a nice night, you can dine al fresco and people-watch, while drinking your own booze.  If you prefer, they have inside seating.  The decor is on the nicer side of standard for your standard sushi restaurant, and the tables are comfy.\n\nThen there's the service.  We had a HUGE order with lots of special order intricate details... and they nailed it.  We had people show up late, as the food was coming out, and they managed to turn around their sushi order at warp speed so they could dine with us.  We ordered the boat... they sailed it our way looking BEAUTIFUL.  All while being so kind and hospitable.  Our wine was opened immediatly, the check was brought promptly, it was just really easy!\n\nLast, but certainly not least, there's the food.  This place has the best sushi I've found.  As a vegetarian, my options are a bit limited, and can get dull and boring... but this place has kajillions of options.  The sushi chef is super flexible too.  He put quail egg on inari for me.  They have the popeye roll, the tempura sweet potato and broccoli roll (my fav x 1000), the tempura roll, fujumaki roll... just lots and lots of great options.  None of which have ever disappointed.\n\nAnd the icing on the cake- the prices are SO reasonable!  A whole dinner for 2 for $30 (with me the vegetarian... as i tend to be a cheap date).  \n\nI really have nothing awful to say about this place.  Even the bathrooms were immaculate.  We come here often, and will keep coming back."
    },
    {
        "id": 115,
        "text": "The raw viking roll was very good- the rest was mediocre at best.  There are definitely better options."
    },
    {
        "id": 116,
        "text": "Sushi and service was great! We had a party of five and order the Boat Party For Three and it was more than enough. The selections were great and the sushi quality was great. Overall, service, price and quality were all wonderful. Would definitely go back again."
    },
    {
        "id": 117,
        "text": "Came here on a Groupon deal and was not disappointed. I normally dislike getting sushi dinners because I am a hungry guy and often feel unsatisfied at the end of an expensive sushi meal. Makiman did not give me this problem, as the rolls were reasonably priced and delicious. Service was good as well, and although it's a small space, its got a nice little ambiance. I will definitely come back, even without the Groupon deal."
    },
    {
        "id": 118,
        "text": "I dont understand the hype for this restaurant, it used to be better back in the day but these days the food there is not that great for the price you pay...their food is def. over priced for the quality of the food.\nthe only thing that i would pay for at this restaurant is the fried tofu, other than that if you live in the northeast i guess its a decent place to come eat if you dont want to drive to the city and get better sushi also its a BYOB which is nice too"
    },
    {
        "id": 119,
        "text": "My friends and I went here late Saturday afternoon and used a groupon deal to order an early dinner. Our server, April, was very nice. She answered all of our questions about the different dishes and the service was pretty fast.\n\n Just a heads up- if you're a meat lover like me then maybe don't order the chicken stone pot bim-bi-bop. It was a nice sized dish, but heavier on the veggies. All of our meals, and the delicious green tea ice cream, were served with a pretty decorative flower that made the meal extra nice (see my pic I added). \n\nI hope to go again and try out one of the many fusion rolls available! I'd recommend this place to anyone."
    },
    {
        "id": 120,
        "text": "We had bibimbap and sushi. The bibimbap was awesome. The sushi was ok. The service was ok. The atmosphere was loud- but mostly because a couple tables were being very loud. Overall experience... Just ok."
    },
    {
        "id": 121,
        "text": "Good sushi spot. Casual ambience. Tried the ramen burger and it was delicious. Decent sushi and appetizer selection as well."
    },
    {
        "id": 122,
        "text": "I've been to Makiman 3 times now and will definitely come back. It's not a fancy place, but I like that about it. The food is tasty and the presentation is neat and pretty. The prices are very reasonable, especially for sushi and especially for being in the city. I also love that it's BYO,  as it cuts down significantly on the bill. The service is efficient without being too sugary, and the sushi always makes its way out fast enough that I never have to whine to whomever I'm with, \"where is the sushi?? I'm staaaarrrvvviiinngg!\"\nMy personal favourites are the spicy tuna roll, the veggie tempura roll and the MM Naruto. Mmmm, I'm drooling just thinking about it. So glad I found Makiman!"
    },
    {
        "id": 123,
        "text": "I love eel and avocado so I had the caterpillar roll and a seaweed salad. The caterpillar roll was amazing and tasted very fresh.\n\nThe service was good and prices were reasonable. My only gripe were all the pesky gnats flying around. I know it's summertime and all but for all the waving away of the gnats I had to do, I might as well had eaten outside :-/\n\nAs usual, I was very happy this place is BYOB and they have fried ice cream! I will def be hitting them back up in the winter when the mosquitoes and gnats die off so I can eat in peace. I'd love to try some of their other fusion rolls and that fried ice cream :)"
    },
    {
        "id": 124,
        "text": "Came here while we were waiting for a concert. Sushi was fresh and tasty, but not superb."
    },
    {
        "id": 125,
        "text": "Makiman had yummy food, and lots of gluten-free options. I went with two friends; we split everything we got, and I would recommend it all! \n\nSalmon bibimbop didn't come in a hot stone pot, but was raw and delicious, especially with the chili sauce that I used in ample proportions. Really happy, b/c it can be hard to find GF Korean food. Just ask them to hold the fake crab, as it's made with gluten. The dish comes with miso soup, which I love, and a salad with a soy sauce-based dressing, which I passed on to my friends. \n\nI enjoyed the tuna-avocado reverse-maki, and the Boston roll (salmon, lettuce, tobiko, avocado, cucumber, and mayo). I thought the Tiger roll (spicy white tuna and cucumber) was delicious. Thank god for a spicy sauce with no soy sauce in it! Just make sure they don't drizzle teriyaki sauce on top, and you're good to go. \n\nI was super excited to see ginger icecream on the menu, but they told me they don't carry it any more. I called at 6:30 on a Saturday to make reservations for 7:30, but was told they weren't taking any more. Showed up early, and waitress agreed to reserve three seats for us at the sushi bar, which was actually kind of fun. Overall, I spent $17 and ate 6 pieces of sushi, 1 miso soup, some bibimbop, and some green tea icecream. I was happy. \n\nI want to come back here a lot. Like every day. Like right now."
    },
    {
        "id": 126,
        "text": "My friends and I came here last night to celebrate one of their birthday's. She's been wanting to have \"sushi on a boat\" for a while now so I looked up a few places and figured this was on the top of the list.\n\nWe ordered the Sushi Boat 3 for the 5 of us and 1 person ordered the Bi Bim Bop because he doesn't like seafood.\nWhen ordering, we asked the waitress if she could hide wasabi under 5 pieces of sushi so that we could play a game. Our one friend is allergic though so she got to know which pieces had it. However! She forgot and ended up picking up 2 with wasabi so I had to eat them. =P\n\nAnyways, the sushi was pretty good and it was my first time trying some of the Edomae (the non-rolled ones, Googled the name.) Personally didn't like the chewier ones.\nMy friends are also not really the non-roll type of sushi eaters so it might have been better to get more rolled kinds.\n\nAt the end of the night, we really enjoyed the sushi, the game, and the metal chopsticks. =P"
    },
    {
        "id": 127,
        "text": "This past Saturday I was in the mood for a quick sushi lunch and headed off on my way to Sumo, my normal spot. When I arrived I found a sign explaining that there had been a blackout (affected the nearby Starbucks as well) and the restaurant would be closed until PECO got the power restored. Still stuck on the idea of sushi, I walked over to the nearby Makiman and decided to give it a try.\n\nI was pleasantly surprised to find that their lunch specials are excellent deals- I opted for 3 rolls and a soup or salad for $9.95. My friend chose the 2 roll special for $6.95 and her brother ordered the sushi lunch, which comes with 4 pieces of California roll and 5 pieces of sushi for $7.95. All three of these choices are super affordable, and I was thrilled at how tasty the rolls were.\n\nUnlike some other places with roll specials (Jay's, I'm talking to you...), these were served with an ample amount of fish. All ingredients were fresh and I really couldn't ask for anything more. I was even able to use the 15% yelp check-in coupon to get 3 rolls and a salad for $8.50!!!\n\nThe only reason this isn't getting 5 stars is because I ordered 3 spicy rolls but only received one. The other two - yellow tail and salmon - came without any spicy sauce. The spicy tuna, however, actually had some kick to it, something I've found is very rare at sushi restaurants (sounds silly but it's true!).\n\nDefinitely a fantastic place to go for lunch specials. I'm sure it's great for dinner too, and am looking forward to returning to try out some of the specialty rolls!"
    },
    {
        "id": 128,
        "text": "Went here for a birthday party last night. Mmmmm Sixers roll was delicious! Spicy tuna was decent. 10 percent off thanks to yelp! Also our waitress was so friendly and even gave a free shirt because it was a birthday! I want to try a boat!"
    },
    {
        "id": 129,
        "text": "Husband and I stopped in for sonething to eat so we ordered the party boat 2 and sashimi deluxe. The food was great! However, the waitress i had was super nice and pretty but she was never there when we needed her! She took way too long and it's not like she was even busy. She was just talking to the other waitress in front of the kitchen area... Great food but terrible service. Overall, I prefer their restaurant on Oxford."
    },
    {
        "id": 130,
        "text": "Such a hidden gem! They are BYOB and the sushi is great. Get the tuna nachos, they will change your life and you will constantly wonder why all great sushi places do not make them"
    },
    {
        "id": 131,
        "text": "Makiman is GREAT. Let's hope their five-star customer service isn't just a 'newly-opened' phase. I came here with 10 friends for a birthday party centered on Makiman's BYOB perk and was amazed by every aspect of the meal.\n\nWhen we arrived, we were expecting Hasu Japanese, which I had actually found on Yelp last week, but it turns out that placed opened and closed in the blink of an eye, and Makiman took over. \n\nNo mind the brief confusion. As we entered the restaurant, we were immediatedly seated and the hostess assessed our bottles-in-tow and told us she would get us a bucket of ice and glasses for our sake, red wine, brandy... beer... ok, so we brought a LOT of booze with us, and the staff was nothing but smiles about it. I swear we must have cleaned out their entire cupboards of glassware, because all eleven of us must have had at least three different glasses to our person. \n\nDespite the fact that we had brought our own drinks, the staff provided us with unlimited, FREE caraffs of hot sake (complete with little ceramic cups), which they diligently refreshed everytime they visited our table (we were drinking like champs!). We were also graced with a free and DELICIOUS wonton cracker nacho-type appetizer with guacamole and raw tuna. These guys definitely have the 'fusion' thing going on... I didn't scrutinize the menu too deeply because our party opted for a \"Party Boat\" of sushi and sashimi (which came with salad and miso for all), but one of my friends ordered some sort of pork burrito appetizer that was also quite good. \n\nAfter all was said and done, our check for a group of 11 topped the scales at UNDER $100, including an 18% gratuity. So, folks, I think this place wins. And I encourage you all to pop in for a visit while they're still in their 'grand opening' phase and score yourself some freebies. I'll definitely be back."
    },
    {
        "id": 132,
        "text": "Good, friendly, and acceptable service. Sushi is good but not the best in town."
    },
    {
        "id": 133,
        "text": "This place is absolutely delicious. They are less than a block away from my work so it's replaced Wasabi house as my go-to sushi place. I'm a wuss when it comes to sushi, I usually stick to vegetable rolls, tempura fried things, and california rolls, but this place does all of the above right.\n\nOne of their signature rolls is called the Cap'n Crunch roll and it's sooo good. It's got kani, cooked shrimp, tempura flakes, spicy mayo, and cucumber and it's seriously one of the best things I've ever tried. \n\nThe only reason I'm not giving it 5 stars is because its a bit pricy but it's worth it."
    },
    {
        "id": 134,
        "text": "$10 for three rolls and soup. Can't beat that!\n\nthe menu looked pretty extensive, and they have some other pretty good deals for lunch and dinner."
    },
    {
        "id": 135,
        "text": "The service is terrible here. We went for a friend's birthday and we had to ask for every single thing - menus, water, wine opened, silverware, plates, etc. It's a shame because the sushi is actually pretty good. Never going back here again. There are too many good BYOB sushi restaurants in this city to waste money on a bad one."
    },
    {
        "id": 136,
        "text": "im very picky on Japanese food, but first impression here is not that good, not very good environment, and the Manu is kinda old- but still great service. And later found out the sushi, and ramen are perfect. Worth a shot guys"
    },
    {
        "id": 137,
        "text": "Decided to have a date / 'oh c$%p my groupon is expiring' night with the wife in center city last evening.  This place is a little hidden, but now I know where to look.  Several parking lots around, expect to pay $10-12 for the night.  \n\nRestaurant has several seats outside, and inside is a small-ish, well decorated sushi place.  Plenty of seats on a Wednesday night, but i can imagine it getting crowded on a weekend.  Service was pleasant and the food came out fairly quick, but as other reviewers have pointed out, I can see this place being hectic/slow if it filled up.\n\nSushi was very good, nice and fresh.  Prices are average ($5 for a tuna roll).  The groupon obviously made a difference though, i may not have enjoyed paying full price.  Definately have a large selection of special rolls to choose from.  P.S. its byob.\n\nThis may be one of those rare places we go back to even without a groupon!  Thats unthinkable normally."
    },
    {
        "id": 138,
        "text": "I guess I can't speak for anything else on the menu, but I was pretty underwhelmed by the sushi at Makiman.  There was so much rice that it really robbed my meal of the delicate subtleties that I expect from a sit-down sushi restaurant."
    },
    {
        "id": 139,
        "text": "Doesn't look like much from the outside, but this is my favorite BYOB sushi spot in Philly. Great sushi, inexpensive, and great for parties. If you have a big group and looking to start a wild & fun night, this is absolutely your spot."
    },
    {
        "id": 140,
        "text": "I have been diniing at Makimans' Northeast location for years, and when I heard they had opened in Center city, I was excited.  Center city is much closer to where my boyfriend lives, so making a sushi trip here is much easier.  \n\nI stopped in for lunch on a Thursday with the $10 for $20 Groupon I purchased.  I was searching for something I had never tired so I went with the Hai duk bop or Sashimi rice salad, something I've been dying to try.  I also orderd a seaweed because I didn't realize it came with miso soup and salad.  The sashimi rice salad consisted of 4 types of fish (salmon, tuna, whitefish, white tuna), and some shredded kani atop sushi rice, strips of nori, shredded lettuce, cucumber, seaweed salad, some shredded white radish and red chili sauce on the side to mix in as you please.  It definitely lived up to my expections and the size of it was huge!  I was only able to finish half, and took the rest to go.\n\nDefinitely plan on heading back to try other items on the menu.  I'm a huge fan of their lunch menu, because it is extremely affordable and has a lot to choose from.  Recommed highly for a inexpensive yet satisfying meal!"
    },
    {
        "id": 141,
        "text": "The service is good and the space is pleasant and, most importantly at this time of year, COOL.  The sushi is fine (I particularly enjoyed the addition of eel sauce to the sweet potato tempura roll) though the rolls lack structural integrity.  I want to go back to try their hot stone bi bim bap."
    },
    {
        "id": 142,
        "text": "I happened to walk by Makiman Sushi one day after shopping in Center City. I decided to head in for lunch. \n\nThe waitress was friendly and attentive. I ordered the Naruto roll and the broccoli & sweet potato roll. The food was ok. However, it was a little pricey the quality of the food.\n\nI would go back if I'm in the mood for sushi and don't feel like traveling farther."
    },
    {
        "id": 143,
        "text": "Not my favorite.  We went because we had a Livingsocial deal, and I wouldn't go back.  The sushi was fine and not extremely overpriced, but it was the atmosphere that lost it for me.\n\nLoud, and not in a good way, with a lot of families with small kids.  Maybe we went at the wrong time.  Also, the place is BYOB, which we found to our dimay when we tried to order a bottle of Saki.  Is that their fault? No, but it put a damper on dinner.  All in all, find a different place for sushi."
    },
    {
        "id": 144,
        "text": "Makiman Sushi is a great place to go for a group. I've taken several groups here for different occasions and it never fails to please. The atmosphere is nice but still cozy, the food is awesome and beautiful, and the staff is attentive. My friends ordered the party boat, which is fun because of how grand the sushi's wooden boat looks. Their scallion pancake is pretty good, a little softer than a traditional Chinese one. I like their specialty rolls, especially the tempura shrimp, tempura sweet potatoes, and eel and avocado rolls. You can't go wrong with green tea ice cream either. To top it all off, sometimes the manager sends out a free dish for the table."
    },
    {
        "id": 145,
        "text": "I've been here a few times now. Overall, the sushi is just ok, nothing spectacular. I did take out a few weeks ago for a special roll that was pretty much just a california roll with salmon, crunch, and spicy sauce, and it was ridiculously over priced. Good for large groups if you're looking for a last minute BYO, but otherwise I wouldn't recommend it."
    },
    {
        "id": 146,
        "text": "I love Makiman! Risque tagline? Maybe. Fantastic sushi? Yes!\n\nI really like the menu here because there is a mix of traditional, specialty, and veggie rolls. This is a place where I can take my veggie/vegan friends and everyone will still be satisfied. I often find myself stealing a veggie roll from a friend because it's so tasty! You've got to try one of the rolls with sweet potato - delish!\n\nThe only roll I've tried that I didn't like was the MM Naruto. It's wrapped in cucumber instead of rice. It left me hungry. Such a letdown."
    },
    {
        "id": 147,
        "text": "I used to live right across from Makiman and had their take out whenever I didn't want to cook. It's pretty good Korean food (I'm not really a sushi person) for a reasonable price. \n\nThe lunch specials are a great deal too!"
    },
    {
        "id": 148,
        "text": "I come with  my friend in here two time,fist time is ok ,this time some fish no fresh at all,I just tried for fish no fresh,service is ok.roll is too small,No more rice from the roll,thanks..........\n.."
    },
    {
        "id": 149,
        "text": "Makiman sushi, what a pleasant surpise you are! Jost got a take out form this new place. Eel teriyaki was fantastic! Started with a perfect miso( best ever), an ok salad and then OMG! Eel was perfectly tender, crispy on the outside, nicely seasoned(if a bit too sweet), and it came with well cooked brown rice and onions, which just melted in my mouth, some (caramelized?) potatoes, which exploded with flavor( I don't even like potatoes!). We also had a sushi and sashimi platter( only ordered a sushi combo, but it was delicious anyway). I would definately recommend this place. Good prices for the quality and quantity. Keep on the good work."
    },
    {
        "id": 150,
        "text": "Sushi was great but unfortunately the service was awkward.  I say awkward because they were attentive but in the wrong way.\n\nI went here with a friend for dinner, used a Groupon deal which was worth it but the hostess/server was all over the place. They were really nice girls but they constantly wanted to remove plates that I was still working on.  I felt kind of rushed eating it since I felt like they were going to come take my plates away when there was obviously food on it.\n\nI think I'll stick to take out from this place to avoid the awkward dining experience I had the other day."
    },
    {
        "id": 151,
        "text": "After my favorite Sushi place closed down earlier this year I embarked on a journey to find a new spot. I had heard some good things about Makiman so I decided to give them a try... I now regret that decision. My friend and I were sat down and then ignored for 15 minutes before someone came to take our order. We ordered one of their sushi boats and when it finally arrive almost 45 minutes later it was terribly disappointing. Nothing tasted fresh and when added to the poor service this is a definite skip me in the future."
    },
    {
        "id": 152,
        "text": "with my living social deal in hand we headed over here on a sunday afternoon. Walking up the street I realize, OH wait! this is where MUNTIN used to be *sigh* . so we go in and are immediately greeted . We ordered the choose your own sushi dinner ... and the dinner comes with 3 rolls of your choice, miso soup, and a house salad. all for like 17! whoa! good price right? also as a starter we got the vegetable tempura. The food was great! the staff was on point the entire time which I love. I must also mention that when we sat down they immediately made some child friendly chopsticks for my daughter without even being asked to do so! LOVES IT! \n\nBy completion we had 2 pick you owns, and the veggie tempura, all for like 44$ AFTER TAX!  thats 6 rolls, 2 soups, 2 salads and tempura.. I'm really liking those numbers! \n\nMy one qualm was when our waitress answered the phone at the hostess booth. This is not an issue but apparently she received a personal call from a friend and spoke with them in a manner that just was not suitable front of house behavior, especially when you have customers in earshot! however she was pleasant, and exceptionally attentive! \n\nI'll def need to come back here, hopefully it doesn't close down like muntin did!"
    },
    {
        "id": 153,
        "text": "The sushi here is amazing. Fresh and such large pieces of sushi and sashimi. It's a small place but we have a large group and they go above and beyond to make us happy. It's also BYOB and that is a huge plus. Besides the sushi, the staff and service were so helpful and friendly. I would definitely recommend this place for good Japanese food."
    },
    {
        "id": 154,
        "text": "This BYO is great for delicious and cheap sushi.  \n\nThe spicy tuna tartar is fantastic...it's actually spicy, the tuna is super fresh and it's only 9 bucks.  The rock shrimp and almond chicken appetizers are also delicious.  I've gotten delivery from here a few times and it takes only 30 minutes or less.  In terms of sushi, I've only tried the sixers roll with shirmp tempura and spicy tuna which was pretty great.  It was a bit hard to choose a specialty roll since the list is pretty extensive, and they also have some Korean dishes offered on the menu as well."
    },
    {
        "id": 155,
        "text": "Actually really good!  The entrance is misleading - you'd think it would be some cheesy little joint, but it's nice and comfortable inside. The sushi was wonderful and I really enjoyed it.  BYOB too."
    },
    {
        "id": 156,
        "text": "Makiman is my local, go-to sushi joint.  I only eat vegetarian rolls, so take read review with that in mind.  In the past year I've probably eaten in about 10 times (you do not need a reservation but book on open table to get your open table points).  It is BYOB, it is quiet, the servers are all very nice, and the sushi chefs work quickly to get fresh food to your table.  I've ordered take out another dozen times and delivery once or twice as well.\n\nI usually get the avocado maki and the veggie tempura roll.  The rolls are always well constructed, though the veggie tempura roll is about three bites and somewhat difficult to eat (about the size of an 8 year old's fist--if I had to guess), but delicious.  The avocado is always ripe and fresh.  The wasabi seems to me to be a bit mild,  so keep that in mind when using it to accompany your sushi. \n\nThey also have a large specialty roll menu. Make sure you check all check in apps to see if they have any specials.  Last time I did, it was buy one specialty roll, get one free.  Right now Makiman is offering 10% off orders when you check in on Yelp."
    },
    {
        "id": 157,
        "text": "The BEST sushi and BYOB place in center city Philadelphia. My husband, friends, and I walked in the door to a warm, inviting, modern atmosphere. We had a party of 9 and expected the place to be small and cramped in like every other sushi place in the city but to our surprise the place had enough room to accommodate several large groups. We had a great long table next to the window. Of course a few from my party were late for our reservation including myself but the waitress was very accommodating and always had a smile on her face.\n\nMy husband and I started out with a Tuna Nacho-one word: AMAZING! ,Tuna Tar Tar-very flavorful, and the rest of the party was very satisfied with their appetizer selections. Another thing that was a surprise to me was that they had a large selection of hot dishes other than just sushi.\n\nWe also ordered the following over the course of the night: McNabb roll- a must try!!! ,NEViking roll-  delicious!, Sixers roll- my husbands favorite! Capn crunch and Lobster roll- very good, and one of my GF ordered the Unagi Bi Bim Bop- Its like the best of both worlds Bi Bim Bop and eel (VERY TASTEFUL). The green tea ice cream is a must have to end the night here.\n\nOver all the sushi rolls we ordered were fantastic and very fresh tasting. Everyone agreed the preparation of the sushi is of high quality and I have to say the portions were great too. Most of the dishes looked really pretty and had real orchids on them (it was almost too pretty to eat!) If you want good sushi then this is the place to visit!!!"
    },
    {
        "id": 158,
        "text": "A very enjoyable experience!  (our first time at Makiman)\n\n We tried the ginger salads, miso, edamame, and a tuna roll (a crunchy one, which was delicious) - then went on to a sashimi deluxe platter.  We found the fish to be very fresh and all in all, we really enjoyed our dinner.\n\nLove the fact that you can BYO wine, too.\n\nTHINK IT\"S TIME TO GO BACK! :)"
    },
    {
        "id": 159,
        "text": "I'm pretty particular about my sushi but Makiman has always passed my exacting standards. Their NE Philly location was my go-to spot when I lived around the corner from it, but now that I'm in the city primarily, this Spruce St location is where it's at. Monday night is all you can eat sushi. Yes I judge a Japanese restaurant by its miso soup, if you don't get it right, you aren't worth your stock (get it?) But anyway, needless to say, Makiman does a fine job with their miso. But of course what you want to know about are the rolls, right!? of course! there's so many I haven't tried them all, but the ones I have are always delicious, neatly prepared and very fresh. I usually go with the Sashimi platter which has never disappointed. Its a favorite for me and my friends. My rolls of choice are the Kappa Maki (cucumber) and the Negi-Sake (Salmon with scallions) those are personal favorites of mine and Makiman makes them just how I like. For dessert, ginger ice cream. The Center City location fyi has a great online ordering system for both dine-in and takeout."
    },
    {
        "id": 160,
        "text": "I went here with a couple of friends and we all loved it! The sushi is FRESH and it's BYOB..YAY! What i loved most is \"tuna nacho\" so yummy too bad it's such a small portion, i think it comes in four pieces. They have very creative dishes and names. Some entrees the portions are big enough to feed two people, well that's if you are ordering sushi and other appetizers. So far I have no complaints about their food. Will definitely go back to this restaurant."
    },
    {
        "id": 161,
        "text": "Makiman has become my go-to sushi spot in Center City.  Both the in-house service and delivery are on point, and the sushi is high quality and delicious!\n\nWhen dining in, the staff is always friendly and I've never had to wait for a table.  Most recently, I came here with a girlfriend to catch up and our order was taken promptly and food was brought out quickly.  Our server even made it a point to wait until we were finished with our appetizers (shrimp dumpling soup - so good!) before bringing our sushi.  \n\nThen there are the days that you just don't want to put real clothes on and would prefer someone to bring the sushi to YOU.  Online ordering is easy and delivery is fast.  Granted, I do live a few blocks away so they don't have that far to travel, but I was really impressed with how quickly it arrived.\n\nPrice point is a little higher than some of the competitors, but I think the quality of the food is worth the extra cash."
    },
    {
        "id": 162,
        "text": "I had sushi delivered from here at 9pm last night.  The woman on the phone was very pleasant.\n  I ordered the MM Naruto roll, salmon with cucumber roll, miso soup, and green tea ice cream with whipped cream. \nEverything was DELICIOUS and the portions were good.  I highly recommend all of the aforementioned items.  The fish was very FRESH. All the rolls sound awesome!  I can't wait to try...blind date, NE Viking, sixers...etc.\n\nThe food came really fast, too.  The delivery guy also came right to the door, which makes me happy.\n\nIt was my first time ordering, otherwise I would have given it 5 stars.  I really can't understand where any of the negative ratings come from?"
    },
    {
        "id": 163,
        "text": "I've never left a one star yelp review, and I've never had a bad tuna roll.. Until tonight.  My wife and I each ordered the \"sushi deluxe\" - which is 10 pieces of sushi plus one tuna roll.  \n\nBefore the plates even hit the table, they smelled like old nasty fish.  Like the Italian market on a hot sweltering day.  \n\nI hoped the smell came from a new piece of sushi that we weren't familiar with yet, but no.  Everything was terrible, even the tuna and salmon (which is usually always so reliably tasty).\n\nThis is seriously the worst sushi place I've been to in center city.  Very disappointed.  Left most of my plate untouched and had to go across the street to get a sandwich at Jay's Deli afterwards.\n\nThe other annoying thing was that the waiter went into hiding after we told him it wasn't very good.  He wouldn't make eye contact afterwards, and we had to hunt down an employee after waiting 30 minutes for the check.\n\nThis place is the worst."
    },
    {
        "id": 164,
        "text": "Came here before heading to the Kimmel Center.  We were immediately seated and provided water.  Our service was good, except that we had 2-3 different waiters helping us at any given time.  It was slightly confusing at first, but did not take away from our experience.  \n\nThe food was good.  We got a few special rolls, an eel handroll (very good), and a yellowtail/cucumber roll.  We also got the veggie dumplings and the seaweed salad.  The food came out in a timely fashion and we were easily on time for our show.  I would definitely come back here when seeing a show on Broad St."
    },
    {
        "id": 165,
        "text": "Do I like it raw? Yes.\nDo I like terrible service? No.\n\nI previously ordered take out from Makiman. Being satisfied with my order, I decided to dine in the following week with my partner. The Futo Maki roll was my favorite, but ended up falling apart due to it being insufficiently rolled. The rest of my rolls were pretty average. \n\nI would've given Makiman an average review, but the service made me feel very unwanted. \n\nOur server was completely apathetic. We were their only table and we still felt unwelcomed. They did the bare minimum while serving us, which I would expect if the restaurant was busy - but c'mon, we're only a two top and we're easy to please. \n\nAfter dining, I asked them about the 10% off Yelp check-in offer. Our server was completely oblivious and asked their coworkers. I overheard one of them saying \"I don't know, just pretend that you don't know what Yelp offer they're talking about.\" Not a direct quote, but still, if you're going to be sarcastic/throw shade at your customer, do it AFTER they leave. Also, do they not know how sound travels, especially in an empty restaurant? Common sense now! They ended up taking the Yelp offer, but I rather would have saved my 10% for better service. \n\nI would also like to note that our server did not have their hair (which was way past shoulder length) pulled up. Isn't this a minimum requirement for servers?\n\nWord of advice: Since you have a \"People love us on Yelp\" sticker, please be aware of the offers you put on your Yelp page."
    },
    {
        "id": 166,
        "text": "I came here after purchasing a Living Social deal.  I *j'adore* sushi but have never been able to find a sushi joint in the city limits that I liked...\n\nYou guessed it... until now.  Love the fact that it's a BYO, it's smallish inside but there were 2 big parties when we went and yet my boyfriend and I could still hear each other great.  The sushi was excellent - fresh, the right texture and firmess, the only disappointing thing was that they were out of toro but, I guess that gives me a reason to go back! (We had the tuna and yellowtail rolls, a spicy tuna, the ebi and the salmon - all so YUM) The miso soup was warm and satisfying on a cold rainy night - just the right amount of tofu and seaweed - and thankfully no huge tofu chunks which always puts me off.  Edamame was like it had just been picked.  Steamed to perfection with a little salt for taste and the house salad with the homemade ginger dressing - O.M.G.  I used the dressing as a dip once the salad was done.\n\nAll in all, I am a huge fan of this joint and cannot wait to go back - AND I thought the prices were really reasonable.  Especially for center city.\n\n\"Chef recommends!\""
    },
    {
        "id": 167,
        "text": "Comfortable atmosphere. Good food. Fast service. \n\nWent it with a Google Offer and ordered three rolls and dessert. \nI tried a Philadelphia Roll, a Sweet Potato and Broccoli Roll, and a NE Viking Roll. All three were delicious, but the winner for me was the simple Sweet Potato/Broccoli Roll. It was ridiculously delicious. Philadelphia Roll was still awesome and pretty much tasted like a bagel with 1/4 of the carbohydrates. The NE Viking Roll was rather good, but a bit too expensive to order again. \n\nGreen Tea ice cream was excellent as well. \n\nGreat service and very helpful staff. They helped me learn how to use chopsticks :)."
    },
    {
        "id": 168,
        "text": "I love coming here as a way to keep the husband and I both happy -- he wants sushi, I'm meh, so I always fall for the bibimbap. Plus, dumplings!!\n\nWe tried Makiman a few visits ago on a Groupon and it went so well that we've gotten a little into it, despite having lots of other options closer to our house. The menu is pretty extensive, so I'm happy taking people here, and did I mention dumplings? Dumplings.\n\nI especially like Makiman as a pre-evening out dinner, as it's so close to Broad Street and all the theater/art/music action there without the crowd. I've also seen huge groups come here without trouble (although I assumed they had a reservation).  We'll definitely keep coming back!"
    },
    {
        "id": 169,
        "text": "I think I've been spoiled by Sumo Sushi.  I probably would have given this place a better review had I not experienced the party in my mouth that is Sumo Sushi.  I had the dumpling soup, and split 3 specialty rolls with my friend.  It was so average compared to Sumo that I just can't give it higher than 2 stars.  If you're jonesing for some sushi, do yourself a favor and when you get to 13th and Spruce, just walk another block south to find the best sushi I've found in the city."
    },
    {
        "id": 170,
        "text": "Tuna Nachos... Mmmmm\n\nOrdered three rolls (in order of my faves): Blind Date, Sixers Roll, and the raw NE Viking Roll - all were quite delicious.\n\nI will be back."
    },
    {
        "id": 171,
        "text": "This is a review for their all you can eat...Monday only from 3pm onward. The fish is fresh but the rules are a bummer. 3 orders at a time...they are pushing you toward ordering the rolls. Can you imagine getting only 6 pieces of nigiri per order?!? They is no way in hell you can eat a large quantity. Another rule is that you can't order the next round until you are totally done. If you want lots of sushi for all you can eat, expect to spend hours here. If you want all you can eat, go to aki instead."
    },
    {
        "id": 172,
        "text": "I wish I could give this place zero stars.  \n1.  Service was incredibly slow even though there weren't many people here.\n2.  There was VERY little meat in every dish we ordered -- two rolls and a Korean dish.\n3.  The salad we got had pieces of rotten lettuce in it.  It wasn't edible.\n\nI wish this place would go out of business because it's doing Philly a disservice."
    },
    {
        "id": 173,
        "text": "Last night was my second visit to Makiman, and I was very impressed both times.  Both times I was also with large groups (10+) and the staff couldn't have been nicer/more accommodating, even when my group last night got quite loud after many glasses of sake and wine.  I don't remember my waitress's name from last night, but on my first visit, Malik waited on us and he was great.  Unlike other reviewers, I do not think the sushi was small or overpriced in the least.  I ordered two rolls last night and couldn't finish it all, and I am a really good eater.  My total bill was 25.35 for a ton of food (we also split a bunch of edamame) - to me, that is a fair price for a nice, clean place with friendly service and great sushi.  In my two trips I've had the McNabb, Eagles, Sixers, tuna/avocado, etc.  All really tasty - wonderful fresh fish and produce.  They take reservations, it's a BYO, and I would definitely recommend it for large groups.  They can handle it.  Makiman is awesome and I will definitely be back!"
    },
    {
        "id": 174,
        "text": "We went on a Saturday night after deciding that we need a quick sushi fix that is affordable and fresh. Huge plus that we get to being our own wine! Yes, finding a quality byo that can seat you on a Saturday night is so golden. And I got just that. (So lucky, I know)\n\nWe were promptly seated upon arrival and had our wine bottle opened. We were so hungry!!! We ordered fried kimchi dumplings, miso soup, seaweed salad, spicy tuna sandwich, spider roll, Naruto roll, yellow stallion roll to share between two of us. Did I mention we were hungry? Yes. \n\nEverything was very tasty but the highlight was definitely the Naruto roll. Cucumber wrap filled with fresh tuna, salmon and crab stick was more than enough fix for the sushi need. Also, the service was very quick and friendly!\n\nOne negative was a very large group that was dining when we got there...really loud and since the restaurant layout was pretty open, we were not saved from all the laughter, and borderline screaming of the conversations. So if you're looking for a quiet and intimate night out, I wouldn't go on a Saturday night. \n\nOtherwise, please pay a visit! I can't wait to go back and try out more items on the menu...there are an extensive list of specialty rolls that must be tried!"
    },
    {
        "id": 175,
        "text": "Great sushi!  If you like rolls, that is the place to go. The sushi was fresh too.  I had my birthday dinner there with the girls and we had a great time."
    },
    {
        "id": 176,
        "text": "Went to Makiman Sushi for the first time a few days ago, and now I am just wondering when will we go back again. It was very good!\n\nTo start I wanted to try their clam soup, but they ran out of it, so I went with the pork dumpling soup, expecting something kind of boring (even though I still wanted to have just some soup). Well no, surprise...great flavors, dumplings were delicious, the broth was so tasty, overall best dumpling soup I have had so far. We also had some seaweed salad, felt fresh.\n\nThen we had some rolls. The salmon avocado cucumber roll, simple yet very tasty. Out of the fusion sushi rolls, we had the Ne Viking roll and the Menabb. Both superb.  We usually keep it simple when eating sushi, but the menu is so extensive, that I am willing to take a risk and try other stuff when we go back.\n\nThe place was packed (thanks to living social) yet service was efficient and very friendly.\n\nWill definitely go back."
    },
    {
        "id": 177,
        "text": "I went here with my girlfriend and my parents.  They were visiting from Cleveland and they had never had Bi Bim Bop.  The bi bim bop was good, but was ordinary and average, AT BEST!  I ordered the mexican role (sushi) at the waitresses request and it was pretty good.  We had edamame for the table and it was well prepared.  Sushi size was average, Bi Bim Bop size could easily feed two people.  Served with soup and salad."
    },
    {
        "id": 178,
        "text": "Went in at around 3:30/4pm on a Sunday and was the only customer in the restaurant. They tucked me away in a corner and completely neglected me for the entire meal, I had to get out of my seat to request more water as the waitresses and bartender chatted in the back.\n\nI came in specifically to order the ramen burger. It comes in a foil wrapping to hold it together. The ramen noodles are fried to a crispness so it tasted less like noodles and more like a thin crunchy bun. There is a barely cooked egg that covers absolutely everything in yolk which smells really strong and makes for one of the messiest meals in my life. I honestly don't remember much of the taste other than the egg yolk.\n\nIt might be easier if they give up on making the ramen burger something you eat with your hands and just present it as a fork-knife meal."
    },
    {
        "id": 179,
        "text": "Good service and very quick.\nBYOB (always a plus) \nThe sushi menu is pretty big and they have good deals (3 rolls for about $16.00). Also a good selection of the Special Rolls! Not the best Sushi in the city, but never disappointing either, especially for the price. Try the Sixers Roll! Would have given another star but I feel like they are a little stingy with the actual fish in the rolls.... \nThey always have Groupons or Living Social deals out, but even with out one its not too expensive."
    },
    {
        "id": 180,
        "text": "My roommate and I are repeat orderers of Makiman via GrubHub; everything is always super fresh. From their Veggie Tempura roll to Bibimbap, everything I've ever tried has been seriously great and their delivery is always here within less than a half an hour (our delivery guy is like 60 and he rides a scooter)! Their other location is just as good. I don't normally dine like this, but I really don't feel the need to order from elsewhere else right now.\n\nThe only downside is one of their hostesses on the phone who must have sashimi in her ears. We tried to correct our order over the phone with her a minute after submitting it and spotting a mistake. When the order showed up x2 as wrong as the way we submitted it, she told me it was my fault because I'm the one who said it that way, which wasn't true. She was very quick to imply that I was wrong before hearing me out. Not appreciated, phone sashimi girl!\n\nPhone sashimi girl sucks, but the sushi is great!"
    },
    {
        "id": 181,
        "text": "We picked this place because it was BYOB and we gotten more than what we expected.  Once we arrived, the table was ready for us.  The place wasn't huge, but there were plenty of room and not feeling cramped.  The server attended to us the moment we sat down.  She opened our bottles of wine and chilled them right away and best of all NO CORKAGE FEE.\n\nThe menu was easy to read.  They have the traditional sushi and sashimi plus they have many new creative fushion dishes.  I especially LOVED the Tuna Nacho, so much flavor and crunchy.  All the sushi rolls were beautifully presented.  The McNabb Roll was very creative and delicious.  There was also this tropical roll with mango which was very refreshing.  Another creative dish that they have was the Unagi Bi Bim Bop with eel. This is one of those that was so simple like adding 1+1 together but how can I not have thought about it?  I  had many Bi Bim Bop before, but I never really like the crispy rice part because most were to burnt.  This place made it perfect.  Just slightly crisp but not too hard or burnt.  \n\nOverall, service and food was great.  Friendly Staff and Delicious Food, you can't go wrong.  We had a pretty large group and we were there for a very long time even after we finished all the food, but they didn't rush us or anything.  Some of my friends lives in the area and were excited that they deliver.  I would definitely come back to this place."
    },
    {
        "id": 182,
        "text": "Ordered delivery from here on a Tuesday night through Grubhub. Estimated about an hour for delivery and they hit the mark pretty close.  My first impression upon unwrapping the food was:  why are these rolls so tiny, and did they really need to give us soy sauce packets?\n\nThe fish was of pretty good quality, the yellowtail particularly being the freshest I've had in a while, but my major issue with the sushi was the rice.  It was all wrong: hard, bland, cold, but thankfully not abundant.  Thinking about that rice still makes me shudder; it ruined the whole experience for me.  The fish portion in the rolls is pretty generous aside from the rolls being somewhat smaller than I'm used to, but there was some unevenness to their slicing technique so a few pieces were all rice and avocado with hardly any fish.  \n\nAltogether we ordered dumpling soup, yellowtail scallion, salmon avocado, salmon cucumber, tuna avocado, a rainbow roll, and a special roll I can't remember.  The soup was not very successful.  The dumpling wrappers became mushy and fell apart in the broth, the filling wasn't very cohesive, and the broth was overly smoky miso-flavoured without the cloudy deliciousness of a good miso soup.  \n\nEly enjoyed his special roll the most, and from looking at other reviews and the photos on their hardcopy menu that the delivery guy brought, this seems to be their forte.  However, I find the lack of quality in the standard roll offerings to be a definite deal-breaker, as when I order sushi I'm not interested in spending $10+ dollars/roll for rolls filled with fried things and spicy mayo.  Terryin has not yet been overthrown as our go-to sushi delivery joint even despite their recent quality issues.  If I'm going to get hit-or-miss sushi, I'd rather spend a dollar less per roll."
    },
    {
        "id": 183,
        "text": "Came here for dinner last Friday, seeing the four star yelp review I figured why not, it's always good to try new places, right? Wrong!  The space itself is fine, there is also outdoor dining which is nice, its a byob which is a plus, but the sushi was simply not very good.  I ordered a spicy salmon and a yellowtail roll along with some other specialty roll, they all tasted the same, pretty bland and too sticky, much like whole foods sushi.  Service was fine though."
    },
    {
        "id": 184,
        "text": "3.5 stars\n\nAlthough we were already pretty stuffed from our really late lunch at the Reading Terminal, we still found it necessary to add in an extra meal, which we called dinner... but it was really like a second dinner since our 'lunch' at Reading Terminal was so late, and so... large.  Even though almost no one was hungry, we went and ordered lots of food - edamame, agedashi, lots of rolls, and even dessert.\n\nWe brought our own wine since it's BYOB.  The Sweet Potato and Crab Tempura Roll was interesting.  I think the food was pretty standard, nothing extraordinary, but it was good.  \n\nService was also good.  We had a good time."
    },
    {
        "id": 185,
        "text": "3 roll lunch special with miso soup.  YES, a go to sushi place....finally! I should have taken a picture.  \nIt is really hard to find a sushi place that's consistently great.  First I loved raw, then Fuji mountain, and now Makiman.  I don't think I'll be switching it up anytime soon.  \nNot only is their sushi über fresh, but the menu items really appeal to me, and I feel the prices are very fair."
    },
    {
        "id": 186,
        "text": "Makiman Sushi holds it down near the Kimmel Center on Spruce Street. They also have a location in Northeast Philly as well. On Mondays, they have an all-you-can-eat sushi special (you know what that means - but a deal is a deal). Pro tip? It's a BYO! So with a bottle of Beringer Sauvignon Blanc in tow, the GF and I stopped for by dinner.\n\nSalad\n\nWe got one of the larger party boat specials, which came with salad to start. This came dressed with standard ginger dressing that was slightly watery, atop field greens, carrots, and cucumber. Some of the pieces of lettuce were a bit wilted, but other than that - fairly standard.\n\nSpicy Tuna Tartare [$9.95]\n\nThe tuna tartare had good flavor, but was a bit too finely 'chopped' for my liking. There was nice texture from the crispy tempura chunks throughout and tobiko helped to provide nice bursts of flavor as well. \n\nVegetable Tempura [$6.95] \n\nWhile the tempura was a bit over-battered and could have been crisper, the veggies were well-seasoned and fresh.\n\nRock Shrimp [$9.50] \n\nThe rock shrimp's batter was better - crisp and well-seasoned. The juicy shrimp was tossed in a sauce that nicely balanced between sweet and spicy. \n\nMiso Soup\n\nThe miso soup was pretty standard with small cubes of tofu. The broth wasn't overly saline, which I appreciated. \n\nParty Boat 1 [$34.95]\n\nThe Party Boat 1 was plenty of sushi for 1. A bounty was on offer, including maguro (tuna),  kurodai (black sea bream), sake (salmon), hirame (fluke), hamachi (yellowtail) with scallion/yuzu, suzuki (striped bass), sweet ebi (cooked shrimp), and saba (mackerel) with jalapeno to temper the mackerel's intensity. Overall, the sushi was fresh. We also received \"white tuna,\" which was really escolar (which I love due to the high fat content). The tobiko and pickled ginger helped to offset the fattiness.\n\nCalifornia Roll \n\nWe also received a California roll, which was standard, but the GF loves its simplicity.\n\nUni / Sea Urchin [$6.50] \n\nI had to order the uni, which had decent butteriness, though didn't taste especially fresh.\n\nSweet Potato Roll [$5.50]\n\nThe GF always craves the sweet potato roll (won't lie - I love it too). This particular order was especially starchy and wasn't crisp - a let down. \n\nThe service was friendly, though wasn't completely knowledgeable. Perhaps we came on an off-night, but the sushi rice was a bit too cold and seemed over-cooked and overpowered some of the sushi. Makiman Sushi offers an affordable option for sushi in the city, but there are definitely better BYO options out there."
    },
    {
        "id": 187,
        "text": "Good service, but very average sushi. Sushi was pretty good, but nothing amazing. I wouldn't go out of my way to come here. The sushi roll I like the most was cooked (Bulgogi roll). Overall, there are better sushi places in the city."
    },
    {
        "id": 188,
        "text": "\"Do you like it raw?\" the menu asks me as I first gaze upon it. I ordered the McNabb roll after my favorite former Eagles footballer, and it was as delicious as Donovan was in his prime. This restaurant is great for groups, love the BYOB, and I definitely love it raw"
    },
    {
        "id": 189,
        "text": "I had heard a lot about this place when it opened but didn't get a chance to check it out until recently. All in all I had a good time there, the waiter knew what he was talking about and suggested some great dishes. \n\nWe bought a bottle of wine and our waiter immediately threw it in an ice bucket and was rather attentive to our needs all night. good experience. def check it out if youre in the area."
    },
    {
        "id": 190,
        "text": "Tried this with a groupon for the first time last nigh.  Never again.  The poorest service I've ever had in the city: ignored upon entry- took forever to be seated in an empty restaurant. It then took forever for someone to take our order... at which point, they got it wrong. I had to wait an additional 20 minutes for them to get the right order.  The starter came after the mains (I had to remind them to bring it) and it took forever to get a drink..or a napkin...or...anything. \n\nFood was so-so. Not terrible- not that good. Only 4 shrimp on the shrimp tempura dinner... Bi bim bop in hot stone bowl...served in a tepid bowl. \n\nNever again."
    },
    {
        "id": 191,
        "text": "Groupon saves a lot of asses, including this place.\n\nMaybe 2 stars, but the service sucked. \n\nI didn't have high expectations, and still I was disappointed.\n\nService is slow and somewhat apathetic (I didn't know who our waitress was for 15 minutes, water took another 15... etc) to the point that I wanted to go old school Korean and tap my chopsticks on the empty glass of water. The table in front of us was not wiped down until right before a customer came (which was almost at the end of our meal).\n\nAppetizer: the tuna nachos- promising, but too much sauce and not enough fish. \n\nWe got the Sushi Boat for 2, the McNabb roll, New England Roll, Shrimp Tempura Maki roll, and all were just blah. If I had to choose, the best of the 3 was the McNabb.\n\nThe salad that came out looked like the dressing and the components were all assembled in the morning (it looked flat). The miso soup was just OK.\n\nTHE SUSHI IS NOT FRESH. It looked and tasted like it's been precut and been sitting out for a while. The salmon sushi was odd (I should've taken a picture of it) because it was sliced so thin that the rice was showing between the fenestrations of the fish.\n\nLuckily, we had a Groupon. Otherwise, I would've been considerably angry after my meal."
    },
    {
        "id": 192,
        "text": "It's no secret that my bf and I love sushi - it became such a problem that (without telling him) I put a temporary ban on sushi consumption because jeez does it add up on my bank statements! But to convince him to accompany me to the Kimmel Center's free holiday tuba concert, I enticed him with the promise of a sushi dinner. \n\nWe've passed Makiman Sushi endless times but never tried them because I don't like how some of their special rolls are priced (seriously, combinations are not that unique and cost more than at most other places, but in particular you pay waaaaay more for raw - ridiculous considering their slogan is \"Do You Like It Raw?\"!). But Makiman is right across the street from the Kimmel and since we had limited time to go from the concert to dinner to a holiday party we went there. \n\nThe servers were really great, very friendly and eager to explain the menu if we had questions. We didn't want to spend too much, which influenced our choices. I had miso soup (fine) and my bf had the pork dumpling soup (yum!). We shared the tuna tartar, which was tasty, and three rolls: blind date, tiger, and a vegetable roll I can't remember. The rolls were fine, nothing special, and the fish quality was good but nothing to squeal over. The rice was kinda...meh...and there was too much of it. With rolls like these, I should be able to fit the whole thing in mouth tiny mouth, but I had to either bite a few in half or remove rice from the exterior. At the end of our meal, my bf turned to me and proclaimed that he never wanted to eat there again. I countered that if we were ever in a group where some wanted sushi and others didn't, Makiman would be a good compromise AND would probably be able to seat a group for sushi, unlike all of the small sushi joints elsewhere. So now I know that we will probably never, ever get sushi from there again, and I can live with that. There are more than enough choices with better fish, better special rolls, and better or at least equal prices."
    },
    {
        "id": 193,
        "text": "Walked past this place probably a thousand times without a second glance. \nAfter my instagram pals foodchasers left a photographic review I had to try for myself, and I must say I'm glad I did,  I have been here multiple times since and my favorites are most certainly the  MM Naruto, Eagles, Boston, and Tropical storm rolls. Very reasonably priced for the quality and portion sizes. Next time I plan to try the ramen burger as it has tempted me during past visits. I also love their tag line and wish to buy the shirt, \"Do you like it raw?\" Very funny."
    },
    {
        "id": 194,
        "text": "I have been going to the Makiman in the NE for a few years. Since moving closer to center city, I was excited to hear that a Makiman was opening in center city. The food is just as good if not better than the one in the NE. We ordered about 8 rolls and every roll was very good. The Sixers rolll (shrimp tempura on inside and spicy tuna on outside) was one of my favorite.  There was also this Mamma roll that was very large and had egg in it- it was nothing like any sushi that ever had  and it was amazing and unique. I also loved the Sweet Potato roll. I've also never heard of an Atkins roll and wasn't sure about it until I ordered it. The Atkins roll is a hand roll and is made up of fish and radish (instead of rice); to my surprise this was delicious. \n\nMakiman has a very large selection of sushi and other meals. Prices are reasonable. Service was great. It's byob which is great but they do charge a nominal cork fee (which I never encountered at the one in the NE and don't remember seeing that on the menu). I was there on a Friday night and the crowd was mostly young adults and it was pretty busy so I recommend reservations for weekends. I will definitely be back."
    },
    {
        "id": 195,
        "text": "They have a great lunch special...5 pieces Sashimi and a roll for 10.95...sea urchin sushi was good...miso soup not so good..overall good service, fresh sushi, great deal"
    },
    {
        "id": 196,
        "text": "The first dish was served with rancid oil\nThe order was wrong\nThe fish tasted fishy\nThe soy sauce was \"off\"\nThe rolls didn't taste right. \nThe mochi ice cream was even bad. I didn't think you could screw something up that comes from a box\nThey were nice and took the rancid order off the bill, but I would never come back. Probably the worst sushi I've ever had."
    },
    {
        "id": 197,
        "text": "My first trip to Makiman was eat-in. Service was good enough. Servers in t-shirts made me feel like I should be in a much more casual-looking place, but I won't hold it against anyone. The food was good, but sad. One special roll was tiny. Another was huge, but the two ends of the five-piece roll were barely filled and fell apart. The yellowtail-scallion roll was cut into long pieces so all I could taste was nori. Meh.\n\nMy second trip was take-out. The eel/avocado roll was decent but I've had better. The Philadelphia roll was a mouthgasm and earns a star just by itself. The seaweed salad, a staple in my sushi meals, was soggy and too lemon-y and I didn't even want to finish it, which says a lot. Meh.\n\nI agree with other reviews that the ingredients are, indeed, fresh. But my experience so far has been as bland as this review."
    },
    {
        "id": 198,
        "text": "Great food.  Reasonable prices.  Volcano roll is amazing.\n\nWould give 5 stars but service is slow.  And when it isn't slow, it seems like the waiters are trying to kick you out."
    },
    {
        "id": 199,
        "text": "At first I was reluctant to go to this sushi place because of its silly name but I went after my friends persuaded me. I'm not a big sushi fan and didn't know what to order. A waitress named Chau was very helpful. She helped me pick out what is good and explained what fish are in which rolls. She knew a lot about sushi and explained to me the difference between rolled sushi and nigiri sushi. My dinning experience was great. I will go back the next time I crave the NE Viking roll."
    },
    {
        "id": 200,
        "text": "Back in March, we were trying to figure out where to go to avoid both the amateur hordes of St Patrick's day drunks, and the short attention span cheering of march madness. After some discussion, the answer struck us; Sushi!. Our party of five wisely made a reservation, as we arrived to find only two tables unoccupied on a busy Friday night. We had to wait a few minutes while the hostess quickly prepared one for us.\n\nMakiman seems a bit of a tight space at first. There isn't much of a lobby or waiting area, and the front door pretty much puts you right into the center of the restaurant. There are two slightly separated dinning areas, each with about a half dozen tables, and another sushi bar area further back. Once we were seated, it didn't feel quite as small, and impressively the overall noise of the room didn't make conversation impossible. New guests arriving do end up waiting right in the middle of everything,\n\nIt's a BYO, and our server spotted my bottle of sake and asked if I wanted it heated, which I declined, instead asking for it to be chilled with our beer. As an aside, if you bring sake, check how it should be served, like wine different types of sake are served differently. She brought out the appropriate glassware and we started opening our bottles.\n\nThe soup and salad were pretty much par for the course, the usual miso soup and seaweed/microgreen salad you get at most sushi places. We also started with an appetiser of spicy rock shrimp tempura, which was fantastic, the sauce, tempura batter and shrimp were well balanced and didn't convey the greasiness of everyday tempura.\n\nFor entrees, most of the table chose a mix of rolls and pieces, but I went for the Chirashi. It came out with several generously sized pieces of several different sashimi, including tuna, salmon, shrimp, octopus, among others. It was well presented in an angled bowl atop a good amount of sushi rice, ginger and wasabi. Each type of sashimi tasted fresh, but I thought the salmon and tuna were the best of the group.\n\nAnother friend of mine chose one of the bi bim bop bowls, and that will certainly be something I go back for. They have several different options to choose between. The various rolls I saw around the table certainly looked tasty as well, and I managed to trade for one or two to confirm that.\n\nWe also chose to go with deserts, and both the banana tempura and ice cream proved a good choice to split. On a future visit, I'd definitely recommend the banana tempura. Also, we enjoyed the wooden boats being carried out filled with sushi, which would be a fine choice for another time.\n\nThe bill was reasonable, and being a BYO you can bring in ample sushi or other drinks to enjoy with your meal. Given the location, Reservations are probably a must over the weekend. They also do takeout and delivery it seems."
    },
    {
        "id": 201,
        "text": "This is one of the hardest ratings I have had to come up with. My experience can definitely be summed up as hit or miss. \n\nHITS: outdoor seating, BYOB, the shrimp tempura, \n\nMISSES: the quality/freshness of fish, corking fees, service\n\nI checked this place out because I had a groupon but don't think I will be back. Maybe I caught them on a bad night but the fish didn't cut it especially with all the other options around town. Looking at \"are these photos helpful\" none of the presentations for my rolls came close to those quality. In conclusion, yes I have experienced better."
    },
    {
        "id": 202,
        "text": "I have eaten in here twice - both times with a voucher, and gotten take out once. \n\nThe service is great, and the restaurant is really cute. It's a BYO which is nice, and they will bring out stands and buckets for wine/beer. The sushi is great, don't get me wrong - but the rolls are small. A normal spicy tuna or salmon and avocado only has 6 pieces. If the prices were cheaper accordingly, that would be fine - but they are on par with all of the other sushi places that give you 8 pieces.  Some of the special rolls only have 5! \n\nThe take out was fast, only 15 minutes- and they deliver too, which is a plus. \n\nFor dessert, try the fried banana and icecream - very tasty and a pretty big size.\n\nSince school is almost out for summer, I intend to come here next week for lunch and try the lunch specials - since they are such great deals, it won't matter too much that the rolls are smaller."
    },
    {
        "id": 203,
        "text": "Came here for lunch, got the lunch special. The salmon nigiri was very good and fresh :)"
    },
    {
        "id": 204,
        "text": "Just got back from dinner here with the boyfriend. We wanted to check this place out because of the Groupon we purchased back in December.\n\nThe boyfriend got the Bi Bim Bop with Eel that also came with a salad and soup.\nI got the NE Viking Roll.\nBoth dish were pretty satisfying. =)\n\nThe dishes here were pretty spicy but pretty good so I think I would come back again.\n\nOh, and all the waitress and waiters were pretty young which I don't know why but it surprised me. Our waitress was nice though. =)\n\nThere were actually more people than I expected to be there.\nAnd parking was hard to find!"
    },
    {
        "id": 205,
        "text": "You won't find the most amazing sushi or service here, but it's a decent BYO place for a casual night out. I came here recently with 2 of my girlfriends. We had no trouble getting a reservation on a Friday night. There were actually only 2 other tables eating there the whole time we were there. \n\nThe service is pretty awful, as echoed by many of the yelp reviews before me. It took a long time for any server to come over to greet us. We had to flag one down after about 15 minutes to get some water and a bucket for our wine. The servers do the bare minimum here- took our order, dropped our food off, gave us the check. The one plus is that they let you sit for as long as you want.. I appreciate that they didn't rush us out, so that we could finish off all of our vino! Also no corking fee which is pretty standard for a Philly BYO. \n\nWe started with the edamame, which was typical and good. Not a huge portion, but enough for the 3 of us. We then each got the choose your own makiman special which is 3 rolls plus miso soup and ginger salad. This was a good deal and a lot of food for the price. The miso soup and ginger salad were both very standard, nothing to fault there. The rolls I got were shrimp tempura, spicy tuna, and salmon and avocado. They were fine for basic sushi but nothing special. I wish the spicy tuna had some tempura flakes to add some texture. \n\nOverall, this was not somewhere I'd rush back myself, but wouldn't mind going if someone else suggests it."
    },
    {
        "id": 206,
        "text": "It's nice to know that you can find a sushi serving BYO in Center City that's fresh & tasty and not horribly priced for the location.\n\nThe sushi was good (NE Viking Roll was particularly ohm nom.)\nThe server - attentive but not overtly so.\nThe atmosphere wasn't cheesy or too trendy.  \nClean bathroom, FTW!\n\nWhen we arrived just before 6, the place was empty - but it was hopping by the time we left.\n\nDefinitely would go back - and would try the Korean food too!"
    },
    {
        "id": 207,
        "text": "Acceptable sushi. Shared the: salmon, yellow fin tuna, striped bass sushi, California roll, miso, and shumai dumplings. The shumai came cool, which was a bit disappointing. Nothing extraordinary with the sushi, but not bad either. Worth a trip and remember it's a BYOB"
    },
    {
        "id": 208,
        "text": "Had lunch here with a work colleague.  I got a variety of sushi fish a la carte.  It proved to be an expensive way to sample the menu.  Nothing stood out.  The yellowtail, salmon, and sea urchin, for example, were all solidly average.  If I were to return, I would go for one of the lunch deals, which seem to provide fair value.  Decor is standard-issue sushi joint with dark wooden furniture."
    },
    {
        "id": 209,
        "text": "If you search Yelp for Sushi in Philadelphia, Makiman is number 3 of the 153 matches.  This is a really good rating and Makiman was only a few blocks from my hotel so I thought I'd try it.  Maybe my expectations were too high, because I thought it was just a bit above average.  I'd give it a 3.5 and I'd go back, but I think I would rather check out a few other places first.\n\nI was sitting at the sushi bar and I avoided ordering any generic white fish because a few pieces looked old and dried out at the edges.  I was able to see what I was going to be ordering and all of the nigiri and maki were good.  Service was a bit weird, three different people wanted to take my order and later when I needed the tea refilled, no server was around.  The guy working the sushi bar would have taken care of it, but he was busy and I didn't want to bother him.  If I caught them on a bad night, their good nights are probably very good."
    },
    {
        "id": 210,
        "text": "Solid sushi BYOB. I have eaten at the restaurant and had delivery. Every time it has been very good, reasonably priced, convenient location, usually never busy for a weekend night dinner. It is a go-to BYOB spot. Went one night with friends and drank many bottles of wine and were there for awhile but they did not rush or hurry us up. They let us just hang out which was nice. \n\nI always order the rainbow roll, spicy tuna, and salmon avocado rolls. No complaints they are always great! And they have brown rice if you ask. \n\nFor what it is, it is a great spot!!"
    },
    {
        "id": 211,
        "text": "I feel bad leaving two stars for this place because my lunch partner recommended it, but I wasn't impressed. \n\nThe restaurant was nearly empty at lunchtime on Friday, which seemed odd. There was one server working and he was running around the whole time so we didn't see him very often. We had to call out for water refills and flag him down for the check. \n\nI ordered a special roll with spicy tuna inside and torched salmon outside, plus a king crab roll. It's pretty unlike me to not plow through my sushi, leaving no trace, but I actually didn't even finish my rolls. They were fine, but not exceptional. My friend had a few of the larger special rolls and the pieces were cut so large she actually ended up choking on one - thankfully, she was fine.  \n\nThe final nail in the coffin was when I went to wash my hands in the restroom and saw how filthy it was. I will not be returning, or ordering from this establishment, again."
    },
    {
        "id": 212,
        "text": "I really have tried to like Makiman. It is right around the corner from my boyfriend, and I have eaten and gotten take out a handful of times, but have never really been satisfied. Their food is very affordable, and if you don't mind settling for low quality sushi or just okay bi bim bop, you may be okay with Makiman. If you expect more than mediocre, you should probably try somewhere that isn't located in a shopping plaza."
    },
    {
        "id": 213,
        "text": "Haven't tried the sushi yet, but I had been looking for a decent place to pick up Korean food for lunch.  Just got bibimbop and must say that it's pretty good!  \n\nI'm picky with Korean food because I won't pay for what I can make at home.  I've been looking for a decent Korean restaurant in Center City (for lunch), but the other Korean restaurants that I'd been to in Center City were just 'eh'.\n\nMakiman Sushi has very decent bibimbop.  The lunch bibimbop comes with a side miso soup. I'm looking forward to trying other things on their menu.  Too bad they don't have a large variety of Korean food--I guess it's primarily a sushi place."
    },
    {
        "id": 214,
        "text": "It was really fun sitting at the bar, watching the roller and seeing all the fresh fillets of fish.  The guys who work here really take pride in what they do and are eager to answer the questions of newcomers to sushi... like me.\n\nMaybe you read my previous review I hadn't tried sushi in 15 years. So i was eager to try another sushi restaurant.  Again, everything was delightful!  Presentation was excellent and the service was extremely considerate.\n\nWe came in later at night, maybe around 10. The restaurant is a byo and there was a large party of girls behind us.  They were very very loud, but really nothing for which you could blame the restaurant.  I can't wait to go back.\n\nBYO\noutdoor seating\ndelivers"
    },
    {
        "id": 215,
        "text": "Went there on a Monday night for all you can eat sushi, $27+tip/tax which is a little expensive for the quality. First order the waitress forgot my order while everyone at my table had theirs. The sushi has toooooo much rice. I only order a few things but I was too full from all the rice.  The quality of sushi? uhh most sushi places in the city are okay, I love how everyone is like, this place has the best sushi place or the freshest fish... but seriously unless you are going to morimoto or zama, you probably aren't getting the creme of the crop sushi. That being said, the items offered for the all you can eat is very limited. There weren't many special rolls offered and if there were, there were far from special.\n\nThere was a 30-minute span of when our vase of water was empty. Seeing how we had a group of 7 and all you can eat sushi/ soy sauce can make you thirsty, the waitress should at least knowledge to give us water. Every other all you can eat sushi places have hastily refilled our water. When we asked to split the check for each person, the waitress looked all bitchy. Well that's what you get for shit service.\n\nSo I ended spending $36 for awful sushi with too much rice... the rice wasn't even good, some of it was not even cooked thoroughly. With $36 I could have a delicious  meal at yakitori along with some imported beer during happy hour or their specials."
    }
]