[
    {
        "id": 1,
        "text": "1st time here. We were headed to Terakawa with the family on a cold Friday night, but they had a line out the door so we went here. Glad we did...\n\nExcellent service & friendly staff. Waitress helped my wife take off her jacket as her hands were full with our baby, as I was tied up with the 3yr old.\n\nI had Chicken Katsu Curry Ramen, Sister had Shrimp Katsu Ramen & Wife had Shoyu Ramen. Everything was excellent, I loved mine. Curry soup was tasty &I the fried chicken was done just right. Same for my sisters shrimp, fried just right with good quality shrimp. My wife lived her Shoyu Ramen.\n\nWe also got the pork buns which were excellent, but not your traditional porkbun. \n\nGreat, great experience."
    },
    {
        "id": 2,
        "text": "1st time here, my three friends and I ordered 4 bowls of ranmen and 4 cans of melon cream soda . I will say my curry katsu ramen was the best I've ever had and i just had Nom Noms ramen the day before. The staff was awesome and attentive.  I even booked my bday party here for next month. 100%/100%\n\nIn addition, the Kustu was crispy and the broth for my curry ramen was light and not over powerd by salts. The eggs were perfect again I just had nom noms the day before , and my 3 eggs from nom noms were cold.\n\nSo out of  our table group of four, 3 guest gives Naoki 10/10  and 1 guest gives it 6/10. \n\nMy background is in Asian culinary arts and hospitality."
    },
    {
        "id": 3,
        "text": "I like everything. I love the ramen noodles here. They are pretty good but i don't see much people come there. Prob they need to advertise more or do something to make more people come to eat."
    },
    {
        "id": 4,
        "text": "Food was very good and service was excellent! Very accommodating for a service dog. Would definitely recommend coming here if Terakawa has a long wait. Atmosphere is great."
    },
    {
        "id": 5,
        "text": "So I found myself in Naoki ramen after a long day of running around Philadelphia; and after reading about it in a newspaper article giving it a spectacular review I just had to see for myself. As we walked in, they were putting up a sign saying that for students with a government issued ID; food was 10% off. I of course just happened to have my campus ID card and they were only too happy to let me use it. Then came the menu. It's a bit sparse, but that's really what makes the food so affordable and good; it allows for the chef to prepare a dish quickly and to the best of his ability; as well as cut down on excess expenses to keep countless different ingredients in stock. Subsequently, the cost of the food is unreal, it's less than 6 dollars for a full cut of chicken Katsu, which for us came out in a matter of minutes. Not only was it speedy though, but there was just so much of it! The bowl that the ramen came in was huge; and compared to the costs of other nearby restaurants, would have easily cost 15 instead of 10. Overall, I was very happy with the wonderful, bubbly service as well as the quality, cost, and quantity provided ^_^\n\nAlso, the waiter just made the experience much more enjoyable; I don't understand why people would see him as annoying.. Just be a bit more social, eating is a social experience too."
    },
    {
        "id": 6,
        "text": "On Wednesday 6.30pm it was pretty empty. Just another table taken. Miso tasted much better then at Nom Nom Ramen."
    },
    {
        "id": 7,
        "text": "This is my second time here, I will say the food is worth the price. I got the lunch special which is about $2-3 less than the regular price. I got the gomoku ramen which has a shio base soup. The soup is not too salty, the noodles are cooked right, it isn't especially chewy (not a fan of chewy noodles). I also had my friends chicken katsu. The chicken is juicy but it was quite oily. Good thing the oil looks fresh. I took a good look at the menu. They have a variety of food, not just ramen. Th ey have rice and udon too. The ambience is nice, I came after lunch so it is quiet. It is clean and spacey. You can bring strollers here if you have children. I will come back again."
    },
    {
        "id": 8,
        "text": "Amazing food! I got the miso ramen and it was very flavorful and filling. The bowl is huge for the price and I couldn't finish it all. Over the restaurant was very clean and the staff was super sweet. I'd definitely recommend this place."
    },
    {
        "id": 9,
        "text": "I have high expectation when it comes to ramen. I noticed this place for a while and decided to stop by with my SO to check it out. The staffs were friendly and seated us right away. The interior is a little spacious and has a lot of seatings which is great for family and groups. Like some reviews, I agree that the broth is not as flavorful and it somehow tastes similar. The noodle itself was a little soggy as well. However, on the positive note, the service was very good, the staffs were very attentive and our food came out fast and hot. For about $11-13 the portion here is very generous, your belly will be fully satisfied :) Perhaps it was a bad day but this place has potential. Might come again in the future"
    },
    {
        "id": 10,
        "text": "Worst ramen in Philly. The soup was greesy and bland, the noodle was not great, and the meat was super fatty pork belly. I have tried every ramen restaurant in the city, and I can't say that I like all of them, but none of them makes such terrible ramen. They kept most of the items from Rai Rai on their menu, but the taste and quality are not even close."
    },
    {
        "id": 11,
        "text": "Decided to give it a second tries and I think it's much better this time. The waitresses are polite and food is quick."
    },
    {
        "id": 12,
        "text": "I love noodles so ramen is surely one of my favorites but this place was not a favorite. I ordered the Shio ramen and my friend ordered the Miso ramen, in both our opinions, they were both quite salty. It's flavorful don't get me wrong, but it was a tad too salty that made us extremely thirsty. I have  to mention what was being shown on the tv screens, it was animals that were wounded and it was pretty gross because that is not something I want to be watching while I'm eating. The workers there came out from the kitchen and was literally shouting across the room to one another, the atmosphere here was horrible. I don't think I will be returning here but it was nice to try."
    },
    {
        "id": 13,
        "text": "Was in town for the day.   Had severe dishes with the family. Overall a great experience with excellent food and service!"
    },
    {
        "id": 14,
        "text": "This was my first time in China Town Philly. I was overwhelmed with all of the food choices. However, my heart led me here. It did not disappoint. Very friendly staff and the fried chicken curry was delicious. The food came out fast and the wait staff was very attentive. I'd come here again."
    },
    {
        "id": 15,
        "text": "Stumbled into Naoki after the wait at Terakawa turned out to be 1 hour+, and was very pleasantly surprised. Ambiance wasn't that fancy, but the service was friendly and food was amazing. It was BYOB so we were able to enjoy the bottle of sake we already had in hand. I got the chicken katsu shoyu ramen. The chicken was crispy, juicy and a delicious complement to my near perfect bowl of ramen. SO got the vegetarian shio ramen with friend shrimp and really liked it. We both left feeling full and making a note to get back there the next time we want a simple but decent bowl of ramen. With a side of edamame, our total was only around $30."
    },
    {
        "id": 16,
        "text": "I had the seafood udon, it was a good size bowl. The broth was a bit salty, but it was well put together. The noodle tasted fresh and loved the mussel and crab stick."
    },
    {
        "id": 17,
        "text": "Had the spicy miso ramen. Soup was lukewarm and taste was very bland, almost a water down instant ramen and the egg was still cold. \n\n2.5/5, giving 3 stars because I'm generous."
    },
    {
        "id": 18,
        "text": "The ramen was delicious. Not quite like it's neighbor that is always packed. But it was well worth the meal. Get the hot & spicy ramen...friendly staff and quick food turnaround time."
    },
    {
        "id": 19,
        "text": "Absolutely loved this place. The ramen was soooo good! Huge bowl with lots of seafood and the broth was amazing. The service was also great. Our waitress was friendly and polite and the food was out very quickly. I also enjoyed the relaxing atmosphere of this place. Check it out!"
    },
    {
        "id": 20,
        "text": "Probably not as good as terakawa but it's right around the corner and there's never a line! I'd urge people that are waiting to eat at terakawa to skip the obnoxiously long line and give this place a try. It's bigger in terms of area than terakawa and again there's no line! The ramen was decent and the prices were right. Certainly worth a visit."
    },
    {
        "id": 21,
        "text": "Had Miso Raman, very salty. But great customer service! Maybe Miso Raman are suppose to be salty? Idk, but it just doesnt taste good for me. Nvm just talked to the manager, he is eilling to make it less salty. Great service!!"
    },
    {
        "id": 22,
        "text": "Great food and atmosphere.  Staff was very polite and the prices were reasonable (about $50 for 4 people).  Fancy, yet affordable.  I don't think I'll ever be able to eat instant ramen again!  This is now a MUST VISIT for me and my friends, when we go to Chinatown!\n\nEdit:  Almost forgot to mention the cleanliness of the bathroom!  It may be a single bathroom, but the set up was very high end!  \n\nOverall, it was a great experience and awesome memories to have with friends."
    },
    {
        "id": 23,
        "text": "I have never experienced such bad customer service before. My friends and I came there to try their ramen, but little did we know we will be treated so badly by the bald waiter. He literally threw the bill at us and rudely grabbed the bill as well. Save your time and avoid this place. There are better ramen restaurants with exceptional customer service around the area."
    },
    {
        "id": 24,
        "text": "This place is great for lunch. I love that they have a large variety to choose from. Not only that but the service is amazing. I highly recommend that you check it out."
    },
    {
        "id": 25,
        "text": "So today me and my wife decided to try this out. It use to be Rai Rai Ramen and they were good. But today after trying the ramen out. It wasn't disappointing but it wasn't great. We had the takoyaki the fried oysters Gomoku ramen and Hakata ramen. The app was good but the ramen broth lacks flavor and depth. Both are shio soup. The noodles it self is ok but I like mine medium well. Other than that everything was good. Food came out on time. Service is good (don't like servers that are too attentive) plus free sodas when you order ramen. The price though didn't match the ramen $10.00 to $11.00 for a bowl of ramen that lacks flavor. You decide. That's why it only gets three stars"
    },
    {
        "id": 26,
        "text": "Great place to hang out with my friends over the weekends. I was very impressed by the Spicy Akamaru Ramen, definitely recommend it! The appetizers were awesome. We had Takoyaki and Pork Bun."
    },
    {
        "id": 27,
        "text": "Good ramen and soup base situated in convenient spot of Chinatown with the newly furnished space. Good to come another time when craving noodles. The menu choices are somewhat limited."
    },
    {
        "id": 28,
        "text": "Terrible service. Meh food. \n\nMy boyfriend and I gave Naoki a try instead of Terakawa. We sat down and one of the staff (not sure he was a manager or owner) asked if we wanted hot green tea or ice water. We asked for hot green tea without knowing the extra charge ($1 each) for it. I felt like we were scammed, but it was kind of our fault for assuming it was free. \n\nWe ordered miso ramen and shoyu with chicken katsu. Chicken katsu(which was good) came in first. So we started eating them and ended up finishing it before shoyu ramen came. The staff kind of yelled at us saying \"you should have waited for the ramen. Chicken katsu is supposed to be on the top of ramen. You ate all of them already!\" Um excuse me? Then why did you bring the katsu out 10 minutes before the ramen? You should serve them at the same time. Or at least let your customer know that the katsu goes on the top of the ramen. \n\nRamen was so-so, but didn't feel welcomed there. We felt like a burden, not a guest. I'd rather go to Terakawa just for better service."
    },
    {
        "id": 29,
        "text": "The best Ramen in Philly! Chicken Katsu Curry Ramen and Chicken Katsu Shoyu Ramen are my favorite!\n\nThe boss and waitress are so friendly！\n\nAccept credit card, and don't need waste time to wait a table!"
    },
    {
        "id": 30,
        "text": "EXTREMELY RUDE CUSTOMER SERVICE!\nThe food was decent with reasonable price and portion, HOWEVER, I will not be coming back unless they change their way of serving customer. Our waiter ( the bald guy) was giving us attitude, threw the bill at us and basically just took our bowls away while we were not done with our food yet. I have never had experienced such a bad customer service like in this restaurant before, so I will take my money where I get treated with respect! For a new restaurant, they really need to improve in their customer service if they want to be in business..."
    },
    {
        "id": 31,
        "text": "Really nice comfy place in Chinatown on Race st. Got the seafood ramen since I love seafood in general and it was amazing. Had mussels, crab, sushi paper and more along w the pork buns which are also really good. Our waiter Hak was really fun too so bonus points there lol. Def a really good experience and the price is fair."
    },
    {
        "id": 32,
        "text": "Best seafood ramen ever!  We went there on a rainy day and had hot & spicy seafood ramen.  It was delicious and price was right!"
    },
    {
        "id": 33,
        "text": "Decided to eat here because another place was crowded and have to say this place may seem a little unassuming but the food was awesome. Service was great and the food came out hot and tasty. Maybe a little lacking in atmosphere and could use a few more choices of condiments on the table but this place is solid and I'd definitely come back."
    },
    {
        "id": 34,
        "text": "I stumbled by this spot yesterday with the intent of getting pho, but I am so glad that I chose to check out the ramen here instead. This must be a new establishment because I did not know about it prior to passing by yesterday, and apparently not a lot of other people know about it either considering I was the only customer in the entire restaurant for a solid hour yesterday evening. The selfish side of me wants to keep this place on the low, but I will do my civic duty as a Yelper and tell the whole world about how awesome this place is because Naoki Ramen truly deserves a 5 star review. \n\nI started off with 2 pork buns as an appetizer. These pork buns were phenomenal. A lot of ramen places do not get the pork buns right (the pork is either too dry or the texture of the fluffy buns is off), but this place hit the nail on the spot. The pork was juicy and flavorful, and the fluffy buns were actually fluffy, as the name implies. For my ramen, I chose to go with the Spicy Akamaru Ramen which came with 3 pieces of pork, an egg, naruto, and all the other toppings for just $12.95! I personally thought that this was a great deal given that other ramen places always try to pick at your wallet by offering minimal toppings so that you have to order extra toppings on the side. In this case, I did not have to order any extra toppings because they were plentiful to begin with. Furthermore, the portions here are huge. I can usually inhale an entire bowl of ramen in one sitting, but I had to take half of mine home last night. The noodles were cooked to the perfect texture, and the broth was spicy and had a lot of flavor. If you love spicy food, I highly recommend the Spicy Akamaru Ramen. Usually after eating ramen at other locations, I tend to feel greasy and bloated, but I did not feel this way last night after eating the ramen here, which was a major plus in my book. \n\nAside from the delicious food with fair prices and large portions, service was quick and friendly. Not to mention, the restaurant itself is very spacious and open with lots of seating. The interior is embellished with a lot of Japanese-themed decor, giving the restaurant an authentic Japanese feel. For drinks, this place offers a variety of Japanese sodas, along with hot tea and regular coke products (no alcoholic beverages here). So, if you're ever craving ramen, definitely give these guys a try."
    },
    {
        "id": 35,
        "text": "The ramen is good. BUT. The chilli pepper sauce they have on every table is AMAZING. Worth it to eat ramen here just for that sauce. Seriously. Also! The vegetarian option they have here is pretty good! I've been to a few places where the vegetarian ramen was abysmal so that makes me happy :)"
    },
    {
        "id": 36,
        "text": "This is my 2nd time in here since grand opening in December of last year.  I had the fried chicken wings. They are awesome.  Crunchy on the outside and juicy inside.  I also had a bowl of Gomoku Ramen. The soup is light and I don't feel heavy and guilty after finishing to the last drop.  It really hit the spot."
    },
    {
        "id": 37,
        "text": "Great service, friendly staff, and great ramen! We tried the curry ramen, oxtail ramen, octopus balls (tee hee), and pork buns. All 4 were great, especially the octopus balls. I noticed that a lot of reviews compare this place to its neighbor, Terakawa, and having been to both, I can say that they both offer a different experience. What I like about Naoki, which you just can't get next door, is a much more relaxed vibe and way more comfortable seats! We didn't have to wait 30 minutes and honestly, the octopus balls here are actually better (bigger chunks of octopus and you get 5). Naoki offers specially ramens like curry, kim chee, and Dan Dan ramen, which are all really good. Prices are on point and you never feel rushed to give up your seat. The ramen wasn't too salty, which some might equate to bland, but I feel they achieved a nice balance between flavor and seasoning. I hope they stay because I like having ramen options in Chinatown."
    },
    {
        "id": 38,
        "text": "It's one of the best ramen places to go to in Philly. The wait is never long, the food is always nice and hot, and the staff are very nice,  even when you ask for a lot from them. I've never been served badly and to be honest, I like the food and service better than Terrakawa Ramen. My two recommendations the Chicken Katsu Ramen, and the Hakata Ramen. They even have a vegetarian selection!"
    },
    {
        "id": 39,
        "text": "Nice and modern looking restaurant. The staff was very nice and the food came pretty quickly. I got one of the spicy pork bowls. The broth was nice and definitely for people who prefer spicy food. The pork was well done, very tender and fell apart when I picked it up with my chop sticks. The bamboo shoots soaked up the flavor very well. The egg was OK, it just seemed a little under done to me. The noodles were a little undercooked, but not inedible. My wife got the Winton ramen. It was about what you would expect in flavor. The broth was a little fishy, but overall was pretty good. The noodles were well done in this dish. They over thing I though was weird was the beverages. The teas were fine, but the sodas were served in cans. Not terrible, just surprised me. The iced green tea was a little too watery. The prices were very fair for the portion sizes. The experience was very nice. I would return."
    },
    {
        "id": 40,
        "text": "I really enjoyed the food and atmosphere here. The waiter (Hak) is very sociable and will get to know your name. I really enjoyed that everytime we show up and eat, it's like going to eat at a friends house. It's sad to hear that he doesn't work there anymore, my buddies and myself really enjoyed his company there. They should bring him back!"
    },
    {
        "id": 41,
        "text": "I came here on new years day with a group of 12 and management was extremely accommodating for our group. Hak was very helpful and friendly and made sure everyone in our group was taken care. Definitely will be coming back with our group again."
    },
    {
        "id": 42,
        "text": "How can I describe how fucking disgusting this place is. I ordered the Shoyu Ramen with chicken Katsu on the side and shrimp fried rice.  It was the nastiest shit I've ever tasted. \n\n\nFirst of all the ramen broth was like warm and smelled like some type of rotten pig meat and dirty Tripe. It smelled so bad it made me want to vomit. I tried to taste it but when I did I almost threw up. It was the worst ramen dish I've ever had in my life. Possibly the nastiest meal I ever tasted because of the disgusting pungent smell of  pig shit. It smelled like shit... and the broth was cloudy as if it they just threw in a Bouillon to give the porky broth a taste. The should inform people that the broth is cooked with pork for those who can't eat it. I love pork but this wasn't fresh at all. \n\nThe fried rice was dry and flavorless. The rice tastes like it was precooked so they threw it back in the pan and reheated it because it had that hard texture like it was leftover fried rice. I didn't bother eating that either because the pork they used for the soup broth was used for the rice and I was at the point of puking. That taste was stuck in my Mouth for hours. I wasted 15 bucks on the food and should have waited in line to go to Terakawa Ramen which I did right after. If you want  real Ramen that's fresh and delicious please go there it's right around the corner."
    },
    {
        "id": 43,
        "text": "Food here was delicious! Tried it here for the first time .. the spicy seafood ramen sure hit the spot! Love the soup spoons! Even the seaweed salad has flavor! Customer service was great as well!"
    },
    {
        "id": 44,
        "text": "My friend and i went to chinatown to look for the best ramen restaurant. of course i had to follow yelp and Naoki ramen was the best option at the time. there were many options for the ramen so we asked the server for just regular ramen with chicken. We got our ramen and mine was supposed to have chicken but apparently they only serve it on the side. It was also not very fresh and tasteful. The service was very good and fast but as far as the food, it could've been better."
    },
    {
        "id": 45,
        "text": "The best part about Naoki is that you can get a table, even for a group, and it isn't cramped. When a ramen craving hits, it really sucks to have to wait for a tiny table at Terakawa. Is the ramen better at Terakawa- yes, but that doesn't help me when I want ramen in my mouth immediately. \n\nNaoki's ramen is decent thought some added soy and chili oil helps. They have a large selection of styles. Chicken katsu is decent, a little fatty. Soft boiled eggs aren't over cooked. Service was accommodating."
    },
    {
        "id": 46,
        "text": "I think like a lot of people, my group and I tried to go to Terakawa Ramen and it was too packed for us to get in. So we came here instead and so glad we did. It was quiet, the waitstaff as attentive, the place was clean and bright. And oh, the ramen. So good. So so so so good. I got the  miso ramen and added egg, which was great because oh man was that freaking delicious. Makes my heart ache that I'm not local and can't get this all the time. Good price for great ramen."
    },
    {
        "id": 47,
        "text": "I would have given 2 stars but it is a new restaurant with room for improvement. I ordered the Curry Chicken Katsu Ramen. The broth and the curry was a bit bland and diluted. The chicken katsu was alright. The meat was juicy and breading was crunchy. The service was fast pace. As soon as you order the waiter grabs the menu and walks off. Would I come back to eat? Yes but probably in a month when they improve their menu and service."
    },
    {
        "id": 48,
        "text": "Not bad ramen.  Certainly not as good as Terakawa.  But it gets the job done on a cold day.  The broth wasn't as thick and sticky as I had hoped that it would be, but it had a pretty good flavor.  I ordered the Gomoku Ramen she got the Spicy Ramen with some kimchi on the side.  \n\nThe takoyaki (fried octopus balls) were very good here.  A little crisper than some others that come to mind.  There wasn't too much mayo on them either.  \n\nThis place looks very clean, and had immediately available seating when Terakawa had an hour wait around the corner.  We saw a few people bring beer in, so I guess it is a BYOB."
    },
    {
        "id": 49,
        "text": "Terakawa Ramen was overly packed, so being extremely impatient & hungry, I opted to satisfy my ramen craving around the corner at Naoki Ramen. I was a bit skeptical about the food because the weren't very busy when I walked in. But right when I tasted my Hot & Spicy Seafood Ramen, I just knew that Naoki Ramen was a good choice. I haven't found a gourmet ramen place that does spicy like they do here! My portion was $12, but for that you get a big a$$ bowl filled with delicious seafood broth, perfectly cooked noodles, and a variety of seafood. As big as my appetite usually is, I was unable to finish a whole portion. My friend ordered pork buns, and shoyu ramen - which she preferred over Yamitsuki. \n\nIt's been two days since I've been to Naoki, but that big delicious bowl of ramen is all I'm thinking about, so it's safe to say that I will definitely come here again."
    },
    {
        "id": 50,
        "text": "To be honest we only came here because there was a long line at Terakawa but this turned out to be just as good if not better!  Especially loved the chicken katsu.  Way less crowded too with excellent service.  Will definitely be coming back!"
    },
    {
        "id": 51,
        "text": "Stopped in on a very rainy Friday night for dinner. My partner and I shared the gyoza and the pork buns to start. They both were very good. I had the Tonkastu Ramen and my partner has the Miso Ramen. Mine was way better I believe. I also added in corn and some of the hot pepper oil. The servers were very attentive and we got our food very quickly. Can't complain!"
    },
    {
        "id": 52,
        "text": "Amazing place, I love their ramen here, mainly the soup. Would come back for more ramen bowls"
    },
    {
        "id": 53,
        "text": "Love the curry chicken ramen. The chicken is amazing, curry base was great, and I loved every second of it. (I added corn to it, very good)\n\nThe vegetable ramen was a huge disappointment, though. The main vegetables were a lot of chopped lettuce a couple of broccolis, which tasted very bland. I would have preferred more traditional ramen vegetables, or something with flavor. Plus they forgot the advertised corn. \n\nI agree with other reviewers about the eggs - they could have been softer. I think it is the intense marinade making them too tough.\n\nNote: I ordered online, probably easier to customize in person. Will definitely keep ordering and check out the place some time."
    },
    {
        "id": 54,
        "text": "I love ramen and this place is legit. Everything is very affordable and the atmosphere is so friendly and welcoming. The staff is also very friendly. \n\nThe thing I love about this place also, is that the wait isn't very long and the food comes out FAST and fresh! The Mochi Ko Ramen is my favorite"
    },
    {
        "id": 55,
        "text": "Great food and the owners and employees are always very friendly! Love this place!"
    },
    {
        "id": 56,
        "text": "I absolutely loved this place. I rarely write reviews unless I'm very impressed. The food was so good and the waiter Hak, was even better. He referred to all of us by name, did a nice new years toast, and played 80's jams and freestyle music for us. What else could you possibly want? Even my sometimes hard to please husband was very happy. Thank you! Will be back for more delicious food and great food experience."
    },
    {
        "id": 57,
        "text": "Like many others, I stumbled upon this place when the other joint was packed to the brim with a very long wait (plus no where to actually wait). \n\nNaoki Ramen was spacious with plenty of open tables and very clean looking so we thought why not. I had the spicy seafood ramen and that's exactly what it was. It actually was so spicy, my nose wouldn't stop sniffling ... perfection! The ramen noodles were decent. The broth was good. Plenty of seafood in my bowl. I was a happy camper in the end.\n\nWe also had split the pork buns, which were made exactly as expected, which was quite good.\n\nAlso, the owner and waiters were super friendly and on top of everything including filling my water cup regularly. \n\nI'll definitely return if I'm ever back in the area."
    },
    {
        "id": 58,
        "text": "Terrible service. Food was mediocre. Miso ramen had a real fatty pork flavor, not what miso ramen should taste. Took a while for our food to come out when there was only 1 other table in the resaurant. I usually don't post bad reviews but this place did it for me. Server forgot to put an ingredient into our ramen, so she brought it out and asked us to use our chopsticks to put it in. I would think she would have used a different pair of utensil but nope she used mine when I was already using it."
    },
    {
        "id": 59,
        "text": "I agree with most of the other review. If it is just the food it would probably got 4 stars but the service left a lot to be desired. If I have to give them a suggestion I'd tell them to ask if we are done before taking the bowl/ plates. What if I want to buy extra noodle?"
    },
    {
        "id": 60,
        "text": "Walked by here with my girlfriend and decided to stop and have lunch. Best decision. Ordered the chicken katsu curry ramen and she ordered the chicken katsu curry rice. Both were amazing. Ramen bowl was more than filling. Cheap too. $25 for the two of us and that was with a generous tip included. Definitely going back and trying something else. The staff were friendly and attentive. Food came fast too. My only complaint, if you would call it that, was the check didn't come bery fast. That is because they were waiting for us to say we were done and ready for the check. They were in no rush to rush us out. Lol.  Great place. Definitely recommend this place to anyone."
    },
    {
        "id": 61,
        "text": "Amazing Ramen. Truly transcendent. Delicious pork, amazing eggs, fabulous broth. Makes me fall asleep at my desk after lunch in the best way ever. I love the Hakata, but the crispy Chicken ramen is also fantastic. New lunch prices mean it's more reasonable to come more often."
    },
    {
        "id": 62,
        "text": "Came here with low expectations for the ramen,  compared to terakawa nearby, and I was unfortunately right. The ramen isn't bad, but the soup isn't flavorful and rich.  Though I will say the chicken katsu was really good. Hey that instead."
    },
    {
        "id": 63,
        "text": "Went here last week for dinner!!!! Decent food! Initially we planned to comeback but the service was extremely rude toward the end. The bald waiter took the food away when we weren't finish yet. We asked to split the check between the 4 cards. He literally threw the check at us and said he can only split into 2. Wont come back!!! Never had these kind of services before"
    },
    {
        "id": 64,
        "text": "Pretty good food. About 10$ a bowl. It came out in 5 mins for me.  The super hyper server definitely lived up to his name :) i find him comical but i can see how some people might find him offending. Aniways if you came for the food then this place is pretty good but the service is pretty meh..."
    },
    {
        "id": 65,
        "text": "Yummy ramen with good service. The staff is very friendly here, but it was also not busy when my friends and I came here recently.\nI was able to customize my order since I wanted shoyu base with the extra vegetables.\nThe fried chicken Katsu that my friends had were super tasty and perfectly crispy. Add some dipping sauce and you're set! \nThey also take credit card which is helpful. Come here if you're craving ramen and want to try something new!"
    },
    {
        "id": 66,
        "text": "I came by with my friends bc the other ramen place was pack and I was so glad we came! We got takoyaki, chicken katsu curry ramen, spicy seafood ramen, and the soyou with chicken katsu. Ramen was good as it would any other places in Philadelphia, but what blew me away was their katsu. It was soo moist but crunchy on the outside! The price was pretty moderate too (ramen and katsu for 10.95, great deal. The portion was really large as well! I really recommend it if you are looking for a good ramen place!"
    },
    {
        "id": 67,
        "text": "Came here for Rai Rai Ramen and realized it had been replaced. We were hungry after dealing with bad service across the street so we figured we'd give it a shot. My boyfriend and I got the two different broths they had for chicken katsu. The broth wasn't as flavorful and not as creamy as RRR. There did seem to be more materials in the soup though.\n\nWe also ordered takoyaki, which was really good and meaty. Much better than what we've had at Kungfu Tea and others.\n\nThe service seemed decent, though when we arrived, the waiter asked if I wanted hot tea or water (i was under the impression that meant that both were complimentary, which is not the case.) the hot tea is $1 which isn't a problem but it seemed a little deceiving. I didn't even end up drinking the tea. \nHe also just kinda threw the bill at us when we weren't ready for it.\n\nThey do accept credit cards and have a choice of cool Japenese soft drinks. The bathroom is also in good shape.\n\nPs- they have 10% off for students and rewards cards!"
    },
    {
        "id": 68,
        "text": "my curry katsu ramen wasn't bad~ it came quickly and piping hot! the broth is japanese curry.. so i think that's kinda hard to mess up lol it tasted as expected.  the katsu was made from dark chicken meat, breaded with panko and fried to extra crispy.  they did an alright job! so overall, nothing to complain about.  i would come back if i'm craving curry noodles again.  $13.60 after tax and tip.  solid."
    },
    {
        "id": 69,
        "text": "The place to go... if there's a long line at Terakawa.  The mochi-ko chicken is mostly batter and skin, so I'd pass on that.  The ramen is acceptable.  I'd stick to the more traditional flavors, otherwise, you're going to get a very chinese-y ramen, with a lot of salt and corn starch."
    },
    {
        "id": 70,
        "text": "We decided to try this place out for dinner after seeing an incredibly long wait for Terakawa around the corner. Place was pretty empty when my bf and I walked in, and we were kind of worried that the lack of customers was due to the quality of the food, but after eating there I'm pretty sure its because this place just recently opened. To my surprise their ramen is just as good as Terakawa, and they have a special that is a shoyu or curry ramen with chicken katsu for about 11$, thats practically the price of a bowl of ramen at Terakawa. The portions are generous and I really feel like I got the best bang for my buck, especially because everything was delicious, and we walked out of there full and happy. This is definitely my new ramen joint from now on! \n\nPs: have no idea what the previous ppl are complaining about customer service for, the place is a ghost town and we were one of 3 ppl eating there and the waiter was attentive since there wasn't that many people."
    },
    {
        "id": 71,
        "text": "Basically if you're from Philly or come to Philly area frequently, then you know the hottest place to get ramen is Terakawa. However, we all know the issue with that place since it's clientele is bigger than it's business. (see my review for Tarakawa for more info). \n\nThe noddles at Naomi are amazing, just as good as Tarakawa if not better. The customer service is great, and they have a loyal customer punch card that keeps you coming back. There really isn't much to say because it's just that amazing. The price for two is well under $30 and you always leave full and satisfied."
    },
    {
        "id": 72,
        "text": "First ramen place I've tried in Philly and it didn't disappoint. I came with my sister and she ordered ramen ( I forgot the name) and it came with fried chicken. I had ordered the curry chicken with rice. The chicken I had was crisp and the curry added a lot of flavor to the fish. The portion was a lot bigger than expected though.\n     Decor is pretty nice and modern. Service was quick and our waitress was very nice. The restaurant was pretty quiet with only us and 2 other people. Would recommend. :)"
    },
    {
        "id": 73,
        "text": "No frills ramen place. Both times I have gotten the platter that comes with noddle bowl and fried chicken pieces. They have a pretty simple menu which is nice and it was good. They also have a loyalty card which is always a nice bonus."
    },
    {
        "id": 74,
        "text": "This place was empty when my friends and I entered and so the service was spot-on! They gave us the choice of either tea or water as our starting beverages and then we proceeded to order. They used a phone other than pen and paper to take our order which surprised me since it's the first time I've ever seen a restaurant do that. The food came out swiftly and was all cooked nicely. My spicy shio ramen with pork was moderately over salty and wasn't as spicy as I hoped it would be so I dumped a bunch of chili oil that they had on the side inside the ramen. I still devoured it like I haven't eaten before. Nonetheless, great service and food."
    },
    {
        "id": 75,
        "text": "Best place to get my ramen noodle when I'm craving for one ...reasonable price and nice environment with great service...definitely going to go there again"
    },
    {
        "id": 76,
        "text": "My husband enjoyed his meal. It tasted a bit like Indonesian beef rendang sauce and the usual accompaniments of iceberg lettuce and white rice. \n\nHowever; my Ramen could have been much better. The dish looked pretty but my egg/yolk was cold! So basically it's like- from fridge to no attempt to make it warm before adding that half egg with soft cold yolk into soup. It didn't make it enjoyable and that's my favorite part of the dish besides all the noodle broth slurping. The broth was also lacking in depth. It seemed more watered down today. \nDifficult to judge this highly to my top 3 favorite: Hiro, Terakawa, and Cheu"
    },
    {
        "id": 77,
        "text": "This is a pretty good spot for ramen. The options and portion is pretty decent. I enjoy that the soup base is not extremely salty unlike other ramen soup base I have from other places. This place is quite small and the only thing I dislike about it is the space. I feel that there were a little bit too much table and not enough space. But overall the food was pretty good and definitely would come back. I got the chicken Katsu ramen and the chicken Katsu is on the side just like an entire appetizer which can totally be shareable. My friend got the miso ramen with charsiu (pork) and usually places only gives one piece but this place is pretty generous and provided three. There are corn, bamboo, and bean sprouts in majority of the ramen along with a slice of seaweed and half an egg."
    },
    {
        "id": 78,
        "text": "Ordered delivery from Naoki and our food came quickly. We had the miso and the gomoku ramen and pork buns. The pork buns were delicious - would definitely order again. The ramen was good, but had a tiny fishy smell to it. Not the best ramen I've had, but decent. I'd order from them again, but I'm curious to try out other ramen places in the area."
    },
    {
        "id": 79,
        "text": "Wandered in while trying to find lunch on a busy afternoon in Philadelphia. We ordered the curry katsu, shoyu ramen, and tonkatsu ramen. Everything was great. Would definitely come here again."
    },
    {
        "id": 80,
        "text": "My friends and I just visited Naoki this evening. We saw the Philly Mag article and wanted to check out the new Ramen in Philly. We were very excited to see the simple, traditional ramen menu. We were greeted with warm tea and a warm smile by our enthusiastic server who took the time to explain all the dishes to us. We each tried a different bowl at Naoki and were equally pleased with the results! The broth which was cooking for at least two days was extremely well seasoned and delightful. The Hakata ramen was my favorite. The noodles were cooked in traditional style and the toppings were delicious with the bok choy, seaweed, scallions and roast pork. The soft boiled egg was cooked perfectly and delicious. Seriously, this is authentic, yummy ramen. They even can accommodate vegetarians if you ask for it. They offer a curried spicy ramen which is also quite tasty and some delicious chicken tenders which was quite the surprise. The service was extremely fast and quite attentive. Also, this is a BYOB with no service fee!! Next time you're in the mood for some ramen and want to support a local business, Naoki is where it's at!"
    },
    {
        "id": 81,
        "text": "The old Rai Rai Ramen. When my colleagues and I saw the sign changed to Naoki, We decided to give it a try during lunch. The place still looks like Rai Rai, nothing changed. The service was pretty fast. We ordered a couple of appetizers and all got different types of lunch special noodles.. To be honest, the meat on my ramen smelled really weird, and my colleagues noticed that too.. The broth was fishy even though I got a pork broth.. and it had a very weird after taste. The meat was also small compared to other ramen places here in Philly.. I don't know. Still 50/50. I might give them another chance in the future."
    },
    {
        "id": 82,
        "text": "Great place for ramen! The owner and waiters are so nice, they even gave us a free dessert!! Would come again 10/10"
    },
    {
        "id": 83,
        "text": "Stopped by here today during lunch looking for authentic ramen. I ordered the Hot & Spicy Seafood Ramen. It was absolutely delicious! The broth was savory and the bowl was HUGE. \n\nThough the place was almost empty, the service was great and the waitress very friendly. I was definitely not disappointed and look forward to trying them out again."
    },
    {
        "id": 84,
        "text": "Great service and food was good! We ordered the Takoyaki and Gomoku ramen and they were really good!"
    },
    {
        "id": 85,
        "text": "The worst customer service ever! The food was just fine but the bald guy waiter was like throw the bills at us and rudely grabbed all the food and bills without asking if we finished or not! So rude!!!!!"
    },
    {
        "id": 86,
        "text": "Terakawa was busy, i wanted chicken curry rice.\n\nSo i went here, looking from outside it was kind of empty...in doubt to come in.\n\nI ordered chicken curry rice...not deep fried enough... chicken feels like have fatty. \n\nShouldnt have come in."
    },
    {
        "id": 87,
        "text": "Loved the Chicken Katsu Curry Ramen I had. The chicken was so juicy and breaded with cashews. It lived past my expectations and I'm dying to go back.\nHak, our server and I think owner, was most helpful in explaining what the dishes were in addition to how each soup is different. I'm utterly glad he recommended my dish! \nHoping to go back within the week to try the Chicken Katsu Curry Rice!"
    },
    {
        "id": 88,
        "text": "This use to be Rai Rai Ramen... How I missed the bright lights with the new name and banner saying that Naoki had it's grand opening yesterday, I have no clue. \n\nMenu was plain and simple. I give them two stars instead of one, giving them a chance to grow and change since yesterday was their first day.\n\nOyster Katsu was terrible. It was so fishy, like it wasn't fresh. You can taste the fishiness even after dipping the sauce. \n\nRamens were ok. The broth was a bit salty for me, The half an egg i paid a dollar for, was overcooked. \n\nThe staff was scrambling everywhere. Didn't know table numbers, therefore, carried our Katsu back and forth.. back and forth. Did they only have one iPad to place orders? Why were they yelling for each other for the iPad?\n\nThere's a difference between asking how everything was \"because\" and \"just because\". The guy that asked landed on \"just because\". He didn't care to look at us or listen to our response because his head was already looking at the customers by the door and his body was already leaving our table with our bowls. \n\nPeople, Terakawa is just around the corner."
    },
    {
        "id": 89,
        "text": "Pretty good ramen! Nice and sleek modern design inside. Takes credit card. All dishes are $12.95 or under. I ordered the Mochi Ko Chicken Ramen with Shoyu Soup and thought it was delicious! The only thing was the fried chicken has thicker breading than I would prefer but all in all, a good dining experience!"
    },
    {
        "id": 90,
        "text": "This place is solid. My favorite is Terakawa and Nom Nom, but Naoki is great as well. Good service, clean space and well decorated. Food price and portion is on point. Give it a try when you're the area. However, I keep saying we do not need anymore ramen places in the city. I want Korean, please. More Korean restaurants."
    },
    {
        "id": 91,
        "text": "If I could give them no stars I would. \n\nTL;DR Rude service, sucky food. Go to terakawa or hiro or ANYWHERE ELSE.\n\n I was so angry dining at this restaurant. My sister and I went on grand opening day hoping to find that Naoki would be better than Rai Rai was. When this spot was Rai Rai Ramen we also went to the grand opening and was pleasantly surprised. However, they quickly spiraled downwards a few months later. \n\nSadly Rai Rai was way better than Naoki currently is. They spruced up the decor by slapping on a few wall decals and wooden bamboo walls, and cut down the menu significantly. We were told to wait 5 minutes when a table that seats 4 opened up. Then a server asked if we minded sharing a table with another couple. Sure, no problem. Except we would be literally sitting at one table.... either across from or next to a complete stranger bumping elbows. WEIRD. I thought they meant like 2 tables close to each other that seated 2 each... Nope. Then when my sister and I declined, they attempted to seat the couple who came in 10 mins after us first!!!!! After catching their problem they had us seated first. \n\nI don't know if the man running around the restaurant shouting obnoxiously was the manager/owner or just an over enthusiastic server but he comes off quite abrasive. We ordered a chicken katsu (after the guy basically shouted at us to get it) and two tonkatsu ramens both without  mushrooms or bamboo and one with an egg. Fast forward 35-40 mins.... no food yet. We finally get the chicken katsu which by the way they gave us pork, and it was COLD. Not even warm or room temperature, it was COLD. As if it was sitting in the kitchen forever. The pork was so fatty it was basically inedible. Also, our ramen came out at the same time as our appetizer and both had mushrooms and bamboo inside... and one came without the egg that we had asked for. My sister asked for an egg and it came out 10 mins later. ALSO COLD. IT WAS ICE COLD. The broth was virtually tasteless and room temperature not steaming as it should be. The noodles were definitely cooked for too long because they had a waxy taste to them.\n\nOnce the obnoxious server asked how everything was and we just replied....ok.... he had another server come over and ask us what exactly was wrong. We explained and it seemed like she had no idea what to do. We asked for the check and told her we'd go eat somewhere else. I gave her my card and went to the bathroom and upon walking up to the front desk, she handed my card back and said, \"Im not going to charge you.\" I asked her \"are you sure?? I'm sorry!\" and she replied \"yeah, let's leave it at that\". LETS LEAVE IT AT THAT?!??!?! WOW. She should have just apologized. It's not my fault that your food sucks. Not sure why I apologized to her. My sister and I were still hungry after eating their \"food\" that we went somewhere else and ate AGAIN. What a waste of stomach space and calories."
    },
    {
        "id": 92,
        "text": "One of the best ramen I have on the east coast so far. Service is great and the food is excellent. Don't forget to order the miso and hakata ramen. The pork just melt in your mouth. Make sure you bring your student ID to get special discount."
    },
    {
        "id": 93,
        "text": "Naoki Ramen is a somewhat new ramen bar in an expanding list of ramen restaurants in Philadelphia.  They have a decent selection of Ramen bowls, as well as a few appetizers.  I had a selection with the shio broth, which is supposed to be a bit less salty than the shoyu (soy sauce) broth.  Next time I'll give the shoyu a try.  True to what the server said, the shio brith was not too salty, but still had a good richness to it.  It wasn't overpowering with gelatine or fat, though the noodles I got were not the curly egg noodles you'd usually see in ramen, so if you want those be sure to ask to ensure your selection has them.  The service was a bit slow to order and get the check, but from the time I ordered to the time I received my meal was fast...maybe 5-8 minutes.  Overall, nothing spectacular, but a solid choice with decent food."
    }
]