[
    {
        "id": 1,
        "text": "Good quality ingredients! Poke bowl was a huge portion.\n\nAfter some questionable poke in Montreal this week, I was starting to get worried that good poke was only a West Coast thing. Fortunately, I was wrong. This was not exactly a traditional poke bowl (kind of a lot of carrots and corn), but the ingredients were fresh and high-quality, and the portion size was very generous. I think their $16 poke bowl was literally twice as large as a $13 poke bowl would be in Seattle, and these are airport prices!\n\nService was not super speedy, especially since I was there in the early afternoon when there was a staff changeover, and it seemed like they usually have fewer customers at that time of day but today it was pretty busy. If you're in a hurry, you can order anything off the menu to go (or there are premade sushi containers in a fridge, whose quality I can't vouch for)."
    },
    {
        "id": 2,
        "text": "Got this in Terminal E- best airport food out there.  Not even a hint of food poisoning!  I asked, and it wa a possible to substitute salmon for kani.  Wonderful rolls with wonderful service.  Not world class.  Definitely airport world class!"
    },
    {
        "id": 3,
        "text": "Great service and food was good too. Ready made salad was wilted and they made me a new one. Also friendly and very helpful staff."
    },
    {
        "id": 4,
        "text": "There is no other place to eat when you are at the airport! Fantastic Sushi and the pork ramen is incredible. There are two sit down locations at this airport and a food court option. They have an incredible selection of Sake as well."
    },
    {
        "id": 5,
        "text": "Food was delicious, and the BEST service I've ever had at an airport. Lucy was a great conversation partner, and I had a terrific experience all around. Would recommend!"
    },
    {
        "id": 6,
        "text": "Amazing service.  Amazing food. Airport prices but it's sushi, so it actually makes sense.   Anytime I'm @ philly airport I hope to go here."
    },
    {
        "id": 7,
        "text": "Despite of all other 9 reviews with 5 stars, maybe I am only an unlucky one. I just had a miso ramen and it wasn't good at all. I am giving 3 stars just because staffs were very nice and friendly. I saw a gentleman next to me having a special roll amd it looked just alright."
    },
    {
        "id": 8,
        "text": "I ordered the Miso Ramen and vegetable Goyza. Both were very very good. I didn't like the dipping sauce that came with goyza. Everything lease was wonderful. Bar seating in high top chairs. The service was great & the free water tasted filtered. Great choice Leigh, great choice! (Patting myself on the back)"
    },
    {
        "id": 9,
        "text": "The best! I always order the triple delight and pork Ramen and sake... It's the only place I stop when flying in Philly!"
    },
    {
        "id": 10,
        "text": "Wow, what a terrible dining experience, I should have seen the red flags before committing to eating here. The staff seemed completely incompetent on my visit; it took about 45 minutes to get our food; the staff had to confirm twice why we had ordered and STILL got it wrong; we were in a rush and ended up just paying the overcharged amount. On tip of that, my Chirachi bowl had no rice, and was just tuna and salmon with cooked shrimp. I seriously cannot believe all the good reviews here..."
    },
    {
        "id": 11,
        "text": "Amazing Ramen and Sushi! Definitely worth a try! Staff and service incredible. Food was amazing."
    },
    {
        "id": 12,
        "text": "Awesome place while stopping by omw back down south. Variety and quality of the soft shell crab is truly a hit with me."
    },
    {
        "id": 13,
        "text": "Ordered ramen and chicken teriyaki bowl. The teriyaki had a,little too much vinegar taste to it. The ramen was substandard. It was suppose to be miso tasting, but it smelled and taste bad with very soft noodles. Go into philadelphia or Chinatown and get a great bowl or ramen or even chicken teriyaki."
    },
    {
        "id": 14,
        "text": "Excellent quality food, beautiful presentation, very friendly knowledgeable and helpful. staff. The owner was very kind and treated us to dessert. Thanks!"
    },
    {
        "id": 15,
        "text": "Not impressed, the dry ramen has little pork and cold canned mushrooms. I had to go back and ask for the cucumber and green onion topping. I usually carry a dried ramen or instant soup with me and I really wish I had this time. $13 and a .99 pack is better."
    },
    {
        "id": 16,
        "text": "I'm on connecting flights and I stopped on this sushi bar because I'm an addict when it comes to sushi, it is nothing what I've tasted in my life. BEST SUSHI EVER"
    },
    {
        "id": 17,
        "text": "most amazing to have decent food in an airport!!  i needed a bowl of noodle soup...and they had a good one!! with tonkatsu....mmmm!! savory goodness to warm my stomach!!.....really wide selection of sushi and other noodle bowls and soups.....will totally recommend this place for philly travelers!!"
    },
    {
        "id": 18,
        "text": "I never thought I would give a airport restaurant five stars! I stumbled across Gachi when stuck in the Philadelphia airport. There were several flights delayed and the airport was bustling from 9pm to 2am when the last flight left. Even though the airport was full, big name restaurants in the airport were giving last call on food and beverages, but not Gachi. \nI was pleasantly surprised to find out they severed wine and they had delicious, fresh seafood. I had the franklin, which consisted of salmon, spicy tuna, avocado, and seaweed salad. The sushi was well priced, plentiful, and delicious. There is very limited seating in this spot but the staff also offered to take the food and beverage to go! I would absolutely recommend this place to anyone traveling though the E terminal at Philadelphia airport!"
    },
    {
        "id": 19,
        "text": "Decent sushi by any standard. Nice to have available in the airport! Service was just fine, but the prices were reasonable. Also had some of the ramen. Dining partner calls it yummy and pleasant."
    },
    {
        "id": 20,
        "text": "Wonderful food, freshly made in front of you. Lucy is very friendly. Highly recommend Gachi"
    },
    {
        "id": 21,
        "text": "I am a frequent traveler and have just finished THE BEST airport food EVER! Entire time I am thinking how could this sushi be better than even my regular spot back home. Will no longer eat anywhere else at PHL. I am hooked! Service was also equally as great. My server Lucy was awesome! Check out the pic of my entree, amazing! Loved it!"
    },
    {
        "id": 22,
        "text": "Best eats at PHL.  Recently opened this sushi and noodle shop has excellent food and even better service with a friendly smile.  Sushi, noodles, bento boxes and more made with care, speed and personal preference.  I had the bento box with Gyoza, salmon teriyaki and California roll with miso soup and salad included for $18.  Very fresh and tasty.\n\nChef Lucy cares and is very friendly along with the rest of the staff.  Fast service gets you in and out in time for your flight.  Located in A West around the corner.  Try it!"
    },
    {
        "id": 23,
        "text": "Got to the airport early and was surprised to see that there is not much to eat in this A West terminal other than a handful of takeout places. GACHI appeared like a mirage. Excellent presentation and super fresh amazing food! As good as anything similar I've eaten at highly touted restaurants in LA."
    },
    {
        "id": 24,
        "text": "For airport food, you really don't get better than this!  Tonkatsu Ramen was really solid. As good as what you will get at a really good ramen place in CA."
    },
    {
        "id": 25,
        "text": "Got to the airport early and was surprised to see that there is not much to eat in this A West terminaother than a handful of takeout places. GACHI appeared like a mirage. Excellent presentation and super fresh amazing food! As good as anything similar I've eaten at highly touted restaurants in LA."
    },
    {
        "id": 26,
        "text": "It is a nice sushi place in the airport. It is nice and quiet. Lucy was very friendly. I tried the triple delight and it was delicious! I also promised her that if I ever have a chance to come back, I will try the Ramen as well. I will definitely recommend this to my friends."
    },
    {
        "id": 27,
        "text": "Best Sushi I had in Philadelphia! Definitely give it a try! Great Service always helps!! I highly recommend the Imperial Roll!!"
    },
    {
        "id": 28,
        "text": "Tried this based on the good reviews. I ordered the takoyaki and triple delight. The portions are generous for the price but I found several pieces of bone in my fish. \n\nTakoyaki wasn't bad, but I don't expect perfection at the airport. \n\nI will try the ramen next time!"
    },
    {
        "id": 29,
        "text": "Pleasant surprise to see a Ramen place at PHL!  Good ramen, may be better than one in Chinatown!  Staff is super friend. Sushi looks fresh. Nice gem!"
    },
    {
        "id": 30,
        "text": "Amazingly giving this Japanese place in the airport 5 stars! I had the miso ramen which was actually really good. Not the best ramen I've ever had in my entire life but really quite good and way better than the one at the other ramen place in PHL (Noobar-- seriously don't go there). It comes with roasted corn, bamboo shoots and two really tasty pan seared dumplings. It's also veg/vegan which is great. Def my new go to at PHL!\n\nThe service is very nice and they have a few seats at the bar with access to electrical sockets."
    },
    {
        "id": 31,
        "text": "No, just no. We tried 3 separate places and this side of Terminal has no decent foods.\n\nWe tried California rolls and salmon teriyaki. Came out of a pre-made package. California rolls were cold and slightly dry. Salmon teriyaki rice bowl was average - not freshly made and on the slightly cold side.\n\nBetter off eating a bag of chips or trial mix."
    },
    {
        "id": 32,
        "text": "Great food, friendly staff. I've tried several different things and it's all delicious. Very accommodating for my gluten-free diet. Highly recommend."
    },
    {
        "id": 33,
        "text": "Stopped at the Gachi in the food court at Terminal B/C in the early afternoon of 6/4/2019 and ordered the tonkotsu ramen with pork (chashu) for $14. What I got was nothing like the picture shown above the counter. There was no ramen egg (ajitsuke tamago) as shown in the picture. The broth was definitely NOT tonkotsu (pork bone) broth.  It was canned chicken broth.  The chashu portions were decent, but there were no other ingredients except for a little corn, a little seaweed, and a very skimpy portion of noodles.  I left hungry and angry that I had been cheated out of $14 for a fake, falsely advertised bowl of glorified chicken broth.  If you're ever thinking of stopping here on your way through PHL, just don't."
    },
    {
        "id": 34,
        "text": "Very good and quick. I got the Miso Soup--standard. The Southwest roll includes shrimp tempura, spicy tuna, avocado, jalapeño, tobiko, and house spicy sauce was beyond good! This roll is higher than 5/5 stars! Very flavorful and just the right amount of spice. It was a great airport meal and I don't say that often. The sushi roll was very detailed, and it was appreciated."
    },
    {
        "id": 35,
        "text": "I placed a to go Sushi order today at 4:53pm, at 5:00pm was told my order was almost ready, by 5:15pm the order was not ready. Been that my flight was leaving from the gate a across and as a crew member I had time constraints. I spoke to one of the servers and she agreed to take my food across and drop it at the gate for the agents to give it to me. By my departure time at 5:50pm the food had not arrived and now I have no way of getting a refund as they do not answer their number..."
    },
    {
        "id": 36,
        "text": "Really impressed with Gachi Sushi! The rolls were fresh and delicious and the service was great. I'm always amazed when you get great service in an airport since they may never see you again... we enjoyed our dinner."
    },
    {
        "id": 37,
        "text": "This place  is amazing!  Airport food\naside it's true Asian excellence and Lucy is a great host. I totally recommend this place and the Southwest roll we just had is a home run!!  Do it!!"
    },
    {
        "id": 38,
        "text": "Excellent!  Best meal I've had at the Philly airport.  Fresh, delicious and great customer service.  Staff are all friendly and helpful.  I asked for a recommendation and the chef did not steer me wrong.  He even gave me samples of sushi to try.  I went with the deluxe sushi bowl... Definitely recommend!"
    },
    {
        "id": 39,
        "text": "Got a Chicken Teriyaki bowl for $11.23 (incl. Tax). Was SUPPOSED to come with edamame and cucumber. I asked to have a few pieces of lettuce added since this restaurant has NO VEGETABLES.\nIt came with 3 leaves of lettuce, NO edamame and 4 half slices of cucumber, and about a cup of white rice, and about a teaspoon of sauce. Enough chicken.\nSoo NOT worth $11.23.\nPlease bring back.Panda Express."
    },
    {
        "id": 40,
        "text": "This places was quick and had excellent customer service!! And loved the Phillies roll!"
    },
    {
        "id": 41,
        "text": "This may sound crazy but...... best pork tonkotsu ramen I ever had. And I seek out ramen in every city! It was really good."
    },
    {
        "id": 42,
        "text": "I had veggie miso ramen. 3 stars because it was good for airport ramen but not great. Service was good, food was expensive"
    },
    {
        "id": 43,
        "text": "Nice service, they offer cleaner and fresher food. I wouldn't eat D graded sushi at the airport but the Tonkastu ramen wasn't bad at all."
    },
    {
        "id": 44,
        "text": "Food not bad but employees totally unwilling to make changes or customize an order. Would not repeat."
    },
    {
        "id": 45,
        "text": "was TOTALLY surprised by how good the bento box was. its like what youd find at a traditional sit down japanese place. \n\nthe bento box isn't on the menu but you can ask for it. i saw it on their website. \n\ni swapped out the california roll for another roll.\n\nyou also get miso soup which has tons of tofu in it as well. \n\nso surprised by how complete and good this was.\n\nchicken was tender and juicy too.\n\nORDER: at counter\n\nits in that big food court in the middle of the airport, not the side by temrinal F"
    },
    {
        "id": 46,
        "text": "Early flight and was a little surprised they were open at 6 am. What can I say I ordered Beto box and was pleasantly surprised!! Fresh, and everything was spot on. If u r interested in Japanese or sushi in am.. this is your place!"
    },
    {
        "id": 47,
        "text": "I got the miso ramen with pork and honestly it was the worst ramen ive ever eaten in my life. I was craving something soupy before my flight and found this place in the food court. The cashier lady wasnt friendly and the wait was really fast (probably about 5 mins). I knew right away after i got my miso ramen that it was gonna be bad and i was right. I couldnt even finish my food cuz it was really really bad."
    },
    {
        "id": 48,
        "text": "Worst bowl of ramen I've ever had in a restaurant.  Wow it's bad! This place would go bankrupt in SF, Toronto, LA, Vancouver... Maybe people in Philly think ramen should remind them of the stuff you get at a supermarket?"
    },
    {
        "id": 49,
        "text": "We are lovers of ramen and we're in search of it near our terminal in the international hall. Long and behold, we met the nicest staff and chef at Gachi, and we had a delicious and soothing ramen soup :) their ramen is vegetarian by the way! No bonito flakes."
    },
    {
        "id": 50,
        "text": "The first few times I had the Triple Delight I was blown away (about a year ago). So much so that I go out of my way (to Terminal A) to get it nearly every time I fly. The next several times were good, tho not quite the same, but the most recent time was by far the most disappointing. There was way too much rice (easily half the roll) and way too little fish and not enough sauce. Now it's just another OK but nothing special sushi place.\n\nMight give it one or two more tries to see if it improves before switching back to Legal for pre-flight meals."
    },
    {
        "id": 51,
        "text": "Got the Miso Veggie Ramen ($13)\n\nFood: It came with ramen, mushrooms, seaweed, two dumplings, corn, bamboo shoots, scallions, and miso soup base. The flavor was decent.\n\nPrice: It was okay for something in the airport ($13), but I expected a bigger portion size for the price.\n\nService: It took 20 minutes after placing the order to have it prepared. It felt a little bit longer than usual. Other than that, the lady in the front was kind.\n\nAmbiance: Seating area is in the food court. Nothing special.\n\nOverall, this was an okay experience. Service was a little slow, price is higher than average, and portion size was sub-optimal. Would I come here again? Probably not, considering there are many other options in the airport."
    },
    {
        "id": 52,
        "text": "Loved their customer service. And their service was fast.  Food was delicious. I had the Gion Udon Soup (veggie) and it it the spot.  And the Imperial roll was even more delicious! If you're in the America Airlines terminal make sure to stop by."
    },
    {
        "id": 53,
        "text": "They're good. It's solid. They're quick for hot food. I actually look forward to flying out of A terminal knowing I can stop here for some comfort food before a long flight."
    },
    {
        "id": 54,
        "text": "Heading out with the husband and bonus children to North Miami beach for a quiet social distancing vacay, when I came across Gachi....\nMAN LISTEN! The southwest roll was absolutely wonderful. I didn't really want to share with my husband. Loved it."
    },
    {
        "id": 55,
        "text": "Amazing food! The service was incredible. This is 100% not what I though airport food would be."
    },
    {
        "id": 56,
        "text": "For airport food this place is good. Excellent service, workers really care and are kind people. Ramen is just okay, I have had better... Got the tonkatsu pork ramen and it was a decent portion, could feed two people. Tonkatusu broth was a bit too greasy and oily for me. The pork was a tad dry but I appreciate the char. I am happy there is ramen at the airport though, great comfort food."
    },
    {
        "id": 57,
        "text": "Surprisingly decent ramen. Flavors were there but portion size was tiny. But they did fill it up with pork belly, seaweed, corn, all the fixin's!\n\nQuick and easy option in the airport but beware the high prices which is the norm in the airport. I would get it again. Happy eating."
    },
    {
        "id": 58,
        "text": "Gachi Sushi & Noodles (8/10) is a nice, small sushi bar eatery that offers a wide selection of sushi and ramen dishes. Overall, a promising lunch venue especially if you want a nice bowl of noodles. They have two locations; today I went to the one at Terminal A.\n\nAMBIANCE: (8.5/10)  It is a nice small quick stop restaurant with a nice bar seating area if you aren't in a rush.  The location is very quaint and in one of less busy parts of the airport, so it's a great place if you want a bit of quiet in the airport. I felt like I was able to relax and enjoy my meal without having to rush or worry about loud announcements interrupting my meal. \n\nCUSTOMER SERVICE: (9/10) The staff is very friendly and attentive. I was offered seating promptly and my order was taken quickly. All the seating options were properly set up and had a very nice and clean presentation. Food came out in roughly 10 mins, so great timing on their part. \n\nFOOD: (7/10) \nTonkatsu Ramen with Pork and Boiled Egg ($13 +$2 for the egg)\nI previously saw some mixed reviews mentioning the ramen, so I decided to try it myself. It came out as a sizable portion, and I only managed to eat about 2/3 of it. It comes with only 3 pieces of meat, so I wish it came with more but it was reasonable. The meat was a bit chewy, but it still had lots of seasoning and flavor in it. The boiled egg was also very good although it tasted a bit salty. Overall the flavor of the super was powerfully flavorful but with a bit too much sodium for my personal tasting. This includes the broth which felt a little overbearing. Aside from the extra sodium that I tasted the other flavors worked very well together. The broth was nice and hot which was perfect for this cold day and it mixed well with the veggies (great complementary texture) along with the flavors from the meat. It would have been a higher rating from me if there were a bit more meat and a little less salty taste."
    },
    {
        "id": 59,
        "text": "Tucked around the corner near Gate A18, this is a gem of a restaurant with featured meals and sushi menu. We had the Triple Delight with soy wrapped avocado roll topped with diced yellow tail, salmon and tuna garnishes with avocado and tobiko--yum! The Crispy Chicken over rice comes with a small salad--romaine and cucumber. Small wine menu with reasonable prices. A lot to like here--much better than most airport fare."
    },
    {
        "id": 60,
        "text": "Not often I review something that I don't like, but this place really is that bad. Do yourself a favour and give this place a miss. Given the limited options in the terminal B food court - Chic-Fil-A, subway, smash burger, Genos- I thought this would be a safe bet to get something halfway healthy and decent tasting. I ordered the sweet and sour chicken thinking that it can't be too hard to mess up. I was wrong. The Rice was soggy and over-cooked chicken was rubbery and tasteless, the batter completely without any crispiness. The saving grace was the sweet and sour sauce which was at least spicy and covered the blandness of the rest of the dish.\n\nPretty disappointing, and I didn't come with high expectations!"
    },
    {
        "id": 61,
        "text": "0 star on portion size, and 3-4 star on food.\nOrdered a spicy Chicken fried rice, and got less than 1/4th of the serving-bowl/togo-box filled. Not going back."
    },
    {
        "id": 62,
        "text": "As far as airport restaurants go this has to be one of the best.  It is clean, pleasant, well designed, and a good varied menu of sushi, noodles and other Japanese inspired dishes.\n\nWe sat at the counter and I had a dry Udon with chicken.  It came in a nice bowl shaped dish and all of the ingredients tasted fresh and well prepared.\n\nThe sushi in the counter looked quite fresh and one wonders how long it can stay that way at an airport installation (?)\n\nI also had a some hot green tea that came in a stylish cup.\n\nThe service was overly accommodating and the entire experience was quite good."
    },
    {
        "id": 63,
        "text": "Amazing customer service and amazing food! Yes the price is high but you are at an airport, that's to be expected! \n\nMy waitress was amazing, helpful and kind! She helped me make choices and she made sure I did not overpay for food! I had a horrible experience with my airline and coming to this restaurant made the end of my trip so enjoyable and relaxing!\n\nGreat place to eat and great people!"
    },
    {
        "id": 64,
        "text": "Food tastes fresh and has good flavor.  Low rating to to the amount of salmon.  I paid extra and only 3 little strips.  Not sure if I would eat here again."
    },
    {
        "id": 65,
        "text": "Yommmmy! Quick fix before my next flight. Expedited my order because I was boarding. Decent prices for airport food! Do recommend! & they have sake!"
    },
    {
        "id": 66,
        "text": "Two visits to Gachi (Terminal E location):\n\nEat-in (5*+): superb triple delight roll - amazing amount of fresh fish, packed with flavors, better than any sushi I've had in center city Philly. Seafood udon was good but nothing special.\n\nTake-out from pre-packaged (3*): summer rolls were a miss - hardly any shrimp, lacking flavor and texture; volcano roll was decent but couldn't hold a candle to the triple delight\n\nMade to order sushi is definitely where it's at here. Didn't try the ramen but might next time. Can't wait for them open a B/C location"
    },
    {
        "id": 67,
        "text": "Grabbing a quick  veggie roll  bEfore my flight. Not many vegan options on the menu, sadly. My understanding is the ramen noodles have egg, so that's out sadly. But they always have a pretty-made roll of carrots, cucumber and avocado is definitely safe and a quick."
    },
    {
        "id": 68,
        "text": "Ramen at the airport? Don't mind if I do. When we first saw Gachi at the edge of the so-called food court at Terminal A of the Philadelphia International Airport, I'll admit, there was some hesitation. We're about to be trapped in a metal tube for hours, shoulder to shoulder with strangers, with limited access to restrooms. But on second thought and after taking a look at the lacking food options at this terminal, we decided to live a little. And we're glad we did. \n\nWe ordered the Miso Ramen with Pork and the Chicken Teriyaki Bowl. The ramen was surprisingly tasty and could hold up as \"good ramen\" at almost any decent ramen spot in Los Angeles. It had everything you'd want in terms of flavor and consistency of the broth, soft boiled egg. And the noodles themselves were cooked very nicely. Tasted authentic. Don't let the presentation of the to-go bowl mislead you. It was good ramen. The Chicken Teriyaki Bowl was just ok. There was too much of the teriyaki sauce which was not too good. We wish we had ordered 2 ramens. \n\nThere is bar seating and a TV to pass the time. They also serve sake and wine. It seemed like a two person operation here, but the service was above average. The food came out quickly - less than 5 minutes after ordering. \n\nIf ever back in Terminal A, I'll be returning to Gachi for the ramen."
    },
    {
        "id": 69,
        "text": "The tonkatsu ramen was disappointing.  The broth--which is most important part of a ramen experience-was kinda bland, just salty with a touch of pepper, but not complex and umami-ish the way good broth should be.  And it was not really what I expect as \"tonkatsu\" (pork cutlet); it was over-boiled pork belly (some pieces were tender, but many were hard and tasteless.  And the soft-boiled egg, although tasty, was too tiny to be worth the $2 up charge.  \n\nI wish I had spent my $15 elsewhere.  Like buying lots of pastries at Au Bon Paine.\n\nBut the staff was appropriately attentive, though they didn't seem to understand what \"warm water\" is."
    },
    {
        "id": 70,
        "text": "I wouldn't recommend if you have a flight to catch. Took 20 minutes for my food.  They appeared very confused. I'm not sure why chicken teriyaki took 20 minutes when there were less then 10 people in line, most of which got their food before me.  The food comes in very small containers packed in so tight you're forced to eat it in layers. All the chicken first, then the lettuce layer, then the rice. Was more frustrating than anything else. One and done for me."
    },
    {
        "id": 71,
        "text": "Get the Abura Soba if you want that ramen soup flavor but no soup!  This is a dry ramen, which is more like the noodles are dressed in some of that delicious tonkotsu.  I fly into here often and will get this time to time.  Also, love the fresh bits of mushroom and cucumber (tastes like Asian cucumber salads)"
    },
    {
        "id": 72,
        "text": "Picked up some sushi to go for an outbound flight and it was terrible!  The fish did not taste fresh."
    },
    {
        "id": 73,
        "text": "I'd give the food here three stars. I had the \"pork ramen here, and it's pretty much what one might expect from airport ramen: okay noodles, meh soup (NOT pork!), and hard, kind of dry pork. The pork is actually slightly sour which is a bit concerning, but it's cooked so I'll probably be fine? \n\nI reduced this from a meh three stars to one star because the menu clearly shows a photo of ramen with half an egg for $13 (that's a lot for crappy ramen!), but the egg is actually an extra $2 -- not mentioned anywhere on the menu. That is not okay.\n\nI wonder if it costs extra to have fish included in the sushi.\n\nOh, and I found a pretty big piece of chicken in my pork ramen."
    },
    {
        "id": 74,
        "text": "This place is the best airport food I've had.  I wish we had one in Orlando.  It is a definite hidden gem as we had our 2 hrs wait to board.  I got the salmon bento box and my gf got the veggie ramen with egg.  I'm sorry we didn't take pics.  We gobbled it up too fast!  It was better than what full, large restaurants serve.  It would be my go-to place if it was in Orlando Airport.  The Philadelphians are sure lucky to have this as an option!!!"
    },
    {
        "id": 75,
        "text": "This place is the best! My husband and I ate here once when we were traveling. Now, every time we're at the Philly airport we seek it out, we will walk from other terminals just to eat here. The staff is super friendly and the Miso Ramen is amazing! An awesome spot for anyone who is vegetarian/vegan or if you just want great food."
    },
    {
        "id": 76,
        "text": "I literally had to wait for 20 minutes for noodles.  The manager was on the phone for 30 minutes during the dinner rush. They don't care to service their customers.  Horrible service experience."
    },
    {
        "id": 77,
        "text": "Can't say enough about how fresh and tasty this cozy airport lounge is! And customer service is just outstanding. I had the vet popular triple delight - a signature sushi roll. Not only was it presented very beautifully, it was also the perfect portion and the flavours were pure divine and the rice was perfection. Miso soup are vet well and authentic. They have cold sake, that is as close to quality as an airport Lounge gets. The green tea Mochi is pretty special. A big thank you for satisfying my foodie needs! Everyone I interacted with here was lonely kind and warm. Highly recommended on a stop over at the philosophy airport."
    },
    {
        "id": 78,
        "text": "Didn't end up in Sky Asian Bistro like I normally do in Term C; however, I was not disappointed. Sashimi was fresh, and the Liberty Roll was tasty. One thing to watch out for is your timetable. Things from kitchen comes out sooner when I was there. They only had 1 sushi chef on staff when I was there; not sure if they have more during peak hours."
    },
    {
        "id": 79,
        "text": "What a surprise!!  Extremely great and abundant sushi.  The Ramen was fabulous!   Clearly a must stop to eat... airport restaurant!"
    },
    {
        "id": 80,
        "text": "Absolutely delicious! The Miso Soup with vegetables was fantastic! The dumplings were the best I've ever had. Staff was great and very kind! Our order ran a little long which we were completely fine waiting for and one of the men who worked there gave us a water and chocolate covered popcorn. He did not have to do that, we were more than happy to wait, but we really appreciated the gesture! Is there any way to get this delicious dish when not flying?"
    },
    {
        "id": 81,
        "text": "Am I at the airport?  This little place is a hidden gem in the A terminal and completely worth the lay-over! The staff is fast-working, friendly and pleasant.  Again, I have to emphasize that I was shocked I was eating sushi in an airport.  This place has quick bites to go for those that do not have the time to spend.  For those who have a moment to grab some eats, it's worth it!\nI sat at the sushi bar area, which was pleasant and clean, and shared some cozy space with some other travelers that were passing through.  I ordered the green tea (iced) and a Bento box - Salmon.  It was surprisingly fresh and tasted incredible.  Good deal for the amount of food in the meal.  In fact, a passerby saw me eating it and stopped to order the same.  He too was surprised at the quality of sushi given the location in an airport terminal.  Again, they have a great selection of sushi, noodle and rice bowls, bento box options and quick bites to go!\nI definitely recommend this tiny hole in the wall for its excellent staff, service, cozy ambiance and stellar food!"
    },
    {
        "id": 82,
        "text": "I had the miso ramen here with extra bamboo shoots. The quality of ramen was alright.  But for the price they're charging at the airport I would not come back. It's conveniently located in the food court between B and C terminals.  A nicer spot to hang out than at the gate if you're in early."
    },
    {
        "id": 83,
        "text": "There are 2 in the Philadelphia airport, but I like this location the best.  Staff are super friendly and make great recommendations on the food.  I had the miso soup and the Softshell Crab Imperial. Wow!  Recommend it highly. The prices are reasonable, won't break the bank if you are a traveler on per diem"
    },
    {
        "id": 84,
        "text": "What. No.\n\nI'm from Southern California. Daikokuya, yes. Tsujita, yes. Tajima, yes.  Terawaka in Philly's Chinatown, yes.  But this? Not even closeeee\n\nServers are nice, but the tonkatsu broth with pork ramen is a NO.  I struggled to eat it. Because it smelled like fart.  I think it came mostly from the bamboo shoots. And I wasn't sure what the white flecks floating in it were. Noodles were overcooked and strange. Egg costs $2 extra. Mushroom is chewy brown, maybe bellas? I found that to be an odd choice.\n\nMy stomach feels very unsettled right now.  I hope it's all in my head."
    },
    {
        "id": 85,
        "text": "is my second breakfast croissant with crispy bacon so yummie... thanks vivian that breakfast make may day"
    },
    {
        "id": 86,
        "text": "This is the best sushi in Philadelphia International Airport.  Their Chirasi sushi and Chicken Teriyaki Bento is great. Food is great, but the service is excellent."
    },
    {
        "id": 87,
        "text": "We just enjoyed a delicious lunch here thanks to all the Yelp reviews. I am a big fan of ramen and I enjoyed My Tonokotsu Ramen. The broth was really flavorful. \n\nMy husband got the Salmon Teriyaki bowl and absolutely loved it. He is not a fan of salmon but he said salmon like this he can eat daily. \n\nThe service was prompt and courteous."
    },
    {
        "id": 88,
        "text": "I love is Tha best I eat como visit , muy bueno y lo mejor es una delicia m Mon like this food my too"
    },
    {
        "id": 89,
        "text": "It was pretty early in the morning but I had already been up for 4 hours so I wasn't in the mood for breakfast. I appreciated that Gachi had some lunch options on the menu that early because most places didn't. The chicken and rice bowl was pretty basic but hit the spot... white sticky rice and some grilled chicken with a little sauce. They were already prepared in a heated cabinet so there was no wait. I did get some gyoza as well which had to be cooked. It wasn't great but the chicken bowl was plenty on its own."
    },
    {
        "id": 90,
        "text": "Good place expensive but they had a large variety and even hot food if you wanted it.\n\nI feel like the food and everything else is overpriced but it's an airport so I guess they have to market up to get their money. It was a great selection and even the one at the Canned wine and was different never seen that before.\n\nIt wasn't too crowded you can grab what you needed and even sit down if you want to. I stopped here because we can get food without getting a bunch of snacks."
    },
    {
        "id": 91,
        "text": "I got ramen from this store front in the airport and it was...ok. it took a long time to get the food and the food itself was just ok. Regardless, I was happy to be able to have ramen in the airport."
    },
    {
        "id": 92,
        "text": "Not bad! Has a lot of options. Sushi, hot bowls, cold bowls, and drinks (alcoholic) regular airport restaurant small bar area to eat mostly take out. Would recommend. About $10 for a sushi roll of 8 pieces"
    },
    {
        "id": 93,
        "text": "I've actually been to Gachi at the BWI airport before and had great sushi and customer service there, so I was really excited to find one at PHL in the International terminal (A West). When I came here, I got the volcano roll and the miso soup with crab stix. I absolutely love spicy mayo and it was drizzled all over this volcano roll just the right amount. The taste reminded me of my favorite sushi back home! I was also pleasantly surprised by the portion size for how much it was. I've been to other sushi places at airports that charge around the same for very small rolls of 6 pieces. The most unique item was definitely the miso soup with crab stix added (Make sure you ask for it). Most restaurants serving miso soup always give you that generic miso paste mixed with water and only three to four pieces of tofu and nori thrown in. If you go to Japanese restaurants often, I'm sure you know what I'm talking about. The miso soup at Gachi, however, cannot even be compared to any other miso soup. The serving size was great and I literally could not get enough of the flavor and all the ingredients inside (I ordered this twice because it was just that good!!). Overall, the food experience was amazing - and the staff were super friendly too! 10/10 would recommend."
    },
    {
        "id": 94,
        "text": "This is a very good sushi and noodles spot at the international wing of the airport. Where around is mostly basic food a Chickie's and Pete's  and some pizza and burgers; here everything is made fresh and tasty. A little overpriced as airport but great rolls, noodles soups and a. Great selection of beers and sake. My goto restaurant at the airport"
    },
    {
        "id": 95,
        "text": "What a find! With a 4-hour layover in Philadelphia enroute in coach from San Francisco to Prague, we knew the airlines wouldn't feed us adequately. It's unusual to find sushi and noodles in an airport, so we went for it. Not a mistake! My soba noodles were A-OK and my friend's sushi was excellent. Kudos to Adam, the manager, for running a delicious show!"
    },
    {
        "id": 96,
        "text": "I had a chance to stop by when this store just recently open. The food selection is great. Try the Phillies roll if you like the combination of crab lump meat and shrimp tempura. This establishment has more varieties of Sake selection compares to the other tenants nearby. I would recommend to try the Junmai Sake selection."
    },
    {
        "id": 97,
        "text": "Right across from A-18 !! Very nice place, super sweet people and good eats! Yumm had the Eagle sushi, crab and avocado based ... look at it, so purty!"
    }
]