[
    {
        "id": 1,
        "text": "Stopped in to check out this new spot around the corner from us, as my boyfriend has been anticipating its opening for quite some time. Can I say it- FINALLY! Am amazing place for sushi in the city. We were there for what they were calling their soft opening, where apparently they are testing out menu and cocktail items for their \"official\" opening sometime soon. We were very pleased with the ambiance, service and food/drink. The fish is top quality. We said hello to the owner/executive chef and he seemed to be beaming over his accomplishments, rightfully so! This is a must stop if you're a sushi/Asian fusion fan. We look forward to seeing what's in store for Tuna Bar and are thrilled to have this a two minute walk away!"
    },
    {
        "id": 2,
        "text": "I live in the neighborhood and used to order at least once a week and pick up.  The last last few times I have had to wait from 10 to 15 minutes as the team scrambles around trying to find change. All I wanted to do is pay for my food and take it home.   And tonight after the wait for change. I gave them 2 20's for a 27 dollar check. \nI get home and it is the wrong food. My warm dish was cold and my sushi was wrong.  Lost me as a customer"
    },
    {
        "id": 3,
        "text": "We came here tonight just for a date night. We started with some basics of edamame and tuna tartare, the tartar took me back to California, the taste of fresh ocean and soft creamy avocado was just to die for. Then we had some creamy rock shrimp that had a tiny bit of spice at the end which was pretty good too. We also had the Miso soup which was one of the best miso soups we've had. This was followed by our version of surf and turf where we had sushi rolls and their steak. We were nothing but satisfied with all of the flavor profiles we were able to enjoy during this entire meal. If you get a chance please check this place out they also have amazing cocktails."
    },
    {
        "id": 4,
        "text": "Wow! What a great dining adventure! Huge rolls, good sake, good beer and HOT tea- was all awesome!"
    },
    {
        "id": 5,
        "text": "Wonderfully fresh sushi, amazing lobster fried rice with tons of umami, beautiful looking restaurant."
    },
    {
        "id": 6,
        "text": "Hard to find a sushi spot with good quality ingredients. Service was amazing as well. The waiter accidentally forgot to take one of our orders and later gave us complementary dessert to make up for it! Got the Fishtown roll, dynamite white tuna, and green tea cake with chocolate ubé ice cream."
    },
    {
        "id": 7,
        "text": "Tuna Bar is a new sushi digs in Old City, a relatively upscale neighborhood in a city flooded with mediocre sushi restaurants. I frequent laban's favorites, bubblefish being one of them and the last visit left something to be desired. The fork in the road left me with two options, Royal Izakaya or Tuna Bar, and boy am I glad I chose the latter.\n\nThe ambiance is on point, and the service is friendly and welcoming. The menu is curated beautifully, from my understanding they narrowed it down quite a bit from the other location. This means everything on the menu is guaranteed to be fantastic and FRESH.\n\nWe started with the steamed chicken dumplings which were light and steamed to perfection. The ginger salad followed with slices of avocado and wonderfully balanced ginger dressing that wasn't too sweet. And they even do spring mix, which was great considering romaine isn't the best these days. \n\nFor our sushi selections we went with the classic dragon roll, the east roll, the j & j roll, and 4 pieces of the tasmanian salmon, which is a fattier cut of wild caught alaskan salmon. The fish absolutely melted in your mouth and highlighted the night beautifully. The dragon roll was crafted wonderfully and the rice on every selection seemed to highlight the delicate subtleties of genuinely fresh fish. The wasabi was even a notch above. I don't know what else I can say besides try it for yourself. The preparation of everything was so wonderfully thought out and you can tell they care about what they do here. Ken was also present and very humble about my compliments.\n\n6/5"
    },
    {
        "id": 8,
        "text": "After loving on the west coast for over 20 years, I admit I'm a sushi snob. From the quality of the fish to the rice to the wasabi, it all counts and Tuna Bar hits on all cylinders (the wasabi is freshly grated). I'm looking forward to trying the other dishes as well but I'm sure they will deliver as well."
    },
    {
        "id": 9,
        "text": "My girlfriends and I came here for a nice girls dinner (we love sushi). My friend had heard that it got good reviews so we decided to try it out. WE are so glad that we did!! The space is really neat. It has an inviting, laid back, retro atmosphere. I felt like I spent the first few minutes just taking in the scenery. They did an excellent job with the decor. We were seated immediately and our server promptly offered us water and drink menus. She was awesome! We ordered edamame and the chicken/shrimp dumplings. Both were very good. We ordered 6 rolls (each came with at least 8 pieces regardless of it being a special or house roll). We got 2 spicy salmon, yellowtail scallion, spider, dragon and the Old City. They were all VERY good. Highly recommend. Even the platters that the food was served on were well thought through. A manager came over to our table to ask us how our experience was. I appreciated that touch and will definitely recommend Tuna Bar to people!"
    },
    {
        "id": 10,
        "text": "Absolutely amazing!! We made reservations but it wasn't overly crowded on a Sunday, it was a perfect chill spot. The decor is awesome and a very stylish but warm vibe. The food was phenomenal and service was great. We got the dumplings, lobster fried rice, Rick shrimp, Sindy roll, and fishtown roll. The Sindy Roll and dumplings were our favorite. Highly recommend !!!"
    },
    {
        "id": 11,
        "text": "Checked out this new sushi spot after hearing good things and I'm glad I did! The fish was clearly very fresh and the portion sizes were generous. The seasoning was excellent on the dishes. The J&J Specialty Roll was really good and I highly recommend it.  All in all, a great experience with delectable food and lovely ambiance. Will definitely be coming back!"
    },
    {
        "id": 12,
        "text": "Excellent and fresh sushi! Started with the soba noodles and ginger salad. So delicious! I got the J&J roll and I wish I had ordered two!! Best sushi I've had in the city by far."
    },
    {
        "id": 13,
        "text": "Wonderful new addition to Philly/Old City. Isreal behind the bar is a real bartender in a city of imposters, completely​ knowledgeable​ about cocktails/liquor​. ​Chef Ken is running a tight ship. the sushi is consistently​ fresh/clean everything you want in a sushi place. Happy hour is prime. Don't​ have anything negative​ to say about this beautiful new spot. I love everything down to the glassware​ and bar tools."
    },
    {
        "id": 14,
        "text": "I ordered the Rittenhouse roll and geisha roll on the special menu! I really enjoyed both. They were very fresh and flavorful. I also liked the environment."
    },
    {
        "id": 15,
        "text": "I had high hope on this fairly new but seems popular restaurant. So I went there on a Friday night with a friend of mine. \n\nAt 7:30pm, It was very crowed, fortunately we made a reservation. We were seated quickly by the window. The server was friendly and nice. Each of use ordered a drink. I ordered Lychee - it's a $15 cocktail. The drink was plain and I could barely taste alcohol. For the price I pay, I would expect a fantastic cocktail. Who wouldn't? \n\nThen it comes to the sushi. We actually also ordered a fried rice. It's very average fried rice, like the ones you can get in Chinatown for $8. But you pay double of the price in this \"fancy\" restaurant. The sushi was ok. Just ok. I'm a sushi lover, and I've tried many sushi restaurants, good and bad. The sushi we had was just average. Didn't blow my mind at all.\n\nOverall, this restaurant is over priced for the food, but I must give credit to its ambience, very modern and romantic. They also have outdoor seating. It's a good restaurant for a date night, but don't expect good food."
    },
    {
        "id": 16,
        "text": "Amazing experience at Tuna Bar tonight. The food was amazing and service was great, as well. I would definitely highly recommend."
    },
    {
        "id": 17,
        "text": "What a wonderful dinner I just ate! Came here with five friends and the table we had was extremely accommodating. Love the mood lighting and stone tables. Our waitress, Stacey, was extremely lovely and answered all our questions! We had the rock shrimp and edamame as appetizers which both were very delicious! We shared a bunch of special rolls as well as sushi. The fish was very fresh and the soy sauce was very good! Overall a fabulous experience! Will be back soon!!!!"
    },
    {
        "id": 18,
        "text": "We have had three meals since opening day. Proud to admit that this has now become my favorite sushi spot. The drinks are phenomenal. Sushi is fresh and creative. And I love the vibe in there. Ps to one of the previous comments. They have high chairs. Kids have lives too!"
    },
    {
        "id": 19,
        "text": "I have been here three or four times and have had nothing but great experiences. The drinks are great, and the sushi is always fresh. It is a little bit on the pricey side but worth the money! My boyfriend and I were walking by one night without a reservation and they accommodated us at an outside table since it was a beautiful night. Just as we got our food it got very cold and windy and they quickly moved us to an inside table even though it was a little crowded. The chef is so friendly! He stopped out our table one night while we were dining here and took time to explain that night's fish specials and came back later to make sure we enjoyed his suggestions. Overall this restaurant has great food, great service and a great atmosphere!"
    },
    {
        "id": 20,
        "text": "Been coming here since the place open and I swear it's gotten better and better every single time. We live pretty close by and we're super happy in this place opened up. Their weekend specials and brunch are pretty amazing. Some of the freshest fish in the city 100% hands-down"
    },
    {
        "id": 21,
        "text": "My first ever yelp review. I'm not the type to write reviews but Tuna Bar was just fantastic and I wanted to support the new restaurant in the neighborhood.\n\nWe ordered the pork gyoza, tuna crudo, toro sashimi and two sushi rolls. All were out of this world good. You could tell how fresh the fish was. \n\nOnly house sake being served right now but waiter told us a full sake menu will be offered shortly.\n\nI highly recommend Tuna Bar and I can say for sure that I will be back."
    },
    {
        "id": 22,
        "text": "The best for sushi and non-business lovers. \nFood and service was just amazing!\nI will definitely be back."
    },
    {
        "id": 23,
        "text": "Went here for NYE. Great space and friendly, knowledgeable staff. The food was outstanding, especially the avocado toast and flash fried yellow tail. Will go back."
    },
    {
        "id": 24,
        "text": "AMAZING FOOD, GREAT COCKTAILS AND FANTASTIC SERVICE\n\n\nEvery single decision made for this restaurant was the exact perfect choice. The food is the best in Philadelphia and the cocktails pair perfectly. The style is inventive with the backbone of authenticity. If I had three meals left in my life, I would eat here 3 times."
    },
    {
        "id": 25,
        "text": "I'm not overstating: this is the best Japanese restaurant I've been in the United States. From the beautiful design to flawless food, including very nice service, it was a perfect dinner. Miso soup is fantastic, the rolls were amazing and the kobe beef niguiri, so good!\n\nBefore leaving, the waitress called the owner to greet me and I even got a small dessert on the house. \n\nThe only bad thing about Tuna Bar: it's too many miles from my home in Orlando. I could eat here every week if it were not by the distance."
    },
    {
        "id": 26,
        "text": "3rd time ordering out and the sushi was just disgusting. I ordered the spicy tuna roll and the tuna tasted like it had been sitting out in the sun rotting for days. It was not fresh and it tasted horrible. Last time I ordered I felt sick after eating the spicy tuna and I'm afraid I'm going to feel sick again after having one piece. Very disappointed and not going to order again"
    },
    {
        "id": 27,
        "text": "I've been here four times already!  The sushi is fresh.  I really enjoyed the Fishtown Roll."
    },
    {
        "id": 28,
        "text": "I'm a foodie and this is a special restaurant. The Mai fried rice: I wanted to hug it and go to bed with it.  Everything is well thought out including the cocktail drinks."
    },
    {
        "id": 29,
        "text": "First of all they sat us by the window and then they turned the fan on. The waiter Up sold this \"amazing\" toro tuna avocado tartar so we got it and then 25 minutes pass.. nothing. They brought us the sushi we ordered before our appetizers. The sushi was average, overpriced and nothing special and they didn't serve the sushi with wasabi or ginger... we had to wait 10 minutes to ask for wasabi. Insane. They then brought us the toro app after our entree and it was horrible. The toro was falling apart and did not taste like an expensive piece of fish should. The waiter had to come back without us even asking and said I'm so sorry the toro was not up to our standards we're taking it off the bill. We then ordered another roll to supplement which was fine. Overall a $108 meal for 2 worth $60. Not going back."
    },
    {
        "id": 30,
        "text": "Hands down best sushi in Philly! I make an effort to try places around the city and this blows them all away. Superb dining experience. Exquisite!!"
    },
    {
        "id": 31,
        "text": "By far the best Japanese food in Philadelphia! Having lived in Osaka and being Chinese, this food transports me to places. I have never praised fried rice but their fried rice takes me home. Special. Tuna tartare and sashimi salad are amazing. J&J roll was excellent. Even the genmai green tea was high quality. \n\nLove the Shiso picante cocktail. \n\nI predict this to be one of hottest places in Philadelphia in the near future."
    },
    {
        "id": 32,
        "text": "TB is a GREAT new addition to Old City! This might be one of my favorite restaurants in the neighborhood. Kisso and Uzu have been our go to places for sushi but now there's a new guy in town! My boyfriend and I enjoyed the NYE pre fixe menu. Our friendly server threw in an order of tuna crudo on the house which did not disappoint. We sat at the tuna bar and both ordered drinks - a cocktail for me and beer for him. The atmosphere was energetic and fun! We will definitely be back."
    },
    {
        "id": 33,
        "text": "Phenomenal!   Awesome food, even better service and incredible atmosphere.  Ken knows how to do it right.  2 for 2."
    },
    {
        "id": 34,
        "text": "Modern trendy layout. Sat at the bar and was able to watch the chefs make everything. The food and drinks we had were delicious... sushi was spectacular but pricy.... 5 sushi and tuna roll for 35 or 8 sushi and tuna roll for 60.. my math is off... but either way was good.\n\nMy issue is with the hostess/seating. Mostly empty and told it was all booked so we sat at the bar... 2 hours later those same outside seats still open.... another group came in and sat at the bar... nothing taken.... don't pretend."
    },
    {
        "id": 35,
        "text": "I made a reservation based on the previous reviews of Tuna Bar for Valentines Day almost 2 weeks in advance. The night before the reservation (tonight) the hostess called me and informed me that they would only be offering the chefs tasting menu. \n\nThere was no information on Open Table or their website about this restriction, and I just checked again and still nothing. \n\nWhile I am usually ok with tasting menus, my purpose for booking the restaurant was just for the sushi. \n\nWhen I called back to express my concern, the hostess offered a weak apology and did not try to help resolve the situation. I am now forced to scramble the night before Valentine's Day to make a reservation because of their lack of communication. \n\nBecause of this, I will probably not visit this restaurant in the future as I am beyond upset at how the restaurant handled the situation."
    },
    {
        "id": 36,
        "text": "This place was amazing. Between the food, atmosphere, and affordability of the menu, I was extremely happy with my dining experience. I still dream of the Sindy Roll (one word: perfection) and the homemade Matcha Cheesecake ice cream."
    },
    {
        "id": 37,
        "text": "I've been here twice so far. Pretty positive experience overrall.\n\nAs far as the food - the fried brussel sprouts were excellent. Can't recall the special that I got more recently, but it was delicious though I believe overpriced. The more standard menu options are delicious and portion sizes are good. \n\nNice layout overall, though some of the seating feels slightly cramped - especially during busy dinner. Not something that would hinder me from going back for a night out with friends, but I'd choose another spot if the conversation was more business related."
    },
    {
        "id": 38,
        "text": "Everything we had was amazing! I've tried many different sushi rolls and appetizers. Every bite was amazing! The best sushi place I've been to by far.\n\nI also would like to mention the wonderful service!"
    },
    {
        "id": 39,
        "text": "Food was ok but definitely overpriced. Also they have no high chairs for patrons with children. I think tuna bar is trying to be like morimoto but falls very short."
    },
    {
        "id": 40,
        "text": "If it wasn't for the tuna tartar, which was decent, this would be a one star restaurant.  The tuna tartar had potential, but needed some finishing salt and maybe a little heat and/or crunch to make it more interesting. \n\nOrdered three rolls and they were awful.  The spicy tuna and the unagi rolls contained this weird mixture, which I assume was pureed fish.  I've never experienced that before.  The salmon rolls had too much rice and the seaweed was too thick.  We slathered the rolls in soy sauce and wasabi to make them more palatable. \n\nOrdered three pieces of sushi.  They were some of the largest pieces of sushi I've ever had. The salmon was not fresh.  The hamachi was boring.  The striped bass, which was the cheapest of the sushis, was actually the most flavorful. \n\nA crisp Riesling is usually a good accompaniment to sushi.  Unfortunately, there is not one on the menu.  The one they had was cloyingly sweet, with no acid or fruit.  It wasn't even finished!  The pinot noir was too earthy.  The cava, while not great, was the best of the options. \n\nThe main restaurant can be very loud.  The small side booths for two are a good option for a couple who want to be able to converse."
    },
    {
        "id": 41,
        "text": "Warning: be careful with reservations. We made a dinner reservation far in advance, and when we arrived our table was not ready. At first, no big deal/it happens. However, after waiting for 40 minutes outside, there was still no telling when our table would be ready. We were offered to squeeze into a (small) two person table for our reservation of three. There were no accommodations made, we were basically shit out of luck. So FYI if you plan a nice dinner ahead of time, reservations mean very little at this restaurant. They are obviously new to the business side of things, and really need to get it together. Will not be returning, nor do I recommend. (Also - first time I've ever felt the need to write a yelp review, it was that poorly handled)."
    },
    {
        "id": 42,
        "text": "I found this spot who had some interesting sushi rolls. So, we went over to check it out. With the wall facing the street being all windows, the inside was flooded with natural light. They had a quite large sushi and bar counter in the middle, with seating all around it. They also had small two-person booth seating on the side as well. Very clean decor, I am glad they didn't put up any kind of cheap or fake Asian \"artworks\" on the wall.\n\nWe ordered an appetizer and side dish to go with our sushi rolls. We chose Creamy Rock Shrimp, Lobster Fried Rice, Sindy Roll and Old City Roll. All in all, they were all very tasty, high quality and we enjoyed them very much. Yes, everything was perfect until we ordered some desserts... \n\nSince they didn't have a dessert menu, we ordered Tree Cake and Green Tea Cheesecake based on the description of the dessert that our waitress gave us. \n\nThis so-called Tree Cake...I call it \"rip-off\" cake. Our waitress described it as a cake made with almond, egg and butter. When it came out, I was shocked what it really was... If you are familiar with a common and popular sweets in Japan, one of them is called Baumkuchen which is actually a German layered cake. They can be purchased from most bakeries and stores, and not so pricey unless you go to some fancy boutique to get it. The cake we were presented with, in my opinion, was store-bought, and sliced as thinly as possible. For $10, you can buy an entire cake!!! Very disappointing... And on top of that, it was dry (with these thin slices being cut off from the cake, I wonder how long it has been since the cake was first purchased?). And if that is not enough, we were given spoons to eat this...why? I don't know...\n\nOur waitress was very friendly and polite, and we were well taken care of. Everything we had, other than the Tree Cake was great. High quality and tasty, a bit on pricey side, but that comes with the quality. I wish if we made a different choice with the dessert. But then, you live and you learn. If you go there, avoid the tree cake!"
    },
    {
        "id": 43,
        "text": "Just tried this new Japanese restaurant in Old City tonight. There we're seven of us. The service was warm and enthusiastic. Loved the ambiance, they played great music. Full bar with great selection of spirits. The food was absolutely delicious! Had an assortment of sushi and sashimi, steak, crudo, and other appetizers. Everything was quite delicious. This will definitely be our new go-to place in Philly for sushi!"
    },
    {
        "id": 44,
        "text": "I loved the sushi and the drinks. The quality of the fish seems very good. I can't wait to come back again. What a wonderful addition to the neighborhood!"
    },
    {
        "id": 45,
        "text": "Food was amazing and service was great! Drinks arrived quickly and tasted so good. Also loved the atmosphere!"
    },
    {
        "id": 46,
        "text": "This was a great dinner out with some outstanding dishes. A couple of things that did not wow me as noted below but overall I thought this place was top notch. Atmosphere was lovely and our service was mostly excellent.\n\nWok Kampachi Ceviche app: Delicious! Sweet, savory, umami yumminess.\nTuna tartare app: This was the only dish that I would not order again. The tuna was super fresh but it came too cold and bland. If you are hoping for something akin to the tuna tartare at Morimoto's, this is not it.\nLychee martini- The first one I had was very sweet without enough tang. The second one was better. I would order again. I would suggest that the bar get some fresh lychee to garnish the drink in the future. My first came with flower petals, my second came with a dried orange slice.\n\nRolls:\nSindy: Excellent! Favorite roll of the night. I had never had a roll without rice before and I'm a convert. Everything was fresh and presented just right. No weird temperature issues with the crispy eel. I'm coming back to this place because of this roll.\nDynamite White Tuna - Best spicy tuna I've had.\nDragon roll - this is a standard sushi offering. Getting it here will make you happy. Quality ingredients, perfect combo.\nPeppered tuna - the most understated of the rolls we had. Kind of like a tuna salad flavor. I liked the daikon. You might want to start instead of end with this roll. It did not wow me after the others I had with the bold flavors.\n\nSmall issue- No soy sauce on our table so we had to grab one from a neighboring table.\n\nWe'll be back for the Sindy!"
    },
    {
        "id": 47,
        "text": "Cool decor, kind staff, fresh sushi.  Some of the standout rolls where old city, peppered tuna and geisha roll (no rice). But overall all the sushi was fresh and tasty.  I like my sushi simple and not overly sauced.  This was on point. Also enjoyed the soba noodles and the tuna tartare.  They also had an excellent offering of teas. Overall, Great evening with friends over good food and drinks."
    },
    {
        "id": 48,
        "text": "Came in on a Saturday afternoon for lunch. The ambiance is nice and the staff was friendly. I wished I could say the food was as good at the service. I ordered the Chirashi and the Wok Kampachi ceviche. The kampachi ceviche was salty and was served warm. I was not expecting a ceviche dish that was listed under cold starter to be warm. Chirashi was meh. The wasabi paste had an unpleasant grainy texture and did not dissolve in the soy sauce very well."
    },
    {
        "id": 49,
        "text": "Great food, amazing service and beautiful interior. The music just seemed a bit or of place. Mid 2000's pop?"
    },
    {
        "id": 50,
        "text": "The atmosphere/decor: 4 stars \n\nService: 4 stars \nOur soy sauce pod was empty and we told one of the servers, he switch our pod with the empty table next to us lol...i don't know why he didn't refill it ‍ \n\nFood: 3 stars \nWe ordered the sashimi sampler, japanese uni and toro (my fav) but was disappointed. The \"freshness\" was average. I don't know how they have a 4 star rating. We also ordered the scallop crudo as an app but they ran out of all the ingredients that went with it (i order that app because of the ingredients). They made it with completely different ingredients and the flavors did not go well together in my opinion. \n\nI don't think i would return for dinner or recommend anybody to come here if you're looking for good sush."
    },
    {
        "id": 51,
        "text": "Great interior design for 1-on-1 dates or for bigger parties. Its basically a sushi restaurant, but kind of a fusion too because of the other types of food they serve. They also have a bar and I would recommend their cocktails (Geisha). As a party of 3 and we basically ordered 3 appetizers and 3 rolls, and it was definitely filling. The rolls came on one tray for us so we ate it family-styled. However, I saw tables where people had their own plates of sushi as well. \n\nI thought the brussel sprouts were really good, it had an asian style to it, probably from the sesame oil/seeds. The tuna tatare was served over a crispy thin cracker, which balanced out the creamy avocado and tuna. The mai fried rice was decent, just fried rice.\n\nFor rolls, we ordered the peppered tuna, white tuna, and J&J. Though the specialty roll (J&J) was almost double the price of the regular roll, there was definitely more going on and it was a lot more filling. I'd recommend getting at least one specialty roll. Still, the normal rolls such as the peppered tuna was refreshing to eat.\n\nI also noticed that they have pretty exclusive sushi such as uni, el toro, kobe, and live clams."
    },
    {
        "id": 52,
        "text": "Very nice environment, the setup is pretty intimate. They have a pretty decent selection of rolls to choose from and a solid drink menu. I'm glad it's around the corner!"
    },
    {
        "id": 53,
        "text": "Tuna bar was fantastic! We went with friends and were impressed with every dish! The ambiance was really nice. Finally, a great sushi place in old city!"
    },
    {
        "id": 54,
        "text": "Very disappointing to have to give this place 2 stars considering I live across the street and really wanted to like it here. We dined in on a Sunday around 6pm. The place wasn't very crowded and there seemed to be an abundance of servers, but we sat waiting at the table for about 15 minutes before the waitress even came to fill our water. We ordered right away and the food came out relatively quickly, but nothing really wowed me. We started with the fried brussel sprouts which were tasty but not as good as ones I've had elsewhere (I'm looking at you, Sampan). I had miso soup which was fine but served in a large bowl and filled not even a quarter of the way. Definitely not worth the $6. We shared the lobster fried rice which was okay- not an abundance of lobster and a consistency that made it very difficult to eat with chopsticks. Finally we got 3 sushi rolls (2 house rolls and a special roll). They were tasty but not spectacular and had a tendency to fall apart easily. I did appreciate the presentation of the rolls served on a large wooden platter. All together our bill was $70 (no drinks) which was definitely not worth it for what we received. Overall it was overpriced and nothing special. I will say the ambiance was nice however the music was a bit too loud. I probably will not be going back."
    },
    {
        "id": 55,
        "text": "I went here for NYE.  Beautiful space and I've been so excited to go to Ken's new establishment.  Tuna Bar is the highest quality sushi I have ever eaten in Philly.  The dishes were truly authentic, amazingly fresh and the service was excellent.  I can't say enough great things.  Good luck to them and I will be back many, many times."
    },
    {
        "id": 56,
        "text": "We ate at Tuna Bar on Saturday, June 16, 2018.\n\nNice location, cool atmosphere, and we had a great server.  The sushi was ok.  Not bad, but not great either.  The problem is the pricing.  Our main entre was the \"Large\" Sushi Sampler for $60, and a Geisha roll for about $15.  Let's just say we expected a LOT more sushi for that price.  There were literally 7 pieces of sushi and a very small tuna roll on that \"Large\" sampler.  Simply not worth it."
    },
    {
        "id": 57,
        "text": "First let me start by saying I AM STILL THINKING ABOUT THE FOOD!!!! I absolutely love sushi, but when you add an awesome location, fabulous and trendy decor, reasonable prices and outstanding service, you've got a GEM!!! Ok so my sister and i decided to have a sushi lunch date and I'd been hearing about this place and how amazing the ambience and sushi was, not to mention I follow this IG page and the pictorial post are always so mouth watering. Anyway, once we stepped into the restaurant I was immediately impressed and knew we were in for a treat, once we were seated and began glancing over the menu, my mouth began salivating immediately! OMG!!! The options are endless and my inner greedy girl wanted to order EVERYTHING off the menu! We however opted for the brussel sprouts, fried oysters and the tuna tartare as our appetizers, all were to die for delicious! We chose a few sushi roll options to split and as stuffed as i was that inner greedy girl savored every single bite, till it was all gone!!! I could really eat here EVERY day! The sushi is so fresh and good! I can honestly say, the best I've had! What an absolute GEM! This restaurant is good for any occasion (date night, girl's night, single girl night) it doesn't matter, you'll totally be blown away!"
    },
    {
        "id": 58,
        "text": "Wow! What a cute stinkin' place!!! I love the modern decor here. Like so much. I've wanted to come here for a while and finally got the chance to. Came here on a Wednesday afternoon and it wasn't busy at all so the service was fast. When I saw they had shishito peppers, I knew I had to get that. I've had such an obsession lately. And if you've never had them, you're missing out! They were good. So simple but so good. We also got a basic California roll, spicy salmon, the wentz, and dragon roll. They were all so good. I must say the wentz was my favorite and you could tell everything was fresh! It did not disappoint! I would definitely come back here and try other things."
    },
    {
        "id": 59,
        "text": "A group of us went to Tuna Bar per a friend's recommendation. The Mai Fried Rice, Old City Roll, and the Bone In Strip Steak were all excellent. The group loved the sushi and thought it was the best they ever had! For drinks, I had the Saki and the Hana - both were very good. The price was reasonable as well. Definitely recommend trying Tuna Bar!"
    },
    {
        "id": 60,
        "text": "I'll start by saying that I'm a bit of a sushi snob. I lived in California for a long time and the sushi there was on another level and I've really struggled to find a place in the Philadelphia area that can compare. We live about an hour outside of the city, but we heard about Tuna Bar and had to come check it out. I'm glad we did, this is the best sushi I've had in a very long time and I couldn't be more impressed. The owner, Ken, came to our table and introduced himself and made recommendations for what to try on the menu. We ended up ordering several appetizers and then a ton of sushi to share and it was fabulous. I'm usually just stick with sashimi and sushi, and skip the rolls, and I finally found a place with excellent fish that doesn't need to be drizzled in spicy mayo or eel sauce to taste good. I'll be a regular here now!"
    },
    {
        "id": 61,
        "text": "I thought this place was A OK. It wasn't the best, and didn't leave any impression really. Be cool for a date night, it's pretty and what not, and I'm glad I tried it. Bout it."
    },
    {
        "id": 62,
        "text": "Best sushi in philly. Second time we went and both experiences were perfect.  Great cocktails and even better sushi"
    },
    {
        "id": 63,
        "text": "The perfect spot for: Date night, girls night, group night, whatever you want! \n\nI had been meaning to try Tuna Bar out since it opened up in the neighborhood, but I don't have a lot of friends that like sushi (shameful.... I know). My girlfriend and I decided to have girls night here and it was great! They have a nice selection of wines/cocktails and plenty of options for sushi. \n\nWe ordered three rolls and shared between the two of us: the Wentz (special roll), the Fishtown (speciality roll), and a Spicy Salmon roll.  I think what I liked the most about this place was the plating. Everything is served on one long platter and perfectly set. We all know we 'eat with our eyes first' and this was definitely one of those nights. \n\nAll three rolls were spectacular. Service was just ok, but honestly the food is great and it's a great addition to the neighborhood so I'll be back!"
    },
    {
        "id": 64,
        "text": "Saw a review from Fox29 and had to give it a try! Love the atmosphere, trendy and vibrant! Quality of food is on point, service super friendly! Love the non rice options for rolls! If you are in the Old City area, must give this place a shot!"
    },
    {
        "id": 65,
        "text": "Tuna bar has great sushi and a very creative mix of food on the menu. But it's drinks are WAY over priced and its service is lacking for the price point. I love their fresh sushi but I don't go there as often as I would like because of the service and prices. The drinks are $12-15 for very small portions and the sushi portions are very small too for their cost. Their outdoor seating is nice though! Overall, good place if you're looking to spend lots of money for little food in a cool atmosphere."
    },
    {
        "id": 66,
        "text": "Just wanted to take a moment to commend the staff of Tuna Bar for their professionalism and hospitality during an unfortunate power outage this evening. Despite the entire block and their whole building losing power (absolutely beyond their control), the owner and staff went above and beyond to ensure that we had a meal that was savory and special. We were beyond impressed with their service and dedication to their customers. Having been to this restaurant several times since it's opening, even with the power out, the food was fresh, flavorful and 100% satisfying. The tuna crudo and the rock shrimp are items we will continue to order as long as they serve them. The sashimi style fish was a delight to have served simply, as to properly enjoy the freshness of the ingredients. We will continue to come back again and again. Thank you to the owner and staff!!"
    },
    {
        "id": 67,
        "text": "Great all around. Love the vibe, delicious sushi and apps, awesome atmosphere! We'll be going back."
    },
    {
        "id": 68,
        "text": "Everything was awesome. Comfortable, clean atmosphere and the food was outstanding. Definitely making another trip. Thanks Ken."
    },
    {
        "id": 69,
        "text": "Every roll is beautiful and done with artistry. Ambiance is inspired. On par with Suraya."
    },
    {
        "id": 70,
        "text": "They have the most creative sushi I've ever had. Start to finish, from the wine to dessert, everything was amazing. Wine list is solid, and the cocktails looked really interesting even though we stuck to wine. The dumplings and kobe spring rolls were insanely good. We got a lot of sushi, but the standout was by far the Old City roll. If that was the only sushi I could ever have again, I'd be a happy camper. The black sesame ice cream was also to die for!\n\nOh and shout out to the best waiter ever, Brion. If you're lucky, you'll get him as your waiter too!"
    },
    {
        "id": 71,
        "text": "Tuna bar is always amazing. Sushi super fresh. We are obsessed with this place, great vibe and incredible service. Special thanks to Victoria and Ken you are guys are the best ."
    },
    {
        "id": 72,
        "text": "Stopped in here tonight for an early dinner and was not disappointed. I started off with a Yuzu Sour, which was great. One of our guests doesn't drink and the bartender prepared her a delicious alcohol-free mixed drink upon request. All the food was outstanding, but the Brussels sprouts were the best thing I ate - the sauce was SO flavorful and just a little sweet. My only complaint is how the dining area is laid out. I'm no expert on this matter but as a party of 4 our only table choices were right in front of the entrance, or at a small round table oddly wedged in a corner. Wouldn't deter me from coming back, though. Service and food made up for it!"
    },
    {
        "id": 73,
        "text": "What an experience! Talk about magical dinners! Yesterday was my first night at Tuna Bar and I can't wait to go back. \n\nWe had made reservations in advance and were seated in what I think is the best table of the restaurant - a small table just for two by the window/glass doors. The weather was nice so they had their sliding doors open in which you could feel the breeze and the environment from the outside but also feel like you were part of the upscale dining environment in doors. From either end of the table you got views from the restaurant and from the outside which I thought was magnificent. \n\nThe restaurant per say is beautiful, it has very chic. modern and elegant decor. They have leather booths and small tables and a nice design throughout the restaurant. The music is audible but not extremely loud that disrupts your conversation. \n\nThe service was also very good and our waitress was very pleasant. \n\nAs for the meal everything we ordered was absolutely delicious. We tried the shishito peppers which were perfectly seasoned and the fried Brussels sprouts which were also perfectly crunchy. For our main course we ordered both the Fishtown and Old City sushis and they were SO SO GOOD I'm still dreaming about them. The desserts were also good but not mind blowing (this was the only ok part of our meal). We tried both the Green Tea and the Tree Cake and they were traditional Japanese Sponge Cake which was very good but not exactly what we were expecting as our dessert. \n\nOur glasses of wine and proseco were also very good - I just wish they offered half bottles at a more convenient price. \n\nBottom line is, If you are in old city and looking for a place to dine don't think about it twice."
    },
    {
        "id": 74,
        "text": "Tuna Bar is a great place to come for a date night with your boo, friends or gals. The ambience is reallly chill- dimly lit in some sections and decent lighting in others. The decor is relatively simple but very clean and modern. \n\nWe had the tuna tartare & wagyu egg rolls to start. The tuna tartare was delicious- very refreshing & the flavors were amazing. The egg rolls were good- nothing too out of this world but still very tasty. \n\nWe also ordered the Fishtown roll, salmon/avocado rolls & the peppered tuna roll. The Fishtown roll is just the right amount of spice to it. The avocado in the roll was creamy and delicious. I wasn't a fan of the peppered tuna roll but my boyfriend really liked it. \n\nA few rounds & a few rolls will cost you a few dollars, but definitely worth it for a night out with loved ones.\n\nWill def be back!"
    },
    {
        "id": 75,
        "text": "Great sushi and love the atmosphere. My favorite is the mirror on the ceiling by the sushi bar where you can watch them prepare your sushi"
    },
    {
        "id": 76,
        "text": "As a regular at the New Jersey Restaurant, Yokahama, we stopped to have dinner at the new restaurant here in Phila . Start to finish everything was excellent. Ken has done a great job with ambiance and excellent fresh meals. Service was great also. Parking was a bit of a challenge though.  Good luck Ken."
    },
    {
        "id": 77,
        "text": "Great food, great service, and pretty environment. This place has one of the best \"rice\" free sushi options I have had called The Geisha! It comes in rolled cucumber and is phenomenal. Also recommend getting the fried oysters...slightly embarrassed to say we ate her twice in one weekend - parking is almost non existent in old city and at this place so I would recommend taking a Lyft or walking."
    },
    {
        "id": 78,
        "text": "Ambiance: 5 stars\nFood: 4 stars\nService: 2 stars\nPrice: 2 stars\n\nI had the chance to try Tuna Bar for the first time with my husband and my cousin. We were all really impressed with the decor and atmosphere of the restaurant (even if we did get blasted with cold air every time someone new entered).\n\nWe started with the pork gyoza and fried oysters. When we asked our server how many oysters came in an order, she said 2 per order. We ordered two so that all of us could try an oyster. When the plates came out, there were three gigantic oysters on each of them. So, we really didn't need to order 2 at all. The oysters were OK, nothing special. They mostly tasted like breading. The gyoza were disappointing. They really didn't have much flavor and tasted basically like plain ol' pork sausage.\n\nThe actual sushi itself was really good, though. I got some salmon sushi, a yellowtail and chive roll with scallion oil, and a spicy tuna roll. I loved the sushi - it was so tender and melted in your mouth. I also can't say enough good things about the yellowtail/chive/scallion roll. It was...really unique and delicious. I would definitely order that again and advise that you try it for yourself!\n\nOverall, I enjoyed my meal here. I thought their cocktail list left a lot to be desired and that the price for everything was too steep for what you actually got. While I won't be making any grand effort to return, I wasn't dissatisfied with my meal here."
    },
    {
        "id": 79,
        "text": "4.0 - 4.5 star Review. I compare all sushi restaurants to Philadelphia's best - Royal Sushi at 5 stars. Tuna Bar may be the cities second best option in terms of the variety of fish offered and quality.\n\nNice modern restaurant in Old City located on the main floor of a condo building. Service was excellent on both my visits. You can take your time and enjoy the meal, have a drink or two. Nice laid back atmosphere.\n\nA few appetizers stood out for me - Wagyu beef spring roles, Seaweed salad, Sashimi salad and I loved the Grandmom's wonton soup.  \n\nThe Tuna Bar is at its best serving fresh sushi / sashimi.  I was with larger groups so got to try many of the house rolls which were mostly good but I was happiest ordering from the Sushi A La-Carte section of the menu. The fish was incredibly fresh and not the same boring pieces (i.e. Salman, Tuna, Ebi etc....) served at the 100+ sushi restaurants in Philadelphia.   \n\nLoved the variety of fatty tuna options (Toro and Otoro but no Chutoro when I was there - different options available depending on the day), 1-2 Uni choices, Maguro, Kampachi, Striped Bass, Hamachi and Unagi.  \n\nIf you want above average sushi options / quality, give the Tuna Bar a try. Prices are above average but to be expected given the variety and quality. \n\nRecommended\n\nBK"
    },
    {
        "id": 80,
        "text": "Stumbled in after a great first Friday in Old City, attracted by the decor and the strangely shaped building it's in! Pricier than most sushi places in center city but the interesting roll flavors were worth it. Truffle oil in the appetizer was a bit overwhelming but if you love truffle oil, shouldn't be a problem. \nWe enjoyed sitting at the sushi counter! There are mirrors above to see all the sushi making action. Servers were attentive and lovely. Clientele were hip and expensive looking, we felt sorely underdressed in our first Friday art seeking garb. Probably would need a reservation too; it was a cold day and we just got lucky."
    },
    {
        "id": 81,
        "text": "Well I can't judge the food because unfortunately I wasn't able to eat it. Online it states that the bar closes at 10, so I called at 9:20 to just get some late night sushi and they said the kitchen was closed... if your kitchen closes as 9 then the restaurant closes at 9... as a waitress myself and have worked in many restaurants the rule is when the restaurant says it closes that's when they stop serving food unless you are a bar that stays open till 2"
    },
    {
        "id": 82,
        "text": "Came here for the first time on a Sunday evening for birthday dinner and my boyfriend and I were blown away! It was a beautiful day and there was outdoor seating available, but they also take away part of the wall to the inside to merge some of the outdoor seating with the in. \n\nNow on to the food. All in all we ordered Grandmom's wonton soup, the Soba Noodles, and the Wentz, Sindy, Rittenhouse, Dragon, and Spicy Scallop Rolls. Everything was delicious! Now we're no Japanese cuisine experts but my boyfriend said that was the best wonton soup he's ever had. The soba noodles were very flavorful and tender and all of the rolls were to die for. Every roll was unique and delicious but we agreed our favorite was the Sindy roll. Instead of it being wrapped in soy paper or seaweed it's wrapped in thinly shaved tuna. Something we had never seen before. \n\nMy boyfriend had only casually mentioned it was my birthday in front of the host but the host was keen enough to pick up on that so the chef made us a small raw fish appetizer that was to die for and since we hadn't saved room for dessert our server, Dori, brought us over two small dessert drinks before we left. Very thoughtful and sweet on everyone's part! \n\nP.S. This spot is also an easy and quick walk from the waterfront.\n\nP.S.S. They have a specialty roll for dogs! You can bring your pup and order them a \"sushi roll\" that has all dog friendly ingredients in it."
    },
    {
        "id": 83,
        "text": "This is my favorite place while visiting Philadelphia. I stopped by right after they closed the kitchen but the owner, Ken,  was kind enough to open up and serve me. Fish was very fresh, amazing drinks, and wonderful service. Highly recommend to check it out."
    },
    {
        "id": 84,
        "text": "Love the happy hour here, especially the sake and the atmosphere! Happy is definitely a steal!"
    },
    {
        "id": 85,
        "text": "I really wanted to like Tuna Bar and was looking forward to our Valentine's Day dinner reservation. After making the reservation and realizing we weren't able to preview the prix fixe menu, I decided to contact the restaurant since my boyfriend has a shellfish allergy and this can often be a problem with sushi. I called, no answer. So I messaged them via Facebook. I explained his allergy and asked if this would be issue with the menu and their exact response was \"...confirmed with management and there will be no shellfish on tonight's menu...\" (See pic) \n\nGreat, so we went. As soon as we sat down and looked at the menu we realized almost half of it included shrimp aka SHELLFISH (see V-day menu pic). Now maybe they were unaware that shrimp is shellfish? Or maybe they were just too lazy to actually check when I inquired, but either way, it's pretty inexcusable to ignore someone's food allergies and risk a health scare. What if we had asked if a dish included shellfish and my boyfriend had eaten it due to their ignorance? We would have ended up at the hospital. \n\nI'm giving three stars because our waiter did his best to accommodate us once we were already seated and expecting a decent meal. The sushi roll  that he subbed for the 6th course (didn't have a name, his creation) was pretty quality and we did really enjoy it. I just can't get past the staff's ignorance regarding food allergies and a $210 dinner with drinks that we didn't really get to enjoy."
    },
    {
        "id": 86,
        "text": "I came to the Tuna Bar to interview a candidate for an executive job at my company and left a huge fan of the Tuna Bar.  We ordered the steak and a variety of raw and cooked fish.  Everything was prefect, but the highlight for me was the scallops.  A must go to place in Philly."
    },
    {
        "id": 87,
        "text": "We just had the most awful experience at this restaurant. We walked in to check in for our reservation, and the rude hostess alerted us that her system was telling us that we had canceled our reservation. Uh, no we didn't. We proceeded to tell her that we did no such thing, and that the system had made a mistake. Instead of being apologetic or even just polite, this woman went on to be extremely rude and condescending telling us that her system was not wrong and that we had canceled our reservation and they would not be able to seat us. She did not try to mediate the situation in any way, but told us that we had to leave. I can't even properly put into words how rude and unaccommodating this woman was. We will never be returning here ever again. This restaurant won't last in the packed Philadelphia dining scene with disgusting behavior such as this. Please - if you are looking for a quality sushi restaurant in the area with respectful staff, head somewhere else."
    },
    {
        "id": 88,
        "text": "Super fresh sushi and sashimi. Great interior design. Service was fantastic. We had several rolls (the broad street was a standout), lobster fried rice, sashimi, miso soup and salad. Our waitress  gave us a free piece of green tea cake. Delicious!!"
    },
    {
        "id": 89,
        "text": "Came in here with my boyfriend on a Friday night. We were seated along the back wall next to the kitchen which was kindof cool. The service and sushi were amazing.. love the ambiance in here. Only con was the price of the dinner.. but its great food!"
    },
    {
        "id": 90,
        "text": "This place sucks. I just ordered on Grub hub right after opening and the food is impressively bad. The sushi tasted old and they skimp on the soy sauce. Got through 1.5 small rolls before running out. The wonton soup at first I thought was cabbage soup because the outside is paper thin and shredded up. The wantons are not in soup, they are just in hot water. It's not even salty hot water it's literally just water. Soba noodles were adequate so that's why it gets a 2/5 not a 0, but even though they taste alright, I now have abdominal discomfort after eating them. Worst place I've eaten from in a good long while and very well not worth the exhorbitant price."
    },
    {
        "id": 91,
        "text": "Super unhappy with my latest experience.  This place has a great vibe and decent food BUT.  Some examples - ordered a Basil Hayden bourbon on the rocks. Listed at $15 on menu. Getting the check, I noted it was $18.  The bartender said it was $15 in a mixed drink at 1 ounce but on the rocks they charged $18 for 1.5 ounce.  Two things.  Deceptive to list lower price if you can charge a higher one and secondly, who the heck serves 1.5 ounces of liquor?  I have lived on the east coast for years and know the average pour is 2 ounces.  Another thing is we were told they serve inferior grade fish within the rolls compared to the sushi or sashimi...strange but in the hundreds of Japanese restaurants I have been to, I have never heard that!  Won't be back."
    },
    {
        "id": 92,
        "text": "Order:\n\nTwo Miso Soups \nWagyu Beef Spring Rolls\n3 Roll Lunch Special \n     Spicy Tuna Roll\n     Spicy Salmon Roll\n     Salmon Avocado Roll\nThe Rittenhouse Roll\n\nThe food was phenomenal, but the appetizers were super overpriced. Whoops, sorry--just opened the check. EVERYTHING'S overpriced. It was a great experience and delicious food, so I guess it's worth the bang of the buck. Will come back, but gotta wait until my next paycheck!"
    },
    {
        "id": 93,
        "text": "Love this place! Sushi is my favorite type of food and this place is great. Really liked the rock shrimp and the miso soup. The fried rice was tasty as well. Will be coming back!"
    },
    {
        "id": 94,
        "text": "I am in love with this place: from the design (asian contemporary with mid century modern mixed with a little great Gatsby vibes), the music (from eminem to imagine dragons on instrumental), the food and drinks, to the excellent service, TB is going to be my new favorite happy hour and dinner spot in old city.  I am always on the hunt for good sushi in philly and almost every place I've been to left something to be desired.Tuna bar served fresh sushi and well seasoned soba noodles that not only satisfied but had my friends raving about their next return. You know it's a good meal when we are talking about our next visit!\nSince we had a 5pm reservation we were able to partake in their happy hour specials which included drinks and $5-$7 sushi rolls. It was a great deal considering the quality and ambience. For the sushi we went with the classics spicy tuna, spicy salmon and the salmon avocados. They were able to accommodate for my friend's wheat allergy but giving her gluten free soy sauce. The waiter was very patient and thorough with making sure my friend did not encounter any wheat products. Besides our sushi, my other friend got the chicken dumplings and the avocado ginger salad, which were both excellent. We also happened to come on a particularly beautiful day so the doors were open and they had a photographer take pictures of their new menu items. One of which is this stunning cocktail called 1912 which is inspired by the cherry blossoms in DC. The bartender sprinkled hibiscus dust on top and garnished it with beautiful flowers. It was light and refreshing and not too sweet. It also doesn't hurt that it is a beautiful work of art!\nLastly we had our sweet ending with the dark chocolate sesame ice cream. The chocolate was overpowering the sesame to be honest, but I enjoyed it nonetheless. My only qualm was that the bowl and plates are a bit uneven so it's not ideal for serving. Otherwise, this is a must try!"
    },
    {
        "id": 95,
        "text": "When this place opened up down the street my husband and I were super excited that the neighborhood was starting to fill up with nice restaurants. We went in to check it out last night and we were not disappointed. Everything was amazing! The staff is super friendly, the ambiance is really beautiful, modern and chic but still comfortable and the food is out of this world. I mean, seriously. We've been to tons of other sushi places in the city and this was the best of the best. We had a bunch of sashimi, scallops, fried oysters (omg, so good), fried lobster rice and rock shrimp. The scallops were my husbands fave, I really loved the oysters and the rock shrimp. Everything was so fresh and so full of flavor. The sashimi was so fresh and \"melt-in-your-mouth\" that it sort of seemed insulting to put soy sauce anywhere near it.  We also had really great cocktails, I highly recommend trying the gin-cucumber-wasabi drink. (I can't remember what it's called, maybe Winston Heat? Wilson Heat? Something like that) I really can't wait to go back to this place, it's so perfect for date night."
    },
    {
        "id": 96,
        "text": "Went to Tuna Bar for lunch on a Sunday. Sat at a table next to the window and it was beautiful. The view was very good and so was our waiter. However, the food took a very long time to come out and we were starving. Other than that this place was awesome."
    },
    {
        "id": 97,
        "text": "This is a very beautiful spot! It's always busy and crowded there. Their sushi is good and their cocktails are excellent.\nMy friend and I shared a scallop appetizer. I don't think the fishiness of the scallop was masked very well but it was still good. Their omakase was okay.. it wasn't the real omakase experience I was expecting but the sushi choices were not bad.\nDocking one star for the omakase and scallop app"
    },
    {
        "id": 98,
        "text": "Delivery: Order was 45 minutes late and there was an item missing. Would have been somewhat manageable but the terrible customer service compounded the entire disaster. There are so many other sushi places in Philly; we will not be making the mistake of ordering from here ever again."
    },
    {
        "id": 99,
        "text": "The restaurant was well decorated and had a unique feel to it. The waiter was informative and quick and the food was good. The only thing that I can say was that the quality of ingredients were great but a little underwhelming in terms of the sushi that was served to us. I think I set my expectations a little too high for the price I saw in the menu (as I've had \"better\" tasting sushi at cheaper prices). Overall the experience and food was good and i would recommend this place for a fun date."
    },
    {
        "id": 100,
        "text": "As you enter the restaurant, you are greeted with a very modern and eco friendly decor. The host greeted us warmly and took us to our table. However, this was the turning point in our dining experience. We ordered the Fried Oysters, J&J Roll, and 2 sets of the Large Omakase Sushi set. During our ordering process, we had asked the server how many pieces of sushi come in the small and the large sets for the omakase and they responded with 5 and 10 pieces respectively.\n\nThe fried oysters we received came with very little sauce and when we bit into it there was a squirt of seawater and kind of fishy taste to it.\n\nThe J&J roll was well seasoned and each roll had a good balance of flavors and sauce. However, when you eat the fish laying on top, there was almost no flavor and almost had a hard texture to it. Something one wouldnt expect when eating raw fish.\n\nThe omakase came out with 8 pieces instead of 10 pieces as stated previously. The excuse we received was because we got to eat Otoro (fatty tuna). There was also no explanation of each piece nor sauce that we received. The sushi itself was something that you would expect out of a supermarket sushi bar, premade and refrigerated.\n\nOverall, for the price paid compared to the quality of service and food that you receive, I would not recommend this restaurant. I would give the Tuna Bar a 2/5."
    },
    {
        "id": 101,
        "text": "Fantastic cocktails and sushi. Fresh rolls, great service and location with swanky decorations. Can't go wrong!"
    },
    {
        "id": 102,
        "text": "Way too expensive for what it is. We ordered the noodle dish and it was horrible. Dry, plain and boring. The sushi was very average and nothing special. I expected much more especially for the price. The waiters were also pretty pushy, coming around every few minutes to ask us if we were ready to order yet, when we clearly still had the menus open and were looking through them. I think it must be the cool ambiance that draws people it, because it certainly isn't the food or service."
    },
    {
        "id": 103,
        "text": "My husband and I eat out frequently and Tuna Bar was on our list of our places to visit. We saved it for our anniversary date. We went on a Sunday because we were able to get childcare and we decided on a late dinner because it was easier for similar reasons. Per the website Tuna Bar closes at 10pm on Sunday and we got there around 8:30pm which should have been plenty of time to enjoy a meal. \n\nBy 8:50pm it was clear the staff was ready to wrap up, soy sauce was  collected from the tables around us and we felt rushed. At 9:15pm a staff member loudly swept around our table where we were mid-meal. Frankly this was gross and disruptive. When it was barely 9:30pm chairs were brought in from outside and were stacked near our table. \n\nI will say Diamond was our server and she was great. The food was also good but was not easily enjoyed due to the other aspects of our experience. \n\nI actually both called Tuna bar and emailed to discuss our experience and received no contact back. Poor form all around. I can't imagine choosing to go back."
    },
    {
        "id": 104,
        "text": "I loved this restaurant! Went for birthday dinner. It's a fantastic date spot and the quality of sushi is even better. Parking is easy to find in old city and they have cute outdoor dining for the warmer months."
    },
    {
        "id": 105,
        "text": "What a beautiful restaurant with great food!\n\nMy partner and I came in on a random Tuesday evening for dinner. I made a reservation via OpenTable. The space itself is beautiful and sleek - with a lot of nice accents (a lot of wood and natural textures.)\n\nThe food was delicious, too. We ordered:\n- Tuna Bar Ginger Salad (larger and more substantial than expected)\n- Stir Fried Soba Noodles (great flavor and a generous portion, too)\n- J&J Roll (our favorite of the two rolls - would definitely order again)\n- Peppered Tuna Roll (still good, but probably would skip in favor of trying something else next time.)\n\nService was very attentive and very friendly. A nice spot overall!"
    },
    {
        "id": 106,
        "text": "We heard about Tuna Bar when watching the news one night. They do sushi making classes, we definitely have to check it out! We took the train down and walked a few blocks to reach the restaurant. We arrived before our reservation but were seated right away. We had a window view which made it great for people watching, but it definitely would be better in warmer weather because the windows seem like they could turn the restaurant into an open-air concept.\nWhat we ordered: \n\nChicken and shrimp dumplings: Long chives, ginger, crispy chicken skin, steamed. Just your average dumpling. Nothing too unique about it, but they were tasty nonetheless.\n\nWagyu Beef Spring rolls: onion, ginger, cabbage, scallions, and mustard sauce. The mustard sauce was a star of this dish.  I could honestly drink it. It went really well with the spring rolls but made the dumplings much better. We honestly wanted to order like 6 more servings of these. SO GOOD.\n\nEel Avocado Roll A perfect balance of eel to avocado. It had a teriyaki-ish sauce on top.\n\nSpicy Tuna Roll  Just your normal spicy tuna roll, but it's my go-to. I definitely didn't need to eat any more sushi at this point in the meal, but I love trying them wherever I go. \n\nDragon Roll: crab, avocado, cucumber, topped with fried eel and avocados. \n\nDynamite White Tuna Roll: spicy walu, crunch, and shishitos.\n\nThey weren't kidding about the spice of this roll. The spice was at a good level between the spicy sauce and shishitos and the tuna seemed to balance it all out. Would definitely order this again.\n\n KJ Roll: seared scallops, Kani, cucumber, avocado, and wasabi aioli\n\nAlso delicious. Just the right about of heat and had a great amount of seafood in the roll\n\nRolls that weren't our favorite: \n\nBroad Street Roll: spicy salmon, avocado, crunch, soy paper, topped with king salmon and spicy salmon. No rice. \n\nThis was the roll that our server recommended. although it was good, it was probably my least favorite roll that we ordered. I'm not sure if I ever had a roll without rice, but it felt like it was missing something texturally. If you like salmon, you should order it, but it was just meh to me.\n\nOverall, we liked the Tuna Bar. The food and service were good, but the atmosphere was a bit loud for our liking. I think I saw that they have happy hour deals, but I know we definitely missed it by going on a Saturday night. I think the prices were reasonable for an upscale sushi joint. The drinks were a bit pricy, so we just had a drink (a Sapporo for him and Prosecco for me)."
    },
    {
        "id": 107,
        "text": "Loved Tuna Bar! Upon entering I was so impressed with the modern, trendy space and impeccable attention to detail every where I turned. So many decor pieces and architectural aspects I love here! They had me at wrap around banquet seating in a pop of turquoise. I had a feeling I was in for a good meal from the interior design alone. I was...\n\nFirst visit was for a casual, lighter lunch with my daughters and an old girlfriend which it was just perfect for! We did make ressies on Open Table which wasn't necessary for a mid week lunch, but I would suggested for dinner. \n\nWhile we stuck to some basics, they were pretty great! California, California with real crab made crispy, cucumber roll, peanut avocado (the kids' favorite!), seaweed salad, edamame, and incredible Brussels! Must order! Everything was super fresh and came out in a timely fashion. \n\nService was fantastic! \nPrices were fair. \n\nI can't wait for my next visit perhaps for date night when I can taste some of those delicious sounding cocktails and dig into some entrees. \n\nI love having Tuna Bar as a new option in the Old City area just a bit away from the hustle and bustle, whether that be for lunch, happy hour (which sounded really great!), or dinner...with the kiddos, or without. It will be be on my radar for the next First Friday or after a movie at The Ritz!\n\nI actually found it a tad difficult to spot from the street. It's the door just to the left of United Blue. Not a huge sign. It's there, trust me :) \n\n*Limited kiosk meter parking."
    },
    {
        "id": 108,
        "text": "I will say the food and drink above average but the atmosphere and setting are very nice and romantic.   Not bad for a romantic dinner and gathering but not so sure if they have the best Japanese or Asian foods there"
    },
    {
        "id": 109,
        "text": "This was our first time at Tuna Bar and we were very impressed. The food was amazing and came out super quick. The cocktails were creative and delicious. Can't wait to go back!"
    },
    {
        "id": 110,
        "text": "If you're looking for high quality sushi at a reasonable price, this is the place! I am a sushi snob having lived in NYC and Singapore for years, and this is the only place I've been to in Philly that remotely compares aside from Morimoto and Tomo. Their tuna is very fresh and high quality, the salmon and yellowtail are always very good and fresh too. They do a spicy tuna roll 'the right way' with little mayo and big pieces of sushi, as opposed to the mushy, orange paste-y consistency of most spicy tuna rolls I've had in Philly. The lobster fried rice is also very good with a fresh flavor but a little light on the lobster. I haven't tried anything else as of yet.\n\nWhat sets this place apart is their happy hour and daily specials - you can't beat it anywhere in The City! Salmon avocado, spicy salmon, or spicy tuna toll for $5! You can also choose from chicken and shrimp gyozas and a couple other items for $5. Drinks specials are $5 for the cocktail special and about $4 for beer and wine. Tuesday is Tuna Tuesday where you can get tuna tartare for $7, and Wednesday is hand rolls for $5. \n\nThe service is definitely one of my favorite things about this place. The bartenders are friendly and prompt and super professional. The atmosphere is really cool, a mix of rustic with an Old City feel. They've been open for a year, but I wish I'd found them sooner!"
    },
    {
        "id": 111,
        "text": "Very good! Great food in a beautiful space. Highly recommend for a date night, happy hour or lunch with friends if you want something yummy and stylish!"
    },
    {
        "id": 112,
        "text": "This place is really good. It isn't your all-you-can eat or $4 roll type sushi spot so be prepared to spend a little more but in my opinion it's totally worth it. Aside from the food below the place is really comfy inside and super swanky. \n\nMy girlfriend had a real California and a shrimp tempura roll, I had a real California and the small Omakase (which comes with a tuna roll as well) and we both had the gyoza to start. Both the gyoza and sushi were the best I've had in Philadelphia for sure. The Omakase nigiri was absolutely phenomenal, every piece was perfectly formed and just delicious. Real sushi chefs behind the counter. Gyoza was flavorful, pan seared just right as well. \n\nService was good, albeit a *tiny* bit slow but we were also there an hour before closing on a Friday night when there are tons of people there at the bar and sitting outside -- our waiter was doing the best he could. He was also super friendly and knew everything about what was being served. \n\n2 drinks and the food above - $105. Very worth it."
    },
    {
        "id": 113,
        "text": "Tuna bar is an awesome addition to our city that already has some awesome sushi spots.  I love the ambiance, the decor and the cozy feel.  Its modern and very cool inside.  The food is outstanding, we ordered EVERYTHING and cant wait to go back so we can order more. They have a bar with a nice drink menu that compliments the sushi perfectly.  So glad to have a new neighborhood sushi bar around the corner and wait to come back!!!"
    },
    {
        "id": 114,
        "text": "I was pleasantly surprised by this place. TLDR; this place has steep prices for the drinks and sushi so if that's a problem, go elsewhere. There is a happy hour, but we went for dinner. \n\nSuper nice trendy decor. My date made a reservation and we're were seated at a nice two person booth by the sushi bar. \n\nDrinks are steep. Like $10-15 a drink. But the drinks were strong and super creative. Since I was on a date I didn't take pics, but they were super pretty. We got the lychee (vodka, lychee, lemongrass, and sake) and the winstons heat (gin, wasabi, lemon and cucumber). Both were super refreshing. \n\nFor the appetizers we got the creamy rock shrimp and the brussel sprouts. The shrimp portion was small but these two were probably my favorite of the night. We ended up getting a regular tuna roll along with king salmon, bluefin, and yellowtail sashimi. \n\nBy the end I was pleasantly full and buzzed haha. A great end. Anyway, for two people, we hit the $130s range. Expect to pay that much for dinner with drinks."
    },
    {
        "id": 115,
        "text": "I came here as my cousin accidentally stumbled upon this sushi place and saw how it was always busy - so why not right? We managed to squeeze in early as it as a weekday after the rain and no one was exactly out. I highly recommend reservations here as they are literally always booked and it was my cousins 3rd try. Their sushi is extremely fresh and they do have very unique takes on rolls compared to what I have seen in the area. Our waitress extremely patient and kind. The decor is beautiful but of course its dim and romantic so you can't really see what you're eating either. Seating is small and parking is of course limited.\n\nEverything about the place is insta-ambiance worthy and picture perfect but I can't help but feel it was a little over-hyped. We got the Tuna Crudo which was delicious (aka tuna carpaccio as a comparison fyi) as an appetizer. As for the rolls, the only memorable one that is all over yelp and pictured everywhere is the broad street roll which is that salmon roll you see with the beautiful filters. I thought it was unique in that it had no rice and the fish was fresh but other than that I am not sure what I was expecting. If you want romantic lighting with your sushi and date, here is your place and it caters to the area!"
    },
    {
        "id": 116,
        "text": "Nice ambiance. Good place for a date night, but pricey for average sushi. \nWe ordered the tuna tartare which was pretty good but the chips were a bit greasy. \nThe fried brussel sprouts were prob my favorite out of all that we ordered. \nFor sushi, we got the Geisha Roll, spider roll, spicy tuna, and yellowtail with scallions. Sushi here is over priced and it all tasted average. The soft shell crab batter was not as crispy as I would have liked. And my boyfriend did not like the chewy texture of the yellowtail sushi."
    },
    {
        "id": 117,
        "text": "My favorite new restaurant in Old City! We come here once a week, it is truly a beautiful space and fun menu. Best to dine here during the week so it isn't so crowded.  You must try the wonton soup - best you will ever have! Waitstaff and bartenders are all knowledgeable, the head chef is often there when we stop by and he is incredibly welcoming."
    },
    {
        "id": 118,
        "text": "AMAZING AMAZING. Our fav in Philly this is a must if you are looking for good delicious and fresh sushi. Ken the owner is incredible service outstanding. We come here at least once a week everything in the menu is delicious and fresh. Tuna Bar is the real deal and they have one of the best Happy Hour in the city."
    },
    {
        "id": 119,
        "text": "Delicious food and gorgeously decorated interior!\n\nI'd highly recommend their Brussels sprouts. I'm not sure what's in them -- maybe miso and fish sauce? -- but they're absolutely delicious and set apart from the roasted sprouts you get in most other restaurants.\n\nThe J&J roll is probably my favorite. It's so flavorful; you can't go wrong."
    },
    {
        "id": 120,
        "text": "I'm visiting from New York with a few friends and we decided to try this new sushi spot for Christmas Eve dinner. I'm so glad we did because it was the highlight of our trip! \n\nThis may be a bold statement, but Tuna Bar is the best sushi I've ever had (and I've tried a LOT of sushi). \n\nEven the atmosphere is so interesting. The lights and decor are clean and aesthetically pleasing. The hostess seated us immediately at our reservation time and handed us menus, as well as a drink menu. \n\nTo start, we ordered Sapporo beers, a Geisha (green tea, soju, sparkling white wine, green tea flakes), and a See You Later cocktail (which had rose petals on top). I had the Geisha, and it was a great pairing with the sushi- very light but flavorful. \n\nFor our appetizers, we split a tuna curdo (my favorite dish), tuna tartare, edamame, and a seared tuna salad. Everything was amazing and flavorful. The tuna was the best fish I've ever tasted. \n\nThe owner of the restaurant brought us complimentary shishito peppers, as well. They're simple but delicious! I'm actually craving them now. \n\nFor the rolls and sashimi, we ordered a variety- old city roll, white dynamite, peppered tuna roll, maguro sashimi, and a peanut avocado roll. I attached pictures of the menu that explains what's inside each. \n\nThe maguro sashimi was my favorite. It's just a piece of fish, but it was so tender and flavorful. Even the wasabi that I put on the fish was unique! Much different than the generic, gooey wasabi from every other sushi restaurant I've tried. \n\nI absolutely LOVE Tuna Bar- I wish they had one in New York, but that just means I'll have to visit Philly soon!"
    },
    {
        "id": 121,
        "text": "Sooo good. Everything we got was delicious. Big fan of the Mai Fried Rice. The creamy rock shrimp was a pretty small order for $12 though. Cutest little spot in old city!"
    },
    {
        "id": 122,
        "text": "This place is amazing. Tuna flatbread is to die for. The staff is beyond nice and welcoming. Love this place. Need to bring the rest of the family. Nancy that works there is so sweet. A+++++++"
    },
    {
        "id": 123,
        "text": "Now there is tuna bar and the. The rest of the sushi restaurants in Philadelphia.\nDon't expect rolls mounted with heaps of unrecognizable mayo mixes; this is real clean cut rolls and prime grade nigiri and sashimi.\nA must go to restaurant!\nThe service is impeccable and the decor perfect.\nNice crowd too.\nMust go"
    },
    {
        "id": 124,
        "text": "A girl friend and I had dinner rez's for 6pm on a Thursday at Tuna Bar. It was a beautiful night, so not surprisingly it wasn't long before it got crowded. We opted to get a drink at the bar before heading to our table, so after Happy Hour it started picking up for sure. \n\nMy friend and I shared a bunch of sushi rolls, and split a seaweed salad. \nMy favorite thing I ordered was probably the peanut and avocado roll - surprisingly! \n\nI may be back, but I want to explore other sushi places in the city first."
    },
    {
        "id": 125,
        "text": "I went to Tuna Bar for happy hour on a weeknight! The restaurant wasn't too busy that night, although it seems pretty packed on weekends. We ordered everything but the miso soup from the happy hour menu. We got the several of each of the spicy tuna rolls, spicy salmon rolls, salmon avocado rolls, special rolls, chicken and shrimp dumplings and edadame. We basically got almost everything that was on the happy hour menu, since it was pretty limited. Each of the rolls came with 6 pieces, and we ordered 3 rolls per person. The rolls were good, but I would probably prefer to go somewhere like Double Knot, that has a more extensive happy hour menu. However, I liked the vibe and pretty decor of the restaurant!"
    },
    {
        "id": 126,
        "text": "Raw oysters were bad!!  The Rittenhouse Roll (lobster) left us with indigestion.  Dragon Roll claims \"crab\" but is mock crab stick.  Prices are high relative to portion, even for Philadelphia.  Parking is impossible, so be prepared to pay.  Would not return or recommend."
    },
    {
        "id": 127,
        "text": "This place is great. I feel like Philly has the whole spectrum of seafood (ranging from pretty mediocre to incredible), and Tuna Bar definitely falls on the latter side. Tucked away next to the Delaware River, this place is a great place for hanging out with friends, going on a date, or just grabbing a drink. My friend and I got multiple sushi rolls, and drinks as well. The cocktails are stellar as well, and they complement the dishes perfectly. It's not the cheapest meal, so I would plan accordingly before you start ordering everything on the menu (and trust me, you will definitely want to)"
    },
    {
        "id": 128,
        "text": "Let's start with service - poor service due to their lack of friendliness and manners. The waiter had a very gloom face and seemed to be impatient when we were trying to order he was trying to rush us. My Dinner with three other Colleagues felt like a fast food restaurant quick eats and go. Nothing great about this place.  \n\nFood was not that great. I ordered 2 different kinds of sushi rolls. \n\nLet's just say I won't be back here note suggest this place."
    },
    {
        "id": 129,
        "text": "Tuna Bar has great quality sushi. Their sashimi always is well prepared and tastes very fresh. I also really enjoyed the brussel sprouts and Gyoza appetizers. Its a step above most places in terms of quality. And, the restaurant is very classy - almost a swanky vibe.\n\nAlso, they have some really cool Tea Pots, if you order tea to finish off your meal.\n\nFour stars based on price (I feel like everything is $1 too expensive). But, worth it."
    },
    {
        "id": 130,
        "text": "Quality over quantity of reviews. Don't let that turn you away from making this your new sushi hang out spot. Easily one of the best places you can get on good quality sushi for a ridiculously low price, during happy hour. The atmosphere has a chill ambience, even though it makes you the dining experience of a high end restaurant without the price tag."
    },
    {
        "id": 131,
        "text": "What an awesome addition to old city! By far the best restaurant in the neighborhood. Amazing attention to detail from plate presentation to flavors on the plate. Prices reasonable. Great cocktails! Can't wait to be a regular!"
    },
    {
        "id": 132,
        "text": "Great place for sushi! I usually go for happy hour because I think normal prices are a little high but the quality and taste definitely make it worth it. My favorite is the spicy salmon hand roll but you can't really go wrong with anything on the menu! Happy hour is 5-7pm. On Wednesdays they have happy hour along with $5 hand roll special."
    },
    {
        "id": 133,
        "text": "I will never eat Northeast Philly sushi ever again. It doesn't even compare to Tuna Bar. I sat at the bar and tried the Rittenhouse Roll. Spicy tuna, cucumber, avocado, kombu soy wrap, lobster tempura, and a truffle masago sauce. It was absolutely delectable. This is the holy grail of sushi. My mom ordered a happy hour saki which is graciously overpoured. Her spider roll was also to die for. Definitely a sushi staple in the city."
    },
    {
        "id": 134,
        "text": "I can't even review the food because we never ate. My husband made reservations through Open Table for last night. We took an expensive uber ride into Philly and when we got there a sign was on the door that it was closed for Lunar New Year. I respect the holiday but why were we 1) able to make a reservation and 2)no one called or texted to let us know it wasn't open. I know restaurants sure want to know if patrons aren't going to show and we would like the same courtesy."
    },
    {
        "id": 135,
        "text": "It had only been a few weeks since my last visit here, but I had the night to myself and decided I felt like traveling to Tuna Bar for dinner.  I'll admit to being a creature of habit, so no one that knows me would be surprised that tonight, absent the prodding of my wife or friends, I ordered items that I had before.  \n\nI started with Grandmom's Wonton Soup because I needed something soothing.  I believe I tasted a very slight hint of vinegar in the broth.  I'm not exactly sure what it is, but whatever it is, it provides a modern flare to the broth, to go along with the delicate and very tasty deconstructed wontons.  The dough used for the wontons is extremely light, and the sausage is more significant with great flavor.  My second course, the Wok Kampachi Ceviche, was not only as delicious as before, but this time the kampachi was a more generous serving than my earlier experience.  \n\nRather than a number of smaller dishes, tonight for my third course, I decided to order a larger entree.  The Salmon Shokiyaki proved to be just the right choice.  I like my cooked salmon to have a warm pink center, yet a slight crispness on the outside.  This dish was perfectly done with a warm pink center, slightly crisp, along with a glaze on it that I think may have been miso based.  I'm not sure about the glaze, but it doesn't matter because I'd order it again anyway.  \n\nBetween the food and a sampling of a few sake's, it was a great way to spend my free time.  At this restaurant, the only other thing I really wished they served might be an assortment of robatayaki.  Are you listening Ken?"
    },
    {
        "id": 136,
        "text": "This was a bit underwhelming. I ordered ginger salad, dynamite white tuna roll, and the old city roll. I also also had the winstons heat and rave street cocktails. Here are the issues, the winston's heat could have been more strain for a cocktail. While I love cucumber, there were way too many bits in the cocktail (see photo). The service was subpar. The waiter explain that he had \"forgotten\" about our salad order after nearly 35 minutes of waiting. My part visited during lunch and there must not have been more 10 people attending during our time. Ironically the salad was the best part of the meal. The ginger dressing was delish but maybe a bit over dressed. I found the rolls to be entirely too fishy and not too flavorful. Also call me skeptic, but I don't like the boxes that the sushi is served in. The little wooden rates and obviously hard to clear because we could see debris under our rolls. That is inexcusable especially during a time for a heightened need for cleaning. I was hoping this would be a new sushi gem in philly but it was just underwhelming."
    },
    {
        "id": 137,
        "text": "Vibes: simple, casual but refined, dark wooden tones, candlelit; a bit reminiscent of Double Knot's aesthetic\n\nMenu: short, curated categories of small plates, sashimi/sushi by the piece, and rolls \n\nTasting notes:\n-Wok kampachi ceviche: fish was thinly sliced, lightly seared on one side, a means for picking up the strongly ginger, salty sauce; this was very much of a light but absolutely lovely appetizer\n-Lobster fried rice: tender pea shoot leaves among extremely umami shiitake mushroom slices and bite-sized chunks of sweet lobster; rice was not too oily and on the chewier side; a very shareable dish\n-Mai fried rice: small pieces of sweet, meaty sausage contrast with the refreshingly crisp chopped snap peas and surprisingly large, full shrimp; mixing in the runny fried egg added a subtle creaminess; cilantro is the garnish, an fyi for people who might be like me and not love the flavor\n-Yellowtail house roll: kept simple with yellowtail and avocado with a little bit of garnish, very clean-tasting\n-Fishtown roll: basically a rainbow roll with crunchy, sweet, firm shrimp tempura wrapped inside with a mayo sauce; the size of each piece and the ratio of fish on top to the rest of the bite (rice, shrimp) was perfect for me\n\nNoteworthy:\n-Server was very attentive and friendly and great at explaining the night's specials, down to where the seafood was sourced\n-Booths good for groups and cafe-style round tables for date nights\n\nWill be back for: the A5 wagyu beef sushi-style (because last and only time I had it was in Japan a couple years ago!), happy hour, lunch when they get around to it, because I'd love to dine when natural light flows through the giant windows!"
    },
    {
        "id": 138,
        "text": "I'm hungry just thinking about this place. Best fried rice I've had in my lifetime, I can't believe we just discovered this restaurant. Amazing atmosphere, like an upscale sushi bar. Really nice wine selections and truly to die for food. Even if we hadn't been starving at the time of our dinner, we would have devoured it just the same. We will be back!"
    },
    {
        "id": 139,
        "text": "This place is seriously awesome. The decor is u unique  and the service is great. They just opened and still adding new thins to the menu.\n\nWe asked for a tasting menu which isn't featured on the menu and worth asking! The chef recreated his grandmothers soup recipe and had fresh fish right off the truck from Japan. It was unbelievable.\n\nDessert was awesome. We had dark chocolate ice cream and green tea ice cream with pieces of cheesecake. \n\nThe experience was so wonderful and I highly recommended this place!"
    },
    {
        "id": 140,
        "text": "Hip, mid-century modern decorated sushi spot with some hits and some misses but overall a good time. \n\nCame with a party of 7 to celebrate my mom and aunt's birthday. We opted not to bring a cake because they have a $45 cake fee. \n\nThe drinks here were strong and I quite enjoyed them. I tried the Winston's heat, which was very much cucumber-y and refreshing, the NORI-Grets, which basically tasted like a margarita, and the Yuzu sour, which was a bit too sour for me. \n\nWe ordered a bunch of dishes for the table, which came to around $400 with tip and tax. \n\nThings I'd recommend:\n1. UNI: the uni here was surprisingly fresh (compared to a lot of their other fish). While MP was $12 a piece, I'd say it was pretty worth it. Not sure if the UNI is always this fresh, but we definitely came on a good day. \n\n2. Vegetable fried rice: I'm sure all the fried rices here are good (they have 3 different choices in total, a sausage one, a crab wasabi one, and a veggie one): We opted for the veggie rice and it was delicious - Super simple, but full of flavor. A bit greasy, but definitely a delicious and straightforward dish. \n\n3. Grandma's Wonton soup: I didn't try this, but this was a dish ordered for my grandmother (we thought a grandma soup would be good for a grandma lol). She really enjoyed this! These are Fuzhou style wontons so they're super small, but she ate this entire dish and that doesn't happen often - so they must've been authentic and delicious! \n\nThings I thought that were just OKAY: \n1. The rolls: We ordered the eel avocado, California, avocado, and peanut avocado roll (lots of avocado lol). While they were pretty solid (was personally not a big fan of the peanut avocado roll), I'd say it really wasn't anything special. I guess they presented it in an aesthetic way, but definitely not any better than the regular $5 lunch special rolls at a random sushi joint. If you're a fan of sushi rolls, their rolls are definitely a safe option to order but again, they won't wow you. \n\n2. Oysters: My mom actually really enjoyed the oysters, so this might be a preference thing. They weren't bad by any means but I definitely didn't like that the oysters were pre-seasoned and flavored. Whenever places do that it naturally makes me question the oyster freshness. We ordered 12 oysters in total, 6 East coast and 6 west coast. The oysters were around $3, which I thought was pretty pricey - especially because dollar oysters are pretty easy to find. I pay for $3 in NYC when I've missed happy hour and am REALLLLLLLY craving oysters, otherwise I can't really justify the price - especially in Philadelphia and for the size/taste of these oysters. Again, not bad but not worth it in my book. \n\n3. Seaweed salad: We ordered this for my grandmother who's pretty picky with what she eats. It tasted like standard seaweed salad. Not really sure what else to say about this one. \n\nThings I'd skip: \n1. Tuna tartare: My cousin mentioned this was a dish that was pretty popular here so we decided to try it. Tuna didn't taste very fresh. \n\n2. Big tuna sashimi: Tuna, again, didn't taste fresh. I'm confused why this place is called tuna bar when their tuna doesn't seem...great. Our waiter described this as an \"omakase\" but we chose to order and share with the table. The best part of this plate was the tuna rolls. The sashimi slices were fishy and honestly the color of the fatty tuna made me feel, for lack of better words, A BIT FISHY, about this place. \n\nOVERALL, this place is a fun time and has a great atmosphere. Their fish and tuna truly is...whatever, but I'd still recommend this spot for a nice date or hangout with friends / family."
    },
    {
        "id": 141,
        "text": "Food was good, our waitress was wonderful but the manager was extremely rude. I absolutely cannot respect a restaurant where the manager is rude. I had to ask twice (over a three hour period) to have someone add toilet paper to the bathroom... how is that possible ??? The second time I went  to the bathroom, I was obviously a bit frustrated given the fact that I had already notified an employee and the restaurant wasn't packed. Instead of being understanding, the manager was SO RUDE and defensive; making up excuses, etc. It was baffling... Figure it out and refill the bathroom with toilet paper ??? Anyways. Food is great, management sucks. There are other great sushi places in Philly with management that isn't rude."
    },
    {
        "id": 142,
        "text": "To me, 4 stars seems about right. A bit higher end in the quality of the sushi here and food here, but prices overall are a bit higher than many places. Overall, given the higher quality, I don't mind that too much. The atmosphere and service are both pretty nice, with a pretty neat space that is decorated nicely. Servers were able to answer questions that I posed.\n\nHaven't tried the whole menu yet, but can recommend a few things. Overall, I like the hot entrees a bit better than the sushi and the cooked food is quite good in general (and mostly reasonably priced). Sushi is a bit on the pricey side, but nothing crazy for the quality. Having said that, I think the sushi at Kisso down the street (will review soon) is just as good, if not better. But this is a more fun place to go, so the jury is out...\n\nAppetizers: Tuna Tartare ($14), Creamy Rock Shrimp ($12), Pork Gyoza ($8), Chicken and Shrimp Dumplings ($8), \n\nSoup: Grandmom's Wonton Soup ($7)\n\nSashimi: Toro (fatty tuna-$12), Hamachi (yellowtail-$8)\n\nTraditional Rolls: California ($6), Real California ($9), Spicy Salmon ($7)\n\nHouse Rolls: Peppered Tuna Roll ($9-favorite roll here); Dragon Roll ($12)\n\nSpecial Rolls: Fishtown Roll ($17), Sindy Roll ($16), Old City Roll ($17-very good)\n\nHot Entrees: Salmon Shokiyaki ($23-outstanding), Bone-in Strip Steak ($36-outstanding), Lobster Fried Rice ($16), Mai Fried Rice ($14-outstanding), Stir Fried Soba Noodles ($15)"
    },
    {
        "id": 143,
        "text": "So there seems to be some a few mixed reviews on this place and I honestly can't see why. It's a beautiful restaurant, the food and service was great and their specials were amazing. The ambience is perfect for a date night. We ordered the brussel sprouts which were nicely charred and doused in sweet and salty sauce, and the tuna tartare which isn't a super unique dish but it was done very well and it came with rice crackers to serve as a vehicle for the tuna. We also went with some happy hour rolls of spicy tuna, salmon avocado which were $5 each then a peanut avocado roll as well for $6. The peanut avocado roll is so simple and so good. I actually ordered a second one I liked it so much. I've had spicy tuna at more places than you can count, and this is exactly what you want when ordering spicy tuna. You can tell a restaurant knows what it's doing by the rice. Tuna bar knows what it's doing. Again, these aren't super original, but just done very well and a bit more refined than your typical fusion restaurant. We finished the meal with some Mochi for dessert that had 3 flavors and they were all delicious.\n\nSince there's a lack of happy hour info on Yelp, here's the down low on their happy hour. This could be the best happy hour deal in the whole city. It's Mon-Fri from 4:30-7. Drink options are: one sake (mine was only $4 and poured traditionally overflowing into a masu box), one house red and one house white wine for $7. We went with the white and it was pretty good. You have the options of 3 beers, Kirin, Kirin Lite, and Orion for $5, $4, $4 respectively. Then there's one rotating house cocktail for $7. The night we went, it was a gin martini made with craft vermouth which is a ridiculous deal for just $7. Judging the way they handled the sake alone I'm sure their bar program is excellent. I will return to confirm this.\n\nHappy hour food: 3 rolls for $5 each, Spicy Tuna, Spicy Salmon, and Salmon Avocado. There's also chicken and shrimp dumplings for $7, edamame for $4 and shrimp and oysters for $2 a piece. \n\nBonus tip: (as far as I know) every Tuesday is Tuna Tuesday. Spicy tuna rolls are $6 all day and tuna tartare is $7. Every Thursday is Toro Thursday. Negitoro rolls are $7 all day. \n\nJust come try this place for a happy hour, you'll never want to leave."
    },
    {
        "id": 144,
        "text": "Beautiful decor, delicious food and friendly, prompt service! Have been here twice now and both visits have been outstanding. We have ordered from hot dish side both times. We could eat the rock shrimp all day!!! The dumplings, rice and noodle bowls were also outstanding.  Can't wait to return."
    },
    {
        "id": 145,
        "text": "We came for happy hour and got lots of amazing food on the happy hour menu too! First of all, the service was ON POINT! The waitress was very sweet and the food came swiftly . Did I mention the happy hour sake ?! Omg it's actually two pours in one ; it comes in a sake box filled with sake. We got the entire happy hour and it was DELICIOUS! Very fresh and not over the top with sauce . The roles were light rice and a great amount of fish for happy hour ! We live a block away and we will be back often ! We are so excited to have a good sushi restaurant around the corner . Life is good. Ask for Jenna the server. She is amazing ."
    },
    {
        "id": 146,
        "text": "I was nervous to try a different sushi spot than my usual favorites. I was right to be nervous. The sushi was very underwhelming. It tasted like suburb sushi at city prices. The drinks were amazing and the ambiance of the restaurant was nice, so if you wanted to come here for drinks I recommend it. Unfortunately there was nothing special about this sushi at all. For $180 for 2 people I expected to have a better meal."
    },
    {
        "id": 147,
        "text": "I was happy that Tuna Bar had indoor seating as an option! Everything was nicely spaced out and clean! Our waiter was very friendly even though our rolls seemed to take a long time coming out. The miso soup was Luke warm but good. The rolls were delicious! The speciality rolls were creative and yummy. The King ghidora roll was by far the best! Slightly spicy and super fresh! Tuna bar is a great spot and I've been several times- last night wasn't their best but the rolls are worth it!"
    },
    {
        "id": 148,
        "text": "The food is so good. Full bar with a variety of high end liquors and sakes to choose from. Can't wait to be back!"
    },
    {
        "id": 149,
        "text": "Delicious food & great service. Peppered tuna, yellowtail & chives, and the Rittenhouse were our favorite rolls. Highly recommend !"
    },
    {
        "id": 150,
        "text": "I absolutely adore sushi! (My friends even joke that if they find out I'm having a bad day or in a bad mood just bring me sushi and all will be good again.) So I'm always excited to try out a new sushi place; however, I have to say that Tuna Bar was just average {I would give 3.5 stars if Yelp let you give .5 stars!} The sushi was good and extremely fresh but I just wasn't amazed by the flavors like I hope to be when ordering Speciality Rolls. We ordered the J&J, the Old City (does not come looking like the picture shown on Yelp; it is all flat) and the Fishtown rolls. The Tuna tartare appetizer is delicious though so I would 100% recommend starting with that. The staff is very attentive and the atmosphere is great so I'd suggest it to others in the Old City area but there are much better options in Philly!"
    },
    {
        "id": 151,
        "text": "This is one of my top places to eat in Philly. To give you a sense of the quality of this restuarant, my first visit here I was given complimentary dishes by the chef. Prices are a little expensive for the amount of food, which used to make think I would be hungry after eating here, but after ordering a roll or two of sushi I was surprised by how full I got (so full that I couldn't even finish my appetizer of fried oysters). The food tastes delicious, would definitely recommend the sushi (my go to is always spicy tuna)."
    },
    {
        "id": 152,
        "text": "Our friends raved about this new restaurant in town so my boyfriend and I went on a double date here with them. Upon arriving, I was impressed by how modern and chic this place looked - honestly not what I expect when I think Japanese restaurant. Love all the high glass windows all around that allow you to see in. \n\nFood was amazing. Loved the Fried Brussel Sprouts that were seasoned with sesame oil and miso - nice Asian flare. Tuna Tartare was good and had lots of avocado. Kobe Beef Spring Rolls (it was a special and I just had to try it) had a decent amount of meat in them and came with a dipping sauce.\n\nGrandmom's Wonton Soup - our friends raved about this so we each got a bowl. This is FuZhou style - I laughed when I read it on the menu because I am from FuZhou and this is a traditional soup that my grandma would ACTUALLY make for us eat all the time at home, or you could buy it for like less than a dollar in noodle shops. It was funny to see it being served at an upscale place like this for $8 bucks. It was delicious nonetheless and a nice warming appetizer.\n\nWe ordered a bunch of sushi and rolls afterwards and they brought it out all together on a huge wooden tray for us to share (presentation def did not disappoint). Our server was incredibly sweet and very present - she made sure to keep the drinks and food coming. Overall, it was a memorable meal and a perfect spot for date night!"
    },
    {
        "id": 153,
        "text": "PROS:\n-Service is excellent\n-Place is immaculate, new, contemporary, and has a good vibe\n-Perfecttttt lighting for 1st - 4th date with someone\n-Wonton soup is unique and tasty\n-Sashimi is excellent\n\nCONS: \n-Cold\n-Tuna Crudo is too salty\n-Slightly overpriced for the quantity\n-Music doesn't really go with the decor (music in the bathroom is fun though)\n-Menu isn't exciting"
    },
    {
        "id": 154,
        "text": "I don't post much but WOW. I had to give this place major props after tonight. We went for dinner but got there early (6pm) so we got to take advantage of happy hour drinks and sushi. We got the oysters from the happy our menu ($2) per oyster and So. Good. We got 4 between the two of us. We also got the happy hour spicy tuna roll and spicy salmon roll. Again, really good. \n\nFrom end regular menu-make sure you order the Brussels sprouts (some of the best I've had in Philly) and the shishito peppers. We also got the peppered tuna roll (good, but not my favorite). \n\nThe sashimi was so fresh (yellowtail and king salmon). We'll definitely be back. Service was amazing. Ambience was on point. Food was exquisite."
    },
    {
        "id": 155,
        "text": "Came here for my sisters birthday with a party of 6. It was pretty good! The edamame and Brussels sprouts were great appetizers and we got a few rolls to share. Good spot for a nice and light bite while in the area. We also got some saki to start the night and it was really good!"
    },
    {
        "id": 156,
        "text": "Amazing sushi in a cool space. The sushi bar is the best place to sit. There's mirrors above the chefs so you can watch them making the sushi. Good cocktails and definitely worth traveling to a somewhat sleepy part of town. It is a short walk to old city."
    },
    {
        "id": 157,
        "text": "Ambiance is nice, it is very modern and trendy. The menu is a little plain, not a lot of variety in choices and prices are higher than elsewhere. I would have liked to see more nigiri platter or chirashi/don type choices. That said, the Sindy roll was probably the only roll worth coming out of the way for. The appetizers were just okay."
    },
    {
        "id": 158,
        "text": "I was anticipating the opening of Tuna Bar and went here right after it opened and had some amazing rolls. The place has a very nice atmosphere."
    },
    {
        "id": 159,
        "text": "delish!!! Would recommend pork gyoza, tuna tar tar, old city roll, hurts, and the broad street. Normally wouldn't go for a roll w out rice but didn't miss it in the broad street. Will be back!!"
    },
    {
        "id": 160,
        "text": "service was attentive and great accommodating to our needs. Decor was really nice, a wood finish and a bar. Presentation of the food was neat, however, 3 stars because it just didn't taste that good. The slices of the fish were healthy portions, but there was something missing, like I've had it somewhere else before. When I grade sushi, the first bite has to give me that \"oh, this is good and the taste is different...\" This place is great for a date because it's got a dimmed ambiance and sometimes I'm looking for a nice place just to talk."
    },
    {
        "id": 161,
        "text": "Loved the vibe of Tuna Bar, which had a bit of zing that carried outside to those of us dining al fresco on a windy, October evening. Overall, the fish was fresh and tasty, though I would have liked a little more flavor on some of the specialty rolls.\n\nWe started with: (1) Grandma's Wonton Soup (traditional fuzhou style pork wontons, scallions, celery), which was delightful--a very gentle broth and ghost-like wontons floating therein; (2) Pork Gyoza (kurobuta pork, scallions, ginger, pan-fried), which were nicely crisp, flavorful, and served piping hot; and (3) Wagyu Beef Spring Rolls (onion, ginger, cabbage, scallions, mustard sauce), which included some delicious beef, however, the beef overwhelmed the rest of the spring roll.\n\nWe rolled on with: (a) Yellowtail & Chives house roll (avocado, chive oil), my favorite roll of the evening--that chive oil gave it a certain special something; (b) King Ghidorah specialty maki (spicy tuna, shishitos, hot sesame oil, topped with yellow-tail, jalapeño, tobiko), my second favorite roll; (c) Dynamite White Tuna house roll (spicy walu, crunch, shishitos), my third favorite roll; (d) Fishtown specialty maki (shrimp tempura, avocado, jalapeño, topped with tuna, salmon, yellowtail, spicy aioli), although this roll looked like it would have the most flavor, it didn't deliver on its looks, tasty, sure, but not my favorite; and (e) Eel Avocado classic maki.\n\nThe service was stellar and I appreciated the wider-width sidewalk permitting outside dining to be away from the flow of pedestrian traffic. Will return to check out the indoor dining vibes."
    },
    {
        "id": 162,
        "text": "At first blush it seemed like an excellent addition to the old city restaurant scene.  Unfortunately the restaurant has zero customer service. They'd rather argue with their customers than provide a dining experience that matches the prices.  Yes the prices are expensive... and the food isn't extraordinary... for example the wonton soup taste like it is drenched in vinegar....  I'd recommend taking your hard earned money elsewhere... Especially since ownership believes their clientele is beneath them...."
    },
    {
        "id": 163,
        "text": "First off, I'll have to admit to having a bias since my wife and I frequent their sister restaurant in Maple Shade called Yokohama. That said, Tuna Bar is a tremendously hip new addition to the Philadelphia restaurant scene. The food is of excellent quality and presentation, while the restaurant is chic with a New York City vibe. \n\nI actually ate there two nights in a row so that I could get a true taste of the cuisine.  The Wok Kampachi Ceviche was excellent but my favorite was the Scallop Crudo.  You should try Grandmom's Wonton Soup, which is a creative new rendition of the old time favorite that I highly recommend.  I even had my favorite roll, the Sindy roll, which I eat at the Maple Shade location. It was delicious as usual. \n\nThough Tuna Bar may borrow some rolls from the Yokohama menu, make no mistake, the food at Tuna Bar is original, upscale, and very creative.  The menu is evolving as it is perfected, and getting better by the day."
    },
    {
        "id": 164,
        "text": "My new favorite sushi place in philly! So I agree with some of the other reviews, it is VERY hard to find amazing sushi in Philadelphia. It's just difficult to come by, while this sushi was not the best I have ever had, the experience was five stars. \n\nFirst, I love the ambience. This is a place that suits many occasions, first dates, get together with friends, lunch with a coworker, etc. I would say definitely more of an intimate setting, I came here with Megan F. for a lunch during a work break! Such great vibes. Love the bar area and full length windows, just adds to the ambience! \n\nWe tried their steamed chicken and shrimp dumplings as an appetizer and for rolls we split the J&J roll, peppered tuna roll, and the east roll. The east roll is just your standard salmon sushi roll, nothing too crazy.  The J&J is a great roll for people trying to transition into the sushi eating world of actual raw fish! Loved the seared tuna on the outside. Hands down, our favorite was the peppered tuna roll! I'm a spicy tuna roll enthusiast and I decided to switch it up with this roll. I have zero regrets, a definite must try and great chance of tuna palette.\n\n\nOverall the place and the sushi varieties are very modern, definitely worth a try if you're near this area of philly!"
    },
    {
        "id": 165,
        "text": "Went here for a night out with my roommate. Awesome vibes right from the start.\n\nWe got lost finding the entrance so we called inside. The host gave great directions and even said \"are you in the black jacket? I see you!\" So sweet!\n\nWe had a reservation and got seated right away. The indoor is absolutely beautiful! \n\nI started off with a cocktail (could not remember which one) and we split the tuna tartare. We also got the pork gyoza to split. Both were AMAZING and we tore through them in probably minutes. \n\nI ordered a wonton soup as a starter. By the time our entrees came it had not, so I asked about it. He said they were out of wonton soup (weird) but it was also 10 pm, so it was fine! \n\nFor our main course, my roommate got shrimp tempura and I got the fish town roll. I was not expecting that much heat, so be careful!! I ended up taking the jalapeños off but it was still delicious! \n\nAfter that, I had consumed quite a few drinks, and was getting drunk hungry. I last minutes ordered the fried rice with the egg on top. Amazing!!! Satisfied every craving! I even left with some to go (that I finished before I went to bed )\n\nWill 100% be back soon!!"
    },
    {
        "id": 166,
        "text": "Tuna Bar is a modern and sleek restaurant.  This may be an odd observation but I felt like the lighting was perfect because it wasnt too dark or bright. We opted to sit at the beautiful bar. Our server was very friendly and provided great recommendations.\n\nWe started with the Creamy Rock Shrimp which was lightly battered. The gochujang added a nice mild spice.  The shrimp was okay, nothing to write home about. We also had the Tuna Crudo which was way bigger than we anticipated. \n\nWe opted to try several rolls: salmon avocado, Sindy, Rittenhouse and the unagi sashimi. The sushi and sashimi were beautifully presented on a wooden board. Sindy was my favorite roll as it was super light because it didnt have rice. We noticed the salmon may not have been as fresh as the tuna that day. Overall, it was good though. \n\nWe kept it simple with drinks and had sake and Japanese whiskey.  Can't wait to go back and try some cocktails!"
    },
    {
        "id": 167,
        "text": "Amazing, the one thing was it didn't have toro.  Would come again!  Loved the tuna!  Amazing place all around! The drinks were great too!  Tuna bar is a good place."
    },
    {
        "id": 168,
        "text": "We had a reservation for 7:30 and they were unable to seat us. There were tables open for parties that had not arrived and they refused to seat us at the open table as the party which had yet to arrive had more people. We waited 45 minutes WITH A RESERVATION; the management and owner were extremely rude and unaccommadtibng. After having us sit outside in the cold 45 minutes, we decided to leave and will never return."
    },
    {
        "id": 169,
        "text": "My bf took me here for Valentine's Day and wow, he did good!! We sat at the sushi bar and watched all the yummy sushi being sent out . Eventually decided on the old city roll (the one that everyone gets). It has rock shrimp on top of the roll, which was very pretty and tasted good, but nothing special. Next we got the dragon roll, which was by far my favorite!! It was bursting with flavor and we ended up getting a second dragon roll at the end of the night! We also did the spicy salmon and eel avocado, which I'm happy about. Overall, service was super fast!! We ordered 4 rolls and it came out in what felt like less than 5 minutes! And then we ordered one more roll and that was in front of us in about 2 minutes. Incredible. I also loved the ambiance- very intimately lit and makes for a very cute date spot!"
    },
    {
        "id": 170,
        "text": "Went to Tuna Bar last week for their sushi-making class and had so much fun! Chef Ken taught us how to filet a Hawaiian yellowtail, how to make sushi rice and how to make our own sushi rolls! Overall, it was a fun and interactive experience. I would absolutely do it again."
    },
    {
        "id": 171,
        "text": "Super expensive! Still delicious sushi and nice for occasional and special meals. Great ambiance and experience."
    },
    {
        "id": 172,
        "text": "Delicious food, great sushi and great drinks! This place is so cute on the inside and out. Located in a great area of the city - it is a must if you like sushi!"
    },
    {
        "id": 173,
        "text": "Wow... simply speechless. Tuna Bar is hands down the best restaurant for sushi in Philly. \n\n5/5 STARS!\n\nFood: First and foremost, their food is amazing. I have been to many sushi spots in the greater city and Philadelphia area but Tuna Bar's sushi has the best overall quality and taste. Their speciality rolls are to die for. My personal favorites are the Sindy Roll, Rittenhouse Roll, and Hurts Roll. As for favorite appetizers, it is definitely the tuna flatbread and their oysters. Yum. \n \nDrinks and Cocktails: The best part about going to an amazing restaurant for food is having an amazing alcohol and drink selection to complement the meal. Personal favorite cocktails are the yuzu sour and the race street. If you're a sake fan then definitely ask them about their wide variety of sake. Cheers! \n\nAmbience: The ambience and the atmosphere of the restaurant is amazing. The \"vibes\" are great. They are always playing great music that sets a positive mood for everyone. Big ups to whomever created that playlist! \n\nService: Last but certainly not the least, their service. Simply wow. Tuna bar has the best service. I have to give Ken, the owner, a thumbs up for creating such an amazing establishment with an amazing team. Their General Manager, Tina, was phenomenal. Her professionalism, positive attitude, and seasoned experience can be seen from a mile away. I remember on a busy Saturday night, she was juggling 5 things at once, but still managed to provide my family and I an amazing time. She was super friendly! The rest of the staff were A+ too! \n\nWould I go again? YES YES YES. \n\nRecommend to a friend? FOR SURE. \n\nStop reading and book your reservation now."
    },
    {
        "id": 174,
        "text": "Went to Tuna Bar last week in person, and then had for takeout tonight. It is my new favorite sushi spot in Philly. The rolls are all unique/delicious, and most importantly the quality of the fish is unmatched- where you don't even want to use soy sauce because the taste is so good. I recommend the fishtown and king ghidorah rolls. You really taste the unique touches like shishito and hot sesame oil. Already looking forward to next time. Highly recommend!"
    },
    {
        "id": 175,
        "text": "Tuna Bar is a new sushi joint located in the Old City neighborhood. Modern with retro inspired decor, I felt thoroughly welcomed by the warm staff the second I walked through the door. I would definitely recommend making a reservation, especially on a weekend, as the place was pretty packed when my dining companion and I arrived. \n\nThe menu is relatively small, but from our experience, everything was made with thought and care. We started off with cocktails, the tequila for us both. While the smell let us know it was a generous pour, it was easy to drink and not overly sweet. We split 4 rolls in total: Fishtown, peppered tuna, dynamite tuna, and spicy salmon. The presentation was beautiful, and every roll was delicious, although my favorite was the Fishtown. It was clear that all of the fish and other ingredients were fresh! Our meal a bit pricey, which we expected, but worth the splurge for great sushi!\n\nAs others have stated, the service at Tuna Bar was simply outstanding. The owner himself even stopped by before the end of our meal to inquire how we were doing. A lovely dining experience overall!"
    },
    {
        "id": 176,
        "text": "Opted for a few take out rolls for lunch. I tried the Miso; Hamachi Avocado; Spicy Scallop; Spicy Tuna; Shrimp Tempura; and Broad Street rolls. I'm glad I tried the miso soup, which packs an interesting sweet flavor with buttery soft tofu. My favorite from the order were the Hamachi and Broad Street. Overall, everything was tasty and fresh. Would love to try dining in next time for sashimi and appetizers."
    },
    {
        "id": 177,
        "text": "This place is awesome! My boyfriend and I are huge fans of sushi and decided to come to Tuna Bar to celebrate Valentine's Day. We were so glad we did! We ordered the creamy rock shrimp as an appetizer and it was small but fantastic, highly recommend! We shared the Rittenhouse roll, Fishtown roll, and Broad Street roll. All were fantastic! The place had great ambience and was a perfect date spot."
    },
    {
        "id": 178,
        "text": "Went for brunch. Very affordable & well made sushi. Bottomless mimosa for $20 is a good deal. Large fresh juice selection. Sake selection is very nice as well! Will definitely go back & recommend you everyone for well made fresh sushi at a great price!"
    },
    {
        "id": 179,
        "text": "Will never return.  I must have been to Tuna Bar at least 10 times last year.  However my last experience was the most atrocious experience I have ever had.  I understand that it was the first opening day and some hiccups are to be expected, but Friday is quite beyond.  First we arrived at our reservation time of 7:30.  Once we arrived we were told by the very disheveled matradee that they were running about 30 minutes late.  No issue so we took a walk around the block.  We arrived back at 8 and were told we were the 2nd table to be seated after 1 couple and they were cleaning 2 tables at that moment.  We sat on the bench at which point I watched him seat 2 couples.  Then another customer who showed up later than us went and said something and he sat them at a 4 top.  At that point I went back up and he looked at his computer and couldn't find my name. He eventually found it and looked confused.  He said I'll be the next couple and said here's a $25 gift card.  It was only $15 when I opened at home.  We waited another 15 minutes at which point a waiter started going to everyone including us to tell us they were out of food.  \n\nThere were multiple chances to tell us they would be out.  Instead we waited and waited, watched other people be seated when we were due to be next.  I rather write to you directly then putting my review on social sites as I think you should know about my full experience.  The waiter did give us a $50 gift card as he did with others for running out of food.    I emailed the restaurant direct with no response.  DONE"
    },
    {
        "id": 180,
        "text": "Atmosphere - 5/5 \n\nBeautifully designed space, with a nice ambience to it. Music is neither too loud nor soft. Logo is simple and nice. Menu has a nice feel with minimalistic approach in design. Overall, the interior design is one of my favorite things about this place.\n\nService - 3/5\n\nHost is friendly and the waiters are nice. Nothing extraordinary. The only thing I thought (and maybe it wasn't appropriate for me to expect?) was that there would be an introduction to the sushi sampler/omakase we ordered. I'm clearly not a sushi expert so I had no idea what I was eating, but I kind of wish I did. I guess I was used to an intro/story typically offered at other sushi places for an omakase.\n\nFood - 3/5\n\nWhat I ordered the few times I've been here:\nRittenhouse Roll, J&J, Omakase/Sushi Sampler & Fried Oysters \n\nThe rolls were great. I enjoyed the Rittenhouse Sq Roll thoroughly and the J&J was good to taste. The fried oysters and sushi samplers weren't my favorite. The fried oysters were too sea watery for my taste, and the sushi samplers didn't feel too fresh to me.\n\nPrice - 2/5\n\nFor the price of the food, I would expect a little more from the food and service itself. The interior design matches what I would expect in pricing. \n\nOverall I would give this place a 3.5 if I could. Thank you for the experience!"
    },
    {
        "id": 181,
        "text": "Service was great - trendy spot in Old city! They have plenty of seating for any size group. There's the sushi bar as well as a full alcohol bar with seating to be at. There are small 2 seater \"booths\" that would be cute for dates  as well as large tables that have a mix of a sofa seating as well as chairs. \n\nThey do take opentable reservations! However, when we got there, it wouldn't have been an issue to get a table - but we also went at 8 Pm on a Wednesday:) \n\nStarters:\n\nBlood orange fluke - best part of the meal. The fluke was so gooood and went really well with the capers, blood orange, and radish pieces! I couldn't get enough! A must ORDER!! \n\nRock shrimp: this was good as well!! I liked it because it wasn't coveredddd in sauce or heavily fried. It was the perfect balance of sauce and batter  - there was radish pieces as well - which I loved! Gave it a nice, refreshing crunch to your bite. \n\nLobster rice - this was just your usual fried rice ... with lobster and mushrooms. Some at my table said it was too salty - I think it was the mushrooms - but the rice itself was decent. I'd order it if I wanted fried rice ‍\n\nSoba noodles with shrimp - this was good too. My pick over the rice, actually. However, we had this after the rock shrimp and fluke - and those seemed to be the best! \n\nSushi: \n\nSushi was decent. But nothing heavenly delicious. I have yet to find a good sushi place in Philly  however, the starters were really good, which would make me want to go back and try the other dishes besides the sushi. Sushi wasn't bad, but it wasn't amazing either. But good place to go to take care of that sushi craving! \n\nThe sushi that we tried....\n\nJ&J : this was the best out of the 3 we got. It tasted fresh and flavorful. It had a bit of a rich taste which made you feel full after 2! \nBroad street: this was okay. Too many ingredients made the sushi feel soggy and the flavors didn't seem to have .... flavor. Just wasn't a good combo, in my opinion.\nDynamite : your typical rollllll- which isn't a bad thing. Smaller than the first two, good to have a traditional roll with your specialities!"
    },
    {
        "id": 182,
        "text": "Amazing sushi. MUST TRY. And worth the drive from center city.\nAlso tried the dumplings, fried rice and rock shrimp. Ended up ordering seconds of the rock shrimp. Can't wait to go back!"
    },
    {
        "id": 183,
        "text": "I had had dinner at Tuna Bar less than one week after their opening and was extremely impressed! Upon arrival I was glad I had made an Open Table reservation as every table was reserved and the last bar seats had just been swiped. At first glance, you notice the stunning and modern decor. This place is gorgeous! From the wood bar to the cool fans, you get the trendy ambiance that is often missing from sushi spots. \n\nThe bar menu was small but each drink was really interesting. It's clear that they are committed to craft cocktails and keeping an upscale bar. Our waiter also informed us that a lengthy sake menu will be arriving soon.  \n\nThe food was delicious! Started with the rock shrimp. Perfect. Moved on to the lobster fried rice which was extremely flavorful and not at all greasy. Had a few rolls for our main course all of which were extremely fresh and with a good rice to fish ratio. \n\nThe service was friendly, knowledgeable and not at all overwhelmed or (seemingly) stressed considering it was open weekend. Overall, I left already thinking of when I would go back. \n\nYou can't go wrong checking out this new old city gem!"
    },
    {
        "id": 184,
        "text": "Stopped in here for my birthday a couple of weeks ago. Great quality fish and delicious ingredient combinations. A lot of the special sushi rolls that sounded good were mainly tuna though. I would like to see more choices with another type of fish, but can't complain too much hence the name, Tuna Bar. \n\nAlthough the food was amazing, the service could be better. It took a little longer for our server to come check on us after the food came out. It was later in the evening, so I figured they were busy closing out on a few other tables - fair enough. However, we were then not checked on again for another 30-40 minutes after we were done eating. We all kind of just sat there with empty plates and water glasses wondering if we should ask the hostess to track them down. The restaurant was not busy at all at this point...maybe four tables throughout the whole restaurant (with 3 or so servers working) and a few people at the bar. Nonetheless, we will be back as the location and food outweighs the hit or miss service."
    },
    {
        "id": 185,
        "text": "Loud, over-priced, very slow service make for a lousy dining experience especially when there are two better options within a couple of blocks. If you want trendy with people looking down at their phones this is the place for you. If not, Tomo and Kisso are a much better experience."
    },
    {
        "id": 186,
        "text": "The hostess greeted us warmly, but the waiter treated us so cold that he completely ruined the dinner. When we ask him questioned about the rolls, he answered with unmistakable contempt, very short and quick answer, no smile, aloof. We were shocked. We won't come back."
    },
    {
        "id": 187,
        "text": "One of the best sushi places in Philly especially in terms of the freshness of the fish that they serve. They also have very authentic tasting pickled veggies as a  side to the sushi dish. The service was just as great"
    },
    {
        "id": 188,
        "text": "Clean, nice atmosphere, great service and excellent food and cocktails.  I've never been disappointed."
    },
    {
        "id": 189,
        "text": "Great fish quality with prices that are a steal. Beautiful warm atmosphere with very at tentative wait staff. Our waiter apologized for the food being late and gave us complimentary edamame and miso soups. The chirashi bowl had over 20 pieces of fish and the variety was great. Definitely savored the fattiness in the tuna sashimi. Would highly recommend this place! Good job Sushi Hachi!"
    },
    {
        "id": 190,
        "text": "5 stars ALL AROUND! The sushi here is amazing. The quality and the taste are superb! Not to mention it's a good looking restaurant with some pretty cool decor and a great ambiance.\n\nWe started with edemame, tuna tartar, tuna curdo and seared tuna salad. They were all amazing but my favorite was the tuna curdo which is basically thin slices of raw tuna in a delicious sauce. Order this app it's incredible.\n\nMoving on to the rolls... We had the old city roll, white dynamite, peppered tuna and some yellowtail sashimi. Let me repeat the quality of fish they serve he is the best I have had period. All of these rolls were extremely tasty but my favorite was the peppered tuna! It comes with an amazing wasabi drizzle and the tuna is pepper crusted.\n\nWe also had a few Sapporo beers and the ladies had cocktails the geisha and the I'll see you lata. They said the cocktails were Great!\n\nWe had such a good time and enjoyed the food so much that we told the owner it was the best sushi we ever had. We are visitors from NYC and tuna bat does it better than any of the upscale sushi spots we have been to in NY. We have even discussed going back to Philly just to have dinner at tuna bar again. Absolutely love this place! Best meal we had in Philly by far!"
    },
    {
        "id": 191,
        "text": "The Sushi here was the best sushi that I have eaten in a very long time. We got three types of specialty sushi rolls and a dozen oysters (the west coast oysters were the best). Even their drinks were delicious! The only reason I am giving them 4 stars instead of 5 is because the wait time for our food was a bit long. Nonetheless, when I am back in Philly, I will definitely come back here!"
    },
    {
        "id": 192,
        "text": "Delicious! Just moved to the neighborhood and so happy this is nearby. Their sushi is fantastic (I love the Rittenhouse roll) but their non-sushi fare is just as good. Wonderful wine selection and incredibly friendly staff."
    },
    {
        "id": 193,
        "text": "I took my Danish friends here since they came to visit Philly. Convenient location for us who lives in the old city. The atmosphere and the service are always nice. Food is good. Mr friends said it was the best experience they had. So I am satisfied. Thanks, Tuna Bar! I think their food improved after covid. Since I lived in Japan half of my life and another 10 years in nyc, I won't say it was the best of the best. But for Philly, I say Tuna bar passed the test:)"
    },
    {
        "id": 194,
        "text": "Stopped by here Friday on a whim after checking out the art galleries in the area. Was able to sit at the bar due to a wait for tables but understandable. The bar is made out of pieces of wood that kinda scream Fixer Upper is on the DVR. The vibe of the place was urban and perfect for its location. For apps we ordered the Roasted Brussel Sprouts. Tuna Crudo, Miso Soup and the Pork Gyoza. \n\nThe Miso was $6 bucks, when I asked my companion was it $6 bucks worthy there was a reply of lacking flavor but the size was equivalent to 2 $3 bowls somewhere else. \nThe Brussel Sprouts: Now I confess I hadn't had brussel sprouts since at least 12 and that pushing it but I decided to step out of my comfort zone and try them roasted instead of boiled and I am now a fan. The sesame oil was perfect and they were charred just enough to elicit the flavor of the sprouts to be slightly sweet.\nTuna Crudo: My companions loved this dish and advised the truffle oil was slightly overwhelming but delectable.\nPork Gyoza: Always good and great with the left over truffle oil\n\nThe perk of sitting at the bar was watching the chefs make the rolls and trying to figure out which one was ours. There is a mirror above the bar and more than once did we find ourselves staring at what was going on. We ordered 4 rolls to share: Fishtown, Old City, J&J and the Real California. The J&J was my favorite the shishito pepper would kick in right at the end for a spicy finish. The Old City looked to be the most popular coming off the bar and it made sense - its a instagramable plate in its own right and has a good flavor combo. I initially ordered the Fishtown and depending on what piece of fish you got on top kinda determined if it worked in my opinion. We decided to try the Real California roll for fun and honestly I could have done without.\n\nOverall I liked it and would try it again. I do wonder if they are going to rotate rolls to keep it fresh."
    },
    {
        "id": 195,
        "text": "Tuna bar is always great!! Great drinks, food, and ambiance. It is definitely high end sushi so has the price tag to follow but it is definitely worth it to me. Any piece of sushi you get here will be great and it has the best rock shrimp too. Will be coming back for future special occasions to come!"
    },
    {
        "id": 196,
        "text": "Walking in, it has a nice Japanese contemporary style to it. I've been here twice and both times have been pleasant. \n\nThe cocktails were excellent I like anything tequila/mezcal base\n\nHad the shishito peppers, always a big fan of that. Blistered up with a simple soy sauce.\n\nHad the different oysters, it was fresh and delicious. Wasabi fried rice was good, enough wasabi to give you that kick I like.\nI forgot which sushi rolls i've tried but they were all good and packed with flavor.\nTried the toro and it was melt in your mouth goodness. \n\nEverything came out pretty quick, the waiter was pretty attentive.\n\nI would def come back, the bathroom has some bumpin ass music lol I heard meek mill in it one time LOL"
    },
    {
        "id": 197,
        "text": "This place gets 10/5 for ambiance! It's in a great location and it's so modern inside and provides a great atmosphere for a girls night, date night, friend date, family date, etc. etc. etc. Outdoor seating is available. They have the ceiling to floor doors that they open wide during a nice night which gives you the feel of eating outside even when you are dining indoors. It's relatively small inside so I definitely recommend making a reservation if our plan to come at a busy time. \n\nThe service was good. A little slow but we weren't in a rush so it worked for us.\n\nWe came during happy hour and got two spicy tuna rolls and two spicy salmon rolls (which are $5 each at happy hour prices). It took a while for them to come out. I actually thought she forgot about them. They were just ok. \n\nMy friend got the edamame which she enjoyed. I got a ginger salad. It said it had avocado so I assumed they were just trying to be different by calling it a ginger salad instead of an avocado salad. Most sushi restaurants that I go to have an avocado salad on the menu with ginger dressing and it has at least a half of an avocado on top. This salad came out almost immediately after I ordered it and it was super cold which makes me feel like it's one of those restaurants that pre-makes salads and keeps them in a fridge or cooler. The avocado was so sparse I barely even knew it was in there. Not what I'm used to! To be fair, I assumed it was the avocado salad that I get at other sushi restaurants. \n\nWe split the lobster fried rice because so many people raves about it in the reviews. It was decent. Not amazing. It was kind of egg-y; I felt like that was the dominant flavor. \n\nThe other special rolls I ordered are pretty forgettable. One was a KJ, I believe. That's all I really remember. I don't remember what the other one was even called or what was in either of them. What's not forgettable is the price point of these unforgettable rolls. Their special rolls cost $15 to $21 per roll. ($21? Seriously?) They were falling apart as we tried to pick them up with the chopsticks. The wasabi was more mild than I'm used to. \n\nThe bathrooms are individual rooms for one person at a time. There was different music playing in the bathroom and it felt like a dance party. I was jamming out in there. Lol. \n\nThere is kiosk parking located nearby. Just a short walk will get you there. I'm not sure of any lots. \n\nThis place is great for the atmosphere but I've had wayyyyyy better sushi at a way lower price point. I feel like you are paying for the location more than anything. While I loved the ambiance, I don't really know that it would be worth returning to. I have sushi so infrequently that if I'm in the mood for it, I would rather go somewhere with better sushi and maybe not as awesome of an environment than mediocre, overpriced sushi in a modern, breezy location. \n\nThis is a miss for me and I can't really recommend it...unless you really want to pay a lot for mediocre sushi."
    },
    {
        "id": 198,
        "text": "I recommend this place if you want an Instagram worthy dinner, not too hungry, and have tons to spend on your budget for dinner.\n\nWe came here on a freezing cold nights and had indoor seating in a packed restaurant. Ambience was great but you cannot hear the third person on either side of you because it was so loud. The server didn't come for 15 minutes at least to follow up on our orders every time, So it took us 30 minutes to get our order in after sitting down.The rolls were good, but instead of the usual eight pieces I would expect for this kind of special doll price, they only came with seven and were small on top of that. Appetizers were extremely small and I think there was four pieces of shrimp and a $12 rock shrimp appetizer, each one barely 2 g in weight. Well this is a great place for a date or a girlfriend hang out with tons of martinis, we ended up getting cheesesteak afterwards because we were still hungry."
    },
    {
        "id": 199,
        "text": "Deceivingly Average\nI recently went to this restaurant for my birthday dinner. Upon entering the restaurant, I was pleasantly surprised by how fresh, clean, modern, and beautiful the restaurant was. After sitting for 10 minutes, I noticed that my date and I still had not been approached by any server. Finally, after getting our drink and dinner order in, we received our food. The first two courses were served promptly, the last main course, not so prompt. Honestly, the food was just average. This disappointed me as I was expecting the food to match the beautiful decor.  I was also not impressed with the lack of service. I really had high hopes for this place but it let my partner and I down in two crucial areas: food and service. Needless to say, our check, which was above $100, did not seem to meet what we got. To anyone wanting to try Tuna Bar and are willing to spend above $100, try the many other restaurants in the city where quality meets the price point.  Only then will you know why Tuna Bar falls short."
    },
    {
        "id": 200,
        "text": "Food is solid, but our server Samuel was not professional. He belongs in a hipster bar in northern liberties."
    },
    {
        "id": 201,
        "text": "Finally made it here for happy hour and will most certainly be back.\n\nNot the biggest HH food selection consisting of only 3 rolls and 3 appetizers, but the 3 appetizers were all tasty and I would recommend them: chicken and shrimp dumplings, well seasoned edamame, and shrimp cocktail at $1 per jumbo piece. Also, the sake was cheap on HH and went down a little too easily. \n\nOutside of the HH menu, my group also tried the Brussels sprouts (good, but not on the level of San Pan/Double Knot), and I had the Wentz roll with shrimp tempura, spicy crab salad, and avocado. Loved it! \n\nThey have great outdoor space that opens up through the restaurant. It was a particularly hot and humid evening so we opted to sit indoors near the opening instead."
    },
    {
        "id": 202,
        "text": "Very hip and trendy, food was good but service was very very slow. Maybe just because our waitress was overwhelmed. Location was nice and definitely a good place to bring a date. Got the noodle dish with shrimp, salty but it was good. Drinks are very pricy , house sake starts at 20.00 for small. Might come back next time in town, maybe service will be faster since they are new."
    },
    {
        "id": 203,
        "text": "For a restaurant which just opened, they are doing very well.  Sushi is definitely high standard as are the cocktails.  Sake menu is non existent yet (one house sake on offer when we were there) but should be coming along. \n\nLoved the lobster fried rice as it was not greasy and cooked to perfection.  The kind where you can taste each rice grain. \n\nTuna crudo was clean and tasty and I would definitely order it again when I come back. \n\nI loved my nigiri pieces, cut well and tasted great.  Not sure why they didn't dab a bit of wasabi under the fish but I adjusted my own wasabi so no biggie..  My wife's Sindy roll was very tasty by fell apart way too easily. \n\nVery modern casual ambiance and pleasant staff made for a great overall experience. \n\nLocation is great and I hear parking deal (validation) is coming as parking could be challenging. \n\nNot many places in Philly serving good sushi, this place is and I welcome them.\n\nI wish you guys at the Tuna Bar lots of luck and success and hope you keep the great atmosphere, quality ingredients and quality chefs cutting away for a very long time! Congratulations!"
    },
    {
        "id": 204,
        "text": "Great restaurant! I went here for happy hour recently. Beautiful restaurant and bar. Happy is allowed anywhere in the restaurant (4:30-7pm). They have some $5 sushi rolls and drink specials. All were great and the fish was very fresh. The regular menu looked great, i look forward to returning!"
    },
    {
        "id": 205,
        "text": "*WOULD RECOMMEND*\n\nLocated at the heart of Old City near the pier, Tuna Bar is a great upscale Japanese restaurant, perfect for dates. They offer both indoor and outdoor seating. The place itself looks very classy and modern. Their menu have a large selection, prices are a bit on the higher end but you are getting fresh, qualify fish. Not only is the food delicious but  the presentation is also just as nice. I loved that the rolls comes in a wooden tray. Also they have pretty good green tea that they serve in a steeping pot. Be prepared to spend a good lump sum while you're here.\n\n*LUNCH*\n- Tuna Tartare - Fresh tuna and avocado. I love the rick crackers that they serve this dish with\n\n- Gyoza - pretty standard gyoza, though the skin was not as fried and crispy as I've had at other places.\n\n- Broad Street - Salmon is my favorite fish and this roll literally was all I could ever ask for. The salmon was so fresh and the the sauce made the roll. No need for soy sauce or wasabi or any other additional, good as is. \n\n*VERDICT*\nYes, I would definitely come back again"
    },
    {
        "id": 206,
        "text": "This is the  best sushi place that ever existed in Philadelphia. Cute decor, instagrammable, and great service. \n\nAs soon as I walked in with my company, I was greeted by an amazing host Jack. His personal style is on point and he has most amazing manners. He walked us to our table. \n\nThen, we had phenomenal service from Henry who was our waiter. He made sure my friend was accommodated since she is gluten-free. He answered all of our questions and made great suggestions. \n\nSushi were fresh and delicious! All drinks were strong. I love their fried rice options. \n\nI will definitely be back and this is one of the most romantic places in all of Philadelphia. Great food, great staff, and great atmosphere. What else can you possibly want?"
    },
    {
        "id": 207,
        "text": "Hands down, the best sushi in Philadelphia! Everything about tuna bar is impeccable. We went on a cold night and sat outside and took off our coats because the heaters worked so well. Even their simple rolls are great. The spicy tuna is my personally favorite! You truly can't go wrong with anything on the menu."
    },
    {
        "id": 208,
        "text": "I love this restaurant and cannot wait to go back! Double date last night and everything we ate was so fresh and delicious. The decor inside was sophisticated and modern. Staff was friendly and very professional. I ordered the Yuzu sour, which was very refreshing. Easy to drink and not sweet at all. Our table received a complimentary tuna crudo, which was so tasty. The tuna was soaked in the ponzu and truffle oil, which made it extremely flavorful. Very easy to eat! My bf and I ordered the seaweed salad, old city roll and hurts roll. I don't know which roll I prefer, but both were SO good! I loved the crab salad on my sushi roll but the creamy rock shrimp was just as good. I would 100% reorder these two rolls. The other couple ordered the vegetable fried rice and 2 traditional rolls. They are regulars and always eat at Tuna Bar. Highly recommend this spot and will definitely come back!"
    },
    {
        "id": 209,
        "text": "Always so bomb, a go to for sushi in old city. Inside decor is awesome, and great seating outside for the warmer months. Plenty of choices of sake on the menu with the option for a sake flight. If you're looking for sushi in old city this is your ticket. Also, pretty easy to get last minute reservations or seating, which is clutch these days."
    },
    {
        "id": 210,
        "text": "We hosted our wedding after party at Tuna Bar in June 2021 and it was such an unforgettable experience! Tuna Bar is a beautiful space in Old City, Philadelphia, which features indoor and outdoor seating, delicious food, and creative drinks. It's located down the block from our wedding venue, Power Plant Productions, and we knew it would be a perfect location for an after party. The staff and Tina at Tuna Bar were attentive, friendly, and made us feel special. We were blown away with the setup, signs, and decor they had for our private booking, and loved the entire experience here. We definitely recommend Tuna Bar for a private event!"
    },
    {
        "id": 211,
        "text": "Went to Tuna Bar with a friend on a Friday night. We were able to get a reservation pretty easily, when we arrived the restaurant was very crowded. We were seated immediately but had to wait a bit for service.\n\nWe ordered scallop crudo, chicken and shrimp dumplings, and 4 sushi rolls. Everything that we had tried was absolutely delicious! I have tried many sushi restaurants in Philadelphia and this was honestly the best I've had. The fish was extremely fresh and just melted in your mouth. \n\nWe also ordered two different cocktails each, they were also excellent. \n\nThe only negative to our experience was that our server took some time to come to our table and then take our order. The staff seemed to be very busy and rushing around. \n\nOverall, would highly recommend and will be returning!"
    },
    {
        "id": 212,
        "text": "This spot is new. It's on what I feel is a desolate corner of Old City. And the food isn't stop the world good. It isn't bad, but it isn't \"wow, so glad I came HERE!\" Good. But let's talk about Ducky Spots. Duck as in when you can go to a nice spot and dodge the people you normally run into. That's what I took away from the Tuna Bar. It's open enough (outside seating on Race Street!) and dimly lit enough inside that a first or second date here doesn't run the risk of bumping into your whole crew. That's worth something in a city this small. Capable kitchen, friendly staff. Everything is just fine. Now, next up is their happy hour which from the looks of the menu might be the best deal (versus regular priced menu) in Old City. We'll see."
    },
    {
        "id": 213,
        "text": "Very. Disappointing. Meal. (2.5 stars)\n\nRead the reviews before dining and thought it'll be worth the experience. Completely wrong. \n\nServer was somewhat knowledgeable when asking him questions about the food but my boyfriend and I pretty much answered our own questions. \n\nCleanliness- the menus were all paper and it looked very unprofessional due to all the wrinkles and sauce spill. The wine glass were very dusty. The spoon for our fried rice had a hair/fuzzy on it.\n\nFood- Sad to say, the lobster fried rice was the best part of our dinner. The wagyu beef and west coast uni was good and kinda what we expected. The king salmon ($9) and otoro ($16) was such a disappointment. Both did not taste like the fish we wanted. The quality and presentation didn't match up to what we wanted. We eat sushi very often so we know what it look like and should taste like. That was not worth the money at all. We also had the chicken and shrimp dumplings, it was okay, very strong shrimp taste. But wasn't hot when it came out. \n\nPrice- Too expensive for bad quality fish."
    },
    {
        "id": 214,
        "text": "Highlights: all the cocktails were delicious! Lychee martini and norigrets were faves. Honestly everything was delicious but top items worth trying were the tuna crudo, wonton Soup and rittenhouse roll. They were definitely the most unique. But I don't think you could go wrong with any of the rolls or fish here. Very fresh and great presentation. \n\nAtmosphere is super trendy, great for a date or meeting friends for happy hour! Also has cute outdoor seating with heating. Will definitely be back!"
    },
    {
        "id": 215,
        "text": "Happy hour eats! \n\nWent to happy hour at Tuna Bar today, after hearing chatter of them having the best sushi in the city. I'm no sushi master, but it did not disappoint. We ordered some rolls ($5-6 for the happy hour California roll and $8-9 for the ones pictured off the regular menu). Spicy salmon roll was my favorite. The fried chicken dish was awesome and came in an awesome sauce (pictured after I ate a few, apologies) \n\nThis place satisfied for happy hour and we ordered 5 plates or so plus 2 drinks and only paid 55 bucks before tip. Very reasonable happy hour with an awesome ambiance and good service. Will be back! 5 stars"
    },
    {
        "id": 216,
        "text": "One of the best sushi's in town. Love the ambiance and the incredible menu. Drinks are great too. I wish it would deliver to Fairmount bd Brewerytown."
    },
    {
        "id": 217,
        "text": "I have been to Tuna Bar a couple of times, the first time a shortly after it opened and the second time more recently. The first time, we were very impressed by the quality of the fish and the preparation of our food. The second time, the quality was still very good but it wasn't prepared as well as the first time we visited. Since this restaurant is fairly expensive, we were slightly disappointed. \n\nThe food we ordered included miso soup, tuna tartare, Old City Roll, Fishtown roll, White Tuna Roll, and Spicy Salmon Roll. We really enjoyed the tuna tartare and the Old City Roll, although the rock shrimp on Old City Roll were not cooked as tender as the first time we went. The fish in the other rolls was very good quality, but we were not too impressed by the overall rolls themselves. \n\nMost recently we were here on a Thursday and there was supposedly a happy hour on the lychee martini that featured the drink for $5. We were told when we sat down around 7pm that the happy hour was still going on and we could order the martini with the discounted price, which we did. The martini was delicious, however, when we went to pay the bill, our drinks were listed as full price and the same waitress we had since he beginning of the meal told us that we ordered after the happy hour was over. Therefore I would say the service we received was not the best...\n\nOverall I am hesitant about coming back here, especially because Kisso and Tomo are two other great japanese restaurants within a block radius."
    },
    {
        "id": 218,
        "text": "I was excited to see Tuna Bar open in my Old City neighborhood. Adding a Japanese restaurant to the neighborhood seemed like a great idea even though I'm not a fan of sushi. I hoped it would also have food for non sushi lovers and thankfully it does. \n\nUpon walking in i noticed the restaurant has a nice warm modern decor. I ordered a bunch of items with my dinner companion and we shared. We ordered dumplings, edamame, lobster fried rice, shrimp tempura sushi, and bone-in steak. The dumplings were good, but not as flavorful as the best dumplings I've tasted. The lobster fried rice was the standout. It's a large delicious bowl, with enough lobster to actually taste, and you have plenty to take home at the end. The steak was a perfectly cooked and juicy medium. But it was a fatty piece of steak. I had to trim some of the fat myself, which was slightly annoying. But once the fat was trimmed I was in steak heaven.  Remember, I'm not a fan of sushi but I did enjoy the shrimp tempura sushi. Guess I can like sushi as long as the fish is cooked. I also had a rum & coke, which was mixed well but missing the lime. The bar probably focuses on fancier cocktails as opposed to the old classics. \n\nTuna Bar is a welcome addition to Old City."
    },
    {
        "id": 219,
        "text": "First time visit. Everything very good.\n\nPeanut avocado rolls - good but wouldn't get again\nCooked:\nCreamy rock shrimp - would def get again\nWentz/Hurts Rolls - would get again because I don't eat raw and there's not too many cooked rolls options \nWasabi fried rice - we split between 2 people and it's hard for me to have wasabi but I managed to enjoy enough of it. It's light but you still do feel it in your nose. \n\nHas raw fish so I did not try but am told they were very good and they looked very good to me. Wish there could be cooked fish versions:\nOld City rolls\nGeisha rolls\n\nVery nice restaurant setting. Too cold though because of the fans above. AC was already on so not sure why the fans were needed. Very good service and everything prompt. Food was also quick to come out. Pricey though, for two people this was about $100. Can't dine in too often, we'll probably do more takeout of smaller orders. But highly recommend this place if you want to go to a nice place with good food and good service. Totally worth it. They have good standards."
    },
    {
        "id": 220,
        "text": "Some of the best sushi I have had in the city. Well priced for good quality sushi, not boney. Also their brussel sprouts are OUT of this world. Great date night spot as well as friends night out!"
    },
    {
        "id": 221,
        "text": "I don't care about the fancy hip scene. I just appreciate the good sushi prepared at proper temperatures."
    },
    {
        "id": 222,
        "text": "I feel like there's no in between with sushi restaurants-  it's either your go to questionable delivery place for a $10 3 roll special, or it's high class fish with high class price tag at a place like Tuna Bar. \n\nThe Bar in Tuna Bar is on point- I loved my first cocktail- The Picante (a mezcal drink with grapefruit and jalapeno), but the second cocktail was odd- wasabi and cucumber just tasted like someone blended a cucumber roll, and the wasabi chunks at the bottom were weird.\n\nThe Tuna in Tuna Bar is on par with Morimoto, Royal Izakaya and and Double Knot. Beware of the specials though, those prices add up! We had a 3 piece fatty tuna special for $21 and 2 piece yellowtail for $20. That's $41 for 5 pieces of fish. Coulda had 12 mediocre takeout rolls for that price, so it's hard to wrap my head around. But it was really good! They also had some fun looking fancy rolls and we tried the Fishtown Roll -with jalapeno and assorted fish wrapped around shrimp tempura which was very good.\n\nWe also enjoyed some apps and sides- the bang bang shrimp, brussel sprouts, lobster fried rice (large portion), and the wok fried crudo were all very good. Before we knew it our check was about $100 each. Not sure if there was dessert, since our waiter just brought the check and rushed us out a bit....\n\nThe place was busy on a Thursday night, despite it being in a bit of an odd location). The waiters seemed a bit stressed and the area they had to navigate was so narrow they seemed to constantly be excusing themselves or squeezing past each other. Hopefully they'll get into the groove of things as time goes on.\n\nNext time you're looking to sit down and really enjoy some melt in your mouth fish not being delivered in under 35 minutes for you to watch with Netflix with, definitely try Tuna Bar!"
    },
    {
        "id": 223,
        "text": "We came to Tuna Bar early on a Friday night and they started is at a cozy table by the wall immediately. Service was good and everything we got (listed below) was delicious:\n\nAvocado sushi\nSweet potato roll\nBroad Street roll \n\nThe house special for happy hour was $7 which is amazing and it was a Pomegranate  cosmo, which wasn't too sweet at all.\n\nThey ended up needing our table though right after we had paid, and what makes this place 5 stars ++ for me is that they offered to move us to the bar and give us another round of drinks on the house for moving. I've never experienced that and it just made the act of having to move so much more pleasant. \n\nThe service was just really outstanding, the food was great, and the drinks were delicious."
    },
    {
        "id": 224,
        "text": "I love sushi and I kept hearing up Tuna Bar from friends so you know I had to check it out. I had a little trouble finding the entrance but it could have been because I was freezing and has almost fell 2x on black ice. The restaurant is quite small and quaint and dimly lit. It's very cute and definitely to my liking aesthetically. We started with the creamy rock shrimp which was yummy but wish we had a bit more portion wise for the two of us do share. Then we got 5 different kinds of sushi to try out from specialty rolls to the basic spicy tuna. They were all good, nothing crazy. Great drinks too!"
    },
    {
        "id": 225,
        "text": "Go to spot in old city. Always fresh and pleasant ambiance. Ordered 3 rolls (the dynamite roll, the spicy salmon roll and the fishtown roll) between my sister and I and enjoyed all of them. Their standard roll prices are reasonable between $7-9. Speciality on the other hand a bit pricey. The fishtown roll was $17, although it was incredible and would definitely order again.\n\nThe current covid situation: QR menus to scan on your phone. Mask needed in order to enter the building for restrooms. One thing I wish they would have done is QR payment like some of the other restaurants in the city. Hope they at least clean the check/credit card holders!"
    },
    {
        "id": 226,
        "text": "Everything was delicious! Ordered a sake flight along with the wasabi fried rice and rock shrimp. The rice was amazing, flavorful & the crab was perfectly cooked. Staff was super accommodating! My water cup stayed full & someone was always nearby & available for our random requests for extra places & cups to split dishes. Had a great overall experience"
    },
    {
        "id": 227,
        "text": "I love this place! Whenever I go it's never busy, but I swear the sushi is amazing. So fresh and so yummy. I will say, I do wish their happy hour options were a little more extensive there aren't many items to choose from, but overall I'd recommend this restaurant to any sushi lover for a lunch or dinner!"
    },
    {
        "id": 228,
        "text": "Tuna Bar is an awesome new addition to the Old City neighborhood! \n\nThe decor at this place rocks - the space is bright and airy and inviting. It's brand new, so it's clean and beautiful. \n\nThe service rocks- all of the servers were super friendly, and the bartender was great. We had a tasty gin cocktail with orange. \n\nThe food was all pretty good. The seaweed salad was decent, can't say it was particularly standout. The sushi was all tasty- fresh and presented beautifully. The crispy fried shrimp bites with tuna and caviar on top were my favorite dish - YUM. Also reallllly enjoyed the tuna tartar. \n\nThis place is awesome- definitely worth a stop in when you're in the area!"
    },
    {
        "id": 229,
        "text": "We are big fans of Tuna Bar, especially for a quick and quiet weekend lunch. Their fish tastes super fresh and their sushi rolls are amazing."
    },
    {
        "id": 230,
        "text": "Ok sushi, nice date night ambiance and drink list. Definitely overpriced though. I would suggest Kinme instead for a sushi fix."
    },
    {
        "id": 231,
        "text": "Tuna Bar was high on my \"to visit\" list until COVID hit but New Year's Eve gave us a reason to order a ton of fancy treats for delivery to feel at least a little celebratory at home. \n\nLoved: Lobster Tempura Roll, Wagyu Spring Rolls, Rock Shrimp, Chicken Karaage, Toro Sashimi, Spicy Scallop Roll \n\nPretty Good: King Crab Salad\n\nNot The Best: Raw Oysters"
    },
    {
        "id": 232,
        "text": "Great sushi and great atmosphere. The food has great flavors, we loved everything we got. The service was also amazing. Can't say enough about this place"
    },
    {
        "id": 233,
        "text": "We've been having bad luck with a lot of Japanese restaurants but we had the most amazing meal here at tuna bar! We had the tuna tartar, miso soup and crispy shrimp as appetizers. The tuna was very fresh (finally some fresh fish!!). The rolls we ordered (fishtown, dynamite, yellowtail&scallion) were great -- our favorite was Dynamite. \nThe yuzu cocktail was amazing we'll definitely be back :)"
    },
    {
        "id": 234,
        "text": "We had our school year-end party at Tuna Bar and it was spectacular.  Service was great even though we were a large group, but the best part was definitely the food.  Everything was super fresh with good options for vegetarians too-- my favorites were the brussels, nigiri, and crab rice.  Drinks were fire too.\n\nEveryone really enjoyed it, we will be back.  Shout out to Ken (amazing chef), Tina (manager), and our bartender -- didn't catch her name but she was top notch."
    },
    {
        "id": 235,
        "text": "This was the first we dined outside in serval months and it was wonderful. The staff was kind and helpful. The food was so fresh and delicious! We loved it! If you're in the area, make a point of spotting by, you won't regret it."
    },
    {
        "id": 236,
        "text": "I went to Tuna Bar last Thursday and enjoyed my experience. The restaurant is still fairly new, so there were a couple of kinks, but nothing that should keep anyone from booking a reservation and trying it out. \n\nDo book a reservation. We were glad to have one as the restaurant filled up completely within a half hour of our arrival. Servers seemed to be a little stressed and we had to flag our server down a couple times when we needed something after our initial order.\n\nI typically stick with wine or vodka martinis when I have sushi, but after tasting my friend's cocktail I ordered the same. It was a mezcal drink with lime and jalapeño syrup that was absolutely delicious. My friend later ordered a gin martini with wasabi - the taste was really fresh and interesting but the wasabi wasn't mixed in well and she encountered a few larger nuggets which made the drink a little weird. \n\nWe ordered several plates and highlights for me were the lobster fried rice, crispy rock shrimp, fishtown roll and one of the specials of the day, some fresh yellowtail, which was absolutely incredible. \n\nIf there is dessert on the menu, we wouldn't know, because our check was dropped without us even asking for it. Not exactly the warm vibe I'm expecting when spending upwards of $100/person. Hopefully, the restaurant is simply going through the stress of opening. I'm looking forward to another visit after they have had a bit more time to get things running smoothly."
    },
    {
        "id": 237,
        "text": "Loved everything we got here! We split dumplings that were delicious & a tuna flatbread app. One roll we got was lobster tempura in a truffle sauce. The drinks were also great!"
    },
    {
        "id": 238,
        "text": "Finally got a chance to check this place out for an early dinner on a weeknight and I loved it! I was really craving sushi so when my girlfriend recommended this place I was totally into it. I definitely did not expect to have a new favorite sushi spot!\n\nWhen I say early dinner, I'm talking 5pm which means we made it just in time for happy hour. Their happy hour deals include wines, one of their signature cocktails (I believe it was a whiskey cocktail on the day that we went) and a select few bites. Although we passed on their drink specials, we did order their $6 dumplings and a spicy salmon roll. As for drinks, we both ordered off of the cocktail list. She got the Shiso Picate which comes with mezcal and jalapeño and I got the Winston's Heat with gin, wasabi and cucumber. We both loved our drinks - so much so that we were happy to get a second round!\n\nAside from the happy hour food that we got, we also ordered the fried Brussels sprouts, Tuna Tartare, and the Fishtown roll. The Brussels sprouts came in a fairly large bowl and were fantastic. I'm a huge fan of Brussels sprouts and and these were some of the best I've had in Philly - and trust me I've had my fair share! The tuna was a choice my friend made and it was also very good. Lastly the roll we got was so delicious and very filling! It was loaded with shrimp tempura and fish. \n\nThe restaurant is very pretty, clean and spacious. Staff was attentive and checked up on us frequently. \n\nI can't wait to drop in to Tuna Bar again soon when the next sushi craving hits!"
    },
    {
        "id": 239,
        "text": "We ended up at Tuna Bar on a whim during the Natural Products Expo East convention last week. I have a bunch of food allergies and they handled them with great care and ease! The fish is so incredibly fresh and melts in your mouth. It was so good that I ended up ordering through door dash a few days later - that's twice in four days! Highly Recommend!"
    },
    {
        "id": 240,
        "text": "Best sushi in Philly - by far. Great food, service, and space.  \n\nThis is a great addition to old city and philly in general."
    },
    {
        "id": 241,
        "text": "Quality Sushi in Philadelphia wasn't always easy to come by.  A lot of options, not many good ones.  That's changed in recent years, but I've been loyal to Tuna Bar since they opened.  The atmosphere is nice (not gimmicky), the service is superb, and the food is top tier.  I typically stick to their Maki and Specialty rolls but the appetizers are all wonderful and the quality of their fish selection is up there with the best in the city.  Look to spend around 90-160 for two if you dine in, though I do tend to over order (and this is without drinks).  Great date spot as well if you're into that sort of thing."
    },
    {
        "id": 242,
        "text": "Just had our first, and certainly not last, sushi dinner from Tuna Bar. Awesome food! \nVery fresh and tasty. I highly recommend the seared Tuna or the Brussel Sprouts. Cooked to perfection. \nSimple California rolls are delightful!\nWe did takeout, but if you're considering dining in I would definitely make reservations."
    },
    {
        "id": 243,
        "text": "Dined here with reservations on a Saturday night with my boyfriend. We were seated immediately and was given a heater (since we were sitting outside and it was cold this weekend). We ordered apps and they arrived quickly.  The sushi was taking a bit of time but it was so worth the wait! The sushi was fresh and the rolls were so good! It is a bit pricey but the service and quality of food is nothing less than phenomenal!"
    },
    {
        "id": 244,
        "text": "Best fresh sushi we had yet, and nicely presented. Server was great, always within reach if something is needed. Nice atmosphere, except for Race St noise, and we ate inside. Street parking in the area is tight, and free on Sunday. Not hectic like Tomo which has no ambiance,  and is like eating in the middle of a fire drill. Wife's glass of wine was pricey, $14. Nice beer from 2SP. Will be back."
    },
    {
        "id": 245,
        "text": "I came here last night for my friends birthday - a group of 4 girls all together.  We were really excited to come here because we've heard the buzz and we were not disappointed!  The space is awesome - a mix of retro 50s diner/with modern and sophisticated touches.  It was so quiet - I think because it's so new.  We were the only ones in there from 9:30PM on.  The staff and service were fantastic.  Our waiter, Brion, was attentive to our needs and quick to provide recommendations (which turned out incredible!).  Ken Sze, the owner/executive chef also came out towards the end of our meal to make sure we were happy and satisfied.  We chatted with him on our way out and he was very pleasant!  \n\nOnto the food!  We had a number of appetizers.  We tried the scallop crudo on recommendation and this was one of the best dishes of the night.  This MELTS in your mouth.  You must have this.  We also had the pork gyoza, creamy rock shrimp, mai fried rice, and wagyu beef egg rolls.  All were delicious and would highly recommend.  The wagyu beef egg rolls were on special but I asked that they put it on the full menu when it is released!  \n\nWe got 4 sushi rolls- the Old City, Fishtown, Spicy Salmon, and California roll.  All were absolutely delectable - super fresh, and really flavorful.  We finished off with ice cream for the table - the chocolate and the green tea.  So rich and creamy!\n\nOverall, our experience was awesome and this is such a great addition to the Philly sushi scene.  I will definitely be coming back.  Hoping Ken will release a tasting menu soon!"
    },
    {
        "id": 246,
        "text": "I've only been once, but had a great experience. I went for happy hour with a few friends. I like that they do happy hour at the tables as well - so much more comfortable when there are 4+ people in your party. Their happy hour food specials are great - three types of rolls, and not eensy ones either. The four of us split seven rolls and two bowls of edamame between us, and I was pretty full. We also got two rounds of sake, and the total was about $80 - not bad at all. They also had a happy hour cocktail (sounded too sweet for me), and wine, not sure about beer. But I'm glad I went with the sake - maybe a bit kitschy, but I love how they pour and let the excess spill over into a box. The server was very polite and helpful even though we were probably not making his life easy (not all arriving at the same time, not ordering all the food at the same time, squeezing in a second happy hour round, etc.). He also was helpful when explaining what foods were good for gluten-intolerance."
    },
    {
        "id": 247,
        "text": "My new favorite sushi place in Philly! Great atmosphere and food. I tried their Tuna Flatbread, two specialty rolls-Cindy and Geisha, and Green tea lava cake. Everything was outstanding. I will be definitely going back there to explore more menu!"
    },
    {
        "id": 248,
        "text": "From the ambiance, to the service and the food - I wish I could give this place more than 5 stars! The decor in this restaurant is modern with an extremely aesthetic pleasing bar in the center. I had my birthday dinner at Tuna Bar for a party of 14 people and Tina was extremely accommodating for all of my guests. She helped our party set up a pre-fix menu (from vegetarian options to sharing size portions) - she was amazing! All of the servers were attentive and the food arrived quickly. I highly recommend the tuna flatbread, the yellowtail & scallion roll, the Sindy Roll and their vegetable fried rice. All of which were delicious! Not to mention their cocktails were great also. Perfect for a date night or a night out with your friends. They also have outdoor seating with very cute string lights outside during the Summertime. Highly recommend if you're looking for a sushi restaurant in the city!"
    },
    {
        "id": 249,
        "text": "Tuna Bar has quickly become a favorite of Philadelphians alike and trust me it a great experience! Top tier service from the moment you walk in being that you're so welcomed! Tina is exceptional (thank you Tina! ) I have eaten here quite often and have never thought to do something like write one of these but I'm really hoping this encourages others to visit Tuna Bar! The food quality is among the freshest in the city with all dishes, and the wide variety of options is a treat every time! The drink selections are excellent as well... just top to bottom they did not miss! Thanks again Tina and crew we love the Tuna Bar!"
    },
    {
        "id": 250,
        "text": "5 stars ALL AROUND! The sushi here is amazing. The quality and the taste are superb! Not to mention it's a good looking restaurant with some pretty cool decor and a great ambiance.\n\nWe started with edemame, tuna tartar, tuna curdo and seared tuna salad. They were all amazing but my favorite was the tuna curdo which is basically thin slices of raw tuna in a delicious sauce. Order this app it's incredible.\n\nMoving on to the rolls... We had the old city roll, white dynamite, peppered tuna and some yellowtail sashimi. Let me repeat the quality of fish they serve he is the best I have had period. All of these rolls were extremely tasty but my favorite was the peppered tuna! It comes with an amazing wasabi drizzle and the tuna is pepper crusted.\n\nWe also had a few Sapporo beers and the ladies had cocktails the geisha and the I'll see you lata. They said the cocktails were Great!\n\nWe had such a good time and enjoyed the food so much that we told the owner it was the best sushi we ever had. We are visitors from NYC and tuna bat does it better than any of the upscale sushi spots we have been to in NY. We have even discussed going back to Philly just to have dinner at tuna bar again. Absolutely love this place! Best meal we had in Philly by far!"
    }
]