[
    {
        "id": 1,
        "text": "hmm deep fried balls. This was my first venture with takoyaki and I love Japanese food of any kind, so needless to say I was excited. I ordered the original and was served 6 deep fried balls of goodness. They were tasty, albeit doughy, but left a greasy aching not so fresh feeling. I needed to be drunk to really appreciate the grease. Since it was my first venture I'll say its worth a try, but buyer beware they're super heavy for being small balls of dough. \n\nThe curry chicken I had was a bit disappointing. I scarfed it down thanks to my near state of starvation, but found the roux too rich for my taste. Its worth another trip for japanese fast food- one of my faves and sorely lacking in the city, but its certainly not the best I've had..."
    },
    {
        "id": 2,
        "text": "The dancing bonito flakes are a lovely effect as the sizzling takoyaki make them sway. Take a second to soak in the presentation. No but really take a second. Don't be like impatient me who bites into molten takoyaki, disregarding all warnings and good sense! I knew better, but I do these things constantly with pizza slices, and with delicious Japanese street food snacks, evidently.\n\nI am a fan of Maru's savory ping pong-ball-sized pancakes, filled with pickled red ginger, scallions and octopus. Takoyaki, handmade while you wait, eight of them are served up nice and hot... A golden steamin plate of takoyaki, covered in shavings of dried bonito, nori, a drizzle of tonkatsu sauce. It's a really great snack, and you know I love a little nosh to share \"on the way\" here or there. I need incentives and rewards for everything. The spicy octopus variety with a little shichimi mayo fits the bill quite nicely.\n\nAlso, after peering at the Maru ball cooking process, I am sure that I now really want a nice cast iron takoyaki pan for my very own, to add to my stockpile of kitchen paraphernalia. In addition, just want to note that I love Maru Global's red lanterns with the cute octopus fella on em... My house needs some of those too, because I can't stop hanging decorations from my ceiling. I can not stop.\n\nA really nice couple run this very tiny shop of wonderful authentic Japanese bites. I'll be back and back and back."
    },
    {
        "id": 3,
        "text": "Yummy takoyaki! Finally I found a Japanese restaurant in Philadelphia area that isn't a sushi / tempura joint!\n\nWent there last Saturday, ordered 2 type of tako balls. Original and BBQ flavor. Both in octopus.. since the real takoyaki supposed to be only using octopus as its' meat. But they have other choices of meat in case you don't eat octopus. Like chicken, beef and such.\n\n1 order of takoyaki consist of 6 balls, cost around $5. Both are very yummy, though I like the original more.\n\nI will definitely go back for more and try on their Yakisoba.\n\nMake sure you put one hour on your parking meter if you order more than just one kind. It took 20 minutes for 2 orders of different flavor takoyaki.\n\nI didn't see the problem with super heavy dough or some sort which encountered by other yelpers though. I think everything just perfect!"
    },
    {
        "id": 4,
        "text": "Service: outstanding (five stars).  We were there on a quiet day for lunch.\nPrice: very reasonable (five stars)\nFood: pretty darn good. (four stars) I loved all the bonito on top of my spicy order, and while other reviewers say they're gummy/doughy, I really didn't mind them that way.  This was my first experience, though, so maybe they're less gummy elsewhere?\nAtmosphere: meh.  There's not much to the place.\nPresentation: two stars.  We had lunch there, and my soup came out in a to-go container on a plate meant to stay in the restaurant.  My takoyaki came out in a styrofoam take-out container, even though we had clearly said we were eating here.  I get that most of their food is probably to go, but is it that hard to keep a handful of bowls and plates around for the food being consumed within the establishment?"
    },
    {
        "id": 5,
        "text": "I love takoyaki (octopus balls) and okonomiyaki (Japanese pancake) and almost always jump at the chance to order these when I can.  Sadly, Maru Global doesn't know how to make either.  \n\nI came here for dinner a while back and when I left, the remains of a half-eaten okonomiyaki lay on the table.  I am a beastly pig, and this for me, is kind of unheard of.  They aren't terribly well staffed here (at least when I came with a group of about 7), so if you order all at once in a large group, it takes quite a while for people to get to eat.  \n\nBut on the food side, I ordered an okonomiyaki, and what I got was a pancake with a grainy, doughy texture, that was incredibly oversalted.  The consistency of the takoyaki was similarly off although I can't put my finger on what exactly was wrong.  Anyway, suffice it to say that I've had plenty of great octopus balls and Japanese pancakes elsewhere (like in New York, you can find this in the East Village in the form of Yakitori Taisho or, my fav, Otafuku, or in Philly there's Yakitori Boy).  This place just doesn't cut it, and I'm certain I won't be coming back."
    },
    {
        "id": 6,
        "text": "Philly's only Takoyaki source is great. So as long as you don't mind eating Japanese food cooked by a Japanese man because his wife is American like Jane, then you will love Maru. It's cheap and BYOB. Definitely try their dessert  balls"
    },
    {
        "id": 7,
        "text": "Takoyakis are traditionally cheap Japanese street food, they are pretty much soft dough balls with a piece of octopus in the middle. It's fun, cute and chewy. One would think that it's hard for a specialty eatery like Maru Global to get by, I mean let's face it, Americans are not know for trying stuff that they are not familiar with and how can you really sustain a shop that only specializes in one thing? Though, Maru Global succeeded in breaching the gap between the familiar with the unknown. \n\nOther than offering the traditional takoyaki, they expanded the concept by offering the choice of chicken and beef in addition to octopus. They also offer pizza balls, cheesesteak balls, spicy shrimp balls, crabcake balls, as well as dessert ones like chocolate banana balls. Other than balls, they also offer curry fries/rice/burritos, yakisobas, miso soup, salad and other little Japanese food and drinks.\n\nThe decor is clean, the air conditioning can be upgraded. The portions are a little small. The food itself tastes ok but it's nothing stellar. I keep on wishing there's some kind of okonomiyaki or yakitoris that would make the meal more substantial. Of all the balls, I enjoy the traditional one the best. Their presence is a welcome change for the food scene for sure but I'm not sure a snack food place would work in the States when the motto here is the bigger the better. \n\nI wish them the best."
    },
    {
        "id": 8,
        "text": "LOVE LOVE LOVE this place!! Their food is delicious, fresh, and cheap. Also, they give a 20% discount to Jeff students if you pay in cash.\n\nThe place is run by a husband and wife, Nicole and Ryo, who are sweet and amazing cooks. I've been averaging 2 lunches a week here, and I don't see that changing anytime soon. Make sure to stop by and support this great family-owned business!!\n\nYakisobi, the \"balls\", the noodles, everything is yummmy."
    },
    {
        "id": 9,
        "text": "The Boyfriend and I are huge fans of burritos and Japanese curry separately, but when we found that Maru Global makes a Japanese curry burrito, the opportunity was too irresistible to pass up.\n\nThe beef curry burrito was amazing to bite into -- a nice creamy, spiced curry with carrot and potato.  Who would've known a combination of burrito and Japanese curry was so delicious?  Apparently the chef here at Maru Global whom we had a chance to meet as he was flattered when we took photos of his work.\nCompletely ignoring how full we were, we also tried its namesake takoyaki.  The spicy shrimp tasted so good and completely melted in your mouth it almost seemed sinful."
    },
    {
        "id": 10,
        "text": "This place had great tako yaki. My friend recommended it and I had some.  It was really good. This place needs a little more polish with service and needs to be a little more unique. Its a little like Tampopo but it's not necessarily a bad thing. Once this improves and shapes up a little, it would be a little better"
    },
    {
        "id": 11,
        "text": "The takoyaki balls were one of my food adventures for the summer.  I first tried them in June and I loved them.  Went back in July with my wife and I continued to love them.  Went back a few days ago and probably had the best takoyaki in 3 visits.  I liked them all.  The octupus, spicey shrimp and the sweet and sour were my favorites.  The crab c ake and the barbecue were also done well.  I think the chef- owner works hard to please his customers.  His wife is very friendly, easy going and aims to please.\nWe also tried the yakosobi noodles, which were good.  The Japanese potato salad was very good.\nI think it is an interesting place, small and quaint.  The food is very different from any other restaurant.  \nBe adventuresome and take a trip to the streets of Japan."
    },
    {
        "id": 12,
        "text": "Maru Global is apparently an average starting point for those who have never experienced takoyaki- however I admit that I've gotten a few raw ones on occassion.\n\nAlso the food is not exactly cheap, the decor sucks and size of the place leave a lot to be desired."
    },
    {
        "id": 13,
        "text": "Such a tremendous value for lunch. $5 for veggie curry, miso soup, and a beverage. That deal can't be beat, even at McDonalds. And this is better than McDonalds. \n\nI also LOVE the grain salad.\n\nThey have changed their menu a number of times since opening, and it could still use some simplification, but they seem to be getting closer and closer to the right mix of items. I'm excited to try the sandwiches."
    },
    {
        "id": 14,
        "text": "When I heard that a takoyaki place was opening up in Philly, I was ecstatic to see what they tasted like outside of my freezer burt version I get from H Mart. But I think the word \"aight\" is more appropriate in this case than \"A-OK\". I ordered the Japanese burrito bento, and the Philly cheesesteak Maru Balls.\n\nI'm not sure what was supposed to be in that burrito, but it tasted like a whole lot of rice with a helping of salty paste stuffed in the corner. The bento also came with your standard salad w/ ginger dressing, and a MASSIVE helping of [rather mediocre] potato salad, of all things. The dessert takoyaki was dough with chocolate sauce inside it, I might have liked it better if it had some kind of frosting or sweet dip to balance out the bitterness, but that's just personal preference. I did appreciate the 2 pieces of Hi-Chew though. :)\n\nI was more pleased with the cheesesteak. Another dish that's \"aight\" on it's own, but once I drizzled some ketchup over them they were perfect. I still want to try their take on traditional takoyaki, but I'm not in any hurry to get another one of those bentos. If you need a larger meal for lunch, get a larger order of the Maru Balls.\n\nAlso, I was almost shocked when I saw what I saw upon entering, this place needs a serious dose of feng shui!!"
    },
    {
        "id": 15,
        "text": "My takoyaki balls were woefully inadequate: it was an undercooked, doughy gelatinous mass with exactly two minuscule pieces of octopus randomly hidden in two of the twelve balls in my order.  What was in the rest of the balls? Nothing but the undercooked, doughy gelatinous mass.\n\nThe gyudon rice bowl?  It looked like canned cat food over a haphazard pile of rice.  It was slightly more edible than the \"Maru ball.\"\n\nFinally a comment on nomenclature - there is nothing global about the offerings here.  In fact it represents a niche subclass of Japanese street fare.  As the sole representative of this genre of food in Philly, I wish it could have made a better showing."
    },
    {
        "id": 16,
        "text": "aww c'mon guys!  I can only compare to what i have enjoyed in manhattan at Otafuku, so I'd say Maru Global is pretty spot on, at least with the traditional octopus option.  The people are really very nice too.  Here's a pointer...done bite down right away!  Let them sit for a good minute, and the residual heat keep working..hence, no doughy interior.\n\nanyways, i wish them the best of luck, and once in a while im gonna stop in and get myself an order while i'm on a walk"
    },
    {
        "id": 17,
        "text": "Just had my first order of takoyaki...ordered a big mess of different types (original shrimp, cheesesteak, and sweet n' sour miso beef) all of which were fantastic. I'm actually sad that they're gone right now - if I had known they were this good, I would have gotten more or savored the experience longer.\n\nI only got it delivered, so I can't comment on the in-restaurant experience, though I plan on changing that soon. Wait was probably 25-30 minutes after 8 PM on a weekday night. But worth the wait, for sure. Highly recommended, and I look forward to trying more from Maru in the near future."
    },
    {
        "id": 18,
        "text": "First of all, I'm not dissappointed; but i searched for a sushi bar nearby and got this from yelp. They do not serve sushi.\n\nBut the unique japanese dishes are awesome. I recommend the tofu salad and the french fries are awesome!"
    },
    {
        "id": 19,
        "text": "Maru Global for lunch - we had Octopus Takoyaki and Japanese Curry Rice and Yakisoba. The portions were generous and the flavors were interesting and delicious. The presentation of the food was great as well. HOWEVER, the whole atmosphere of the restaurant isn't that great for a dine-in. The chairs were rocking....we didn't have water (didn't know if we had to go get it on our own or if they were serving it)... and we didn't have the menu until 10 minutes after we sat down because they were just printing it out. I understand since they were just opening for the lunch hour but still. We were just sitting there, starving, with no water and no menu to look at. \n\nIt's a cool Japanese restaurant to try - there are more to Japanese food than just sushi/sashimi ;)"
    },
    {
        "id": 20,
        "text": "This is a review for delivery service only.\n\nOr rather, lack thereof.\n\nLast night, we placed a $40 order for various goodies at approximately 6:30pm. Their website stated that Maru was open until 9pm on Wednesdays, and that they deliver within a 3 mile radius (we're in Center City and well within that range).\n\n7:30 rolls around. 8pm rolls around. We finally call--and the phone rings, rings, and finally goes to an answering machine, which helpfully confirms their hours (and that they should be open). We call about six or seven times in the next half our, in the blind hope they're just really busy.\n\nNot so much.\n\nBy 8:30 we gave up hope, and ordered from our local Chinese place. The icing on the cake will be if they charge our card (they don't open--if they open at all--until 11am today, purportedly)."
    },
    {
        "id": 21,
        "text": "Finally! I have been waiting for Maru to open and serve me so I could get in on Philly's version of takoyaki- dough balls filled with octopus. This is legitimately one of my favorite foods. I have been so frustrated every day this week, stopping in and finding them still not open. Somehow they are not serving octopus yet... tried the spicy shrimp, I can't complain, I love this stuff so much, but it could have used a bit more grill time. Still 6 balls for 3.25 is a great price for a snack. Get it together guys, I will be your biggest fan!"
    },
    {
        "id": 22,
        "text": "I eat here 2 to 4 times each week.  The octopus salad, octopus maru balls, and the yakisoba are great.  They make for great lunches - I do the yakisoba and one of the others and it's about 10 bucks.  \n\nAll that said, I have been underwhelmed by the curry burrito and the don mono.  \n\nNote that delivery can take well over an hour at lunch times.  \n\nAs for the interior, get over it.  The guy is cooking street food and the vast majority of people do takeout or delivery.  Most importantly, the place is very clean."
    },
    {
        "id": 23,
        "text": "I ordered take out from here last night for the first time.  I had seen this place on NBC a while ago and read a few of the reviews, so I decided to give it a shot. I ordered the traditional octopus and the traditional shrimp balls as well as the chocolate chip desert balls to complete the meal.  I thought everything tasted fantastic!  Of the two savory, I enjoyed the shrimp ones the most.  They had a lot of flavor and really fun to eat!  By the photos I saw here I thought the balls themselves would be bigger, but just as the guy at the counter described, they are the size of a ping pong ball.  Very fun to eat and since they are smaller you can try lots of different kinds.  The chocolate chip ones were amazing too.  He tossed them in powdered sugar and were served with an icing on the side to dip them in.  It was warm, chocolaty, and delicious! While I was waiting they let me sample the special red bean dessert ones as well.  They were amazing!  I think I will order them next time if they are still on special.  I am a big fan of red beans for dessert and with the powdered sugar on top just made them perfect!  The people who work there are super friendly and very helpful for a first-timer like myself.  I will certainly be back to check out the other flavors!"
    },
    {
        "id": 24,
        "text": "I had these Gooey Japanese Balls of delight and they were delicious.  You will have to stick with that description because I forget what they are called.  And the man running the counter was very helpful.  \n\nOne problem with this place - the menu looks like it was designed by someone with no graphics skills.  The menu is all over the place.   I just gave up and asked the young man at the counter to order for me.  \n\nIf you are going to market or sell something - take the guess work out of ordering.  I could not make any sense out of the menu.   \n\nGo for it and have fun!"
    },
    {
        "id": 25,
        "text": "TAKOYAKI!!  It's carbo-octo-riffic!\n\nMaru does a decent job at takoyaki.  It's one of the better places I've tried outside of Japan.  The chef also likes to reinterpret Japanese street foods, delivering unique dishes like curry fries with Japanese style curry (yum) or Philly cheesesteak takoyaki (can't say I've tried that one). The crab cake balls are addictive:  delicious, succulent lump crab in a crispy bite-sized package. \n\nOne tip: Takoyaki is best eaten fresh and piping hot, so plan to either dine in or carry your tasty treats over to the Jefferson lawn (10th & Locust) for a picnic."
    },
    {
        "id": 26,
        "text": "Like everyone else, I was impressed and surprised at Maru Global entering the Philly food fray- takoyaki isn't the best-known snack, and Philly can be hard on speciality places. But these guys have truly got the goods: great food and great prices, a friendly attitude, and creativity! There are already plenty of spots to grab a greasy cheesesteak, so this place is a welcome (and delicious) change of pace.\n\nI've ordered delivery several times, but went in yesterday for a sit-down meal. Between three people, we got an order of the Sweet & Sour Miso balls, an order of the Spicy Shrimp, and a classic takoyaki. We also settled on the curry fries (SO GOOD) and ended up splitting the dessert special of the day- Snickerdoodle balls, with a side of whipped cream and chocolate sauce! In total, it was about 22 bucks and totally filled us up. First, I have to remark on the presentation- a lot of care is put into those little takoyaki! The food is cute and nicely arranged, with sauce, scallions, and bonito carefully laid over top. Their texture (a little crisp on the outside, doughy on the inside) is delightful, especially when they're fresh and hot. The curry fries were topped with onions and smelled heavenly- they tasted even better. Their curry is definitely slow-simmered and has a rich, beefy flavor, lots of carrots and potatoes. Dessert was also terrific; the melting chocolate chips inside the Snickerdoodles, wow!\n\nIt's a small location but very clean, bright, and cheerful. You can find green tea, iced tea and lots of other drinks in the back cooler, plus a second small cooler full of fresh salads and other snacks. Their daily specials mix things up a bit, and everything is basically under ten bucks. I've tried their take-out lunches as well: for around eight bucks, you can grab a rice bowl with curry or chicken, beef, etc., plus a salad, miso soup, and a drink. Can't beat that- everyone at work was jealous of my gorgeous lunch when it showed up!\n\nThis place is also well-located to grab a quick round of takoyaki after you've been up the street having a beer. I wish Maru Global a bright future in this town, because my cravings for takoyaki are not going to go away anytime soon."
    },
    {
        "id": 27,
        "text": "***MARU GLOBAL IS NOW TOKIO GLOBAL AND HAS MOVED NEXT TO HEAD HOUSE CAFE. SAME GREAT FOOD!***\n\nI've been to Maru Global a bunch of times- at first, when they just opened, their menu was limited and seemingly dependent on their \"balls\", which aren't terrible but are a little heavy for lunches. Now, they have seriously expanded their menu and include the balls options, which I recommend all of the dessert ones, the crab balls are also amazing.\n\nI usually get the Chicken Yakisoba lunch special, which is $5 and also comes with a water or tea and soup or salad- a great deal! I originally ordered the Beef Curry Burrito, but then I walked by the grill and saw the yakisoba cooking and immediately changed my order to include some of that deliciousness- stir fried ramen noodles with cabbage, onion, carrot, bean sprouts, ao nori and red ginger in a tonkatsu sauce! For only $5 I got my chicken yakisoba, miso soup and a water, plus the laid back atmosphere, chill music, and friendly owner/chef made it easy to want to go back. My friend got the beef curry fries and was also very happy. \n\nI think I'll try dinner next- panko crusted wild harame or katsu curry? Maybe one of each with a glass of wine...I think I read they had free wine, which I totally believe cause last time I was there I got a free apricot-infused mojito for free. Apparently the female owner who also works tirelessly was a bartender and so she likes to mix free drinks for customers (they are a BYOB). Every time I go here, I like it more and more and everyone I bring here agrees it's a great noodle fix and interesting find! I gave it another star in this updated version of my review cause they won it fair and square!"
    },
    {
        "id": 28,
        "text": "Disclaimer: this was for carryout\n\nI can only blame myself for wanting to eat gyudon on a Saturday night, and leaving no choice but Maru Global.  There is a 1% chance I'll be back.\n\nGood(s):\nRegular Takoyaki - It was okay, but I give it the benefit of the doubt because it's my first time with takoyaki\nChocolate chip balls - If not for these delicious little desserts, \n\nBad(s):\nChicken Katsu - Thick, dry, disappointing.\nMiso Soup - meh\nCrab cake balls - Don't get these, you'll regret it.  \nShrimp balls - Bland, mushy, meh\nGyudon - Bland, dry beef.  Average quality rice.\n\nDon't you hate when you really want to like some place and they just come up short?  I really really do.\nBut if somehow they start making really good Japanese street food, someone please let me know.  I've nowhere to go to fulfill those needs."
    },
    {
        "id": 29,
        "text": "It was my first time here and I got takoyaki, beef curry, korokke, original okonomiyaki, and also free choco balls since I ordered over $25. \n\nTakoyaki - I liked it! It was good and flavorful, and there were actual substantial chunks of octopus inside of it (unlike Yakitori Boy where there was barely any octopus inside of their takoyaki).\n\nBeef Curry - I decided to order it without the katsu this time to save money, but oh gosh. This was my favorite dish. It was SO GOOD! Exactly how I like my Japanese curry. It had a very deep flavor (not sure how to explain it in English), with a slight smoky sweet BBQ-like taste. It tastes somewhat similar in style to the curry at GoGo Curry in NYC. I ordered a small for $6, and it is definitely enough for one meal, especially if you decide to order other things with it. This dish is wonderful, I highly recommend it if you are a person that likes curry. It is hard to get curry like this in Philadelphia, and I'm glad I found this place.\n\nKorokke - Essentially they are potato croquettes, and they provide tonkatsu dipping sauce. The korokke themselves were pretty alright. The crunchy exterior was very good, the inside of potatoes, beef (very little beef, mind you), and onions was decent but not extraordinary. Could potentially be better if the potatoes were more aromatic and flavorful. I found that tonkatsu sauce incredibly salty, so I barely dipped the korokke with it. This is my first time having tonkatsu sauce, so I'm not sure if that's really how it's supposed to be like.\n\nOctopus okonomiyaki - I ordered this for take out. It was not terrible, but they forgot to put the sauces on top of mine... so it was a little bland. Also it tasted a little too gingery for my liking. Hopefully next time they don't forget the sauce and it might taste better?\n\nChocolate balls - The balls themselves are pretty average, essentially like unsweetened dough cooked with bits of chocolate and then rolled in chocolate powder of some sort.  But they serve it to you with whip cream dipping, and that makes them really good to eat!\n\nSadly the place is mainly more focused on take-out than sit-in since there is very little seating in the restaurant. I think there were about 4-6 small tables that fit 2 people each, and at the time I went all tables except one were taken by a group doing a BYO. \n\nOverall my experience here was quite good, except for the fact that they forgot to put the sauces on top of my okonomiyaki. Food for the most part is good, and the closest to authentic Japanese food you can get from almost any other Philly Japanese restaurant. (The restaurant is actually owned by a real Japanese person, rather than most other \"Japanese\" food places in Philly.) The couple staff they have working the place are also really nice and pleasant. I REALLY loved the curry and will be going back for it and some of their other interesting eats as well."
    },
    {
        "id": 30,
        "text": "Never had takoyaki before, but saw lots of videos on YouTube, so when my persistent googling of \"tacoyaki\" resulted in Maru Global, I was thrilled.  Salivating for fried squid ball goodness, I ordered up a batch.  Fresh off the griddle, I had to wait until the little guys were cool enough to eat (hee, hee, \"little guys\").  The first bite proved mushy to the point of undercooked and somewhat devoid of flavor..  Frownie face.  My hopes dashed, I hought maybe this is the way its supposed to be, but judging from comments by folks here who've had other experiences, it seems that tthis place just don't make a good ball.\n\nMaybe the griddle is too hot or the batter recipe needs adjustment?  Hope they improve."
    },
    {
        "id": 31,
        "text": "If you believe street food is the essential expression of a culture -- or \"Truth in Street Carts\" -- then you have to hit up Maru Global.  Their takoyaki, which are tiny spheres of crepe batter stuffed with octopus, shrimp, cheesesteak, tofu, etc., have never before been seen in Philadelphia, and I only know of one place in NYC that griddles them up.\n\nMy fave here is the spicy octopus version, topped with spicy Kewpie mayo and bonito flakes that dance and sway atop the molten Maru balls. Like pancakes, french fries and crepes, these do not travel well -- I'd recommend snagging one of the little tables and eating in.  You can also pick up fun Japanese candies when you're done your meal, but the dessert chocolate Maru balls doused in whipped cream are a more decadent bet. \n\nNot much atmosphere here -- but come on, it's street food!  Don't put des cartes before the horse."
    },
    {
        "id": 32,
        "text": "Along with a small mob of people, I waited/killed time outside Maru Global for about 40 mins past when the sign on the front said it was going to open today for its grand opening.  My friend and I were extremely excited to try the takoyaki balls and other Japanese street foods that beckoned to us from behind the glass.  \n\nWe ordered the yakisoba noodles, a large order of original takoyaki balls to split, and the Japanese curry burrito.  While the noodles came out piping hot and fresh, but actually a little too salty, the takoyaki balls were luke warm once they got to our table, which greatly took away from their delicious potential.  Pleasantly, the flavors of the crepe-y batter, octopus, ginger, sauce, and bonito flakes were in savory harmony in my mouth, that only wished the temperature and slight crisp were still there.  My friend got the Japanese curry burrito, and basically said that it was mostly white rice with little curry.  I would say just get the Beef curry Don mono (rice bowl) instead, because it's probably the same thing without a tortilla wrapping.\n\nThey also serve everything in to-go style containers, and though I know the food is Japanese street food inspired, if you are not taking the food to go, it would be nice to eat off a real plate with a real fork. \n\nI'll cut some slack cause it seemed like an extremely hectic opening day-- we got our meal with an I.O.U (and the promise we would return) because the credit card machine was not working. \n\nThe prices are good especially for a quick lunch or snack. I will be back, to pay the I.O.U, and hopefully, to try the balls again and more offerings when they are in the groove of things! (and my rating will change accordingly!)\n\nEDIT: I came by here again today trying to get lunch at around 12:30, when the sign on the front said they were open. I waited outside again for a few minutes watching all the people hustling around inside and not acknowledging the bunch of people waiting outside. HELLO? They need to get their act together. Our group left and went to the new Shinju Sushi, Fat Salmon, which is so nice btw!"
    },
    {
        "id": 33,
        "text": "This is my spot for on the go noodles.  They can make them spicy, delicious and fast.  A lot of the menu flair is soups, rice, and noodle dishes and they are portioned appropriately for one person to leave full but not in pain.  \n\nI really like how they can add enough siracha and other spices to give the meal zing - you'll also get pink ginger strips with your dish to clean your pallate.  I love how their dishes don't leave that \"we never clean our grill or wok\" residue in your mouth.  \n\nLast time I stopped in for a cup of noodles to go, it took me back a to a Tokyo visit, walking through the city on a dreary, rainy day, enjoying spicy noodles as I strolled down concrete sidewalks with an interchange of city smells on my way to work.  Just right."
    },
    {
        "id": 34,
        "text": "This review is solely for the takoyaki.  It is pretty good here.  For about $7, you get 8 of these small japanese griddled delicacies.  The most authentic ones are the squid ones.  There was a fair amount of octopus in it, and the other flakes on top reminds me how much i love japanese street food. \n\nMy minor gripe is that it little annoying that they charge extra for japanese mayo. i mean its only $.50 but i guess its the principle? My favorite takoyaki place in nyc (otafuku) generously puts on all the sauces!  But given that we are in philly and there aren't many other alternatives, this place is solid.  I'd really recommend any takoyaki (or japanese street food) lovers to come try this place out.\n\nOh, if you eat it within minutes of receiving your order, be careful. they  come out piping hot, especially the insides!  Also, they make them on the spot so pre-ordering will save you about 15 minutes, which is how long I waited."
    },
    {
        "id": 35,
        "text": "tried them out for the first time at the night market last night...wanted to do the takoyaki but the line was wayyyy tooo long for that..so I ordered the curry burrito...wow not good at all...will give them another shot in the future."
    },
    {
        "id": 36,
        "text": "Came here to try the takoyaki. Got the bbq octopus and original shrimp. Ordered pumpkin curry with rice, which came out first. Bad idea! The curry was really good and filling (would love to try and make this at home kind of yummy) that I hardly had room left for the takoyaki. The texture of the takoyaki was not what I expected. It was kinda too mushy to my liking, but flavor was good. Also tried to panko-crusted wild harame. Tasted good with the spicy mayo dipping sauce. Fries were extra large and tasty. Homemade green tea is always a plus :)\n\nWould def return to this family run joint. Lady that took our order was very helpful. Excited try out the other goodies on the menu"
    },
    {
        "id": 37,
        "text": "Since my first review, which was written when they first opened, my view of Maru Global has changed for the better! I work at Jefferson and have lunch at Maru Global at least once a month. This is really the only thing I come here for...\n\nTheir lunch specials are pretty sweet, coming with a drink, entree and salad or soup for only $5 (and change depending on which entree). The entrees are also made to order, very quickly, right in front of your eyes.\n\nI usually get the chicken Yakisoba, basically a Japanese lo mein dish; the noodles are fresh, they use free range chicken and they have really perfected the balance of flavors. Love the salty pickled ginger served alongside.\n\nThe house made iced green tea is also a highlight of lunches here.\n\nThe salad is standard, but always fresh.\n\nAs far as lunch deals in center city go, I couldn't recommend Maru Global more!"
    },
    {
        "id": 38,
        "text": "When I read about this takoyaki place, I had to give it a try, hoping to have a comparable Otafuku in NYC right here in Philly. It hardly compares, sadly. Maru Global is going to have to work harder on making takoyaki taste more than soft flour balls drizzled in Japanese bbq sauce (they missed out of the Jap mayo). I was not too keen on the Philly Cheesesteak Maru Balls. Still, it is a good start for Philly . . . \nIf you have not tried Otafuku in NYC, I recommend that you do. It is a hole in the wall, only 3 standing room to make your order. They have a limited menu - takoyaki, okonomiyaki or yakisoba - all perfected. You get your order on paper plates to go or eat standing outside."
    },
    {
        "id": 39,
        "text": "Dirty, slow, and under-staffed (though friendly).  Food's ok, nothing to write home about."
    },
    {
        "id": 40,
        "text": "Very interesting and affordable menu. The balls are delicious and I haven't come across other places that offer them. Highly recommend the octopus balls."
    },
    {
        "id": 41,
        "text": "Went there for a quick dinner. They did not have the veggie curry, so they offered me the meat kind! It was really great. I really enjoyed the Japanese style curry and the set up of the restaurant (open kitchen) it smelled great in there! We also had the chicken teryiaki was great. All the little sauces were great."
    },
    {
        "id": 42,
        "text": "Have you ever made zucchini or pumpkin bread that looked really great until you cut into it and discovered the center was a dense glob of undercooked dough? Unfortunately, that's the best way to describe the consistency of the takoyaki we were served the second day they were open. A week later nothing had changed.\n\nAdding to my disappointment was the long wait we experienced to receive such a lackluster final product. For a place that's serving Japanese street food waiting twenty to thirty minutes to get your food just doesn't work. \n\nI really do hope they can get their act together. Takoyaki would be a great addition to the Philadelphia food scene. If you've survived for another month I'll give you another try."
    },
    {
        "id": 43,
        "text": "Reading some of the reviews on here is why I've been using yelp less and less to decide where to go.  I actually saw someone who admittedly does not like Japanese street food giving a place that serves Japanese street food a low rating.  I'm not seeing the sense in this.  If you don't like a particular type of food, or you don't know how it is supposed to be and is not what you expect, that does not make a place that serves that type food a poor establishment.   But so goes the world these days....\n\nMaru Global sells a mix of Japanese street food (yakisoba, Japanese curry, etc), but their highlight is Takoyaki.   They serve not just the traditional octopus and trad. sauce, but also do a bit of Takoyaki-fusion (I'm assuming this is the \"global\" in their name).  I have had the spicy shrimp, traditional octopus, miso with tofu, and the bbq, also with shrimp.  I have had a few dessert balls as well, the red bean and the chocolate.  Everything was very good, my only holdup was the bbq.  The sauce dominated the flavor too much.  The traditional took me back to Osaka, but I think the miso was my favorite.  They also have vegan options, and they have crabcake, cheesesteak and pizza varieties which I have not tried.\n\nA bit about the balls themselves... contrary to what some reviews on here suggest, the balls ARE NOT UNDERCOOKED.  They are made with Yamaimo in the batter, a staple Japanese ingredient that is gelatious... it's very good, though unfortunately is strange at first for many American palates.  \n\nI have had the Yakisoba, which was excellent, and they have a few salads which I am going to try.  There is not a whole lot of seating inside, and it can be cramped, but I've never had a time where I didn't get a seat.  The prices are also reasonable.  Overall, Maru Global is a good representative of Takoyaki in Philadelphia.  Just wonder what took so long to get one here!"
    },
    {
        "id": 44,
        "text": "Had takoyaki before many times (Otufuku in East Village NYC, also in Hong Kong and China) so I knew what to expect.\n\nSolid octopus, I think I had tofu as well.  Tasty treats."
    },
    {
        "id": 45,
        "text": "What attracted me to this restaurant was their cheap lunch specials. Soup or salad with the entree and an included drink all for about 6 bucks. Good deal but as for the food it was only okay to me. I ordered their special pumpkin curry rice. It was okay but maybe im not used to that type of curry.  It was thick and thought it could of used more veggies in it. They have brown rice as an option as well which is awesome! But maybe it was the day I went - it was a little overcooked. Would I go back here again to try their other entrees? Probably. Their other stuff looks good."
    },
    {
        "id": 46,
        "text": "I've been three times. Had the burrito, the spicy balls in a bento box, and one more thing, I forget. Went on a friday night and by chance learned they had free wine and it was lit up so nicely. Dont forget to get your chocolate balls before you leave!"
    },
    {
        "id": 47,
        "text": "It was a rare Monday I was in the office and not traveling to someplace where Asian food means Chinese.  I thought about trying Jay's Sushi as the reviews are good, but Jamie S. had liked Maru, and I pretty much trust her food opinion above most others. \n\nWell unfortunately I don't share the same opinion on Maru Global.  I decided to try a few dishes -- Sesame vinaigrette on salad?  Sounds great -- and the salad itself was the highlight of the meal.  But a vinaigrette by definition should emulsify, and not just be a loose combination of sesame oil and vinegar.  Oh well.  \n\nBeef curry looked promising -- but was completely oversalted.  Now I like salty food and I found this really difficult to eat.  Even bites of beef, while very tender, reminded me of that unfortunate taste of Dead Sea water. \n\nSo two orders of Takoyaki.  I decided to go far from classic -- after my Falafel Factory experience, I realized I need to be open to the unexpected.  Pizza? Worth a shot.  And with vegan cheese???  Well this was a mistake as the soggy dough was completely devoid of flavor.  Had the balls had a bit of a crisp, I might have forgiven them, but alas...no.   The Chicken cheesesteak balls were promising, what with a little bit of hoisin(?) and a really good cotjia cheese.  And a couple of them were REALLY good.  And a couple of them had no flavor -- not enough cheese and no sauce.  While I am craving the two really good ones, the four not-so-good balls made me concerned about the consistency of Maru.\n\nI really wanted to like Maru, but alas, this was not a match meant to be..."
    },
    {
        "id": 48,
        "text": "i was superexcited about maru global's entry presence on the philly food scene; japanese street food - woohooo yes! i like that it's casual decor/seating and you can actually see the cooks frying up the takoyaki balls, and the service was great, but i still didn't love this place.  \n\ni guess what surprised me was that their takoyaki was mostly just okay, even though their other dining options seemed to taste a lot better. i mean, if your signature dish is takoyaki.... shouldn't that be really memorable and tasty? i'm just saying.  \n\nWHAT WE ATE\n*octopus takoyaki\ni found the octopus takoyaki to be a bit too mushy and really found myself wishing that they had used larger pieces of octopus, but still - a pretty good option. i would say, though, that i prefer the takoyaki at yakitori boy even though these at maru global are certainly more authentic. what can i say - i really dislike mushy dough? \n\n*crabcake balls \ni could have done without. they weren't anything special at all, just standard crabcakes, but the fries that accompanied them were pretty stellar. definitely skip these because even from a basic crabcake standpoint, they weren't memorable.\n\n*beef curry burrito\nThis was definitely the best of the dinner items we had. the curry was smoky and beef was tender and it had just enough rice to be filling and balance out the saltiness of the meat/sauce. PH claims he would get this at least once every three weeks if it were closer to him. i don't know about that frequency, but i'd definitely order this again.\n\n*almond chocolate takoyaki\nwe knew the dessert takoyaki were supposed to be great, but i was surprised by how much i enjoyed these almond chocolate ones. they come with fresh whipped cream on the side, which i abstained from (bleh) but PH spooned up enough to more than make up for it. we need to go back for the chocolate chip dessert takoyaki. honestly, i couldn't really taste the chocolate in them, but they were still pretty awesome.\n\nso definitely get the curry burrito and dessert. the octopus takoyaki are worth a try if you really need to decide for yourself. Plus, they have ben open for a few months now... perhaps they have improved their batter/fry technique ...?"
    },
    {
        "id": 49,
        "text": "They were really nice and the food was very good.\n\nPicture this, you're out at a street fair and you're hungry and need to use the bathroom.  In you walk into Maru Global to accomplish both of these goals.  You end up meeting some really nice people and finding some delicious food.\n\nWhat I just described above was my introduction to Maru.  I ordered the  octopus dumplings and watched as they were expertly made right in front of me.  They cost all of 6 bucks and completely hit the spot for street food.  It was incredibly appropriate since I was outside, spending time on the street.  I took the dumplings, chop sticks and a spicy mayo and had a grand old time.\n\nI'll definitely be back here.  This place has the food, the service and the prices to make it a really attractive spot to grab a quick bite."
    },
    {
        "id": 50,
        "text": "Maru Global was my first tako yaki experience, so I'll admit that I don't have much to compare to in terms of what they're \"supposed\" to be like.  \n\nI ordered the octopus salad and the original tako yaki.  The salad was dry and blah..  nothing really memorable about it.  I didn't really taste any sort of dressing on it, but again I wasn't sure if it was supposed to be that way or not.  The tako yaki themselves were undercooked for my taste - the center was mushy batter so that was a bit off putting.  My friend said that it depends on where you go.. some places are more crispy than others.  \n\nHighlights of the meal were the fries (go figure) with spicy mayo and the chocolate tako yaki.  I'll go back to try some of other dishes, but I was a bit disappointed the first time around."
    },
    {
        "id": 51,
        "text": "I waited almost an hour to eat lunch a few days ago at Maru Global . Got there at 12 because their website said they opened at 11:30 that day. When I got there, a sign on the door had an amended opening time of 12:30. Despite the sign (and the small crowd assembling outside in the cold) they didn't unlock the door until 12:45. The cash register/ ordering system was also not functioning right, so I couldn't order what I originally wanted (vegan maru balls).  Instead, I ordered the vegetarian meal - and had to get it to go because my lunch hour was almost up.  The food was OK (and cold by the time I got back to work) - the tofu and and rice was underwhelming, but the salad and mushroom soup were good.  I'll have to come back for the maru balls.\n\nHopefully the nice staff will work out the kinks.  I've got my fingers crossed."
    },
    {
        "id": 52,
        "text": "The service here is amazing but the takoyaki?  Let's just say that I have had better.  My octopus and spicy shrimp could have been cooked for a few minutes longer to attain that desired level of crispiness.  The batter itself was also a bit lacking in flavor.  This is a cute and inepensive place to stop by if you have never had takoyaki before and want to try it (it's the only restaurant of its kind in Philly, that I know of).  Just don't wait until the balls are cool to eat them because they really don't taste good then; takoyaki is meant to be eaten as soon as the dish is served.  Me?  I'll wait until I'm in NY or CA."
    },
    {
        "id": 53,
        "text": "An interesting combination of japanese street foods and other cuisines make Maru Global a unique and tasty place to eat. The beef curry rice bowl for about $6-7 is very satisfying and delicious. Their hand cut fries w/ spicy mayo are great. The tako yaki, which they are known for, is good, but I can't compare it with other tako yaki. It's a overall good place to eat."
    },
    {
        "id": 54,
        "text": "This place gets 3 stars for its uniqueness.  I stumbled upon this place from www.allmenus.com.  Their menu was different than any sushi place I'd ever seen - that's bc they're not really a sushi place.  I'd call it Japanese Eclecticism.  \n\nI am a fan of healthy food, but every once in awhile, I love to indulge.  I would probably not eat here on a healthy kick.  Many of the menu items seem fried or full of dough.  When last I ordered, I had the pancake balls dessert balls du jour.  The flavor of the day was peach, and they were deelicious.  They were accompanied by a cream cheese icing of some sort.  These were quickly inhaled by my mouth, with not one complaint.\n\nI also ordered the sweet sesame miso maru balls with octopus.  These weren't necessarily bad.  I mean, they were good, but different in a weird way where you can't completely decide if you liked the weird or not kinda way.  Along with this, I ordered the veggie curry fries.  This item, I think, sounds better than it actually tasted.  The flavor of the curry was fine (kinda mild, not spicy though), but the fries that the curry was poured on top of were soggy.  I like a crunchy fry, and these just didn't cut the bill.\n\nOf course, I don't think this will be my final time eating from here.  There are so many things on the menu that I'm still curious about, like the Forbidden Fried Rice and the Japanese Pizza.  I'm hoping to bump this place up another star, but I have the feeling they're going to remain at a solid 3 for me."
    },
    {
        "id": 55,
        "text": "Sesame Miso Fried Rice too salty but takoyaki octopus was tasty."
    },
    {
        "id": 56,
        "text": "i saw this place when visiting my sister who was dog-sitting. i saw that it was Japanese street food and i love takoyaki so i made a mental note to check this place out. i read a few of the reviews for this place before visiting last night, so i got a feel of what people's experiences were like. i didn't set the bar too high since it is street food, but i was really underwhelmed. especially since the pictures look so high-end. they really don't look like that AT ALL.\n\nfirst off, i was surprised the workers there were not Japanese. not that they have to be, but i got the impression that it was by some family who had moved here from Japan and wanted to make a takoyaki business. unless they had the day off...in any case, the place is pretty small. not a place for you to really sit and hang out. more like a dine-n-dash type of setting. they do takeout, so if you really like them, i'd recommend ordering because it does take some time to get your food.\n\nthe woman who was there was really nice and friendly. she was always excited to  place a styrofoam container of balls in your face. \n\nwhen you walk in, there's a counter immediately in front of you and there was a delivery person standing there. a few tables along the side of the wall, not much space. there is a little fridge towards the back for drinks. a few sodas and thai tea in a can (Lucia brand) - which is what i had.\n\nthere's an area in the very back that has a bathroom. be careful, its a weighted door so when you push it feels like someone is pushing back to close it. also, the soap in there doesn't smell too good.\n\ni ordered the Far East Sampler, which had 3 original octopus, 3 sweet&sour miso chicken, and 3 Korroke (which are beef & potato croquettes with Tonkatsu sauce). they're small, but Japanese portions are generally small anyway and the dough can really fill you up. i agree that they were really undercooked. it would have been really delicious if they were cooked properly and had more filling in them. the original octopus came with some shavings of what i think is fish flakes on top? they were cool to look at since the door was open and the wind was blasting in. they looked like they were moving! it was mostly chewy dough with a tiny piece of octopus in it and  or at least i hope it was octopus. it was too small to tell in all that half cooked dough. the sweet & sour miso was pretty good, but i really only liked the sauce, not so much the balls. the korroke was just a fried ball of mush. too much potato, not enough \nbeef. and i didn't get 3, i got 2.\n\noverall the takoyaki i had was 'ARIGHT'. not \"all right/alright/aight\" \nbut \"ARIGHT\". it makes sense if you're from philly. haha\n\ni also ordered the chocolate takoyaki for dessert. pretty much chocolate dough with ice cream on top and some decorative sprinkles. they were okay, i think chocolate glazed munchkins from dunkin' donuts are better though.\n\nmy friends ordered some other ones, but they liked it. or maybe they were just being polite since i picked the place for us to meet up and eat and catch up.\n\nmy one friend didn't get her food until the rest of us had already eaten. they \n\nactually lost her ticket and she had to wait another 10 mintues on top of the 45 minutes she had wasted sitting there watching us eat and picking at our food. the woman was really apologetic about it and gave her pumpkin spice balls on the house. she felt really bad cause we were joking about how this always happens when she orders food. \n\nin any case, we all got to eat and experience this little takoyaki place. i give it 2 stars for trying something new, playing Portishead, and because they tried to appease us for forgetting one order, but if i want takoyaki, i'd rather go to yakitori boy. or Japan."
    },
    {
        "id": 57,
        "text": "These balls are delicious.  \n\nAlarmingly affordable, wonderfully friendly people, and did I mention the balls?!  We had the original and the spicy shrimp balls, and they were gooey and delicious.  If  you plated three of these balls with a drizzle of the ubiquitous chipotle aioli, and a sprinkle of scallions and minced parsley, and charged $11.95, no one would complain.  Instead, you can enjoy six balls for $3.25.  Best deal in Philadelphia."
    },
    {
        "id": 58,
        "text": "Pretty good fried dough balls.  I hope this place makes it -- Philadelphia is a Japanese food wasteland (only other place that serves food like this is Maido out in Narberth)."
    },
    {
        "id": 59,
        "text": "I had only heard of takoyaki because of an episode of Anthony Bourdain's No Reservations, and I must admit I really really like the concept. \n\nFrom what I remember correctly, it's street food, right? I don't know.\n\nAnyway, I got the Sweet Miso version, with tofu. It was definitely tasty, but a bit heavy for just me. I wish I had someone to split it with. I also think I would try something other than tofu next time because it was just all mush inside, and crispy outside.\n\nOverall, I enjoyed it, but I did feel a bit gross and weighed down after trying it. I can totally see how it would be excellent drunk food to split with an equally intoxicated friend though."
    },
    {
        "id": 60,
        "text": "gave it two shots. \n1st visit) octopus balls- i get it. fried pizza dough with very little amount of seafood in them.  Tasty? Nope. Worth the amount of money charged? nope.  \n\n2nd visit ) curry burrito- IF YOU LIKE FLAVOR, DO NOT ORDER THIS. I get it, Japanese curry is different than Indian curry, but COME ON, this burrito was filled with rice!!!!!!!!!! Very little beef! i couldn't believe how crappy that was!! if i wanted a freaking carb overload, i would have eaten a meter long loaf of bread from sarcones. Blah not to mention the squirt of sour cream that they add to the burrito. 100% killed the flavor. i completely avoided that side of the burrito and couldn't make it past the first half. I was too filled up from the RICE.  \n\nboth 1st and 2nd time- the food took a RIDICULOUSLY LONG TIME TO MAKE.  I'm sorry but i can make a burrito in under 2 minutes. I'm pretty sure everyone can. Curried beef is something that's going to be premade. you just cant stew beef in 30 minutes, or even pretend that you are! pathetic!\n\nalso, its super hot inside the restaurant.\nat least the awesome waitress/cashier/cook who didn't wash her hands was kind enough to offer ice water at the end of the meal. \n\nOh, and the lemonades/teas that they serve, would be even better if they offered them with ice!"
    },
    {
        "id": 61,
        "text": "I was very excited at the prospect of takoyaki and okinomiyaki in Philadelphia, but sadly this place just doesn't cut it.  I've never been to the place itself, but they were one of the vendors at the Night Market.\n\nI arrived at the market around 6:30 and immediately stood in line at Maru. They weren't even cooking food at this point because they were \"waiting for something.\"  So I made my rounds and came back not much later.  The short line was painfully slow, when I looked at what was going on there was some white guy making about 6 takoyaki at a time rather than using the entire pan.  I've been to Japan where I've seen them quickly make dozens at a time to a golden brown perfection.  This was inefficient and undercooked.\n\nFor some reason I kept on waiting and after 30 minutes I get to the front--only to find out they are out of octopus!  The ONE dish they are supposed to serve and they are out of it after about 10 people.\n\nI know the night market is busy, and not the same as a restaurant, but this gross mismanagement of time and ingredients proves to me that I do not need to be going here.  Combined with all these reviews of undercooked, poor quality food leads me to believe Philly won't be seeing Kyoto street food anytime soon."
    },
    {
        "id": 62,
        "text": "I really enjoy ball-shaped food. There, I said it. Though embarassing, it's totally true and I often find myself compelled to make or buy it. When Maru Global first popped up, I was instantly yearning to buy up a round of balls, aka takoyaki.\n\nWarning to takoyaki virgins: the fishy/seafoody balls will smell up your entire home. Dashi is apparently the culprit. So, on my next MG adventure I will avoid those balls...\n\nBig bonus - the dudes working were helpful, friendly, and maybe even a little precious... but let's not get carried away."
    },
    {
        "id": 63,
        "text": "As a vegetarian who lives in the neighborhood, I was really happy to see that this place finally open up.  I had never had tako yaki before but was pleased with the wealth of vegetarian options for both that specialty and on the rest of the menu.  I had the shitake soup which was the perfect portion, and the vegan pizza takoyaki.  The vegan cheese was melted perfectly (which is a feat for vegan cheese!), the basil and tomoato sauce smelled wonderful, and the shell wasn't overcooked.  The chef said that they weren't supposed to be super crispy.  I also had the red beans and sticky rice which tasted unusual (but good) with the sticky-sweet combination.  The tofu gyudon was good but I had wished they gave soy sauce to add some  more flavor.\n\nOverall the food and service were great and I'm glad they are so close--  I will definitely be getting take out in the future."
    },
    {
        "id": 64,
        "text": "This place has been on my radar for a while because: (1) It's in my hood; (2) it's Asian (Japanese street food from Osaka!); and (3) when you order, you get to say \"balls\" (I'm 5 years old). \n\nWhen I first heard about the takoyaki balls, I assumed they would be deep fried a la falafel. So when we scheduled a work lunch here, I went in with the mindset that I could indulge now, and eat a salad for dinner. I was surprised to learn that the balls are not fried, but rather hand-cooked in a waffle-iron like contraption with divets the size of golf balls. And while the skins were slightly crisp, the inside was warm and doughy. \n\nFor lunch, I ordered the health salad, and the classic takoyaki with shrimp. If you are the kind of person that likes quinoa-like grains, you will LOVE the health salad. It's a blackish grain with some veggies cut up on top (carrots, cukes) served with two vinaigrettes. The green pesto-like dressing was delicious, and the salad kept me full for the rest of the afternoon. Takoyaki balls were ooey-gooey and totally scrumptious - unlike anything I've ever eaten before (note: if you don't like Nori, skip the classic takoyaki flavor).   \n\nA few weeks later, around dinner time, I had a hankering for these balls (hehe), so dining companion and I ventured over. I got the health salad, AGAIN, and the BBQ takoyaki with shrimp. DC got some yakisoba noodles and the sweet 'n sour miso takoyaki with chicken. I definitely prefer the seafood fillings (shrimp, octopus) to the meat fillings. I also loved the BBQ sauce, but was more or less \"meh\" on the sweet 'n sour miso. Yakisoba was a little too sweet for my liking...but DAMN those balls are good. \n\nThis is not an everyday place for me, but I know I will get sharp cravings for these tasty little snacks on a fairly regular basis, which is why Maru Global gets 4 stars."
    },
    {
        "id": 65,
        "text": "crab cake balls are so fucking good! with fries and spicy mayo, the miso soup wasn't miso-ey enough, kind of watered down, but the woman there i think shes the owner is very nice, we were waiting and she sent us over a free order of carb balls, free food is the best! wait time is kind of long for something that is suppose to be street food in japan, but other than that the place isnt bad."
    },
    {
        "id": 66,
        "text": "After living in Tokyo, I've been convinced that Philly needs 3 things: 1) an authentic soba shop, 2) an okonomiyaki place,  and 3) good tako yaki. I'm glad Maru's here, but it'll need some work to survive. The takoyakis at Maru are small & soft, not the golden-brown delights I remember. I do appreciate the variety though, and will even more when the taste catches up with the creativity. \n\nAlso needing work - the interior. The best tako yaki I've had were sold from an ancient Japanese guy out of a tent, so I don't expect much. But having Food Channel showing on the TV just seems counter-productive. Plus watching Paula Deen makes me less hungry, not more. Anyway, I'm hoping Maru makes the right tweaks and gets it right."
    },
    {
        "id": 67,
        "text": "Totally underrated restaurant.  Considering Philly's demand for honest ethnic foods, I'm surprised Maru isn't continually packed.  While many sushi spots are certainly authentic, Maru is what I would eat if I lived in Japan everyday.  I really dig the takoyaki, I keep coming back for their curries:  very unique compared to southern Asian curries and has a very unique profile.  The staff and owner/chef are great and they have a fun atmosphere.  If at all interested in experiencing another side of Japanese cuisine, don't miss Maru."
    },
    {
        "id": 68,
        "text": "Completely RAW goo, anyone? I had to recook it  at home to make those dough balls at least edible. Service is great but the food is just not worth the price, let alone the 30min wait.  It's street food, hello, not a gourmet restaurant-there should be no more than 5 min wait , especially when noone else is in line.  Soups are oversalted and too thin. Might go back to see if they improved."
    },
    {
        "id": 69,
        "text": "I cannot say enough about this restaurant.  It confounds me why they are not always busy.  It's not the food which is all delicious (I've eaten here on numerous occasions).  It isn't the price either which is more than reasonable (almost everything is less than $10).  Plus, everything is made fresh and to order.  To me this is a place for foodies, to try something you really can't get at any other place in Philly, namely Japanese street food (nary a sushi roll in sight).  (Lots of great options for vegetarians too).  Yes, the inside decor is rather plain, but go for the food.  It's fantastic."
    },
    {
        "id": 70,
        "text": "I just had the worst lunch here that I've had in a year.  I'm not a big fan of Japanese snack food anyway, but this was badly prepared; the little balls were not cooked all the way through.  I got six chicken and six shrimp balls, but I couldn't tell which were which.  So I ate my twelve little morsels of gluey paste with unidentifiable lumps in them and then I went up the street and got a ham sandwich.\n\nThe snack cost $6.50, and I waited 45 minutes for them to be prepared and served.  I resent the 45 minutes more than the $6.50. \n\nWarning to groups: the restaurant seats 12 people total.  It has one table for four people and four tables for two."
    },
    {
        "id": 71,
        "text": "i never get to review balls.  somehow, it's unprofessional, and something that should be kept quiet.\n\nbut now that i have tried maru global, i get to write about balls.  and here goes:\ni've had takoyaki on my last trip of japan.  i never thought i could enjoy little octopus balls coated in a bunch of sauces oh-so-much.  but i did.\nand then i heard a takoyaki shop was opening in philly, and i think i drooled on myself over that thought.\n\nso i'll given them points for friendliness and trying to please the customer.  so nice.  to the point that it makes me sad to write this.  but...  \n\nthe balls were not good!  the texture was just wrong, it was too doughy.  too much bonito, too little mayo.  just...not...right.  when you only have a few things on your menu, and you are the only place in the city serving it, it better be the best darn balls ever.\n\nso, the lesson learned?  never return to gross balls.  the end."
    },
    {
        "id": 72,
        "text": "I wanted a filling meal and decided to try the eclectic looking new restaurant down the street.  I wasn't disappointed, but I wasn't blown away.\n\nI got the Yakisoba combination (for a dollar more, I'd say it's worth it--it includes soup, salad and a can of diet coke).  The service was willing but rushed, and there ain't much ambiance, but I don't care if there are taxidermied octopi on the wall as long as the food is good.\n\nThe miso soup was typical--not too salty and had substantial amounts of tofu, seaweed and scallions.\n\nIt was nice to see a small salad full of romaine and not iceberg, with a great ginger dressing that had a hint of peanut in it.\n\nThe yakisoba was okay--the beef was well cooked, and I really like the texture of the noodles.  The flavor was strange, but not bad--there was a spice I couldn't pick up on that was overused.  The portion was sensibly sized.\n\nOveral, a tasty quick meal, which is what I was looking for!"
    },
    {
        "id": 73,
        "text": "Japanese pancakes for dinner? Does that count as breakfast for dinner? dinner for breakfast? I think these delightful balls filled with chicken/beef/squid/octopus are basically a meal that anyone could eat at any time of day and be pretty happy with. \n\nMaru global has become a go to dinner on nights when I just have no idea what it is that I'm looking for in a meal. We order from Grubhub pretty often and with the exception of an occasional communications error between the web service and the restaurant we have always had exceptional experiences. Even when we did have a communications error between GH and MG the end result was the restaurant being awesome and doing everything in their power to get us our dinner in a timely fashion. And since I'm just a sucker for excellent customer service, you know I love these people.\n\nThe food itself I would say you should just ingest in order to understand it. I find it completely delicious and a nice change up from my normal meals of... actually I don't really have a normal meal. So think about what you have for a normal dinner and enter that at the end of that sentence. ok. good.  Anyway. I find this place a nice Tuesday-Thursday I just don't want to cook anything and starving seems silly alternative. \n\nOh! also let's talk about dessert pancakes balls. generally featuring some form of melted chocolate or pineapple. and powdered sugar. dipped into more chocolate- Can I get an Amen? order some. you will feel this dedicated also."
    },
    {
        "id": 74,
        "text": "Let's talk about okonomiyaki.  That's a sort of Japanese pancake thing all stuffed with cabbage and topped with bonito flakes, spicy mayo, and all manner of other goodies.  Maru has it.  It's less than $10 and mad filling, besides being an umami explosion. You don't know how to make it at home.  Get it.\n\nPS: Okonomiyaki are cooked on a flat-top griddle. Takoyaki are griddled in a special pan with half-sphere indents. They are NOT deep-fried. Just to be clear on what you are gettting--many of the reviewers here are confused as to the nature of the product."
    }
]