[
    {
        "id": 1,
        "text": "Delicious and very nicely presented. We had J Sushi and Fire Roll and fantastic. Excellent service and great value."
    },
    {
        "id": 2,
        "text": "My go-to spot for low key take out/sit in sushi.  Excellent food, quick turn around and contemporary inside.  Highly recommend.  Only suggestion would be to add much more soy sauce packets in the to-go bag :)"
    },
    {
        "id": 3,
        "text": "This place has an amazing lunch special. I definitely recommend the lunch special that has two sushi rolls and a salad for 9 dollars. If you go to Jefferson it is really close by as well, so definitely come after exams."
    },
    {
        "id": 4,
        "text": "Yesterday was my dad's birthday. I ordered sushi from J sushi again. I ordered sushi deluxe, salmon belly, yellowtail belly, fresh scallop, live lobster appetizer, king crab appetizer, and live lobster mango salad. It tastes so good. Their fish is always so fresh, salmon belly is melt in the mouth. I can wait to try more of their menu."
    },
    {
        "id": 5,
        "text": "We love this place! We live around the corner and get sushi here probably once a week. It's extremely fresh, inexpensive and quick."
    },
    {
        "id": 6,
        "text": "First time trying out this spot with 2 other fiends. We got the All you can eat for $25/Per Person. We got two rounds of sushi. \n\nWe came in on a Monday around 7:30pm and we were the only ones there! Started to fill up by 8:30pm. Good for parties of 2-5 as he tables are smaller. \n\nQuality of fish was great, everything tasted amazing! I deducted one star because there was only one waiter and one sushi chef. Getting our food took painfully long as people started to come in. If you're looking for a good deal and quality sushi this is the place. Be prepared to wait for your food though. \n\nI'll be back!!"
    },
    {
        "id": 7,
        "text": "I've been there twice. And I'd like to introduce it to all my friends. The best sushi place in cc.\nMy favorite one is black dragon roll, which made by eel and Tampula. The eel is so fresh and has perfect traditional eel-soy sauce taste. The waitress told me that they use the expensive kind of eel from market. I believe it cause you can really taste that!\nI also like the J special roll, has tuna at top. The sophisticated texture of each layer give your tongue a luxurious massage.\nFor the appetizer, Seaweed salad is the one you won't wanna miss. Very Japanese, fresh and chewy arouse your appetite. The fried dumpling is just fried so perfect, the light crispy bottom is just... professional!!\nLast but not least, service is so good! Take care you you very much. They let us see how they made food at open bar, which is interesting! \nAlready be their loyal customer!"
    },
    {
        "id": 8,
        "text": "I've only ever ordered delivery from here, but this is my favorite affordable sushi place in Philly. They don't skimp on the fish, and I've always had A+ service. They also have really good combos for lunch and dinner that I think are so so worth it.\nI just noticed the promotions they're doing for Sundays and all you can eat...I'm definitely going to make a point to go to the actual restaurant and try these!\nHighly recommend!!"
    },
    {
        "id": 9,
        "text": "I had higher expectations because of the previous reviews. I order the 3 spicy roll deal, the spicy salmon didn't have a great taste.... the salad was just lettuce. I did like the salad dressing."
    },
    {
        "id": 10,
        "text": "Tried this place out with a friend for lunch. It was good, the pale was very clean, the service was prompt, and the lunch special was a good value. They have a 10% off deal for Jefferson employees which was nice too. 4 yelps!"
    },
    {
        "id": 11,
        "text": "Surprisingly tasty sushi at an adorable price.\n\nJ Sushi boat for $60 covered with a soup, salad, and edamame on top of 2 rolls and 21 pieces of sushi. The pink lady took had a lot of slices. I'm not a sushi fan but would definitely go back. \n\n Parking is a bit difficult there but you can find street metered parking around."
    },
    {
        "id": 12,
        "text": "Ordered the chicken and shrimp hibachi combo from UBEReats and it was delicious! Ginger salad was great and love their take on yum yum sauce! I will definitely order from them again!"
    },
    {
        "id": 13,
        "text": "Came here on a Saturday evening and the place was pretty empty. My companions and I were leery because we just came from Aki and we couldn't be seated. I ordered the Sushi Deluxe and it was delicious. The presentation was top notch and the portions were generous and the fish was very fresh. The waitress returned multiple times to fill our water. At the end of the evening, the chef even made us a dessert of green tea ice cream, orange slices and pocky on the house! A very memorable experience. Will come back!"
    },
    {
        "id": 14,
        "text": "Really enjoyed the sushi and chicken teriyaki. They gave generous portions and did a nice job with the presentation. Staff was very friendly and attentive. Look forward to going back."
    },
    {
        "id": 15,
        "text": "The food was very fresh, quality was the best among sushi places I've been to given they have omakasa, we ordered 18 pieces of them, it got some nice selections of rare species like Yaju (high end of yellowtail belly ), Japanese uni and fresh wasabi!  For rolls we ordered recommended Fuji and black dragon rolls, to my surprises their eel were so good and no smell like other places.  For appetizer we ordered an item called avocado dumpling, Omg! It got just ripe avocado that melt in your mouth, inside avocado wrapping it had mixes of various fishes with a little spicy house sauce. I also like the garnishment and plating in that they used dried ice and shaved ices to preserve the freshness, finally i liked their attentive services that made you feel at home. If you like some special fishes and yet with quality and nice display of their skill set or varieties you should stop by and try out. I also was told they will bring in authentic Japanese ramen soon. We will definitely come back. Overall good job to their chefs and good luck to this newly open sushi store at the center city."
    },
    {
        "id": 16,
        "text": "Good spot when you want a dependable place to order sushi delivery from. The entrees are really tasty as well. I recommend the teriyaki platters if you are not a fan of sushi. They are good size portions and are very reasonably priced."
    },
    {
        "id": 17,
        "text": "Many options of fresh seafood sushi and sashimi. Never had raw lobster sashimi before and it was fantastic! Uni was so juicy and buttery! I was told that the uni is from Japan and it is a different kinds from the ones from California. The restaurant is not chain or big name, but they have really good and fresh food. Will definitely eat there again soon. Don't forget mochi icecream. It's so much more than icecream!"
    },
    {
        "id": 18,
        "text": "Great food, great place, great service, I would say they are better than bleu sushi at least.  Little bit more on the price, but worth the price"
    },
    {
        "id": 19,
        "text": "Delivery through multiple online platforms.    There was a mixup on my order, and they called me right away to clear everything up.   The hostess was very pleasant on the phones as well.     \n\nThe salad actually had decent ginger dressing & the sushi was really fresh.   Although I ordered veggie rolls, all the ingredients were top notch.   I also appreciated the interesting and different makis like eggplant tempura roll...yum!    \n\nAll told a good new rotation for my work lunch splurge days.    And the delivery was on time or even a bit early."
    },
    {
        "id": 20,
        "text": "They accept credit credit. I really hope that this place stays in business because it is probably the best sushi place that I have been in Philly. All the staff were super friendly and accommodating. Restaurant is very clean and modern looking. Overall quality of the fish was solid: had the spicy roll combo (8 pieces each of spicy tuna, salmon, and yellowtail). What was special was their plates. All of them had some cherry blossoms or butterflies drawn with sauces, which I thought was a really cool touch."
    },
    {
        "id": 21,
        "text": "We went to try this new restaurant near my house. The staff there were very nice. The waitress recommended their special to us. We ordered baby yellowtail belly sashimi, lobster sashimi, king crab sashimi, salmon belly sashimi, white tuna sashimi, lobster mango roll, shrimp tempura roll. It was fantastic and the flavors were amazing. The sashimi was very fresh. I will definitely be back!!"
    },
    {
        "id": 22,
        "text": "Pretty good sushi place. Not my favorite but I liked it. It was nice and clean with short wait times and friendly service. All you can eat sushi was $26 on Monday, Wednesday and Thursday."
    },
    {
        "id": 23,
        "text": "Ummm.... wow! Just ordered from here via Uber Eats and I can say is GREAT!!!!! The food is absolutely incredible and that's not common with take out. The food is very filling, fresh, looks good, and tastes greatttttt. So satisfied with this place and definitely coming back. \n\nSuper affordable and worth every penny. Do it!"
    },
    {
        "id": 24,
        "text": "I'm here for the 5th time now and am astounded that there isn't a line out the door. Not trendy enough yin appearance? Chairs not fancy enough? I don't know. I do know that the food is fantastic and the price point very fair. Moreover, the service is amazing. They always hand me something to try and it's always beautifully presented and delicious."
    },
    {
        "id": 25,
        "text": "Found this place on a whim, excellent service and comprehensive menu and the prices are pretty reasonable. The avacodo dumpling was awesome and all the sushi I ordered had fantastic subtle garnish that I thought complemented each f the types of fish very well. My wife ordered to specialty rolls, both of which had awesome flavors and very nice presentation. Would recommend to anyone near center city."
    },
    {
        "id": 26,
        "text": "Update: my review below is from three months ago. I have been back several times since and I am still amazed at how few people seem to know about it. Each time the sushi guys hand something to me in addition to my order to have me try something that I haven't tried before. Every single time it is amazing. Last night, I tried 2 new rolls and they were by far the best rolls I have ever had at a sushi bar. I was following the lead of a table of people behind me. They were raving about their food and with good reason!\n\nMaybe they're surviving on takeout and delivery. Either way, if you live in Center City or the Washington Square area, you really should give their food to try.\n\nOld review: I'm  here for the 5th time now and am astounded that there isn't a line out the door. Not trendy enough in appearance? Chairs not fancy enough? I don't know. I do know that the food is fantastic and the price point very fair. Moreover, the service is amazing. They always hand me something to try and it's always beautifully presented and delicious."
    },
    {
        "id": 27,
        "text": "The best and freshest sushi in Philadelphia, great service and very nice chefs. My first time coming here and absolutely will be back here soon. I'm highly recommending to all sushi lovers"
    },
    {
        "id": 28,
        "text": "We stopped in for lunch after hearing that it was a new highly-rated spot. We were definitely surprised that there was no one in the restaurant over lunchtime on a Friday, so we weren't quite sure what to expect. \n\nI had the spicy tuna & shrimp tempura roll and my husband got a lunch bento box with hibachi chicken. The bento box was the biggest one I've seen and had a great assortment. My sushi plate was beautiful and they did have a great selection from their menu. Overall, the food was good but not the best I've had. Certainly a great deal for the price, though!"
    },
    {
        "id": 29,
        "text": "Great sushi with incredibly fresh ingredients.  Delivery service is quick.  My go-to sushi place to order from.  You won't be disappointed."
    },
    {
        "id": 30,
        "text": "I had been trying to find a place to park so that I could try J Sushi and finally found one today in front of Jeff. A Sunday, around 4:30 the place was mine and the server gave me all her attention. The place is Quaker plain in its decor. But I appreciated the calm gray reserve and black tables. Restful. Having perused the menu online several times I knew I wanted the fried oysters $7). Just the idea was too good to pass up. I prefer Sashimi to Sushi. I want to savor the fish and not the surroundings.The server suggested the baby yellow fin special ($17, a little pricey) and I agreed.\nThe oysters arrived nicely garnished. The taste and the texture climb to the ethers. Just a perfect dish.  The baby yellow fin appeared on a lovely wide dish garnished with radish, cucumber, yellow caviar and tiny dice-like cubes of dragon fruit. Here too, a delight (although a bit expensive, at least for me.) \nJ Sushi was everything that I've read on other Yelp posts. If you can find a place to park, this is a cannot miss."
    },
    {
        "id": 31,
        "text": "Vibes: clean, minimalistic, dark tones \n\nTasting notes:\n-Yellowtail jalapeño: sashimi appetizer with slices of jalapeno and pinches of tobiko on top; beautiful presentation with thinly sliced mango and lemon, comes with a light, orange-colored dipping sauce\n-Ocean lobster roll: overflowing with sweet mango and lobster chunks\n-Holiday roll: yellowtail, tuna, salmon wrapped around maki with lobster inside; very light\nThree spicy roll: pink soy paper wrapping, comes with sweet brown and savory mayo sauces; a pleasant mix of crunch and chew, couldn't really get the spiciness though\n\nWill be back for:\n-Lunch box special that is everyday but Sunday\n-Weekly specials"
    },
    {
        "id": 32,
        "text": "The first and the last time in here. I ordered to go and i ve been told about 20 min. I ve waited 45 min and they came over to me and they said that they will stsrt doing at the moment mine. Their excuse was they had lots of delivery order. If you go there their delivery orders will be more valuable than yours for them. And they are over priced for the service and the food.Go somewhere else and make yourself a favor"
    },
    {
        "id": 33,
        "text": "I ordered delivery twice so far and it's been great!! Very quick as well as fresh. Love the gyzo miso soup!! Will definitely be ordering from here often"
    },
    {
        "id": 34,
        "text": "Me and the wife decided to try this place out since it was near where she works. Very glad we did as the sushi was very good and very fresh tasting. We've had sushi at other places that honestly weren't as good as this place. Service was good and the place looked nice inside. Would definitely suggest the Tuna Tata as it is one of my favorites."
    },
    {
        "id": 35,
        "text": "I live around the area, just found this newly opened sushi restaurant. Tried their tuna lover roll and yummy roll for the first time, the tuna was so good, you can taste the freshness. The second time I went with some of my friends, we ordered some sashimi, can I say their salmon belly is the best? \nDefinitely will be a regular customer !"
    },
    {
        "id": 36,
        "text": "Excellent,  fresh sushi.  At reasonable prices. Highly recommend this place,  very friendly staff."
    },
    {
        "id": 37,
        "text": "Take out for lunch. \nGot their any 3 rolls for $13.00\n1. Salmon roll\n2. Spicy tuna roll \n3. Yellow tail and scallion roll\n\nIt was nicely packed in a container and came with a small side of salad! The dressing for their salad was creamy, usually I'm not a fan of creamy dressing but this was light and tasty. \nThe rolls were perfect size and ratio. The spicy rolls were made with rice on the outside and fish inside (inverted sushi), I like that they didn't pack too much rice on the rolls. Yellow tail and scallions had nori on the outside and had fresh yellow tail chunks on the inside. With three rolls and a salad, I was more than stuff for lunch."
    },
    {
        "id": 38,
        "text": "Where are the reviews for this place!? \nThis was AMAZING! Not only the food was great, but the service, the chef, it was a personalized experience. Come and try it out, you won't regret it. They have a huge take out clientele, but dine in is amazing as well.\nWe had tons of fish only appetizers, each of them incredibly fresh, innovative and beautifully presented."
    },
    {
        "id": 39,
        "text": "This place is a small and private restaurant that they can personalize your every need. I love this place so much! The owner is super nice and enjoy serving the freshest seafood. He made sure we are satisfied with the food and the service. Every slice of fish was cut with precision! Never frozen that's most important! This has just became my favorite Japanese restaurant. The prices are very reasonable and considering that it is located in center city. A must visit in my opinion!"
    },
    {
        "id": 40,
        "text": "Great lunch!!!  Found this place on Yelp!! ( thank you).  The place is clean,  the food tasted fresh.  \nI had a Chicken Teriyaki Bento Box.  It was delicious!   \n\nThe place is nicely located."
    },
    {
        "id": 41,
        "text": "Ordered delivery from here for the first time. It was amazing. The three roll dinner special for $14.99 is such a sweet deal. The rolls had fresh big cuts of fish in them. The avocado salad was well worth the price and very tasty - I hate creamy dressing, but the ginger one they use was light and delicious for a creamy-looking dressing. It came with tons of avocado. Also had the veggie steamed dumplings which were yummy as well. Delivery came sooooo fast. Would order from here again over my usual spot!"
    },
    {
        "id": 42,
        "text": "My delivery go too. Always fresh. Love the avocado bombs."
    },
    {
        "id": 43,
        "text": "Fresh fish with a highly artistic presentation. Very friendly staff and delicious off menu sake. Will definitely be back."
    },
    {
        "id": 44,
        "text": "When we got there it was empty. 5 PM on a Sunday. However, the waitress attended us well and the food was really good. We each ordered a black dragon roll and we had steamed gyoza's. Both really good! They had eel sauce with I loved. I have no complaints."
    },
    {
        "id": 45,
        "text": "I will have to say I had the best sushi I have ever had today. Service was exceptional. I highly recommend."
    },
    {
        "id": 46,
        "text": "Very satisfied with the quality of food and promptness of delivery. I went all in and ordered the sushi and sashimi deluxe. Both were excellent. The fish: as fresh as I've had in Philly, which, for me, is the most important thing. Next: just the right amount of rice for the sushi (allowing the fish to stand on its own, taste-wise), and generous cuts for the sashimi. Finally: superb presentation, visually speaking -- and, again, this was just for delivery! They didn't need to do that, but I appreciated the extra effort. All in all, happy to have this place in the neighborhood, and eager to order from them again."
    },
    {
        "id": 47,
        "text": "Great food and customer service, friendly staff, short wait times, and discounted prices for Jefferson students and/or those paying in cash! Definitely would recommend."
    },
    {
        "id": 48,
        "text": "Went there for a quick lunch last week. The place was barely lit, and no customers were waiting for service. I thought that meant I would get my lunch quickly. No such luck. I waited for 30 minutes. There was only one pick up order while I was waiting. I did not order anything special, just a lunch item. Three rolls. And I ate them in 12 minutes, nearly 2.5 times quicker than it took them to make the rolls. 30 minutes?! They were not in a rush at all. \nThe food was palatable, nothing special, but I ate it with a moderate amount of pleasure. I guess all that waiting spoiled the food for me."
    },
    {
        "id": 49,
        "text": "I took daughter to downtown Philly for dinner since she was coming home in the weekend. She suggested Sushi and looked up Yelp to find Fat Salmon. After arriving at the restaurant, we were told a 30-min wait I time. She looked and found another place nearby called CHeU Noodle Bar. Well, this a tiny and popular spot for Saturday night. It had a 2-h waiting!\nIn desperation, we saw this place next to CHeU with decent Yelp rating, so we decided to give a try. \nWe ordered three Special Rolls (Best Friend, Romantic and Black Dragon). The sushi was fresh but they lacked distinct taste to be great. The sauce was very heavy, which made it difficult to really enjoy the taste. The Black Dragon Roll was all my daughter wanted to try. The soft-shell crab in Romantic was okay. The Best Friend Roll will definitely not be my choice of recommendation."
    },
    {
        "id": 50,
        "text": "Nice casual sushi spot in Center City. The staff here are wonderful, they have several menu items to choose from, and a variety of great lunch and dinner deals. Of note, they have a 10% off discount for cash purchase, as well as an additional 10% off for Jefferson students. We had the maki party platter, which came out to roughly 18 dollars per person including tax and tip. Great deal for sushi."
    },
    {
        "id": 51,
        "text": "Superb sushi! Fresh, beautifully presented and simply delicious. The chefs and server are lovely, friendly people. This place is a sleeper so far. Fat Salmon gets the press, but this place and its sushi is so much better, less pretentious with gracious and personable service. I'm usually a harsh critic, but J's gets my unequivocal endorsement!"
    },
    {
        "id": 52,
        "text": "I've gotten delivery and take out from this sushi place and both times I thought it was just okay. Honestly, there are a ton of sushi places in the area and this one just doesn't live up to expectations. \n\nWe tried the 2 roll special combo with the pink lady roll and the christmas roll and the 3 roll special combo with the white tuna avo, salmon avo, and spicy tuna rolls.\n\nSure, the price is pretty good for sushi.. 14.99 for 3 rolls plus soup is ridiculous and a good option when you don't want to spend a lot. But the sushi just doesn't taste that fresh and they love glopping a ton of sauce all over the rolls. I had to physically scrape the tops of all the rolls I got because of how much spicy mayo and other gloppy sauce was all over them. Not how I like my sushi."
    },
    {
        "id": 53,
        "text": "One of the few places we got to try during a long layover after a cancelled flight. The lunch bento boxes are awesome!  My wife LOVED the Ocean Lobster Roll (with mango) and the tuna. Excellent food."
    },
    {
        "id": 54,
        "text": "This restaurant is truly an upgrade from the previous establishment, in almost every way. Sushi is superior here compared to other places in the area, and the dine-in experience is very special!\n\nHighly recommend!"
    },
    {
        "id": 55,
        "text": "Best budget sushi I've found in Philly to date.  There are 3 sushi spots on this block, and mediocrity of the other 2 kept me away from this one until Thanksgiving weekend.  My mistake.\n\nNigiri lunch special is a great value with good fish, a nice mix of flavorful nigiri, half with house dressings and half without.  Dressings were light and complimentary rather than obtrusive.  Rice was on point.  Nothing new or terribly exciting, but frankly well-made and flavorful sushi is cause enough for excitement.\n\nEnded up going back again the next day.\n\nWord to the wise: no lunch specials on Sunday, though they still honored it based on a mistake on their website.  Customer service gets a star."
    },
    {
        "id": 56,
        "text": "I feel compelled to write a review because after 2.5 years living in Philly and ordering from various spots, I *finally* found my go-to sushi place and couldn't be happier! (For anyone who's lived in Boston, my reference point is Fin's and I miss them very much.)\n\nI've only ever ordered delivery but it's relatively quick and always correct. The $14.99 three roll dinner special (+ soup or salad) is an incredible deal and is a ton of food. I've had my share of rolls in Philly that come 8 pieces to a roll but they're stingy smaller mostly-rice pieces. Nope - not here! 8 solid pieces!\n\nSo good. I'm eating right now and already can't wait to order again."
    },
    {
        "id": 57,
        "text": "Because this place had good ratings, I decided to have lunch here. I wanted to warn others that the rating is deceptive. The soda was served at room temperature and the sushi wasn't up to par. The restaurant is rundown and had a strange smell and some of the lights were blinking. I'm sure it's a good deal for students, but it's far from a great restaurant. Beware!"
    },
    {
        "id": 58,
        "text": "The best and freshest sushi in Philly great service and very nice chefs .My first time coming here and i will come back.I'M a big fan for sushi.LOVE IT LOVE IT LOVE IT"
    },
    {
        "id": 59,
        "text": "J sushi is a staple in my life at this point. It's also a quick stop for lunch and takeout. The lunch and dinner specials make is especially appealing! The sushi is always fresh and they give student and cash discounts! Always impressed by the service and speediness of this place!"
    },
    {
        "id": 60,
        "text": "I normally don't write reviews but J Sushi was worth taking the time to write. The place was really empty which wasn't a good sign but MY OH MY the sushi was exceptionally delicious! The specials are so amazingly priced. To top it all off Jesica, our server was the kindest. Highly recommended."
    },
    {
        "id": 61,
        "text": "Came here for a pickup takeout order and was impressed! \n\nDespite there being no one in the restaurant when I got there other than the employees, I would say that this place has impressed a decent amount of people with both dine in and takeout. \n\nI ordered with yelp which is fulfilled with grub hub, but was told that if you call, you can get 10% off which is nice.\n\nI got the 3 roll dinner that comes with a salad or miso soup. I picked shrimp tempura, eel cucumber, and spicy salmon with a bowl of miso soup. The order was ready quick and packed well. The soup was super tasty and the rolls were all great quality for takeout sushi. \n\nClose to work for me so I'll definitely be getting this another time."
    },
    {
        "id": 62,
        "text": "Very yummy and fresh. I like that they have \"pick two or pick three\" special maki rolls for a set price. It's a decent deal and you still get to pick whatever you'd like! Definitely recommend."
    },
    {
        "id": 63,
        "text": "I am amazed that the owner and chef really know how to craft high quality sashimi and sushi here. I ordered the special baby yellowtail and fresh uni from their weekly special menu. I can tell right away they are using fresh and high quality vendor and the taste is so good. It is probably the best sushi I ever had in Center city. But the price is very reasonable. For the quality you get, I can only think of one restaurant in Center city is comparable to it with 30% more expensive. I hope neighborhood and foodie can find out this place and their business should pick up shortly. It is a BOYB"
    },
    {
        "id": 64,
        "text": "This restaurant is delicious. There is plenty of street parking in the area. The service here is great and so is the food. They offer specials on there sushi. I definitely recommend checking them out!"
    },
    {
        "id": 65,
        "text": "Excellent quality sushi with fast delivery! First time ordering from J Sushi and I'm super impressed by the presentation and taste! \n\nI ordered four rolls to try: romantic roll, popular roll, spicy tuna, and Philadelphia roll. Each one has its own distinct taste so it doesn't feel like I'm eating the same roll. The salmon and tuna is super fresh and the pineapple in the romantic roll is super yummy with the soypaper.\n\nWill definitely be ordering from here again :)"
    },
    {
        "id": 66,
        "text": "Atmosphere - Typical casual sushi restaurant. \n\nService - No complaints and as the only table there, I would hope there wouldn't be. Everything as expected.\n\nFood - Great! I honestly forgot what we got but we ordered like 5 dishes (2 of them appetizers/soup) and it was all good. Take out Morimoto and Double Knot, which caters to a different demographic, I'd say this is my new go to Sushi place in Philly. \n\nDrinks - BYOB! Aka awesome\n\nOverall - I have to admit that with so many sushi places in Center City not named Morimoto's or Double Knot, I figured this place would just blend into the other places. To my pleasant surprise, that wasn't the case.\n\nJ Sushi was such a pleasant surprise. My wife and I made it over on a Sunday evening. We were the only table there which was a shame because the service and food were so good. We hope to be back soon. \n\nPoints for: Service, overall food\nNo negatives."
    },
    {
        "id": 67,
        "text": "Amazing prices and service to go along with some very delicious sushi! The prices definitely made me sleptical of the quality but everything I had in my $15 3 roll dinner combo was so yummy!! I have been back twice since I first went just two weeks ago!"
    },
    {
        "id": 68,
        "text": "I liked it a lot. Good specialty rolls. Everything was quickly delivered, packaged well and put together with care. Good spot for sushi."
    },
    {
        "id": 69,
        "text": "This amazing sushi, probably one of the best places in Philly. You will not be disappointed, everything you order will be fresh and delicious and the service outstanding."
    },
    {
        "id": 70,
        "text": "I love J Sushi. They are reliable, always delicious, and well priced. My husband and I regularly get the dinner combo and it is always ready when we arrive. It's an incredible deal and there's no compromise on taste- it's delicious. I only wish they were also open on Tuesdays!"
    },
    {
        "id": 71,
        "text": "The \"Sushi Party\" is highly recommendable! Two of us split it, but it's enough sushi for three! At $60, that's a really good deal! You get 21 pieces of sushi and two specialty rolls. The fish was very fresh and delicious, and the presentation was beautiful! It comes with a soup, a salad (yes, only one of each ) and edamame. There were other deals as well, but I'm almost certain we will be getting the Sushi Party every time!\n\nOh! I almost forgot! If you pay with cash you get 10% off! So our favorite huge dish was suddenly $54 instead. Just when we thought it couldn't get any better"
    },
    {
        "id": 72,
        "text": "This place is a true gem!\n\nIt is so unassuming. We made reservations but were the only party there (which seemed like a bad sign). Don't worry, it turned out okay. \n\nI was very impressed by the sushi. As you can see from the photos attached to this review, everything looked so beautiful and artful. \n\nThe food itself was very good. Left feeling very satiated. \n\nThe dishes came out quickly though that's possibly because we were the only ones there. \n\nBYOB!"
    },
    {
        "id": 73,
        "text": "Found this place on a whim, excellent service and comprehensive menu and the prices are pretty reasonable. The avacodo dumpling was awesome and all the sushi I ordered had fantastic subtle garnish that I thought complemented each if the types if fish very well. My wife ordered to specialty rolls, both of which had awesome flavors and very nice presentation. Would recommend to anyone near center city."
    },
    {
        "id": 74,
        "text": "My husband did an excellent job finding this place as our dinner spot after seeing a show at Walnut Street Theater.  We both were hankering sushi and he had this in his bookmark collection.  \n\nI have no complaints about J Sushi.  It can get a little pricey but nothing we did not expect when deciding to eat here.  If I remember correctly there might have been a discount if you paid with cash (???) but I already knew I was paying with credit so I did not pay attention well enough.  \n\nAs always we decided to share everything so that meant we ordered more than we needed to, but it was delicious all the same.  We started with the Kani Salad (Spicy crabmeat, cucumber, crunchy, masago) and it was a perfect amount for two to share since other entrees were coming.  Very fresh ingredients and a great starter.  For our main courses we got the Sashimi Deluxe (18 pcs assorted raw fish and served with miso soup or green salad) and the Pick 3 Special Rolls.  The rolls we ordered were:\n\n-American Dream: Eel, avocado, cream cheese topped with crunchy spicy tuna, in house special sauce\n-Naruto Roll: Salmon, tuna, white fish, crab stick, avocado, masago wrapped in cucumber with house special sauce\n-No. 1 Roll: Eel, crabmeat, cucumber topped with salmon, tuna, avocado in house special sauce\n\nI would highly recommend any of these rolls, especially the Naruto Roll.  It is very different than any roll I have ever had since it was wrapped in cucumber.  It had its own special flare.\n\nThe server was very pleasant and the ambiance is on point.  Our bill was kind of pricy but we really didn't need three rolls to share especially because the Sashimi Deluxe also came with miso soup or salad."
    },
    {
        "id": 75,
        "text": "My boyfriend and I became obsessed with this place after just our first visit back in March of 2018. We actually stumbled upon this place by accident while looking for parking for another restaurant we were going to. My boyfriend noticed the sign for a special they were running so he said let's just check it out. We both are sushi lovers and thought the menu and pricing were appeasing and decided to stay. \n\nThis place is by far the best and gets five stars  because of the THREE key things: \n\n-the size of the individual pieces are HUGE (more bang for your buck which is key because sushi takes a lot to fill you up), \n\n-prices are good especially for it's location. (If you're not from Philadelphia Center City is a tourist location which means most businesses jack up pricing) \n\n-the taste is so fresh and well prepared. Don't even get me started on the presentation, along with the service, is why we came back this past Wednesday after MONTHS of talking about this place.\n\n\nTrust the place must be amazing if a person takes the time to write a LENGTHY good review. People usually only do this when they complain. Lol hope this helps."
    }
]