[
    {
        "id": 1,
        "text": "Pros: Deals/specials aren't too bad. Ideal for when you're hungry on a budget. Quantity over quality.\n\nCons: The pizza tastes pretty mediocre (even a little bland/strange); tomato sauce tastes okay, but the cheese is a bit too thick for my liking.\n\n\nOrdered (delivery):\n-(2) large 16\" pizzas + (1) 2-liter soda for $20"
    },
    {
        "id": 2,
        "text": "poor quality if wings I can get better from save a lot thingy.  worst ever..its just frozen food put int over for 5 min"
    },
    {
        "id": 3,
        "text": "Everything I've tried at Lincoln's has been amazing. Their chicken is seriously some of the best I've ever had and even when I decide to branch away from that and try new things they never disappoint. \n\nThe only bad thing I could possibly say is delivery can be long sometimes, but it is well worth it."
    },
    {
        "id": 4,
        "text": "I'd been fishing all day and when it was finally 12:32am, I just needed food.  My body needed it all; proteins, fats, and carbohydrates.  For the carbs, I wanted beer.  My friends were at a bar nearby that doesn't really serve food, so I needed to find an option for the fats and protein.\n\nFried chicken.\n\nGrabbed a 3 piece box consisting of a wing, thigh, and breast from Lincoln just a few blocks away.  I'm here to tell you that I'm sorry that I did.  I live near a CFC (Crown) and they serve a good bird.  I thought all of these loosely similar but independently-owned chicken joints had a similar recipe, or even quality control.  Boy was I wrong.  When I got to the bar and slugged two city specials, I was ready to eat.  I wish I had stopped by a Wawa on the way back from fishing.  The seasoning, or lack-there-of, was paltry.  The breast piece had to have been sitting under a lamp for at least 8 hours.  My jaws still kind of hurt from chewing and gnawing.  Of course I ate it all, I was hungry.  But the fact that I was so hungry and kinda drunk and am still complaining just tells you how bad the chicken was.\n\nThis pretty much dispels my previous thought that the eerily similar red-and-white-with-sometimes-KFC-infringement-named fried chicken slingers had a cohesive recipe and quality.  They don't."
    },
    {
        "id": 5,
        "text": "I live about 3 minutes driving distance from this place and it still took well over an hour for me to receive my order. This, after an employee told me on two separate occasions, 20 minutes apart, that my driver would arrive soon. When the order arrived, the pizza and fries were barely warm and my milkshake had already begun to melt. Never ordering from this place again. Do yourself the same favor."
    },
    {
        "id": 6,
        "text": "I walked by this place many times finally I ordered a fried chicken platter & a cheeseburger. The chicken was good as were the sides it came with I would order from there again"
    },
    {
        "id": 7,
        "text": "I just ordered delivery from this place @ 1:22 pm, one cheese steak & fries & a fish platter. I didn't receive it until over a hour later, I actually had to call back to see if they were still coming.  The food finally arrived cold and unseasoned, the corn was spoiled, very fowl smelling.  I called back to tell them to tell them the problem, to no resolution, not even an apology.  This is not the place to order flounder from."
    },
    {
        "id": 8,
        "text": "Food is extremely nasty!!! The pizza and wing is really bad. After eating their food made me feel sick. Couldn't even eat all the food I ordered due to the nasty taste. I will never ordered for this place again!!!!! Just a waste of money"
    },
    {
        "id": 9,
        "text": "Good fried chicken, but the service blows!  The neighborhood isn't exactly the safest."
    },
    {
        "id": 10,
        "text": "Nastiest food ever! My Stromboli was burnt and on top of that I got food poisoning! Never again!"
    },
    {
        "id": 11,
        "text": "As far as casual comfort food goes, this place has my business as a recent Brewerytown transplant. Called ahead for pickup and was told it was ready now. Literally. $9.95 got me a 5-pc bucket of perfectly fried chicken, not too greasy, plus bread and two sides (Mac n cheese and French fries). Also bought a few white macadamia and sugar cookies for $0.50 ea that hit the spot."
    },
    {
        "id": 12,
        "text": "Two words: cherry milkshake. \n\nEveryone who works there is extremely personable, the service is fast, and I've never had a bad meal or a cold delivery. \n\nAnd their desserts are so good, I sort of want to marry the owner."
    },
    {
        "id": 13,
        "text": "So-So food at remarkable prices. Not gonna lie, the inside is grimey and kinda like a run-down chinese take out shop. Flies buzzin around and all that. But i look past that to the deals and the deliciousness."
    },
    {
        "id": 14,
        "text": "Good food for the price. I am a college student if you use the coupons you get a lot of food for a really good price. Isn't the best food in the city but they have a tone of variety. Delivery usually takes around an hour.  I would recommend Lincoln for a good late night spot."
    },
    {
        "id": 15,
        "text": "Haven't had bad chicken since I've started ordering here. The wings are bit small at times, but always cooked well and you can't beat the price. If you're looking for fast and tasty chicken, good place to go"
    },
    {
        "id": 16,
        "text": "The nastiest food i have ever ordered. The fish was sooooo dry. The stromboli was burnt and lacked so much meat. It was truly terrible. I tried to call about the phone and the guy that answered got really rude and disrespectful. His name Saeed. The worse customer service. 5 thumbs down"
    },
    {
        "id": 17,
        "text": "Zero Stars for me. -10 stars for that matter. Not sure why I couldn't by pass the star rating but no matter. Horrible customer service! Extremely rude staff who lack the common decency, humility and manners to even recognize when they're completely out of line. I was considering them for our future meetings where we regularly order large, catered meals but hell will completely freeze over thrice before that happens. Trust that. Ordered for the first time ever via GrubHub.com and was told with much attitude that they were doing us a favor by delivering to our location. Really ma'am? We paid for our order, tax, delivery and a tip. Clearly I missed that favor part. No worries, she'll never have to worry about this paying customer or having to extend that so called favor again. SMH"
    },
    {
        "id": 18,
        "text": "My name is Tony Bennett and I am writing this review for Love Park Chicken & Pizza located at 1402 Ridge Ave, Philadelphia, PA 19130. the Food is Excellent and they hands down have the Best Pizza and Strombolis in All Of Philadelphia. The two owner Mr.Osmen & His Brother Who Runs It At Night Are Very Professional & Respectful. They have a great walk-up crowd as well as business with Uber and many more. They open very early at 10am and stay open all the way up to 3:30 am to get you Food Fix In ! I refuse to order or eat anyone elses pizza and I advise you to follow suit and take my word ! You will thank me later ! I live right down the street and blessed to have them close to me. I view both owners as my friends ! People staying at The Divine Lorraine, Hotels, Etc.. They Deliver and Very Late Night as well !"
    },
    {
        "id": 19,
        "text": "Prices are alright, quality is meh. My mega fries were swimming in cheese and undercooked bacon, but the popcorn chicken was fine. The store itself doesn't look that appetizing. Not sure Id order appetizers from here, maybe stick to the chicken- it's in the name so it might be the way to go."
    },
    {
        "id": 20,
        "text": "Do yourself a favor and get one of their fried chicken platters. This is by far the best fried chicken place in this city! they're the perfect combo of juicy meat and fried crisp. I can't recommend this place enough, I'm already trying to figure out the next day I can go back. (also, I NEVER leave Yelp reviews, but this place truth earned it.)"
    }
]