[
    {
        "id": 1,
        "text": "Not trying to be funny at all this is not for \"us\".  \"We\" don't eat runny eggs and fancy bread for toast mimosa was about two ounces for $9, nah fam I'm good.  Just tried to seem to fancy I don't know what's going on out here I'm from nyc stop trying to be to fancy this is philly supposed to be some what hood eggs and potatoes was $15 and they wanted another $15 for pancakes... shit.............................................."
    },
    {
        "id": 2,
        "text": "Excellent excellent excellent service.  The presentation of the food was great.  We ordered the fried chicken and the lasagna.  The fried chicken was tasty but was a little bit over cooked to be honest.  The lasagna was delicious albeit the portion size could have been a tad bigger for the price.  Overall a good experience but nothing really to write home about.  Would definitely come back!"
    },
    {
        "id": 3,
        "text": "I think Olly is a great addition to the neighborhood. It was decorated beautifully, the food was great, our waitress was very friendly and it wasn't busy. I had read that Olly had just started doing brunch and wanted to give it a shot. I was mostly looking for new place to add to my breakfast/brunch rotation since most of the go-to places in town are always packed on Saturdays (cough Green Eggs cough). \n\nI walked in and was immediately surprised how great the decor was. It looked clean, classy and fairly upscale. We were immediately seated to no wait (it was early for brunch) at the corner window right at the front of the restaurant. I ordered a very simple order, which was eggs scrapple a biscuit and some coffee. The coffee was outstanding and the eggs and scrapple were cooking perfectly. Which is not terribly difficult but nothing bothers me more than when a restaurant messes up scrapple. I will say that I lived in the south for a number of years and have been searching all over philly for a decent biscuit. This place has great biscuits. Probably the best biscuit I've had since leaving South Carolina. So for breakfast foods, this place checks all the boxes for me.\n\nFor my significant other, she ordered the charred broccoli caesar, which she absolutely loved. I'm not one to order salad as a main when going out to eat, however I tried part of her dish and it really was amazing. The char on the vegetables, with varying textures perfectly balanced by the very unique \"caesar\" dressing that was on it. It was a great dish. \n\nAll in all, this place was great for us. I loved that it wasn't super packed and the menu isn't complicated. Our experience was good solid breakfast foods, great coffee, well proportioned salads, clean beautiful decor, friendly service. I'll be coming back often."
    },
    {
        "id": 4,
        "text": "First time here, had the sausage gravy on a biscuit with a side of potatoes.  Gravy was good, although like just about everyone but bob Evans, they are chintzy on the gravey.  Biscuit was excellent though.  Will be back"
    },
    {
        "id": 5,
        "text": "We went for a special tasting menu event. All 6 courses were amazing. Dishes had: Hush puppies, Charred Pole Beans, Broccoli Caesar Salad, Blue Bay Mussels, Lamb Meatballs, Carrot Cake.\n\nI want to bring special attention to the Charred Pole Beans and the Caeser Salad. I personally don't care for Caesar salads or pole beans, but these dishes were my favorite of the night.\n\nService was top notch despite some hoops we asked them to jump through.\n\nGreat ambiance, but keep in mind that the space can probably get a little loud. We didn't get a chance to look at their bar though, so that might be different."
    },
    {
        "id": 6,
        "text": "Brunch review. Have been here twice already. Delicious food in a lovely bright space, nice service, not loud. Great eggs benedict, peanut butter blintz (which is not overly sweet or peanut buttery) omelette, pancakes and warm farro salad. Plan to return for dinner."
    },
    {
        "id": 7,
        "text": "Last night's devours took me to A nine day old restaurant that just opened in the south Philadelphia area. Olly is a Smoove modern day hipster restaurant that plays all of the best 90s R&B jams while you dine. It's very soft and welcoming in this establishment. My bartender Matt was such a great host and really cared about The interest of my appetite. When he asked if I wanted any particular drinks off the menu, I quickly picked a Boulevard which wasn't too happy but When he asked if I wanted any particular drinks off the menu, I quickly picked a Boulevard which was very crisp to my liking and quite strong . After Matt fully explained the menu which was full of very unique items at a very reasonable price. I ordered the muscles in a really creamy garlic cheesy sauce that was phenomenal  wow ordering a broccoli Caesar salad that was also amazing and totally beyond my expectations. This is definitely a spot I will have to revisit it have a fall out dinner. If you ever find yourself around fifth and Bainbridge st, go check them out and show the new hipsters some love  #salad #mussels #dinner #snack #grub #hungry #food #foodie #foodphotography #foodporn #philadelphia #beer #happyhour #southphilly  @ollyphilly"
    },
    {
        "id": 8,
        "text": "Great meal and great service. Definitely recommend for happy hour. Highly recommend the wings and the gnudi."
    },
    {
        "id": 9,
        "text": "The services and ambiance was really nice. Meals were really reason. I ordered broccoli salad which was good. Cauliflower and buffalo sauce which was really good, however we order the buffalo wings which came with five wings which was unseasoned and unpleasant. \nI live right across the street and will not be returning to this restaurant although their customer service and atmosphere was nice the food was mediocre and not the favorite."
    },
    {
        "id": 10,
        "text": "Great opening for this new Queen Village casual restaurant with good food and service. Nice drink selection and reasonably priced. We ordered : Brussel sprout Caesar salad, fava bean toast, burger and halibut. All excellent and shared the rhubarb almond crumble (amazing). New neighborhood gem!  Very cool bar as well."
    },
    {
        "id": 11,
        "text": "Wonderful new addition to the neighborhood. The beets were out of this world; served with smoked salmon and dill, these were like nothing I've ever had before. Also loved the homemade cheeseball. Very fair prices for full bottles of wine--several selections were less than $40. Will definitely return to try more of the menu!"
    },
    {
        "id": 12,
        "text": "Fantastic food, great ambiance, great drink list. Looking forward to coming back SOON.\n\nLoved the wings, ricotta gnudi, mussels, and artichoke. Tough to pick which was the best - which is a compliment to all four."
    },
    {
        "id": 13,
        "text": "I really enjoyed this as a dinner spot. The place is very cozy and low key. I would suggest making reservations ahead of time. I liked that they offer a range of different sized dishes. They have appetisers, a medium range and large entree/dish selection. We ordered the cheese ball, salad, Brussels sprouts, and mussels. I really enjoyed the Brussels sprouts. I'm not even a huge fan of Brussels to begin with, but those were delicious. You can't go wrong with any of the cocktails. Service was excellent as well"
    },
    {
        "id": 14,
        "text": "The only criticism is how staff clearly isn't accustomed to diversity. I walked in with my girlfriend, as she was sitting down I went to the bathroom and the bartender  immediately said \" we don't have a public bathroom\" and blocked the bathroom entrance. As a black woman, looking around everyone-- I had to tell him I'm eating here, and pointed to where my girlfriend was getting settled at the bar. He moved and changed his demeanor when he saw how offended I was that he did that. I'm sure that no one else had to explain they are a customer to go to the bathroom and it's unfortunate. I have never written a review but this needed one."
    },
    {
        "id": 15,
        "text": "I went here with a friend for brunch today and I'm glad that I did.  I thought the prices were pretty reasonable and the decor was simple but inviting.  The coffee was pretty good, too.\n\nMy friend had the omelet, which he basically inhaled, and I had the farro salad with a side of potatoes.  First of all, I was really happy to see a dish like this on a menu - not too unhealthy but not too boring, something other than quinoa (not hating, just welcoming a different grain) and without the poached egg it may have become vegan.  The potatoes were good cooked well and well-seasoned, but a little bitter/burnt for my taste.  I also thought the peppers' seeds added a strange texture and picked out the peppers as a result.\n\nSo, I liked the food but would change a couple of things.  Overall I'm a fan for sure."
    },
    {
        "id": 16,
        "text": "My husband and I came here for our anniversary this year and it was such a fantastic experience. The place was packed by the time we got there for our reservation, but everything ran smoothly. The staff was great, drinks fantastic and the portions of food were far more than expected! We had such a lovely evening and would certainly come back."
    },
    {
        "id": 17,
        "text": "I've stopped in a couple times now, for brunch and dinner and have had great experiences. For brunch I had the biscuits and gravy along with a Bloody Mary. The place itself is really nice, one of the nicer in the neighborhood. Super clean inside with a great current decor. The brunch was really good and the staff is really friendly and welcoming. For dinner, I had the pork belly sandwich, which was nothing less than outstanding. I'm already craving it again. It's served in a really nice roll with slices of baked pear, which is a really great idea by the chef. I'd definitely recommend giving Olly a shot, if you haven't already."
    },
    {
        "id": 18,
        "text": "Another great place to eat high quality and exceptionally executed food that doesn't break the bank in Philly. It's a great place to go with friends and perfect for dates."
    },
    {
        "id": 19,
        "text": "Ate here last night with my dad and his friend who are both terrible people and a massive handful. My dad was super loud, rude and obnoxious the entire time and his friend treated the staff like crap - asking a ton of irrelevant questions/ordering off menu and constantly interrupting our waiter - but amazingly everyone there was really patient and treated us very kind despite the poor behavior of my table. \n\nThe food was also deliciooooous! Will definitely be back ( although alone next time). \nThanks Olly"
    },
    {
        "id": 20,
        "text": "Went here on a Friday night, easy to find seating.  They are a lovely section of seating near the bar area that has hightop tables and a sectional.  Food was really well done.  Had the ricotta gnudi (amazing), and two other small plates.  Overall, food was delicious but the price point is too high and the portions are too small for me to make it a regular spot.  Spent $100 for snacks and two rounds of drinks."
    },
    {
        "id": 21,
        "text": "I don't know what's gone on to make Olly so much better than my first visit, but SOMETHING had changed and it's a GOOD change.\n\nI just recently moved to live two blocks from here and I thought I would give Olly another try. During the pandemic they have a few outdoor tables, so a few days ago I came by for lunch. My server - much like last time nearly a year ago - was incredibly nice and attentive.\n\nI ordered iced tea, started with the fried green tomatoes and then had the mac and cheese with a grilled chicken breast on top.\n\nSo I have to be honest and say I wouldn't have the FGT again. There was just something not right about them. As someone who grew up in Louisiana, these are just not traditionally prepared and I know they're going for a kind of modern hipster take on most of their food, but they just weren't \"right\" for my tastes.\n\nThe mac and cheese however was really great. It *IS* a very, very small portion for the price ($15), so just know that going in. The added chicken breast made it feel more like a real meal.\n\nI came in again today and ordered the same entree, but this time I decided to be a weirdo and have the peach cobbler as an appetizer. Again, I really didn't like it, but I'm not saying it's bad. It's just their attempt at a modern take on the dish which for me wans't enjoyable (the fruit really had no flavor); the ice cream on top was actually the best part.\n\nThe weird thing is the mac and cheese tasted TOTALLY DIFFERENT this time, like literally it was like a different dish entirely, but it was still really really great. And again they made the chicken just how I like it.\n\nOne thing to note: they are putting an automatic gratiuity of 20% on every check. Now normally I am not a fan of automatic gratuities (they are in fact not enforcible and if you feel genuinely like something went really really WRONG because of your server you have ever right, legally, to demand they take it off of your check.)\n\nBut during pandemic times 20% is the bare MINIMUM you should be tipping a server. TBH I think 40% is more acceptable. If you can afford to eat out you can afford to reward people who are risking their fucking lives to pamper you.\n\nSo on both occasions I tipped cash on top of the automatic 20%.\n\nAs just a last thing that is a point of interest... lanternflies. They are everywhere, but for some reason they plague this corner. No less than ten - that's not an exaggeration - landed *on my body* during my meal today. And one on my actual plate. That's not the restaurant's fault, but you should be prepared to deal with it.\n\nAll in all Olly's had just so dramatically completely improved their food from when I first visited. Even when the dish isn't something I personally love, it's still clearly high quality food prepared the way they've designed, and you can't fault them for that."
    },
    {
        "id": 22,
        "text": "I would like to say that it seems that finally this corner is getting its act together! I have been at Olly twice already and I love their happy hour! Their drinks are reasonable and great quality, and the food was very tasty: I had the chicken wings, the mushroom with some veggies, the gnudi and also the cheese ball earlier in the Fall. The service was also excellent and they promptly brought spoons to serve food - why don't restaurants in Philly bring serving spoons is a mystery to me! Anyhow, will be back tonight with a bunch of girlfriends from this neighborhood!"
    },
    {
        "id": 23,
        "text": "We were disappointed with our last meal atOlly. We're in the neighborhood and go to Olly fairly regularly. They were my first choice for a reunion dinner with an old friend who was visiting from Paris for the first time in years. Everything we ordered was salty to the point  that it overwhelmed the other flavors in the dish. I won't be going back."
    },
    {
        "id": 24,
        "text": "I really wish I could give this place a better review. I'm constantly NEAR here but only just finally got a chance to go in tonight for dinner.\n\nFirst things first, my server - there was a pair, both young women, one named Emma - were very nice. Attentive, sweet, friendly, couldn't have been more grateful.\n\nMy meal was less successful.\n\nI started with their pretzel, which is $9 and comes with a cheese dip. It was burned on the top. Like literally the top crust of it was burned black. Beyond that it was really not very special in terms of a pretzel, something I would expect to pay $4-5.\n\nThe real disappointment though was the lasagna, at $23. It's a hefty portion, with bolognese, sauteed spinach and a piece of foccacia. The first weird thing is the spinach is not incorporated INTO the lasagna. It's just tossed on top. But beyond that, the preparation of the dish left it incredibly uneven.\n\nThe top noodle was burned HARD. Like, it was an inedible noodle, charred black around the edges. Yet somehow there were portions toward the bottom edges that were actually cold?\n\nI can't say that flavor wise it wasn't tasty, and again, it was gigantic, but because of the way it was cooked it felt like it was numerous temperatures in different sections. For $23 I would have liked something prepared with more care.\n\nI probably wouldn't come back here just because of how disappointing the food was, which is a shame because it's a really cute place and again, my servers were super duper lovely and kind."
    },
    {
        "id": 25,
        "text": "Tight menu. Happy hour had around $1-3 knocked off of most entrees and small bites. The portions were kind of tiny, but they were extremely flavorful. Had the brussels sprouts, blue bay mussels, and pizza. Each of these are solid, and honestly we left pretty full and satisfied. Every night has a special that you can order for an entire table."
    },
    {
        "id": 26,
        "text": "Great spot, been here once before just for drinks.\nToday was my first try at the food and it was amazing.\nNot your typical American breakfast, brunch spot and that why I like it.\nHad the shrimp and grits medium size plate/ entree and it was delicious.\nIt was polenta fried cake served over a good amount of shrimp, corn, shishitos peppers with a tomato shrimp black broth.\nMust try, satisfied my midday craving"
    },
    {
        "id": 27,
        "text": "Wow! What a wonderful addition to QV. We dine out often and have been to the other two restaurants by the same owners ( Southwark a more \"serious\" place for creative dinners, and Ambra their prix fixe Italian ). The owners are experienced restaurant pros that really know how to combine ingredients for marvelous taste. Olly another winner.  Enjoy a variety of small plates. We had beet salad thin sliced with sushi grade tuna in delectable dressing, mushroom carpaccio, fantastic mussels in delicate tasty broth, Sunday night fish and chips.  Excellent cocktails and wines on tap.  Had a great Muscadet and partner loved his IPA. Kids menu also.  The new decor is just beautiful bright and inviting. Service impeccable, warm and friendly. New spotless dinnerware and flatware replaced at each course. This is a must try...casual and comfortable yet professional and top rate! We will be back! Yum!"
    },
    {
        "id": 28,
        "text": "As far as I am concerned, this place is full bore awsome. Great vibe. Great service. Best frittata and muffin on the planet. Even the coffee and tea were perfect. Loved it."
    },
    {
        "id": 29,
        "text": "Had a great Wednesday night dinner at Olly. Loved my tequila rhubarb cocktail. The cheese ball is a great snack to start. We ordered the Wednesday night special - lasagna, a big stack of homemade noodles, beef, and plenty of cheese. Speaking of cheese, the broccoli salad is 40% cheese which means very very delicious. Ricotta gnudi was probably the favorite of the night. I finished every drop of the concentrated sauce. We were given good guidance on wine selection and were \nsurprised to enjoy merlot when we usually don't. \n\n\nCute corner neighborhood spot with outdoor seating and will soon be launching an attached pizza place."
    },
    {
        "id": 30,
        "text": "Went for brunch having saw the menu a couple weeks ago and was excited about an orange blossom donut. We got the frittata and the lemon pancakes. The food was excellent but the portions left something to be desired (as in i gave a few thoughts to going to Jim's after for a steak!) took the donut home and when we tried it, it was rubbery and not worth the calories, didn't seem fresh at all. If the portion sizes were a little bigger I'd go back, but for now I'll just go to morning glory for brunch."
    },
    {
        "id": 31,
        "text": "I'm not much of a review writer, but I definitely had to share my experience here.\nFirst off, the staff is amazing. Everyone is so friendly and welcoming. It really sets a good vibe while dining, along with the cozy design. The color scheme is easy on the eyes and definitely makes you feel like you're just hanging out in the neighborhood. \n\nOnto the food:\nI've only come here for brunch so far, but sheesh. \nBISCUIT AND GRAVY.\nI could eat that every single time, and it would have the same effect. It just makes me warm, happy, and sleepy all at once. \nThe burger. Oh man. \nOne of the juiciest and most flavorful burgers I've ever had. Nothing over the top in regards to what they put in it. It's just that patty. I don't have many words to describe it. You just have to try it for yourself.\n\nI do believe throughout the meal, I was sipping on a mezcal toddy. It was the perfect choice for myself, being a tequila/mezcal lover. Bursting aroma. I believe it was a star anise pod floating around. A nice, little burn in the nose and chest. Kept me warm and cozy for the weather and car ride to NY.\n\nLong story short.\nOlly, Biscuit & Gravy, Burger, Mezcal Toddy\nI'll keep coming back."
    },
    {
        "id": 32,
        "text": "Olly, boy, am I glad you've arrived. The buttermilk biscuits with whipped butter & seasonal jam at brunch are alone worth the visit. And then there are the cocktails. I had some sort of tequila beverage a few weeks ago that I don't currently see on their online menu (I think it had 'Rainbow' in the name?), and it was so, so good. So good. Go to Olly."
    },
    {
        "id": 33,
        "text": "Stopped in for a few drinks. Friendly service, I'll probably be back for some food. I stopped in to kill an hour. Drinks were ok. The melted microphone drink was kind of an ugly drink. Tasted weird, I dunno if the ingredients work well together. I think expanding the drink list would be good. \nKind of a pet peeve but I don't like when the water is at room temperature. Especially on a hot day. So I took a star out for it."
    },
    {
        "id": 34,
        "text": "Very disappointed with dinner. Limited healthy choices, so we opted for the chicken cutlet. We asked how it was prepared, and the server explained it was breaded and baked.  \"Baked\" we asked? \"Yes, baked\" was the answer. Ok - sort of healthy. It came out dripping with oil, burned, and tasteless. I'm fairly certain it was fried. \n\nSpeaking of tasteless, the eggplant \"flatbread\" was horrible. It comes as a whole eggplant, sliced in half and baked? Steamed? Who can tell ... but however it was prepared, it was underdone. The accompanying slices of flatbread were good. So we ate just that. \n\nThe restaurant was not crowded, so the occasional disappearance of our server was inexplicable. When she did appear, she was friendly but rather aloof. \n\nOn a positive note, the wine was good. \n\nI would say skip Olly and try their attached pizza place called GiGi. However, on the 3 occasions we've tried GiGi Pizza, our pizzas arrived before our salads. The pizza is just ok. \n\nBella Vista and Queen Village have so many good restaurants. I suggest trying any of those before considering OLLY (and GiGi's)."
    },
    {
        "id": 35,
        "text": "Wowwww it's been a MINUTE since I've written a review, but I'm feeling compelled after such a great experience at Olly last night!\n\nThe atmosphere is everything I want out of a small neighborhood joint - cozy, inviting, pleasant to look at. Our server was very attentive and friendly, and service was quick.\n\nWe were able to order dinner off the Happy Hour menu, where many of their dishes are discounted a few dollars, so that was a nice treat. \n\nWe ordered the brussels, buffalo cauliflower, mussels, and the ricotta gnudi.\n\nThe star of the show for me was the mussels, which came in the most fragrant and magical broth. I had to ask for a spoon after we finished the mussels and the 3 pieces of baguette that were served with them, because I wanted, no, NEEDED to drink the rest of the broth - and it was much appreciated that our server didn't judge my savageness. \n\nThe gnudi were pillowy ricotta delights that paired perfectly with the sweet potatoes, mushrooms, and brown buttery bread crumbs that came with. I may have also shamelessly dipped them in the mussels broth - pro tip.\n\nThe buffalo cauliflower, though not necessarily what I expected, was delicious as well. The crumbles of bleu cheese amongst the saucy cauliflower were a welcome, tangy addition. My only small (non)gripe would be that I would've loved this with a side of bleu cheese dipping sauce, because I am a chunk and love to dip all things in all the sauces.\n\nFinally, the brussels were great, but my favorite bite of this dish was the thick cut pieces of crisp bacon throughout, that lent a lovely contrast to the balsamic and grapes. \n\nHappy hour white wine on tap was crisp and light, as was the prosecco. \n\nOverall I was extremely delighted by this meal, and although the servings weren't terribly large for the prices, the quality + HH prices mean that I'll be back again & again."
    },
    {
        "id": 36,
        "text": "Olly was not 'A-OK.' It was alright. \n\nI was here to sample a tasting menu. The group (it was mostly twosomes and foursomes) was informed that everything on the menu were things in regular rotation at Olly and also things that the chef felt best showcased the restaurant's style. \n\nChris D'Ambro, the chef, came out between courses to talk about what was just served as well as general chit chat. He seems like a very enthusiastic, down to earth, 'every guy' type man who really enjoys what he does. And so he must with 2 other restaurants-Southwark and Ambra- to his name. \n\nThe tasting event hostess, not associated with the restaurant and whose name I did not get (and if I had, I'd want to have forgotten it) treated the room like she was Sister Strict Nun and we were all unruly charges. When she wanted to talk, she would ring a loud chime and then comment on how 'good' or 'not good' everyone was in quickly ceasing conversation in order to hear her blab. By the end of the evening, I wanted to throw a pitcher of ice water on her and suggest she go back to the imaginary convent to do penance for her lack of social grace. Again-please note-she is not an employee of Olly.\n\nThe venue is a corner location, small, bright (lots of windows) and full of plants and knick knacks. The colors are restfully neutral but the acoustics are horrible. Kalaya, also a new kid on a block not too far from Olly, is the same as far as having a space that holds unmitigated, high level noise. I shared a table with 7 other diners and by the second course, even those of us sitting right next to each other were shouting and straining to hear the person on either side. Maybe that is the new trend in small South Philly restaurants. It does not make for a relaxing dining experience. \n\nThe tasting started with hush puppies filled with corn and shrimp. I found them dry with one corn kernel and nothing else (not a speck of crustacean) in the several I ate. They were served with a side of quartered lemons. The juice from the citrus was all that made them moist. They were served with aioli but not enough of it. Not at all greasy or heavy but not worth the calories, either. My fellow diner took one bite of hers and left the rest. Enough said. \n\nFollowing those bites came charred pole beans in a black pepper vinaigrette with pecorino cheese and basil. I just don't like beans. These needed a lot more char and a lot less pepper. The starch of the beans and the heat of the black pepper was all I could taste. The occasional bite of basil was refreshing but not enough to save the dish.\n\nThe shining course of the evening was charred broccoli ceasar salad. It was supposed to have chicken in it, though there was none found in all the polite, discreet fork hunting I did as I served myself. This had a fish sauce or anchovy funk that danced well with the skillfully charred broccoli. Had I not been in company, I would have just pulled the serving platter over to my own personal space, eaten every morsel of every component, then licked the platter clean. This is something I have been mentally reconstructing so I can enjoy it again at home. \n\nThe next course was Blue Bay mussels in a buttermilk broth. These missed the mark for me, too. The mussels were plump and well cooked but the broth did not taste like much more than salty water. I love buttermilk but this had none of the tang or the creaminess that makes it a special ingredient. The dish was garnished with Olly's house baguette toasts and even soaking the toasts with the broth did not satisfy my search for the lovely acidity buttermilk brings to food. I was glad I'd managed to keep the lemons from the hush puppy course as they at least added the acid I was missing but unfortunately did not save this dish.\n\nAnother gripe I had was with Olly's servers. No one was given fresh plates with new courses. The tables were set with small, round plates that had a lip. Basically tasting plates. Fine for one tasting course but we were expected to try new things with the same soiled plates. A big no. My neighbor, who was a light eater, had so much barely touched food on her plate that she was having a tough time piling a new serving on top of the prior courses. She asked, then I asked for her, that a clean plate be brought out. Never happened. \n\nLamb meatballs with cucumber and tomato baba ganoush was the last savoury course. They were so salty I left them all and concentrated solely on the excellent mix of greens and herbs they were nested in. Another miss.\n\nThe meal ended with carrot cake which made me groan inwardly with disappointment when I saw it on the menu. Happily I was wrong. This proved to be light, creamy and delightful with a raisin puree on the side.  A heavy, hackneyed dessert blissfully reinvented. Yes!\n\nWould I go back? No. I wish Olly and Mr. D'Ambra well but with only 2 good-ish dishes out of the 6 that I had, as well as the awful acoustics, this was not a dinner outing I'd want to repeat."
    },
    {
        "id": 37,
        "text": "I loved Olly with its fresh, rich, and satisfying dishes.  The interior space is cosy with a large bar in an inviting if a bit noisy interior.  The menu will satisfy even the most diverse clientele with everything from burgers to duck to fresh salads with seasonal vegetables.  I had lamb meatballs with fresh mint which were richly satisfying.  Everyone at my table loved their dishes.\nThe ambiance while cosy is loud and you may struggle to have an audible conversation with the person across from you.  The service was also a bit slow and dishes were served in an odd order in my opinion.  Mains showed up at the time seconds should have been served and vice versa.  The waiter had to return to clarify our order because he didn't write anything down which doesn't work for me!  Ugh!  Pet peeve here!  If your memory doesn't work then write it down, please!  They do it at 5 star restaurants so you can do it at Olly's!  But I digress, bottom line Olly was great food in a nice location.  Well worth a trip."
    },
    {
        "id": 38,
        "text": "This could be my new favorite restaurant. The bartenders, Matt and Mile, were passionate about both the food and drinks. And about those drinks....very innovative, refreshing, seasonally appropriate. The food was amazing. We were lucky to go on stay night for the suckling pig special. Truly amazing...and big. My husband and I shared a single serving and took some sides home. We are rooting for Olly to finally break the 5th and Bainbridge curse. Will definitely go back!"
    },
    {
        "id": 39,
        "text": "The food is excellent, wines are fantastic, and service is incredible. They are also family friendly and have menu options for children. We are so happy to have this restaurant in our neighborhood!"
    },
    {
        "id": 40,
        "text": "If half stars were allowed, Olly would be a 4.5 for sure. This cute new place has a lot to offer for a reasonable price point. The service was great and the food was awesome. \n\nWe started out with the crispy chickpeas, which was seasoned nicely and was a great snack to start with. We got 3/4 of the small plates offered and they were all delicious. The mussels came in a rich delectable broth and were probably some of the best I've had. The ricotta gnudi was delicate but flavorful, paired with ramps and asparagus to make it deliciously seasonal. The smoked salmon and beets was one of my favorite renditions of a beet dish. We also got the mushroom carpaccio, which was light but still super delicious. The lasagna was ridiculous and we all agreed it was our favorite thing. I'm not usually one to order lasagna, but I was all about this version. \n\nThe only thing we didn't like was the cauliflower. It wasn't crispy at all and the texture just blended in with all the different sauces on the plate and was really off putting. For an almost 20 dollar dish, this was super disappointing and I kicked myself for not sticking to my hunch of getting the scallops instead. One miss isn't that big of a deal, but I'll just know for next time.\n\nWe ended the meal with a rhubarb crisp with almond ice cream which was a perfect way to close out a great night. I'll definitely be back to Olly!"
    },
    {
        "id": 41,
        "text": "While I enjoyed the food, the service needs improvement. There were five people having lunch, and five staff working. Nonetheless, my wife's entree, my entree, and our salads all arrived at different times 10-15 minutes apart. Prices were high and portions were small. Then despite the poor service, they helped themselves to a 20 percent tip and added it onto our bill."
    },
    {
        "id": 42,
        "text": "Came here last Friday night with my neighbors, no reservation and no space at the bar. But it was a nice night out and they had open outdoor seating! We opted for that. Our waitress was lovely and attentive, brought us water and took our drink orders right away. \nMy one friend is gluten free so she had to ask about a lot of the items on the menu. She was honest and said she was unsure about a few of them so she checked with the kitchen. She came back with a full list of everything she could have. That was wonderful! \nI ended up splitting the whole black bass and fava bean toast with Lou and my gluten free friend ended up with the Olly wings and the beet dish.  \nThe beet dish was by far the best of the bunch. It was super flavorful and  tasted like spring! The wings were also very unique as they were a dry wing with a cinnamon type flavor and a herby green sauce underneath! \nOur fava bean toast was good but slightly disappointing. It's listed as having burrata but there was little to be found under the arugula. Still good, just not what I expected...\nThe bass was also good, a whole fish as advertised with homemade chips and grilled gems. The gems could have used a bit of a vinaigrette or some sort of finish, the chips were awesome with the aoli provided and the fish was cooked perfectly. \nPrices are reasonable, service is fabulous, as expected from my experiences at Southwark and Ambra. I think this is a wonderful addition to the neighborhood, can't wait for the pizza to open!"
    },
    {
        "id": 43,
        "text": "We had a wonderful dinner at Olly's.  The waiter was friendly and made an excellent suggestion with the \"Spend My Thrills\" cocktail. We ordered Bay Blue mussels and lasagna.  Our waiter informed us that the lasagna takes extra time, and it was worth the wait. I enjoyed it at dinner and still enjoying it as leftovers. The place is cozy and inviting and the music that was playing was a great mix. We look forward to returning."
    },
    {
        "id": 44,
        "text": "the service was great but the food portion was so small. the spaghetti and lasagna was salty. my friends and i felt uncomfortable because the waitresses kept looking at us like we was about to run away without paying."
    },
    {
        "id": 45,
        "text": "Quaint atmosphere, always packed! The food was excellent and the portions were the right size. Our server was very friendly and helpful."
    },
    {
        "id": 46,
        "text": "I LOVE THIS PLACE! It's been on my to try list for awhile and it was worth the wait! Everything we had was amazing, from the orange blossom donuts, cheeseball (wowza), omelet (perfection), and warm farro salad with the most perfectly poached egg. Even the coffee is specially brewed for this restaurant! Go go go!"
    },
    {
        "id": 47,
        "text": "I was pleasantly surprised by my dinner at Olly on Tuesday night! I'd heard some good things, and was expecting a nice meal, but dinner absolutely exceeded my expectations. The space is really cozy and inviting; there aren't too many tables so be sure to make a reservation if you want to eat in the dining room!\n\nMy friend and I shared a bottle of sparking water which was fine, but I would love to see some inventive non-alcoholic options on the menu (currently they have iced tea and soda). \n\nThe food was awesome, and our server was fantastic. We started with buffalo cauliflower which was much lighter than what I was expecting. Here, you could actually taste the cauliflower, and the sprinkling of blue cheese was a nice addition. Next, we had the mushroom carpaccio, which was delicious! It was spread over the plate with some mixed greens and had a hearty sprinkling of parmesan. \n\nMy friend chose the gnudi for her main (really nice!) while I went with the special of the day, a cod and clam chowder. This dish was hearty and loaded with delicious veggies and tons of flavor. Such a perfect cold weather meal! \n\nWe couldn't resist dessert and had the chocolate tart and apple crisp. The tart was definitely my favorite; it was super rich and came with the most fantastic whipped cream and a caramel sauce that was phenoms. Loved it! \n\nScrolling through my insta last night, I saw a photo of some really bomb-looking margherita pizza. Turns out, also from the folks behind Olly! They just opened a concept called Gigi Pizza, which you can access through Olly or a separate door on Bainbridge. Planning my visit!"
    },
    {
        "id": 48,
        "text": "I loved the charred broccoli, white bean and chicken salad with a lemon vinagrette, mussels, beets and chicken wings were amazing! It seems everyone is doing similar menus  - buttermilk fried chicken seems to be on every menu but hands down Olly is my new fav. Can't wait to go back. Easy, light, family friendly- kids love their chicken fingers (the real deal), casual, outside seating. A little noisy, I wouldn't recommend for a quiet romantic dinner but a must try."
    },
    {
        "id": 49,
        "text": "Checked out Olly with a couple foodie friends based off recommendations from one of my GFs co-workers. \n\nThe carpaccio was a great starter for the table. I went with the fried chicken and my GF went with the mushroom lasagna. Both were delicious! \n\nI would give 5 stars, but service was not up to par. Our waitress was a little slow and very disinterested in our dining experience. We sat outside, which I know can be challenging for the waiting staff, but I definitely expected a little more since this new restaurant is still trying to prove itself. \n\nTough location to open a restaurant like this right off of busy south street, but I hope they crush it!"
    },
    {
        "id": 50,
        "text": "Olly has a small menu that's perfectly curated to match the cozy ambiance they provide. The bartenders are attentive, knowledgeable, and conversational.\n\nWe started with buffalo cauliflower, which was great but nothing special... the entrees though....\n\nThe daily specials are to d i e for. Monday's fried chicken is juicy, perfectly brined, and enough for 3.5 meals. Tuesday's cod and clam chowder is perfection - the seared cod is golden, flaky, and delicious sitting atop a soup that is somehow both light and decadently rich, with thick chunks of bacon, delicious clam bits, perfectly tender potatoes carrots and celery, and topped with a drizzle of oil. \n\nAlso of note was the burger and fries, cooked to medium rare perfection with a nice pickly aioli, and the fries (though a bit over salted) were crispy and great. \n\nLastly; their fall martini is crisp and refreshing after all the decadence!"
    },
    {
        "id": 51,
        "text": "Went Saturday night for dinner. We opted to sit outside since it was so nice out. Staff was friendly, attentive, and knowledgeable. Tried the artichokes, wings, mushrooms, lamb meatballs, mussels and the duck. I give the food 4 out of 5 stars. The lamb was a 5!! The drinks were quirky and interesting, I give them a 3.5 out of 5 stars. Bonus points for being environmentally friendly and using metal straws!! Will def return to try the brunch menu."
    },
    {
        "id": 52,
        "text": "Checked out this new place tonight and everything was super flavorful. We had the fava bean and burrata toast, gnudi, mussels, and fried chicken. We enjoyed every bite! Will be sure to return."
    }
]