[
    {
        "id": 1,
        "text": "So I'm super confused as to why everyone rags on this place. They're super nice, quick, and cheap.  People have complained about their chicken fingers being dry but I have no clue what they're talking about. They're great and their honey mustard is delicious. I've had salads from there too and they give you lots of veggies which I love. Their fries are delish as well and I love that they give you cole slaw with the chicken finger platter. All and all, I love that this place is literally a few steps away from my apartment and that they have decent food. I also don't understand the greasy spoon comments... you do realize it's a pizza joint right? You aren't going there for the ambiance, more for the cheap food."
    },
    {
        "id": 2,
        "text": "There is something to be said about great chicken fingers, and this place has got 'em. Sure, you can get chicken fingers anywhere, but great ones (perfect crispiness, juiciness, doneness) are a bit trickier to find.  I order through third party foodler.com which takes only 20 mins for delivery, considering I work 2 blocks away from the place. I get the fingers for lunch fortnightly, if not more frequently., and they are consistently delicious. The fries are decent but a bit soggy for my taste, which may be attributed to the styrofoam containers they use for takeout -- but honestly, if you're a predominately takeout establishment, you should know how to package your fries without turning them into wet noodles by dellivery time. I've also had the mozzarella sticks (below par) and fried mushrooms (mediocre.) The baked ziti was just so-so as well, but that's  to be expected from a glorified fast food joint. I guess my opinion isn't the greatest representation of this place as a whole, considering I've never physically been here - but if you're looking for some dank chicken fingers - you've found Mecca in The Spot."
    },
    {
        "id": 3,
        "text": "I liked the chicken philly. The cheese wasn't excessive, and they weren't cheap with the chicken."
    },
    {
        "id": 4,
        "text": "My friend & I have ordered from this place twice. The first time we had a really decent cheese steak that was like a Jim's or better-known steak sandwich places'. \n\nJust ordered a pizza from The Spot last night. It was disappointing & we ended up throwing out most of it. The cheese was saturated with grease & slid right off of the crust. As for the topping, definitely of the \"mystery meat\" variety. I picked mine off to see if the slice could be redeemed with out it. That was a slight improvement, at best.\nI hate to write this because both times the people who we spoke to over the phone seemed really nice. It's disappointing & seems that most places can only make a great pizza or make a great steak sandwich. Was hoping that The Spot was that rare exception."
    },
    {
        "id": 5,
        "text": "Ordered the Chicken Ranchero Panini and the Chicken Cheesesteak Wrap. Both were good, especially for delivery food."
    },
    {
        "id": 6,
        "text": "So I live across the street and have ordered pick up a couple of times due to convenience.  EVERY time there seems to be a bunch of people \"working\" there, all doing nothing and barely acknowledge you when you come in.  Even if they say order will be ready in 30 min, and you come 30 min later to an empty, dingy takeout joint, they 1) totally ignore you, rudely going on with their conversation  2) did not start your order and give you no indication that they plan to start it soon.  I would say guesstimate double the wait time they say.  Also, got a large cheese pizza here last time, and half of the cheese was slid off the pizza, crust so thin and soggy that it had no structural integrity for the pieces that did have cheese- so unappetizing that I didn't eat it.\n\nHowever:  shitty pizza and service aside, this place has REALLY good salads- full of delicious veggies and chicken and comes with 2 garlic knots- $9 chicken avocado salad lasts me 2 meals and the oriental sesame dressing is really good.  Also, mozzarella sticks were pretty good, but those are near impossible to mess up."
    },
    {
        "id": 7,
        "text": "Great food!!! I order from here all the time. They have some of the best burgers around which are also 100% pure angus beef and they make some of the best pizza dough around. Also try they're soup! I'm personally a big fan of their waffle fries."
    },
    {
        "id": 8,
        "text": "Tonight I was dying for chicken wings so I ordered the 10-piece hot set. To meet the order minimum I added waffle fries. Fast friendly delivery. However, I was very disappointed in my food. Both things tasted burnt like they needed to change the fryer oil--GROSS. Clean your fryer, Spot. Didn't get very far into the meal, $16 down. Sucks."
    },
    {
        "id": 9,
        "text": "A large specialty pizza was just $16 after tax, and would easily feed 4 people with a salad or something on the side. We felt like pigging out a bit, so it was just for 2 people accompanied by movie candy;-) We only got through 3/4 of it and were both beyond full.  \nThe pizza is quite nice, the crust is thin but not crunchy.  Ordered for pickup and it was ready within half an hour.  Got the Scallopini pizza and we both really enjoyed it!   I didn't find it greasy at all, which was nice. We will definitely be ordering again."
    },
    {
        "id": 10,
        "text": "This place is under new ownership, and the pizza is absolutely delicious. Seriously, give it a try. It looked a little different than what I was used to (I think they use several different kinds of cheese), but the flavor and texture were just perfect. The lady who runs it really knows what she's doing."
    },
    {
        "id": 11,
        "text": "Love this place. It's our lunch go-to \"spot.\" The paninis and waffle fries are so good!!!"
    },
    {
        "id": 12,
        "text": "The pizza here has a great crust - it's on the thin side, but not so thin and crispy you think you're eating tomato sauce and cheese on top of a hard saltine cracker. The fries are also good here.\n\nThat said, the other stuff that I've tried here pretty much sucks. The buffalo wings are WEAK and the chicken fingers are overcooked and not juicy at all, contrary to the experience described by another reviewer.\n\nAnd the customer service is just bad...  it turns out they have a 10% student discount. I only noticed a sign for it after they rang me up and gave my change, but they wouldn't help me out after the fact, even though I had tipped for take-out more than the amount that they would have had to discount. The student discount is only on a tiny sign a few feet away from the register - not something you'd notice before the few seconds it takes to be rung up, unless you were a compulsive sign reader. \n\nI'll probably come here again because it's super convenient to me and the pizza is OK, but next time, I'm asking for the student discount in advance and NOT tipping. Sorry guys... take out tip is definitely more discretionary and while I give it by default, you can definitely un-earn it by being an unflexible cheap-ass (which in turn inspires me to be a cheap-ass towards you!)"
    },
    {
        "id": 13,
        "text": "Really 4.5 stars - 5 stars for those boneless wings and around 3 to 4 for everything else.\n\n~~~~~~~~~~~~~\n\nThe last time around, The Spot didn't blow me away, but it wasn't half bad. So in an attempt to see what their pizza and wings were like, the GF and I decided to check them out again. I'm glad we did.\n\nLarge Special Pizza [$15.99]\nPepperoni, sausage, ground beef, onions, mushrooms, green peppers\n\nFirst thing's first. For us, it's not about the pizza at The Spot. It was a bit soggy, but the dough was decently seasoned and the veggies seemed fresh. Overall, it was alright, but there are certainly better pizzas out there like Lazos Pizza & Grill.\n\nSpecial Chicken Sandwich [$7.99]\nLettuce, tomato, provolone, bacon, Russian dressing\n\nThe GF was in the mood for a chicken sandwich so was happy with this effort. The chicken was crisply fried, juicy, and decently seasoned. The Spot seemed to have forgotten the provolone, but the Russian dressing helped to amp up the sandwich a bit. And waffle fries? Nothing wrong with those!\n\n\nBoneless Buffalo Wings [$13.29]\n20 pieces; half mild buffalo, half BBQ\n\nThe real star for us though? The boneless wings. Now let me tell you - I'm personally a bone-in man myself. But for the GF's sake, I deal with boneless. And with The Spot's iteration, I have no qualms with that at all. These were incredibly moist, perfectly crispy and both sauces were on point. The buffalo was slightly spicy and the BBQ was not overly sweet and definitely had nice smoke to it. \n\nSo if you're in the mood for wings or have a somewhat finicky partner, definitely check out the wings here. There's easily some of the best boneless wings in Center City."
    },
    {
        "id": 14,
        "text": "If you're looking for a place for a great salad this is not the place. Like most places I've ordered from, only the fried food is good. But isn't it always... \nThe lettuce is rotten. I ordered a cob salad that included brown lettuce, avocados like rubber, and raw bacon. The garlic knots were also stale. Stick to fried food if you order from here."
    },
    {
        "id": 15,
        "text": "First off I want to say that this is one of the best tasting pizza pies in the city and that is why I am giving it a 3 star review. That being said we ordered a small pie to be delivered and it showed up 30 mins later and had clearly been dropped. The cheese and toppings were all pushed to one slice and 2 slices were upside down. We called to inform the them that the pie had been dropped and the woman was very short and said we will send a new one and hung up. No sorry was said but eh, they rectified the mistake by sending a new one. Well 20 minutes later she calls back and was extremely rude saying that we will have to return the previous pie that was sent otherwise we are not getting a new pizza. Well in those 20 minutes we had eaten the \"edible\" slices, and when we informed the woman that we did so told us that we would not send another pie. She even asked \"why would you eat that?\". Well why wouldn't we eat that? We ordered food because we were hungry and did not want to have to wait another 30-60 minutes for a pizza that should have been delivered correctly in the first place. I could not believe that a paying customer can be treated so poorly."
    },
    {
        "id": 16,
        "text": "There's A LOT on the menu, all pretty basic grill food, priced right for a neighborhood joint, but one thing worth mentioning is the Chicken Souvlaki.  A great garlicy tzatziki sauce and freshly grilled chicken with veggies in a very nice pita wrap.  It's a great (and healthy!) lunch or dinner.  Our friends (another couple in the neighborhood) recommended this and we've been hooked ever since.  Steve (the owner) is a nice guy, too.  I wish they offered more Greek food because THAT's what they really do well.  If this place focused on simply varieties of pita sandwiches and a single ethnic theme they would do phenomenal business.  Sometimes too much \"choice\" is not a good thing.  Would give more stars if there were more items of Greek origin."
    },
    {
        "id": 17,
        "text": "Fast delivery, reasonably priced, and amazing breakfast food served all day! YUM!!!"
    },
    {
        "id": 18,
        "text": "Bad food and even worse service.  How many times did they screw up my order or completely forget to make it before I wrote this review?  A lot.  I can deal with the bad food, thats what carry out is all about.  But Id like to actually get the bad food that I ordered."
    },
    {
        "id": 19,
        "text": "I really love this place.. \nDependable, accommodating and very affordable. The man who usually answers the phone will go out of his way to ask about a special substitution, order, etc.. He's always very kind and the delivery is always so quick. I've really only ordered a few things including a salad, breakfast, zucchini fries and sweet potato fries (which are amazing) oh and waffle fries! They have waffle fries! Enough said, right?! \nCustomer service here is always on point and they respect people's time and money.. Much appreciated ! A+"
    },
    {
        "id": 20,
        "text": "Pizza is GROSSSS. Both times I got pizza here it was soggy, extra salty, soggy, undercooked and it just fell apart like a sloppy mess. \nI am not a PPP (picky pizza person). But come on! Sevs pizza is better than the spot."
    },
    {
        "id": 21,
        "text": "This place has a very good chicken cheesesteak wrap, but if you are delivering be cautious of the roof delivery guy. I've had two encounters with the same guy and he is rude. The first time he was impatient, when I work at a hospital and was trying to meet him in the lobby. The second time he shoved the bag in my had since I told him to come inside instead of me going outside for the food . That is not how you treat customers! I called and spoke with the manager and he said \"well he is very busy, that's no excuse I'll talk to him\". If that was no excuse then it shouldn't have been mentioned. I'd recommend only dining in , if you must."
    },
    {
        "id": 22,
        "text": "Will do in a pinch, which is how I got here in the first place.  I got a slice of  spinach mushroom.  Nice thin crust, well heated, good cheese but much too much garlic and salt.  Also, they just dropped the spinach on top and put it in the oven to heat, so the spinach got completely dried out and I had to pull it off before eating the slice."
    },
    {
        "id": 23,
        "text": "Good food for an economically friendly meal in Rittenhouse, which is not the status quo in this area.\nPizza and deli style.  They also do steaks, pasta, salads, grill.. check out the website.\nGood specials and breakfast all day.  \nIn addition, they are super nice.  \nI will definitely be frequenting this place."
    },
    {
        "id": 24,
        "text": "The food is always decent, however, if you are ordering in, expect to wait. Their delivery options will take at the bare minimum an hour and fifteen minutes. Sadly, this often means that by the time the food arrives, it is cold.  The staff generally feed the same excuses \"we only have one delivery man, the weather, traffic...\" \n\nNot sure if the food is worth the delivery hassle!"
    },
    {
        "id": 25,
        "text": "I live a few blogs away and have been coming to The Spot pretty regularly for close to a year. I have been happy with anything I've ordered. The Chicken Sampler appetizer (5 buffalo wings, 3 big tenders, and 3 WHOLE Fried wings) is a delicious and fulfilling meal. My sister always goes with the Mega Fries (Mozz, REAL Bacon Bits, with a side of ranch) which are also great. They always give out the sauces with their menu items and you never have to ask. The cheesesteaks are decent. Stuffed with meat that has been finely chopped. The pizza is the best I've had from a take out joint in/around rittenhouse. The crust does have a garlic tastes (which I like) but if that's not you're thing you have been forewarned. \n\nThe staff is always nice on the phone and the food is always ready on time. I always get looks on the street as people smell what deliciousness I'm bringing home for dinner.\n\nIf you're looking for that guilty pleasure food this is THE SPOT."
    },
    {
        "id": 26,
        "text": "I ordered buffalo chicken fingers, and asked several times during the order for blue cheese to come with it.  I mean, come on, what's buffalo chicken without blue cheese, right?  Well, they arrived without the blue cheese.  This kind of thing happens sometimes, I think the important thing is how the restaurant handles it when they forget to send something.  When I called the woman reluctantly asked if I wanted her to send the blue cheese, with a tone that suggested the unreasonableness of that request.  I asked if she would send it, and at this point it's been over an hour and a half since I called, and no completion of my order.\n\nJudging by the other comments on here, it seems that The Spot routinely messes up orders, has poor customer service, and is not diligent in correcting their mistakes by giving customers what they ask and pay for."
    },
    {
        "id": 27,
        "text": "This place has had really great fries ever since they came out. The burgers are always great too. \n\nPROBABLY THE BEST FRIES IN TOWN THO."
    },
    {
        "id": 28,
        "text": "We placed an order at 6PM today- its now 8:30 and our food has just arrived.  Well let me correct myself - our food did arrive earlier but 2 out of the 3 items we ordered were incorrect.  I had ordered a tuna salad but instead got a regular garden salad, no tuna.  We called and asked to get the money credited back to us, but they said they could not and would get us the correct order right away.  An hour and a half later our food arrives.  Instead of a new tuna salad, I got a big blob of tuna to throw on the salad they sent 2 hours earlier.  Thanks guys!  If you are hungry and you want your food fast, DO NOT ORDER HERE.  This is not the first time we have had the same problem here with food delivery taking so long, now we won't be making that mistake again.  It's not cheap either as far as takeout goes."
    },
    {
        "id": 29,
        "text": "I'll get straight to the point: if you don't love garlic, you won't love their pizza.  I like garlic so I'm good with their pizza.  The only bad thing I can say is that the very top part of the crust is really bland, which is sort of a let down when there's such a strong flavor in the rest of the pizza.  I'll definitely eat it again, but will probably skip on the crust part.\n\nI also tried their wings, which were really tender.  They were also bone-in (which isn't specified on the menu).\n\nI only gave 3 stars bc the special I ordered was advertised as 22.99, but was 24.50 when ordered online.  Consistency in pricing would be good.  However, the food is pretty tasty."
    },
    {
        "id": 30,
        "text": "It was at about 2 hours that I decided to just cancel the order. Ordered a pizza and I live a block away. I called at an hour and he said 5 minutes, it's on it's way. At 2 hours I called to cancel and the guy hung up on me. The odd thing is, he answered the phone \"pickup or delivery?\" but told me that he was \"f-ing busy\" and wasn't taking orders before he hung up on me. \n\nI used to order once or twice a month from here, never again. Food wasn't even anything special- just overpriced."
    },
    {
        "id": 31,
        "text": "Great strombolis, eaten them a bunch of times. Also great customer service over the phone. Very simple and accommodating. Love this place."
    },
    {
        "id": 32,
        "text": "Order delivery burgers. Meat tastes as if I had severe freezer burn and was not thawed out before cooking. Ordered without lettuce tomato and mayo but it came with that anyway. Fries were decent but had to be put in the oven to be re-crisped. The worst part by far was the milkshake which tasted as if they had added water to it instead of milk. It was worse than a glass of watered down skim milk chocolate milk."
    },
    {
        "id": 33,
        "text": "The pizza is just okay, this is Philadelphia and a good pizza is VERY hard to find.  \n\nThe sandwiches and other items are the menu are fantastic.  I am a fan of the Chicken Florentine Sandwich on the seeded roll.  They are right around the corner from me so I cannot speak for delivery."
    },
    {
        "id": 34,
        "text": "Walking home at 8, 9, 10PM after being in the office for 13-15 hours, the last thing I want to do is cook something, so I head right over to The Spot.  \n\nThe Greek Salad is always filling and very satisfying with an array of veggies, and always the right amount of feta to keep me happy.  I LOVE, repeat and emphasize, LOVE the Buffalo Chicken Pizza... it's greasy as all get out, but when you're craving some fatty, greasiness, that is what you want.\n\nGrab one of their frequent-customer cards and get $5 off your 5th visit.  Also, the weeknight specials from 5-8PM are always the right price.  So, when you're in a bind or just don't want to cook, head over to The Spot."
    },
    {
        "id": 35,
        "text": "I think most people would agree that good pizza is hard to find in Philadelphia.  This is among the better I've had here, and I usually stop in every couple of weeks or so.  The staff is very friendly, and the pizza is consistently good.  The only thing I've ever ordered here is pizza, so I can't comment on the rest of the menu."
    },
    {
        "id": 36,
        "text": "Love coming here for breakfast sandwiches. \n\nLong kaisers with pork roll egg and cheese. It's probably more food that anyone needs in the morning but when you wake up late on a Saturday there is nothing better. \n\nI have only been here for breakfast and it has always been fast service. I normally eat  and chit chat about the night before with a friend. I love that this place is so casual it really does not matter what you wear. However you may be judged as you walk by spread to get here."
    },
    {
        "id": 37,
        "text": "I just wanted to update this review.  The morning after I placed this order/wrote the above review, I received a phone call from The Spot.  I was in class, so I didn't get the voicemail they left until late in the day, but they stated that they had heard that they made a mistake with my order and they offered me another meal on the house that day, which I thought was very nice of them. Because it was so late when I got the message, I didn't end up taking them up on the offer, but I was impressed that they took the effort to try to make amends.  Also, it seems they check their Yelp reviews regularly because that would be the only way they would have known I was upset about the mistake in my order.  I think that says good things about their willingness to please customers and stay on top of the feedback they are receiving.  I would definitely be willing to give this place another shot now."
    },
    {
        "id": 38,
        "text": "I stopped going to The Spot in 2009. The food was fine (my husband and I actually became good buddies with the cooks there). It was just the management that made me so angry. But that was 2009. Maybe things have changed, who knows!"
    },
    {
        "id": 39,
        "text": "The Spot is my #1 delivery go to. I order from here a few times a month. They are always fast and the food is always hot. I've tried a lot of items on the menu and have enjoyed everything. The chicken cheesesteaks, strombolis, pasta dishes, paninis, etc. are all awesome. Pizza is decent for Philly."
    },
    {
        "id": 40,
        "text": "I'm a new neighbor. I ordered other place when i was just move in but there is bad at all. So I tried here today.\nIt was good. I ordered a pizza.\nit's very tasty, lovely thin crust and nice combination with vegi and meat.\nbut little salty to me... hence I rated 4stars."
    },
    {
        "id": 41,
        "text": "The food here isn't bad, but it's a problem when you order something and it is consistently incorrect.  I ordered 3 things 2 of them were wrong.  When I brought it back the woman at the counter gave me nothing but grief.  I asked what we needed to do to communicate better and was a met with silence.  Nothing like trying to figure out how to work with someone better only to get stonewalled."
    },
    {
        "id": 42,
        "text": "On a recent night, the GF and I felt like getting some good ol' American grub - burgers, cheese steaks and fries. So we hopped on Seamless and decided to give The Spot a shot. Located in Rittenhouse Square, they offer a typical Greek 'diner-esque' menu, which is to say that most items imaginable for traditional American fare will be on said menu.\n\nCheese Steak ($7.29)\nBeef, sharp provolone, onions\n\nThe cheese steak was piled high with well-seasoned chopped steak that unfortunately was a tad dry. The sharp provolone provided a bit of funk and the fried onions were interspersed throughout. The roll housing the beef was extremely soft and pillowy, without any semblance of texture.\n\nNot one of the worst cheese steaks I've had in Philly, but certainly not the best. Ordering online was a bit annoying because when you order the 'cheese' steak, you actually need to add the cheese manually for an additional 50 cent charge. So what did I do? Ordered the regular steak sandwich, and add the cheese there so you don't lose out on a dollar just because you want some cheese on your cheese steak. So look out for that! \n\nCheeseburger ($4.99)\nAngus beef\n\nThe quality of the Angus beef was quite good and the fact that you can order your burger's temp is appreciated. The GF went with medium, though this came closer to medium-well. No lettuce or tomato was offered for the burger unfortunately. Still, it was nicely char-grilled and covered with an abundance of American cheese. The brioche-type bun was quite nice and housed the meat perfectly.\n \nThe burger and the cheese steak both came with a bag of Ruffles potato chips,\nwhich was appreciated.\n\n10'' Buffalo Chicken Calzone ($9.99) \nChicken, blue cheese, hot sauce, onions, peppers\n\nThe buffalo chicken calzone was a great iteration of the dish. The creamy ricotta blended well with an abundance of mozzarella, blue cheese, and moist chicken. The Spot allowed the addition of onions and peppers without any additional charge.   \n\nThe dough of the calzone was crusty and a blanket of delicious cheese coated it perfectly. Despite the number of ingredients, the calzone held up well to delivery.\n\nMega Fries ($5.79)\nMozzarella cheese, cheese wiz, bacon, side of ranch\n\nIf I see Mega Fries on the menu, I'll usually order it. The fries were crispy and completely covered with mozzarella and crispy chunks of bacon. I appreciated that they followed through on my request for Whiz on the side. The fries also came with ranch dressing, which helped to bring this artery-clogger over the top and render each bite creamy. \n\nThe Spot can provide a satisfying meal that requires a few hours on the treadmill after the requisite coma. It reminds me a bit of Pandoras, though not necessarily on their level. But it wouldn't hurt to give The Spot a try if you're aching for some gut-busting delivery or are in the neighborhood."
    },
    {
        "id": 43,
        "text": "I don't really know what happened but I used to die for the baked ziti with meatball. It had a lot of sauce and cheese on it and it tasted really good. I ordered it recently and it's flavorless with almost no sauce or cheese. My boyfriend ordered the stromboli and it had almost no sauce either. We ordered boneless wings and they came bone-in; I guess the jalapeno poppers were good. Comon Spot, you're better than this!"
    },
    {
        "id": 44,
        "text": "I think this is the second time I ordered from this place. Don't remember what happened the last time. I ordered from Grubhub and this was a mess. I'm waiting to see what I will get refunded for. The sandwich was not what I ordered, but I did expect a change since they had called me and told me they were out of an ingredient. But it still was not what I thought I was getting. I ordered a cake slice but they sent a different one, so I sent that back with the delivery guy. I cannot believe they can stay in business making mistakes like this!!"
    },
    {
        "id": 45,
        "text": "Food was mostly above average and delivery was much quicker than expected. We ordered through GrubHub and the food arrived more than 30 minutes before the estimated time.\n\nDelivery guy arrived on a bicycle and was very friendly. He even warned me about opening my soda because it probably got shaken up on the back of his bike on the pothole strewn streets of Philadelphia.\n\nThe Boneless Wings were disappointing. They were more popcorn chicken sized than what I would call a boneless wing. We also requested Hot Wings, but there was barely any sauce on the wings, so they were pretty bland. I'll give them another shot, and request more sauce on the wings next time.\n\nPortion sizes of sandwiches with waffle fries were generous. Sandwiches were pretty good. The Caprese Chicken sandwich had fresh basil, large slices of fresh tomato and a good amount of chicken. I got the grilled chicken, which was a little dry, but overall very satisfying. The Garden Panini was very good. The vegetables were cooked just right, not until they are really mushy and there was a generous amount of vegetables in the sandwich. So much so that there is half in the fridge waiting for lunch tomorrow. The waffle fries were seasoned, kind of like a curly fry, and nice and crispy; very good.\n\nI would definitely try The Spot again."
    },
    {
        "id": 46,
        "text": "The delivery time is over 2 hours and the people who work there are rude and blatantly lie to you."
    },
    {
        "id": 47,
        "text": "This place is a bit of a greasy spoon (do people still say that?).\n\nThe other night sheer laziness led me to order from The Spot for dinner.  Then guilt set in and I tried to health-ify the situation by ordering lentil soup, a greek salad with chicken and zucchini sticks (compromise!).  Bad move.  The soup was super salty, the salad was the most meh version of greek imaginable, and the zucchini sticks seemed to have been deep friend in hundred year old oil.  \n\nGranted, this place is not meant for healthfulness.  If laziness (and potentially drunkenness) steers me here again, I will go for pizza or similar and review again.  A dear friend of mine gets their chicken fingers three times a week, so there may be hope yet.  The owners seem to work in the shop, which makes me want to like it.  We'll see."
    },
    {
        "id": 48,
        "text": "A large specialty pizza was just $16, and would easily feed 4 people with a salad or something on the side. We felt like pigging out a bit, so it was just for 2 people accompanied by movie candy;-) We only got through 3/4 of it and were both beyond full.  \nThe pizza is good, the crust is thin but not crunchy.  Ordered for pickup and it was ready within half an hour.  Got the Scallopini pizza and we both really enjoyed it!   I didn't find it greasy at all, which was nice. We will definitely be ordering again."
    },
    {
        "id": 49,
        "text": "If I could give no stars I would. 1 I received the wrong meat on my sandwich - sausage instead of bacon with zero warning 2. The delivery man was exceptionally creepy and had his eyes closed the entire exchange."
    },
    {
        "id": 50,
        "text": "Very solid chicken cheesesteak. One of the few places I've had one where they actually spice the chicken so it's not bland.\n\nGood chicken finger platter. Fries are good. Have to ding them because the chicken finger platter no longer comes with coleslaw. This is not reflected on their menu online and in print. It took me ordering it 3 times for someone to actually tell me this and then they tried to charge me for it. I know rent is high, but I imagine coleslaw isn't a particularly expensive item to make. I'm not expecting a huge container of coleslaw, but you can't give me a small container size of coleslaw?"
    },
    {
        "id": 51,
        "text": "I randomly took a chance on this place the other night as I was craving pizza and it's less than a block from my apartment.  I ordered a small extra cheese.  It came out to be about $8, and was definitely big enough for me to have something left for breakfast the following morning (Because that's what 20 somethings do- pizza for breakfast-).  The service was friendly and quick, and the pizza was actually pretty good- not too doughy, and not drowning in sauce.  I'll definitely be back."
    },
    {
        "id": 52,
        "text": "5 stars all the way- I can not say enough good things about this place! The food is always so delicious, fresh, and large portions! It's hard to impress a New Yorker with the pizza, but the margarita pizza is amazing. We've had everything from the omelettes, pastas, and sandwiches and have absolutely never been disappointed. It's our go to dinner spot more nights than we'd like to admit! I admit we've never done delivery which seems to be the only reason this place doesn't have 5 stars-so take a walk and it'll be a win win all the way!"
    },
    {
        "id": 53,
        "text": "I'm astonished that there are actually positive reviews of this place.  I'm pretty sure those reviews are planted by the owners.  My criticism is not as much directed to the quality of food, as it is the amazingly rude service.  The women who own The Spot are rude to their customers, as well as the poor guys who cook in the back.  Ladies, it's uncomfortable for your customers when you talk condescendingly to your workers in an open kitchen.  Perhaps, there are courses at Temple you can enroll in that will teach you the basics of professionalism.  I've given this place several opportunities and it continually disappoints me.  Thankfully, I'm moving from Rittenhouse next week.  I would never recommend going to this place, especially when Towne Pizza is around the corner on 19th and Pine where they are much more appreciative of your business."
    },
    {
        "id": 54,
        "text": "I have been going to the spot for a few years now out of convenience.  For the most part the food ranged from mediocre to just plain bad, but recently it has gotten quite good.  There are apparently new owners now, and the quality of the food is much better.  I ordered a hoagie for dinner tonight and was pleasantly surprised to find my hoagie came on a really good seeded italian roll and the meat, cheese and vegetables were all fresh.  I strongly recommend trying The spot again if you have been in the past or even if you haven't you should give it a shot."
    },
    {
        "id": 55,
        "text": "I love the BBQ chicken pizza and the older women that opened this place.  The red head woman that works in the afternoons has zero customer service skills and should stop talking about how her 20 cats that have puss coming out of their mouths as customers eat.  She must be the rudest woman in this area.  Also, please stop wearing dirty tight shirts.  And then the weekend woman with her annoying voice.  What a rude woman.  She asked us \"what yous want?\"   The woman stood there and messed with the computer for 2 minutes before asking us that and she did it without eye contact.  We waited 25 minutes for tiny buffalo wings.  People that ordered after we did, got there food and was half finished by the time this woman got us our food.  She even asked us what we ordered 15 minutes after we ordered already.  What a waste.  Stop hiring complete idiots and maybe people will come back.  20 wings costs $14."
    },
    {
        "id": 56,
        "text": "I order from here using Grubhub a LOT. Delivery is always super speedy (about 30 mins, tops) and the food is always hot. My go to is the pepperoni calzone. It's enormous and the crust to cheese ratio is spot on. Also if you're not a ricotta fan then you're in luck since there isn't a ton. \n\nIn short - good, reliable delivery food for nights you don't want to cook but don't want to spend a lot of money."
    },
    {
        "id": 57,
        "text": "I've ordered from here using GrubHub twice now and love the fact that they deliver breakfast.  The bacon, egg, and cheese breakfast wrap is huge for the price and delivered piping hot and fresh.  The waffle fries are also really good.  The delivery was quick too, compared to other places I've ordered from on GrubHub.    However, I don't know if I'd order from here for anything other than breakfast.  \n\nI knew I was going to be in hardcore study mode this weekend so when I ordered breakfast, I ordered a small pepperoni stromboli for dinner, thinking I would probably forget to stop for dinner and then all of a sudden be starving.  When I went to heat the stromboli up later that night, it smelled funny.  Not like it was rotten, just odd.  I came to realize it was the pepperoni that had a funny smell.  It smelled like feet.  I ended up tossing the stromboli and finding something else to eat.  I don't think feety pepperoni will make me not order breakfast from here when I'm feeling too busy or lazy to cook."
    },
    {
        "id": 58,
        "text": "The food is great. The delivery guy is always incredibly rude and can barely speak English. I wouldn't get delivery again."
    },
    {
        "id": 59,
        "text": "the spot gets one star not because of one bad experience but MANY BAD EXPERIENCES.  If you want bitchy women taking your order WHILE on the phone yapping the whole time only for them to take your order wrong and then get mad at you when you want the correct order then this is the place for you!  For instance, tonight I ordered a chicken cheesesteak for PICK UP and they said it would be ready in 15 minutes.  about 20 minuets later i walked over and i hear the woman, one of the owners, say \"I'm gonna kill him!  he took a pick up order as a delivery!!\"  i thought it was the lady in front of me but nope, it was my order.  About 10 minutes later the guy comes back with my order.  It didn't really bother me at the time because I've worked in the food industry; mistakes happen.  The next mistake is however horrible enough to lose my business for GOOD! As I'm eating my chicken cheesesteak i feel this stringy thing when i try to pull the sandwich away from my mouth which tuned out to be a long black hair tangled into the chicken!!! then i noticed in the container another black hair which looked like it had a gray root.  When i called to inform the lady about the hair in my sandwich she was very adamant about knowing what color the hair was and when i told her about the grayish one she started to argue with me about how no on there had gray hair.  so i suggested maybe it was blonde which she quickly informed that NO ONE had blonde hair but the delivery guys has blonde hair!!  she told me that they would remake the sandwich and the delivery guy would bring me a new one and she wanted the old one back and then hung up on me!!  she didn't even give me two seconds to say I'd rather have my money back.  WHY would i want another hairy cheese steak??  i ended up getting my money back and the blonde delivery guy picked up my hairy sandwich with not even a sorry.  ITS NOT OK TO BE RUDE TO YOUR CUSTOMERS!!"
    },
    {
        "id": 60,
        "text": "I've ordered from here a few times now, and keep finding something wrong with my meal. Still not sure why I keep ordered, except for the fact they are one of the few places open before noon on a Sunday.\n\nOne time I ordered a turkey club and an order of fries- took over an hour and a half for delivery. The fries were somewhat cold and soggy by the time they arrived, but the Turkey Club was good.\n\nAnother time I ordered through grubhub- I ordered the American Chicken Sandwich and paid $2 extra to have it on seeded french bread instead of a Kaiser roll- of course it came on the Kaiser roll anyway. The sandwich was very good and I was so hungry at that point (another over an hour delivery) that I didn't bother to call and complain.\n\nThe most recent time we ordered was just because they were open at 10am on a Sunday morning and decided to walk there vs risking a 1 hr 15 minutes delivery time-  I got the omelet which came with toast and home fries. The omelet itself was good- nothing amazing, but good. The home fries left quite a bit to be desired. As far as the toast, I have never tasted soggy burnt toast before- and I hope to never again. Didn't realize you could even mess up making toast until then.\n\nOverall, maybe I'll go back if I am desperate for delivery breakfast at 10am on a Sunday - other than that, there are plenty of other places in the area I've gotten much better food at."
    },
    {
        "id": 61,
        "text": "I know better, don't I? \n\nBut we wanted breakfast delivered after the bf was unable to walk on a busted ankle and the only place we could find was The Spot. \n\nI know better, don't I? \n\nWe ordered a couple of bacon, egg and cheese bagels. They were OK, actually they were beyond mediocre. I didn't even bother eating half of mine because it just didn't seem worth the effort or calories. That may be a common statement among some people, but not this woman. We also had a couple of side orders of breakfast potatoes and they were just awful, don't order them - tasteless, gluey, unseasoned potatoes. There was also an omelet in the mix and it was pretty pathetic looking in that Aramark catering sort of way. Expect cafeteria food and then lower your expectations. I rarely write a one star review as I always find a redeeming quality in a restaurant. So what is the redeeming quality of The Spot? They deliver. Unfortunately, I'm not certain that's a good thing."
    },
    {
        "id": 62,
        "text": "For those seeking thin crust NY-style pies, this is not your place.  If you'd like something more akin to what we New Englanders call \"Greek style\" pizza, then you may enjoy The Spot.  And if you're generally OK with a somewhat thicker crust, and will also be pleased with fresh toppings, flavorful sauce, and speedy delivery, and very friendly staff over the phone and in person, then look no further.  Their Italian hoagie is also worth trying.  When fast, tasty junk food is on the agenda, you can definitely do much worse!"
    },
    {
        "id": 63,
        "text": "This is my neighborhood jawn for hangover food and Friday night cheesesteaks.\n\nIt's pretty straight up from-the-grill grub.  I used to have a weakness for their buffalo chicken cheesesteak, but depending on who is making it, the sauce can get a little heavy.\n\nNice staff, quick service, and a solid Philly cheesesteak."
    },
    {
        "id": 64,
        "text": "The only thing I've had from here is the gyro, which I really loved.   I found it to have the perfect ratio of meat, veg, and sauce.  The pita was warmed nicely and was still steaming when I got back to my apt.  I can't say I would enjoy eating there,  too small with fast food style booths, but with online ordering and delivery I don't think I'll have to."
    },
    {
        "id": 65,
        "text": "I got a Gyro from here today--delivery was quick, but probably because I work 2 blocks away.  They really skimped on the meat here.  Seriously skimped on the meat.  \n\nI had to get garlic bread so I could make the delivery minimum and there was a metric crapton of bread.  I'd have appreciated more meat on my gyro and less bread."
    },
    {
        "id": 66,
        "text": "Delicious!!  Ordered the Italian calzone, large.  Really generous portion, great flavor.  The ricotta filling was a tasty touch.  Our new favorite calzone spot!"
    },
    {
        "id": 67,
        "text": "This was one of the worst Pizza Spots that ive every ate at. I ordered a small  cheesesteak Stromboli and it was the size of a Hot Pocket. Not to add it had Mad Garlic in it.The cheese friea where very salty, And the price was high. I will never order from thia Jawn again."
    },
    {
        "id": 68,
        "text": "I placed an order for breakfast this morning- french toast and the two egg platter (menu says the platter includes breakfast potatoes and toast).  I can't comment on how long delivery took because about 45 minutes after placing my order with no word from the restaurant, I decided to go downstairs to run next door to the bodega to grab something to drink and found my delivery order left on the floor of my lobby.  I had my cell phone on me the entire time and had no phone calls from the restaurant or delivery person.  Awesome.  So I took the food upstairs and opened it up only to find that the toast and breakfast potatoes that were supposed to come with the egg platter were simply not included.  Delightful.  The french toast was decent, but it's pretty difficult to eat eggs over easy without toast....I didn't call the restaurant, mostly because I was just really put off by the fact that they just left my food in the lobby without contacting me (I included my cell phone number in the order, as well as a note asking them to call when they arrived because my building's intercom doesn't work).  I don't think I'll be ordering from here again."
    },
    {
        "id": 69,
        "text": "Great pizza! It's as good as I remember it from our last visit to this restaurant, back when the place was called \"Paul's Pizza.\" The new restaurant name is apropos; their pizza really did hit \"the spot.\" :)\n\nWe got a large pizza with eggplant, mushrooms, artichokes, and ricotta cheese. The crust had just the right amount of crunch, and the cheese was warm and oozed as we bit into it, just like a fresh, well-made pizza should. :) The ricotta was rich and delectable, and was a great match to the other toppings on the pizza.\n\nIt was so delicious! I've had pizza elsewhere in Philly, and I have to say, this is one of the better places to go for a slice in the Rittenhouse Square area.\n\nWe ate our pizza in the restaurant. There were a lot of take-out and delivery orders that night as we sat waiting for our pizza. The pizza took over 30 minutes to arrive, but it was worth the wait. The manager apologized about three times for the delay. This may've been atypical; since this is the first time I've been there since the change in management, I have no way of knowing. There's a good chance we'll be back to this restaurant the next time we visit Philly, so I'll be looking forward to doing more \"research.\" :)"
    },
    {
        "id": 70,
        "text": "I recently moved to the neighborhood (1 block away), and pass The Spot regularly.  It doesn't seem to ever have much of a crowd, but a few days ago I went in for a slice of pizza for lunch.  Very disappointing!  The pizza definitely looked and tasted like it was a day old... I almost complained, but the cashier didn't really seem like the type that would care.  (I mean, come on, she delivered it, and this LOOKED like old/bad pizza!)  To make matters worse, there had to be at least 3-4 flies buzzing around just within my seating area.  Really sad for the Rittenhouse area.  Maybe other items - or freshly ordered whole pizzas - would be better food quality, but I'm not likely to try again."
    },
    {
        "id": 71,
        "text": "Great and convenient place for pickup or delivery.\n\nAlways friendly and the food is consistently good - I recommend a cheese steak or spaghetti and meatballs."
    },
    {
        "id": 72,
        "text": "This place is clutch: good food, fast prep, just straighforward food service. The Spot has clearly turned a page with the new ownership. Favorite is the buffalo chicken sandwich, but their salads are humungous and a great deal -- tons of chicken it's ridiculous. Oh, and there's waffle fries there, too. Yum."
    },
    {
        "id": 73,
        "text": "I got delivery to my hotel. The guy answering the phone was not awesome but he was fine. The food arrived quickly and was hot. \n\nI had the tortellini Alfredo. Very good, but more soft than Al dente. The sauce was excellent--not too heavy like Alfredo is sometimes. The bread that came with it was just run of the mill bread. \n\nOverall, nothing too special, but not bad either. Average."
    },
    {
        "id": 74,
        "text": "Total improvement since the management change--even though the physical restaurant looks basically the same, the food and service have drastically improved, and that's what counts, particularly at a neighborhood pizza/cheesesteak joint, right? (I usually have their food delivered anyway, even though they're only about a block away, so decor isn't really an issue for me.) Stick with the basics here and you shouldn't be disappointed. I have tried a few of their specialty chicken sandwiches on french bread and was pleasantly surprised with these, too. Highly recommended, especially if you live in Rittenhouse & are craving an above-average cheesesteak (on an Amoroso roll, as it should be)."
    },
    {
        "id": 75,
        "text": "My friends and I come here a fair amount for a slice and a can of soda at lunch. The pizza is pretty standard and they have pre-made cheese pies in the back and add whatever toppings you want. They are quick and it costs me like $3 which is pretty cheap."
    },
    {
        "id": 76,
        "text": "I like this place for one reason..it just needs some love. It's always emptyExcept for some old dude just lurking in a booth eating his pizza. There's always one of those! And he's always listening to our conversations. I love it. !The Spot is around the corner from my friends house and we like to hang out here sometimes when we wanna pig out and be really lame. \nUmm...chicken fingers are banging. I will always love the Spot. And it's called The Spot! Who doesn't love that?!"
    },
    {
        "id": 77,
        "text": "Used to order from here all the time, but the last 3-4 times their orders have taken 45 minutes longer than grub-hubs projected time (getting close to 2 hours to delivery) Good food, but would rather not deal with having to call and ask where our food is every time we order when there are plenty of other places that are priced similarly, have the same quality food, and deliver in a timely manner."
    },
    {
        "id": 78,
        "text": "I order from here. Their service is friendly, they are quick (even on Friday nights), and their food tastes great.\n\nI love their shrimp jammers and boneless wings."
    },
    {
        "id": 79,
        "text": "Good take-out joint.  I only give it 3 stars because it's nothing special, but they do make good turkey hoagies and chicken cheese steaks.  They don't seem to understand the concept of just ordering stuff to go though... I stopped in the other night to grab a quick dinner, and the lady asked me if I wanted a bag for my fountain soda and straw.  Um, no... I'll just carry it, thanks.  That wasn't a problem, just a funny observation.  They did have free sugar-free Altoid samples, and I love me some free samples.\n\nGood place for quick, cheap food in Rittenhouse, I'm sure I'll eat here again."
    },
    {
        "id": 80,
        "text": "Their gyro platter is both cheap and delicious.....yum yum"
    },
    {
        "id": 81,
        "text": "I eat here because it's close to work. \n\nTheir greek salad and gyro's are great. They also delivered super quick tonight. The delivery guy looks like my ex boyfriend so I always give the kid way too much tip."
    },
    {
        "id": 82,
        "text": "Okay it's not like we have anywhere in our neighboorhood where we can find something cheap and mediocre. So, let's not just throw \"the spot\" to the dogs. Sure for a few bucks more we can go next door and get some pretty tasty chinese, but sometimes you want a little grease.\n\nI've had breakfast and lunch here. The home fries are horrible. They are frozen shredded potatoes thrown on the grill. Pass on them. Get a breakfast sandwich or something else. The pizza is pretty decent.\n\nThey are running a special right now 2.99 for a small pizza pie on thursdays. Pick up only. Hey the economy sucks ...where else are you going to eat a small pie for 2.99?"
    },
    {
        "id": 83,
        "text": "Since moving here, I found that many restaurants around here are quite pricey. Being a grad student and living on my own with a part time job can be difficult when the only places around you cost more than $15..this place is great for cheap and good tasting food. I'm not the usual, go sit down and relax kind of gal. I am always on the go and need good food that also won't cost me so much. This is a great place with such a huge variety. Some people may get overwhelmed but since I usually order through the app, I get to look on my own time and think about what I want to eat. This place is rather small since coming from Texas but its a nice and quiet place, friendly service and good food. Whats not to like?"
    },
    {
        "id": 84,
        "text": "I would give this place more than three stars but the woman that is always at the cash register is so grumpy and unpleasant to deal with. She yells at the cooks all the time.  As well as the delivery boys. So far everything that I've eaten from here is fantastic."
    },
    {
        "id": 85,
        "text": "Great pizza !!!!!!!..... The place is under new ownership, the foods and service is impeccable.  The new owner really know what she is doing.  Her pizza is taste delicious and not greasy like the old pizza.  The ingredients taste fresh and the pie crust does not soak with grease.  This place is now have a new loyal customer.  Well done !!!!"
    },
    {
        "id": 86,
        "text": "Their delivery was horrible and it takes forever to get to us. The food was cold and the driver made us come down and find him. Never again."
    }
]