[
    {
        "id": 1,
        "text": "Let me tell you mina's is the place i always go to! The food is always good and the delievery is so quick! I am defiantly going to miss this place when i leave"
    },
    {
        "id": 2,
        "text": "That dough!!!  PHENOMENAL!!!!  Veal stromboli?  IN MY FACE!!!!!!!!!!  Curly fries with cheese sauce?  YES!  Fast delivery, good prices, awesome sauce (see what I did there?!)!"
    },
    {
        "id": 3,
        "text": "In my quest to find the best pizza in Roxborough/Manayunk had to eventually hit this place up as it's about 2 blocks from my digs.  It was hard by passing Roma's my favorite local place to taste this, but I am an equal opportunity provider.  Called up and order two large which were ready fairly quickly.  Descently priced which was about 17.95 before tax.  A little disappointed though off the bat as their large is a 16\".  When I brought it home knew right away this paled in comparison to the other local joints.  The crust was a dead give away as it seemed to be premade frozen stuff, not the fresh dough.  I've encountered crust like this at other places such as Fiesta II on Henry which doesn't help only hurt the rating.  Nothing stood out about the sauce or cheese, real mediocre.  Friendly and conveniently located for me which garnishes a 3.  Don't think I'll be returning for the pizza, but might give some other menu items a try."
    },
    {
        "id": 4,
        "text": "We love their pizza.. it's crispy and not greasy!! We also love their chicken fingers and fries..\nThey are the quickest delivery in the yunk!"
    },
    {
        "id": 5,
        "text": "Just started checking this place out. The food is damn good and the service is quick too."
    },
    {
        "id": 6,
        "text": "This place is still very good...in fact, im heading over there tonite!"
    },
    {
        "id": 7,
        "text": "I really enjoy this spot...the pizzas are yum!...the holy trinity (sauce, crust,cheese) they have it right...the salads are very big and fresh, the wings are very very good ( I always order mine well done for xtra crisp) the sauce they use is very tasty...so this is definitely one of my pizza/wing go to places."
    },
    {
        "id": 8,
        "text": "My boyfriend & I just moved from the 'burbs to roxborough and we were putting together our Ikea furniture & doing some cleaning, so we needed something cheap & fast.  \n\nPizza (1/2 pepp, 1/2 plain) was yummy, delivery took 20 minutes - it was great!  We also ordered onion rings which I wasn't a big fan of.  \n\nWill definitely be ordering from here again, will update review as new items are tried! :)"
    },
    {
        "id": 9,
        "text": "Amazing club sandwich. I haven't tried the pizza."
    },
    {
        "id": 10,
        "text": "This isn't a 5 star restaurant by any means, but it gets 5 stars among the numerous take out joints in the area.  Mina's has been my go-to order out place in the East Falls/Manayunk/Roxborough area for over 6 years.  I tried a bunch of places which all seem the same, simply average.  Minas is average in some ways too, but stands out for a few reasons.  First, the wing sauce is really good.  I've had better at some restaurants, but never better in a local take out type place.  The service here has always been very fast and friendly.  They make a nice big cheap salad that my girlfriend enjoys.  Also, the pizza isn't out of this world good, but we like it.  Check it out, especially if you want to order out for good, cheap wings."
    },
    {
        "id": 11,
        "text": "Awful food, even worse service!\nTo start when the delivery guy came I gave him $30 for a $21 meal he just took the money and turned around so fast that i couldnt even ask for my change back.\nWe ordered a Turkey hoagie yet they forgot to put the turkey in the hoagie... literally the only thing thats supposed to be in a TURKEY hoagie, you had one job!\nWhen I called to tell them the mix-up she could not have been any ruder. She thought i was making it up and finally agreed after 10 minutes to send me a new hoagie but requested i give them their original back (the bread with lettuce and tomato's, sans turkey). \n\nIf you like turkey-less hoagies and watered down meatballs you'll love Mina's!"
    },
    {
        "id": 12,
        "text": "Everything I've ordered from Mina's has been great! Delivery is always faster than estimated. Order the buffalo chicken calzone or the cheesesteak with extra cheese - you won't be disappointed."
    },
    {
        "id": 13,
        "text": "I swear this is the best pizza in town.  We order from Mina's regularly, and they do NOT disappoint.  \n\nThey are generous with the toppings, but not so much so that the crust gets all greasy and floppy.  The cheese is fresh, flavorful and stretchy.  \n\nI'm from NYC, so I'm hard to please when it comes to good pizza.  But, Mina's is the best in Philadelphia, hands down."
    },
    {
        "id": 14,
        "text": "Mina's is my go-to spot for times when I develoop a craving for the grease-filled goodness of things like pizza and mini-tacos and mini-quesadillas and wings. [ Roma's is actually my favorite local pizza, but they don't deliver :( and worse, are closed on Sundays] The people who work there are all nice and the food is ready quickly and delivered quickly. \n\nUSUALLY, that is. For the second time in a row, it took almost an hour and a half to get the delivery.\n\nFirst, understand that me getting delivery is lazy--I could walk there and back in a half hour. Second, understand that I get the delivery anyway because they normally take only 20 minutes. Everyone can get busy-- I don't mind that. What bothers me (and why they are getting 3 stars instead of 4) is that regardless of how long it will take, they tell you a half hour-45 minutes. \n\nWe called at 6:19. At 7:20, when An hour had gone by, we called back-- they said \"oh, we're sorry. we're just very busy because of the game and the weather.\" Except Flyers were over by 3, Phils were down 4 in the 7th, OKC and LAkers were ending double ot, even  the Bruins had finished up.... In other words-- WHAT game? Had they said, \" listen-- we're backed up. Is an hour and a 25 minute delivery with cold pizza acceptable to you?\" Then we could have made the decision to go elsewhere. Instead, like a rotten cheating boyfriend, Mina's took away our power to think and decide for ourselves (probably because, like that rotten cheating boyfriend, they knew we wouldn't've stuck around...) \n\nThe kicker to this story is that when the guy finally got there, he explained that it took so long because when he reached us the first time, he realized that \"he forget the menu\" on our box, so he had to \"go back to the store and get it.\" Seriously? Another menu, when you stick 10 in my door each week?!?!? screw the menu, how about just getting us the food while it's still relatively warm, please?"
    },
    {
        "id": 15,
        "text": "Mina's advertises 10% off on orders placed online on both their website and their flyers, yet they also charge an additional 10% if you order online!!!\n\nI'd love to hear them explain this: In both the flyer that I already had on hand, and the one that was just delivered with my order, a small plain pizza is $6.89 but I was charged $7.59, and a small gourmet pizza is $9.29 but I was charged $10.19. That's a total of $17.78, and I did receive a discount of $1.70 (not quite even 10%), but it essentially costs exactly the same.\n\nIsn't this illegal in some way? \n\nThey've now lost a customer over... well, actually over no money... they could have just charged me their regular price without falsely advertising 10% off and I'd have been happy."
    },
    {
        "id": 16,
        "text": "Only good thing about the pizza was the cheese. The rest was just cheap and seemed lacking. The hoagie was ok, nothing to write home about."
    },
    {
        "id": 17,
        "text": "Average food. Average prices. Not bad to stop and grab a bite, don't set your hopes too high though. It was clean."
    },
    {
        "id": 18,
        "text": "Ordered a large pizza, when i opened the box it looked like a medium. The pizza itself was okay nothing special. Also ordered twenty hot wings, once again just okay. Definitely not worth the thirty dollars."
    },
    {
        "id": 19,
        "text": "I can't believe all the 4 and 5 star reviews for this place. The pizza here is total crap. You can go right up the street  (to the right) to Roma's and get a REAL pizza. The pizza here is like the frozen pizza you get at a supermarket. The dough is pre-made frozen stuff and the sauce tastes like Ragu spaghetti sauce. Absolutely horrible. If you think this is good pizza, something is definitely wrong with your taste buds and you need serious help. You'd have to try hard to find pizza this bad. ZERO stars!"
    },
    {
        "id": 20,
        "text": "Some of the best pizza in Manayunk and a very pleasant staff. I Recommend the mozzy stix and the cheesesteaks."
    },
    {
        "id": 21,
        "text": "I should've known when I walked in and saw no slices on display that they don't do slices, but when I asked, they said they did. After about 7 minutes, my slices were \"ready\". I took a peek inside the bag and knew right away we were in for a bad time. When we got home I quickly realized why none of the patrons in the restaurant were eating pizza. This stuff was bad. By bad I mean I can't say one redeemable thing about these slices. The dough was flimsy, raw, tasteless, white. I actually put the pizza in my oven at 500 degrees for another 7 minutes and it was barely done. The sauce was really sweet and, with most bad pizza shops, over oregano-ed. Cheese was fine and price was good. It's amazing to me that this restaurant has pizza in the name. Have they ever eaten pizza outside of a 7-11 or high school snack bar? Pains me to shit on this place like this, but with a food as ubiquitous as pizza, come on, get a clue, why am I still writing this, food network, yelp, pizza blogs, other pizza places, whatever."
    },
    {
        "id": 22,
        "text": "The 10% discount on the online order is a lie. Their online prices are roughly 10% more expensive and the \"manager\" that deals with this issue is never available and always available tomorrow. \n\nJust be honest guys, it is not end of the world to NOT give the 10% off online, rather than creating a bad customer experience."
    },
    {
        "id": 23,
        "text": "A good choice for meth heads and drunks. Really lousy product, horrible customer service, and raunchy customers makes it intolerable."
    },
    {
        "id": 24,
        "text": "We actually ordered from Minas multiple times with no issue and today for some strange reason they delivered our order to a different house down the street.  The people were nice enough at the house to walk the pizza over to us but when I called Mina's  to tell them about the mistake, not to complain but just to let them know that it happened, and they should look into it, they hung up on me. Unfortunately that's the last time will be ordering from them."
    },
    {
        "id": 25,
        "text": "So since moving to Philadelphia from North Carolina  I've been on the hunt for great pizza. Yelp of course was my guide but for 2 months I've eaten bland, mall-type pizza with cardboard crust, so when I got a flyer for Mina outside my door I decided to NOT go to yelp first and just order a small pepperoni pizza and thank goodness I did. This pizza was cheesy with plenty of pepperoni, thick yummy crust, and great sauce between the two. I couldn't contain myself and had to eat 2 slices in the car on the way home. I cant speak of the service or anything else on the menu but if you're looking for great cheap pizza Mina is a great place to start."
    },
    {
        "id": 26,
        "text": "Complete TRASH!!!!..... both the food AND the service. Delivery driver was very rude and and disrespectful. Food was delivered over and hour late with no apology and tasted HORRIBLE. Not worth it.  Would NOT recommend. I will tell everyone I know not to eat here."
    },
    {
        "id": 27,
        "text": "IF YOURE THINKING ABOUT ORDERING FROM HERE, DONT. \n\nThis was indisputably the WORST EXPERIENCE EVER. I ordered a pizza with two toppings, the pizza was delivered to me with only one of the toppings and the cheese slid off half from being carried sideways. It was also cold and under cooked and on what looked like a frozen crust from a grocery store. I called and alerted Mina's of the issues. They said they would have to talk to the cook about the issue and would call me back later. After waiting a long time for a call back, I was finally told that they could offer a different pizza but not the one I ordered (which was simply with ricotta and peppers). I said I would like to pizza I ordered originally, and didn't want the white pizza they offered (because it's not even close to what I ordered???) they reluctantly agreed. The new pizza was delivered about an hour later. This new pizza was also sparse with toppings (one of which didn't even appear to be what was ordered), it was cold, undercooked, and generally repulsive.  Oh, AND they asked for the original pizza back.  In the spirit of cooperation, I obliged.  \n\nI once again called Mina's to voice my dissatisfaction with the replacement order and asked if I could simply be refunded since the this was becoming such an issue. The manager got on the phone and told me I could be refunded but \"NEVER TO CALL HERE AGAIN\". I said well I certainly do not plan on calling again, but I paid in cash, and wanted my money back so I could order from somewhere else. The manager once again said \"ITLL BE DROPPED\nOFF. NEVER CALL HERE AGAIN\". It has been several hours and we have yet to receive a refund. I have never been so DISGUSTED by BOTH the food and the management of an establishment. Mina's should be ASHAMED of themselves and how they treat their REGULAR CUSTOMERS. It is truly repulsive and I have never been so disappointed by the service or food of a restaurant in my entire life. Do yourself a HUGE favor and DO NOT ORDER HERE. EVER.\n\nUPDATE: after calling to see where my refund was (3 hours later) the (very nice delivery driver) returned with my $12.36 and to my surprise asked for 2nd the pizza back (after already repossessing the first one). I informed the (very nice) delivery driver that we had already disposed of the pizza and it was in the dumpster. He said he was instructed to bring the pizza back and I must retrieve it. I HAD TO GET THE SEVERAL HOUR OLD PIZZA OUT OF THE DUMPSTER. I told him the pizza was now mingling with other garbage (since its been THREE HOURS) and he said that is ok. I handed him the ENTIRE garbage bag which he took back to the shop. He handed me my refund (entirely in dollars and cents) with a note from the manager saying \"make sure to get pizza back from her\". I would be more pissed if I was not absolutely bewildered by the mind boggling unprofessionalism and absolutely disgusting food I have experienced today."
    },
    {
        "id": 28,
        "text": "I don't get why people say the wings are good here. They were a 4 on a scale 1-10. I asked for hot and they were barely hot. My favorite bar food are wings but I will definitely not go here again for them. Can't say anything else about the food because I only ordered the wings."
    },
    {
        "id": 29,
        "text": "Their food is really good especially the cheesesteaks, delivery service is fast,  however they feel the need to cover my food in gross amounts of pepper every single time, even When I ask for none it's still all over and I end up throwing out the lettuce and tomatos.."
    },
    {
        "id": 30,
        "text": "I would feel much better if I could make this review a 3.5. Ordered a white pizza with spinach and tomato. Delivery was quick and very polite, pizza was solid. Not earth shattering, but solid. I am definitely going to check out some of the other items on the menu. See you soon!"
    },
    {
        "id": 31,
        "text": "Only ordered from here because the line for Riverside (the best Pizza spot in Manayunk) was busy for ages and Roma's (a decent backup) doesn't accept credit card payments. Mediocre pizza. Don't order mushrooms, they're the flavorless canned kind."
    },
    {
        "id": 32,
        "text": "Quickest grubhub delivery but at a price.  Botched our order through grubhub and then had to call back and argue for the fries we paid for.  They don't know their own menu and sent a panini instead of a wrap and a sandwich instead of a club.  We paid double the price for the lower priced items.  What a joke.  Stay away from this place if ordering from grubhub.  I feel like they intentionally try to get over on customers."
    },
    {
        "id": 33,
        "text": "Best buffalo chicken cheesesteak I've ever had. Hands down. It's real chicken, not thin chicken steak. The sauce isn't super hot and they fried onions are the bomb.com. The curly fries are hit or miss. Sometimes they aren't cooked enough. But this is def my go-to for a buff chick cheesesteak."
    },
    {
        "id": 34,
        "text": "Ordered on GrubHub recently and had very quick delivery, came within 30 mins even though the projected time was 50 mins. GrubHub always projects delivery around an hour I guess to be safe and I feel like sometimes the restaurants take advantage of this and deliver slower than they normally would had you called them directly. Minas does not fall into this group as they almost always beat their projected delivery time.\n\nFood was great. We order an Italian Stromboli, perogies, and hot wings. All three were very good. I enjoyed the hot wing sauce, good amount of heat without being overpowering and a great flavor. Prices are also reasonable. I have order from here many times before and Mina's always comes through with good food and quick service."
    },
    {
        "id": 35,
        "text": "The average truck stop bathroom is cleaner than this place but if you feel like rolling the dice I say go for it! I recommend the cheese fries with a shot of penicillin on the side. \n\nI've been told they voted for Trump so..."
    },
    {
        "id": 36,
        "text": "We ordered from here last nite for the first time and had a great experience ! Right from the start the girl that answered the phone was so personable ! (How many times do you call and order from somewhere and they seem utterly annoyed to take your call and have no patience to listen to which apartment in which unmarked house you live in in Manayunk ?) This girl was great though ! The food showed up quicker than they said and everything was delicious ! Loved the appetizer sampler ! Also had the meat lovers pizza and mild wings .. Which were a little hotter than mild for me but still good. Definitely will order from them again !"
    },
    {
        "id": 37,
        "text": "I ordered from Mina's Pizza through GrubHub. The order was placed around 6:30 and it was delivered right before 7! The driver was kind and the food was hot. I got the turkey sandwich and mozzarella sticks (I know it's random but that's what I wanted). The food was good and I'll definitely order from them again!"
    },
    {
        "id": 38,
        "text": "Don't order the spaghetti. There's nothing good about it. The service sucks! The employees who took my order and worked at the pickup counter where having a bad day, and it showed."
    },
    {
        "id": 39,
        "text": "Ordered pizza and wings tonight for the first time. Pizza was good, wings were great,  and the delivery was super fast. Placed order on grubhub at 6:00 and someone was knocking on my door at 6:26. This is my new favorite place!"
    },
    {
        "id": 40,
        "text": "The size large was only $11 which made it a good bang for your buck. Would definitely rather order from Minas than Dominos at the lower price point for a large pie. The crust was phenomenal, cheese sauce and toppings were good - slightly greasy. I will definitely be ordering from Minas again."
    },
    {
        "id": 41,
        "text": "I was thoroughly disappointed with the pizza. I hope they are able to make the appropriate changes to their dough and sauce needed to continue competing with Roma's and new comer santuchis. I'm rooting for you guys!!"
    },
    {
        "id": 42,
        "text": "garbage!\n\nMy expectations for pizza quality is too high after moving here. I ordered a stromboli and it was like a soggy diaper. I had to Shaquille O'neal slam dunk the stromboli into the trash RIP Minas."
    },
    {
        "id": 43,
        "text": "Haven't ordered from Mina's in awhile because their delivery drivers were always not so friendly so we decided to go somewhere else solely because of this. \n\nDecided we would give them a shot since it's been awhile. The delivery driver was definitely much better this time. We ordered wings, fries, and a salad. The wings were very good. Blue cheese was good and the wings had good flavor and were crispy. \n\nThe one issue we came across was we found a staple in our salad...I'm sure this isn't a regular occurrence, but overall we've had generally poor service and food from Mina's. It just feels like they don't really care about customer service or quality. The food and service is immensely better at Zesto's so if you're looking for a pizza place, go with them."
    },
    {
        "id": 44,
        "text": "Food is not worth your money, you're better off going somewhere else. If the subpar food wasn't enough, the service makes this place worse. Delivery guy is an old man who makes you regret ordering from this place, bitter and rude."
    },
    {
        "id": 45,
        "text": "Pizza is lousy, and I have to think they know it.  Place is clean and service  good.  But cardboard crust, rubber mushrooms, and soggy clumps of spinach, and  super stringy cheese and tasteless sauce.  \n\nMinas needs to up their game.  It's a neighborhood where most of the local pizza misses the mark.    As other venues raise the gold standard, Roxborough stands down with  ho-hum pizza from an era when nobody knew better."
    },
    {
        "id": 46,
        "text": "Went there to grab a sandwich. New Newton area and tried it. Food is ok. Staff is shady. Didn't talk to you much or smile. I felt like I was an inconvenience to them. Never again."
    },
    {
        "id": 47,
        "text": "After charging my card they called me 15 minutes later to tell me that my address is to far to deliver. Now I have to wait 72 hours for a refund."
    },
    {
        "id": 48,
        "text": "Honestly this place is horrible. The food is sub par but the worst part isn't even the food. It's the service. The worst delivery experience I have ever had! The old driver is soooooo mean and just overall leaves a bad taste in your mouth. Trust me. Save your money. Not worth it!"
    },
    {
        "id": 49,
        "text": "Bang for your buck! Stromboli was lit but fries in platter could be better. Also, it was way too difficult to find a menu online so I added some photos of it to help customers & the business."
    },
    {
        "id": 50,
        "text": "This was my first time trying Mina's and it'll be my last. I ordered a small cheese pizza and strawberry cheesecake.\n\nThe pizza reminded me of the kind I used to eat as a kid at a bowling alley. It was thin, the cheese was completely detachable, there was barely any crust and it lacked crunch and flavor. So far, the worst pizza I've had in Rox/Manayunk. \n\nThe strawberry cheesecake was made at Dora's Bakery in Drexel Hill but sold at Mina's. It was a Japanese style cheesecake which has a sponge-like texture and no crust or base. These types of cheesecakes are not my favorite but this one especially was pretty bad. It was flavorless...just like the pizza. \n\nAfter reading some reviews about the delivery guy, I have to disagree. The delivery man was an older gentleman and he was the only positive thing about this experience. It was a contactless delivery and when he called me, he was so friendly, patient and polite. I would give the delivery driver 5 stars but the food at Mina's is a 1."
    },
    {
        "id": 51,
        "text": "Food is horrible. \nDon't order. Second day in a row that they have completely messed my order up. Food was not fresh... actually taste worse than school Lunch. Bout to make myself throw up."
    },
    {
        "id": 52,
        "text": "Per usual asked for pizza to be well done, as often it's doughy and gross if you don't. The pizza that came is a brick. Could break your teeth on it as it's completely charred. Had 1 slice and trashed the pizza. Grossest pizza I have ever had. Completely disappointed in the food lately, rarely a good experience and ALWAYS ALWAYS ALWAYS late by at least 15 mins. Sorry I wasted $20 on Mina's food, I can promise you this was the absolute last time I'll order from this establishment."
    },
    {
        "id": 53,
        "text": "I really used to like Mina's but the place has gone downhill.  I really have a problem with kids cooking my food.  They don't give a damn and it shows in the product that's served.  Don't bother wasting your money at this place.  Very disappointing.  Will not be coming back."
    },
    {
        "id": 54,
        "text": "All I can say is FRESH!!!!!\nThe chicken and broccoli pizza I ordered was so fresh and all I needed to add was garlic, not many white pizzas are as fresh and usually most have tons of oil, mines was delicious."
    },
    {
        "id": 55,
        "text": "I had a sudden wing craving and turned to yelp to look up some local delivery places and found Minas.  It's your typical local delivery joint and the food was good.  I ordered some wings, mozzarella sticks and pizza.  The food showed up timely (impressive for Superbowl Sunday!) and everything was plenty hot.  The wings were good - I do like them a little crispier but it also may have been due to the fact that it was delivery and they were sitting in sauce.  I'm a wimp and just like mild sauce but I thought the sauce was very good.  Mozzarella and pizza were both delicious as well.  I think it's hard to really screw most of these things up but it's nice to find a local delivery place to keep on hand.  Would definitely recommend.  They also take online ordering and give a 10% discount on the order."
    }
]