[
    {
        "id": 1,
        "text": "Not a bad place for a sandwich or salad.  Focus on fresh and healthy food.  Flatbreads made in store."
    },
    {
        "id": 2,
        "text": "Why did it just take over 5 minutes for me to get only a medium coffee?  Because there wasn't any coffee made in a coffee establishment, that's why. In addition, there are non-customers sitting in all of the outdoor seats and the floors and counters are sticky. I'm done with this Cosi. I'll be going to Brew Ha Ha from now on. The customer service is just too poor here."
    },
    {
        "id": 3,
        "text": "pricey food and sub-par service. the half of any sandwich or melt looks like a crust. only three people and they took forever to make the food. understaffed on that sunday"
    },
    {
        "id": 4,
        "text": "Maybe it's too much to expect but a pleasant staff would be nice.  I had an awful experience today with Nashiir. Some individuals should take a step back and realize working with the public might not be for them."
    },
    {
        "id": 5,
        "text": "I work right next door to Cosi and it's perfect for my 20 minute lunch break. I usually get their tomato basil soup because it's absolutely delicious and I'm not a big soup fan. They serve it with your choice of either original bread or whole grain. It's thick yummy and so tasty and the best part is it's ready to go within just a couple of minutes. Also their salads are amazing too."
    },
    {
        "id": 6,
        "text": "It's another Corporate Day at this Cosi. Everybody running around doing everything but ensuring the food gets prepared. After asking where my food was.....I finally walked out. Onion soup at the Midtown 2 Diner instead."
    },
    {
        "id": 7,
        "text": "This is a great place to go if you need some quick food to sober you up!  I've been here many times with my crew after drinking copious amounts in the gayborhood, after NBC functions, after UPENN functions...  Actually, I've never been here sober.  I can't really rate it better than OK, because I'm not sure if I'm remembering via the nostalgia brought on by dirty martinis or horror brought on my shots of patron.  I do know I always feel better after leaving!  The bread is good and does a drunk tummy wonders!  Someday I'll go back sober...  That way I can rate this establishment with a tabula rasa, instead of drunk induced admiration!"
    },
    {
        "id": 8,
        "text": "We were looking to eat breakfast at an inexpensive place. We happened to walk by this Cosi and it worked out perfectly. We got to eat breakfast for all 3 of us for under $10 dollars. The food was delicious."
    },
    {
        "id": 9,
        "text": "This Cosi used to be on my regular weekly lunch circuit.  I swim nearby, and would stop here once a week for lunch.  A LONG time ago, they had freshly carved turkey and their roast turkey and brie was a delicious treat.  Then about 3 years ago they switched to the bland, processed, tasteless turkey.  After boycotting them for about 6 months, I came crawling back and continued ordering the roast (processed) turkey and brie.  \n  Next, they cut down on the quantity of turkey in the sandwich (to match the reduced quality, I guess).  Another brief boycott and again, I came crawling back. \n  All this time, you could always tell when they had a new manager.  More than any other restaurant I can think of,  the change of manager was always obvious - sometimes for the better, sometimes for the worse.   About a year ago they had an outstanding manager- always out front of the counters, being sure all the customers were being helped, that the tables were clean, that the soda dispensers were working, etc.\n  Well, the management for the past 6 months or so has gone from good to atrocious!  At least one of the soda dispensers is usually out of order.  The orderly lines to order either salad or sandwich, marked by signs over the counter, have disappeared, to be replaced by nothing but a milling group of customers not knowing where to stand to order what.  \n   The final straw came on a Sunday about 2 weeks ago.  I went in about 12:30 PM.  There was nobody waiting, and only 2 or 3 tables of people eating.  I ordered the usual roast turkey and brie.  The guy acknowledged my order, then went to the cutting board and cut a flatbread into sandwich sizes.  OK, I thought, he's cutting my sandwich bread.  Well, then he took a second loaf and cut that.  Then he took a THIRD loaf and cut that.  When he started to cut the FOURTH loaf, I said, \"never mind\", and left.  He didn't even look up.\n  That was the final straw.  I have NEVER found the help in this store to be, well, helpfull, but that was the award-winner.\n  This time, my boycott is permanent!!"
    },
    {
        "id": 10,
        "text": "Though am not a big fan of chains, this place is the only place around my crib that i would go to if i am not feeling too adventurous to wander for food.\n\nThe Service is pretty good and , though there is only thing that i ever eat here. Yes the BBQ individual Pizza, by substituting the regular chicken i get the Tandoori Chicken , which gives the BBQ the smokey meat seasoning that it deserves. The breads are made fresh in their hearth oven, might be a bit tough for some of u, but i totally dig that. What i also like is that u can pretty much mix and match what you want frm their salad bar to build ur own grub. \n\nWhat most ppl dont knw is that most Cosi's this one and others have a decently stacked bar, so if ur friend wants a cup of latte u can douse urself with that Vodka concoction, u knw where to be at."
    },
    {
        "id": 11,
        "text": "I have been going to this Cosi with terrible results since I was a teenager.  I know, you're thinking, why do you keep going back?  But it's because it is right in Center City and near work/school/home etc.  However, I am not going to be eating here again any time soon.  Maybe coffee.  MAYBE.\n\nAnd here's why:\n\n1.  I went into Cosi to order a salad.  I was the only person in there because it was an odd hour.  I told him I wanted a salad without lettuce (don't hate) and that I would pay extra if giving me more of the toppings was a problem.  He looked at me with disgust and told me this could not be done.  I told him I was pretty sure it could since he had everything I needed right there.  He put in the regular amount of toppings (tiny scoop) and then shoved the bowl at me and said \"THIS is what you want?!\" I told him I would be happy to discuss it with the manager if it was a problem and asked if he could put in another scoop of each thing.  He did what I asked while mumbling under his breath that this was ridiculous and he didn't know how they would ever figure out an appropriate price for this.  When I went to pay, the cashier had no problem figuring it out and I left but it was a not so good experience to be told by an employee that what I want is outrageous when it is far from.\n\n2.  I went to use their WiFi and order breakfast.  The WiFi wasn't working.  Something about being so close to Starbucks' WiFi and that it's \"sometimes an issue\".  They did reset it for me but it still didn't work and I was not able to do anything.  What's the point of having non working WiFi.\n\n3.  I ordered an egg and Cheese squagel for breakfast.  I was one of two people waiting for food and the other person picked their up and left right as I was placing my order.  It shouldn't take very long to make but somehow, 10 minutes later, I was still waiting.  When I got my sandwich, I rushed out because I was going to be late and when I opened my sandwich about 10 minutes after that, I discovered it was a BACON, egg, cheese and TOMATO squagel.  I do not eat bacon.  I do not eat tomatoes.  Even though I picked it all off (otherwise no breakfast and I had a meeting that wouldn't be providing nourishment), the bacon and tomato took half of the sandwich with it and I was left less than satisfied.  \n\nAgain, I might go back for the coffee because it's pretty hard to screw that up and when you need coffee, you need coffee, but these last three incidents (I have MANY more but they aren't recent enough to yelp about) have left me completely uninterested in eating at Cosi ever again."
    },
    {
        "id": 12,
        "text": "I have been here a number of times, and I have been happy each of them. The service is great (today I had a spectacular wait staff who responded quickly to my concerns about the number of tea bags in my drink!).  They have soy milk, something you cannot find at every tea/coffee shop.  They have a quiet atmosphere.\n\nNow, here is the conjunctive. I only go here for tea and I am a cosi member so I get rewards for using Cosi over one of its competitors on the opposite corner of the street.  I do not know anything about its food, wireless internet, or high calorie desserts.  \n\nBut, what I do know about it, I do like."
    },
    {
        "id": 13,
        "text": "i don't have a whole lot of opinion on gay cosi. it's open late, which is nice. not cray about the coffee. not a lot of vegan options. but some comfy seats. it is what it is."
    },
    {
        "id": 14,
        "text": "food was 3/5 but the service was 0/5. this place's leadership need to kick them in gear"
    },
    {
        "id": 15,
        "text": "I'm an out-of-towner and I only went here once, but I had the TBM squagle (tomato, basil, mozzarella) and it was AWESOME.  I put aside my skepticism over a square bagel and tried it out at my friend's recommendation, and loved it.  The squagle was nice and crispy on the outside and chewy on the inside, and the tomato, basil, and mozzarella was an excellent combination.  I enjoyed my squagle with a cup of coffee and watched the rain fall on a fine spring morning."
    },
    {
        "id": 16,
        "text": "Came here to study. \n\nInternet: unstable\ntables: unstable\nservice: inconsistent. the MANAGER forgot to make a drink order. If the MANAGER is blatantly forgetting to do things, i don't understand how the restaurant plans on functioning. \ntea: decent, but realized they are sitting in an semi-open canister on the counter the ENTIRE day."
    },
    {
        "id": 17,
        "text": "I'm sitting in your establishment right now because I'm in that awkward time prior to an engagement and I thought I could study here beforehand with your Internet.\n\nWhat the hell. Why did you dim your lights. I already have glasses, you just want me to waste more money on eye complications don't you. Not only can I NOT find an outlet to plug my laptop in, but when I find it, it's right by the door so I am cold on top of having a cold. And this whole table service idea, really REALLY BAD idea.\n\nI came for soup while I study. Your service was nice and your food was yummy. But why oh why did you just dim your lights and make me even more cranky :( You made me sad, Cosi, a very very sad Anjali :("
    },
    {
        "id": 18,
        "text": "I *think* this is the location I studied at lots of times. It was always a cosy (pun pun pun) respite from the center city chaos outside. If you get there before 5, they don't hassle you with waitress service--AND you can get as many free bread sticks as you'd like! woohoo!!"
    },
    {
        "id": 19,
        "text": "I went here on a Sunday night, so it wasn't too crowded with tourists. I ordered a turkey sandwich and mixed green salad. The turkey sandwich was tasty, but pretty small. I don't remember seeing nouveau in front of the sandwich description.  The mixed green salad was fresh and the vinaigrette was tangy. However, the salad fit on the smallest plate available, which is to say it was almost microscopic in size. Frankly the meal just wasn't worth the money. I'd rather have gone to Potbelly's or Top Tomato across the street. The only good thing about the place was that there were a lot of good looking women studying there."
    },
    {
        "id": 20,
        "text": "I like to go to this place for breakfast. Their western croissant is great, if you order a medium coffee, the combo is only a dollar, so the total for breakfast is around 5 bucks. I personally think the food has better quality than dunkin donut if you are looking for a fast breakfast. Their coffee is OK, the dark roast tastes like medium."
    },
    {
        "id": 21,
        "text": "Here we go again with this location. I came here around 8 to kill time and get caffeinated before my 10 pm movie. I do love the Smart Fit salad, so there's my dinner (albeit with an aluminum foil cover and no bread - I didn't want any, but I wasn't asked, but the gal in front of me was. I was also eating in; another question the gal in front of me was asked, but I wasn't). However, the caffeine part? Not so good. There was no coffee at a coffee house! I was offered espresso, but I don't drink espresso! I wanted a coffee to take my time with and enjoy. What is with this location? Why was the gal in front of me treated better? When will this spot get straightened out and when will I learn to stop coming here?!"
    },
    {
        "id": 22,
        "text": "There are a lot of haters out there on this Cosi.  First of all, this is the best Cosi in center city.  And though I've been remiss in my check-ins lately, I eat here more than I'd like to admit because I can get a delicious, fast meal for relatively few calories.  \n\nThis particular Cosi has more seating and is generally nicer than the other close Cosi's (rittenhouse & the 4th/Chestnut one).  I can actually go there and work for an hour or two and feel comfortable.  At this Cosi you order your food at the counter and then sit comfortably while they bring it to you... and they even take it away later if you stay after you're done eating.  \n\nAnd the food is delicious.  Really.  Okay, I might get the same thing every time now (and I build my own sandwich, so don't be scared by what someone else called a \"limited\" menu) but I've tried a multitude of options and not been disappointed.  \n\nOh, also - get the COSI card.  Buy 10, get one free."
    },
    {
        "id": 23,
        "text": "My favorite stop on the way home for a super big ice coffee. Everything is fresh, the occasional brownie or blondie delish, and staff is always pleasant. Sign up for their frequent shopper card and get free stuff."
    },
    {
        "id": 24,
        "text": "This morning I ordered an unsweetened iced tea, paid for it, and was then told they didn't have any made. I was offered a flavored tea instead. I told them that I didn't want a flavored tea, and they responded \"I'm sorry\".\n\nI was never offered a refund (the $2.50 won't break me).\n\nI indicated that I would write a Yelp review and they just laughed.\n\nWHY DO I KEEP GOING BACK TO THIS DUMP? Poor food safety behind the line, you have to go to Starbuck's across the street to use the restroom when the Cosi bathroom key is lost (and the Manger says no to using the spare key) , and the place is never the same. The only time you get consistent  and good service is when Corporate is in town.\n\nThis is proof that any business can survive LOCATION, LOCATION, LOCATION."
    },
    {
        "id": 25,
        "text": "Not bad. It's a sandwich shop. The help is bored and indifferent, had to ask 2 different people for a spoon but the food is ok."
    },
    {
        "id": 26,
        "text": "stop by every morning.. clean , great service,  and friendly,  rare in philly"
    },
    {
        "id": 27,
        "text": "I like this Cosi  because the customers are very interesting especially because it is located at the heart of gay culture that always bring interesting stories and friendly atmosphere. \nAlso I started to come here instead of coffeehouse because this is the only place around south philadelphia until 11 p.m. That and free Wi-Fi make this place wonderful.\nTheir food is quite salty overall. \nTheir coffee is not great but ok considering the price and you are welcomed there to work until 11 p.m."
    },
    {
        "id": 28,
        "text": "When I started living in center city and going to school in north Philly, I knew I would have to find a coffee shop where I could drink sweet ice-creamy coffee flavored drinks, people watch, waste time on the internet and maybe occasionally study. There were quite a few options for me to choose from and I ended up frequenting this particular Cosi for a number of reasons, despite competition from Starbucks across the street. \n\nFirst of all, there is free wifi, which, although sometimes difficult to connect to initially, is pretty fast and probably the number one thing that puts this place on a level far above its neighbor. The seating is comfortable and there is almost always enough room to have a decent-sized table near an outlet for your laptop, books, iPhone, dogs, trumpet, and whatever other possessions you are travelling with. I also love that they are open late (I think 10:30pm most days).\n\nThe coffee is good. Not going to change your life, not going to write home or even update your Facebook status about it, but definitely solid for a chain coffee shop. As for the food, I always order the same thing, the turkey bacon cheddar melt. It is absolutely delicious, possibly in my top ten favorite sandwiches, and I am a sandwichy kind of guy. Everything else I've tried here is decent, although I've never had a salad and they seem like a pretty popular item.\n\nThe people that work here are nice and very refreshingly unpretentious, which is another big benefit over some of Cosi's competitors. For the most part, the customers are cool as well, although this is Philadelphia and I guess a certain baseline level of unwholesome characters is unavoidable. Generally, the atmosphere is very, very chill and comfortable. \n\nThe biggest two negatives about this place are that sometimes the music is too loud and can sometimes be insanity-provoking, and that it is not well-lit enough for non-computer reading when it is dark outside. But these are minor things, at least for me. Previously, the biggest negative was that they began table service and jacked up the prices at 5pm. However the absurdity of this practice must have recently been brought to their attention, because they no longer have table service. Yes!\n\nThe final bonus of choosing Cosi is that they serve beer and wine, in case you give up on studying and decide to get slammered instead.\n\nGo to Cosi, drink the coffee, order the turkey bacon cheddar melt, ogle the gender of your choice and I will say with confidence that if you have reasonable expectations for a chain sandwich shop, you won't be disappointed."
    },
    {
        "id": 29,
        "text": "Good lunch place. I really like their melt and the salads."
    },
    {
        "id": 30,
        "text": "I really like this Cosi, but in the last week, they've had no chia shots and the overpriced Polar Seltzer has been warm and not chilled. Get it together, 12th & Walnut Cosi!"
    },
    {
        "id": 31,
        "text": "They've done away with the family feel. Now it's cold and stuck-up. They removed pizza from the menu and the Parent magazine award poster. I don't know what to do. The pizza wasn't that great anyway."
    },
    {
        "id": 32,
        "text": "As with 18th and Walnut location, I have been a longtime patron of Cosi at 12th and Walnut.  I am a big fan.  I love the options and the quick service.  The new system of ordering at register and server bringing item to table is excellent.  The restaurant is clean, team and managers always positive and helpful.  As a dog owner, tables on sidewalk are really nice."
    },
    {
        "id": 33,
        "text": "Gay Cosi!\n\nReally, in this neighborhood, how else am I to distinguish this Cosi from the eleventy others in Center City?\n\nTruthfully, I try to avoid chains like Cosi, but this one holds a special place in my heart if for no other reason than the sentimental value it holds. All I can really comment on is the caprese sandwich and the coffee (I liked Cosi so much more when I ate meat!) and they're just....OK. But this Cosi is the best in town just for the ambiance. Gay Cosi embraces its place in the neighborhood - it has a painting of Edith Piaf for dog's sake! - and it's a good enough place to meet up with people or just grab a cheap bite by yourself.\n\nReally, I just frequent this Cosi because I know people who go there a lot and it's a place to get coffee past 8pm. But for that, I kind of like it."
    },
    {
        "id": 34,
        "text": "Ended up here for brunch after getting rained in from walking around the city, and despite this being very chain-y, it had the vibe of a Panera. I got the signature salad which had grapes, pears, cranberries, Gorgonzola, and pistachios... Delicious!! Price around $8 and we got the $5 off if you bring your receipt back before a certain date (didn't end up using it though). My friend didn't really like her Thai curry but overall I was happy."
    },
    {
        "id": 35,
        "text": "Customer service sucks!\nStrike 1: I'm the only customer in the entire store, somehow my bagel is never ready in less than 5 minutes because the guy is not getting bagel out of the toaster.\n\nStrike 2: two weeks ago I asked for bacon, egg, and cheese on a bagel and I got cream cheese instead! I called an hour later and the manager lady said she would \"get me\" the next day. The following day I got a free bacon, egg, and cheese on a bagel and it was very nice of them... Until...\n\nStrike 3: the only customer in the entire store, I said good morning to the bagel guy, he replied without making eye contact, didn't care to service me, kept on checking a tinny list in a small piece of paper and totally ignored me, meanwhile manager lady kept her back at me but I know she saw me coming in, because of the noise of the door, 2 minutes went by and nobody asked me what in hell I need, I'm going to be late for work, good bye così. I left without my breakfast.\nAlso, like another review said, you have to repeat your order to them.\nI feel sorry for the business Corp, they need to train these guy ASAP, or they will have to close this store."
    },
    {
        "id": 36,
        "text": "I've been here a few times for the oatmeal in the morning. Often times there are servers engrossed in gossip in the front customer area. Lots of attitude and just negative looks.  Just unwelcoming... Then today, I got my oatmeal.  It was like a brick. I added hot water to loosen it up. Took a bite and found a finger nail. Garbage. That's pretty much it for me...good luck to other folks eating here."
    },
    {
        "id": 37,
        "text": "In general, I'm a fan of the cosi chain, but this particular location is just awful. The staff is insanely rude, even belligerent at times. They do not care whatsoever about treating the customer nicely, much less with a basic level of respect. I have never felt more intimidated to go into a place of business--I have given this location the benefit of the doubt (maybe this handful of employees was having an off day?) more than once, and will not be going back. \nIt's a shame really, the food is good and it's close to where I work. But it's not worth the condescending, distasteful interaction that comes with it. I hope corporate cosi visits this one, it needs serious attention."
    },
    {
        "id": 38,
        "text": "Since I wrote a rather negative review in 2011, this Cosi got a lot better.  You can always tell when a change in managers happens, as it directly affects, for better or worse, the quality of the help, and the general upkeep and appearance.  I wish that I had written a positive review in the last couple years because now, there has obviously been another change in managers (in the past month or so - this being written on 5/18/15), because now it is an absolute DISASTER AREA!  There is total chaos in the store.  It looke like every counter person is new and has had NO training and has no idea how to make a sandwich.  The people who are apparently supposed to be supervising/teaching/ helping, are totally useless.  Customers mill about, not knowing where to stand- orders back up - the counter person asks the helper what to do. the helper pulls out the menu card.. they study it.. There is a line for everything - ordering, paying, etc.  TERRIBLE!   \n  I can only wait for the NEXT change in management, which hopefull will come soon!"
    },
    {
        "id": 39,
        "text": "After the ballet went there for a quick bite, and ordered some pizza Margherita and a drink, and after seating down at a table and waiting for my order was told I had to take it out because they were closing"
    },
    {
        "id": 40,
        "text": "So disgusted. I went in around 1pm today and ordered a sandwich, only to watch the man behind the counter use his latex glove covered hand as a tissue and then make my sandwich while several other employees looked on and didn't say a word. I hope the homeless man I gave it to enjoys my grossly overpriced sandwich. Will definitely not be back to this Cosi location."
    },
    {
        "id": 41,
        "text": "The food simply wasn't good. Ordered an chicken rice bowl and all I could think about was how I should have just gone to the chipotle across the street. My friend ordered a BBQ chicken pizza and it was decent in taste and could even feed two (small stomachs). \nThere are way too many other solid food options in Philly to waste a meal here. If I come back, I'm gonna keep it simple and stick to coffee and a pastry."
    },
    {
        "id": 42,
        "text": "I have spent a LOT of time over the years  and mucho $$ in this Cosi. It used to be great but it is now horrible and going downhill FAST!\n\nFirst of- it is really dirty. I noticed the cutting boards along the prep area. They are FILTHY! All cut up (understandable) but the cuts are all discolored. What does that? Bacteria. Now I can't bring myself to order any sandwich that will sit on the boards. Blech!\n\nSecondly, they \"revamped\" the menu and it SUCKS. No more 1/2 sandwich with soup option. STUPID.\n\nThey are permanently out of my lunch rotation. Farewell."
    },
    {
        "id": 43,
        "text": "I have no idea what is going on with this cosi. I waited for 15 minutes as the second person in line before walking out of the store and the first person still hadn't had their order taken. The employees seemingly just walk around in circles doing nothing."
    },
    {
        "id": 44,
        "text": "I love Cosi. And this is the worst Cosi I've ever visited...twice. Service is amazingly slow and staff are careless. One Gentleman made my sandwich while holding the bread in the same hand as an open pen. I have watched them dump the liquid from peppers onto the sandwich. They have rolled the sandwich in foil like a burrito. There has been a line to the door and they have moved liked molasses. There just doesn't seem to be a care in the world. Understaffed and under-motivated."
    },
    {
        "id": 45,
        "text": "This cosi is a good one! The lines can be out of control long around lunch time as everyone is grabbing lunch between classes, but the staff handles the rush well! The separate the ordering lines so that quicker orders are tackled pretty much immediately. If you just want soup head on up to the register! \n\nIt can get pretty loud in the place during the day with students popping in and out so I wouldn't recommend for studying. Although it's a lot quieter in the evening when students have moved else where along campus and it's open decently late it you prefer a spot like that for studying. The upstairs seating is also always a good option as a lot of people forget about it. Otherwise this is a pretty standard cosi nothing to complain about. Oh and as with all my other reviews of cosi's throughout the land get the chicken TBM melt!"
    },
    {
        "id": 46,
        "text": "I hate the setup of this cosi... It's really confusing because you have to give your order at one end (not where the cash registers are) and then you have to walk around to the other side and repeat your order to whoever is at the cash register.. the setup is not systematic, it is jumbled and confusing and the employees don't really assist with directing traffic because they expect you to know the process (which i think is unreasonable considering no other cosi i've ever been to is set up in this manner)\n\nIn addition, I was 1 of 2 customers waiting on an order and i watched my hot beverage through to completion and it took FAR too long for me to be serviced. I'm usually relatively patient with this kind of stuff and I would have been in this situation had the employee making my drink 1. known what she was doing and 2. not had three different conversations with other employees in the meantime.\n\nDisappointed and probably won't be returning to this location."
    },
    {
        "id": 47,
        "text": "Today I tried Cosi. I honestly debated whether to chance it or wait it out at Chipotle. I should've waited.  The set up of Cosi doesn't make much sense.  It seems like they're trying to hard to be like Starbucks and failed.  I ordered a half a turkey bacon sandwich.  Bacon is in the name yet bacon isn't what I received.  Lady informed me they were out of bacon but they could give me pepperoni instead.  Well yea that's an even trade not really but F it I said yes.  My Sandwich looked pitiful. It was cold and nothing exciting. It looked as if someone gutted bootleg pizza crust and used it for bread. Next came the lemonade which I figured had to taste better than my turkey pepperoni sandwich.  I was wrong.  The lemonade tasted as if someone left the lid off in a smelly locker room.  This was even after I tried to doctor it with agave nectar and raw sugar. Like how do you make lemons and water taste that bad?  I checked my breath after sipping it.  I def wasted my money.  Get it together Cosi."
    },
    {
        "id": 48,
        "text": "Let me start by saying I LOVE COSI. I have been going to Cosi since the late 90's when it was X and O and have hit most of the locatons in the City of Philadelphia and even the one in Wayne. I love the sandwhiches, soup, coffee... but my goodness the service at 12th and Walnut is UNBELIEVABLY BAD. They just can't get their act together. Every time I order something there it is wrong. The coffee and register staff (at lunch hour, I'll add) is always miserable, complaining or just standing around. \n\nI kid you not.\n\nSome advice: Don't go here. Try going to the one at 18th and JFK. There's a good Cosi. Or the one at 18th and Walnut, now that's a good Cosi. But if you get sacked with going here, take some advice\n\n1. Order food directly from the menu and make no changes. If you need to (which hey, I asked for no sauce on my sandwhich today) make sure you watch the staff make the sandwhich to ensure you get what you ordered. Today (like others) I did not and am now stuck eating what I precisely did not want. Saucy!\n\n2. Order coffee from the board, no changes. If you like a pump of this or a pump of that in addition (which they OFFER) again, make sure you watch the person make your coffee. You might have to return it 3 times (yep, 3) but you'll ensure it's right.\n\n3. Check your reciept to make sure you were charged properly and not extra for something that no longer exists in the menu. Yeah, that happens too."
    },
    {
        "id": 49,
        "text": "Service is terrible. Employees don't make eye contact with you, don't explain how the order process works (you order at one spot, repeat your order in another, nobody tells you how you know when your meal is done). Food isn't that tasty either :/"
    },
    {
        "id": 50,
        "text": "A good place for lunch, but I never could find the napkins!  I had the Vegi Muffaletta and it was delicious.  There are a TON of banana peppers on this sandwich, but I happen to love them so that just made it better in my opinion.  T had the wasabi roast beef, and he said it was delicious.  It even had pickled ginger on it.  Mmm!"
    },
    {
        "id": 51,
        "text": "I'll just jump right in here with this...I was flashed in this Cosi.  Granted, the act alone was no fault of the staff.  However, the reaction of the staff was horrible.  I went over to my waiter to complain, and he told he \"He'd look into it.\"  The flasher was NOT removed from the restaurant.  \n\nI understand the staff might not want to make a scene, but that was pretty ridiculous."
    },
    {
        "id": 52,
        "text": "Not a fan. Simply not impressed with the food, the atmosphere or the service. $12 for a bowl with 4-6   mc nugget sized chunks if steak on a bed of lettuce seems a bit pricey for the cookie cutter chain. One word sums it up..meh."
    },
    {
        "id": 53,
        "text": "Just what, exactly, is going on here. It seems that I will never understand the Cosi clue! This location's low-level management is just awful and confused. I'm sure their intention is to IMPROVE, but obviously that ain't happening.\n\nThis location keep changing their in-store ordering setup. One day, you'll order here, go pay there, and come back here to pickup your food. Another day, you'll order and pay there, then go to the other side to pickup your order. Why you are trying to confuse us, Cosi?\n \nOh, you prefer to place your order online for pick up, make sure you got all your items, they have the tendency to miss either your bread or your coworker's bag of carrots, or perhaps they will forget the whole order. Re-think.\n\nI believe that their management operation is just awful and confused. I try not to go, but it is around the corner from me, and it is one fast Ritalin food. Sometimes I cannot resist. \n\nI have another legit question, Cosi: Why most, if not all, of your employees are miserable and unhappy. \n\nOne and half Yelps."
    },
    {
        "id": 54,
        "text": "I stopped at this Cosi recently for a quick lunch. Much the same as other Cosi's in center city it was busy, full of students and business-looking folk on lunch break.  I ordered a salad with grilled salmon on top. It wasn't bad, but the lettuce and some of the veggies could have been a bit fresher - they had a little limpness going on. Another few stars off because the bathroom and drink/coffee supply station were pretty messy.  I can imagine this was due to the busyness of lunch time, but at the same time they were well staffed. I would go back again, I'll just make sure the food looks fresh before I start eating."
    },
    {
        "id": 55,
        "text": "Sandwiches were good and freshly made. In terms of the food, nothing stood out as different from the Cosi places I frequent in DC. Cosi is just generally a very good sandwich shop.\n\nI went around dinner time and it was a bit crowded though. Took almost 10 minutes to get my sandwich, whereas I'm used to about a 5 minute wait. Other than that, no complaints. The free wifi was nice!"
    },
    {
        "id": 56,
        "text": "I generally hate Cosi - the bread is like hot cardboard - and the food is not my thing, but I stop in to this one every once in a while for iced coffee.  A good friend lives near this one so we'll meet here, grab some iced coffee and hang out with or without our kids in tow.\n\nThe restroom is abhorently filthy though.  Yick."
    },
    {
        "id": 57,
        "text": "I've been here a few times for lunch, and every time I go, I've been impressed with the staff. They are the happiest bunch of employees I've ever seen at a Cosi, and they alone make it worth coming in for food. I got my salad in record time and chatted with my cashier about how hot it was. When I grabbed the salad, the man behind the counter gave me the biggest smile.\n\nMy only complaint is that the egg in my Cosi Club salad looked perfect, but something about it was off--almost sour. Otherwise, the salad was as good as any I've ever had from Cosi. Will definitely come back for lunch another day."
    },
    {
        "id": 58,
        "text": "I'm giving this five stars for breakfast.   Different than others with square bagels cooked on premises, all kinds of unique flavors.  Had the sausage and pepper breakfast sandwich and it was fantastic.  My wife also got a breakfast sandwich (she forgot to order the egg on it and only got mozzarella and onion - reminder, get the egg!) and coffee.  For the two of us it was less than seven bucks.  That's two people, great food, less then 7, holy smokes, we'll be back."
    },
    {
        "id": 59,
        "text": "Ugh...not sure if just this Cosi sucks, or if they are all this bad, but either way my experience here has completely turned me off from eating here again.\n\nI live across the street, and would have loved for this place to be one of my go to's but I had a bad experience here around the time I moved in so I pretty much wrote it off. The other day, however, it was cold and rainy, and I was suddenly craving some soup. Not wanting to go far, I decided to come here (man I really wish Cosi had closed and been replaced by Chipotle, instead of Potbelly). \n\nI decided to get the pick 2 combo including a cup of the chicken, sausage, and rice soup, a Greek salad, and a side of bread. Panera offers a similar option (pick 2 combo), however, the food there is about 100 times better! I've had plenty of Greek salads since my fiance is obsessed with them, but this one was just awful. The dressing was all wrong, and none of the ingredients tasted fresh. The soup was decent, but very oily. And the bread was...well really nothing special about it honestly (although it was a pretty big piece).\n\nI'm very confused by the face that you can find Cosi all throughout Center City, but not one single Panera...one of the few downfalls of Philly!"
    },
    {
        "id": 60,
        "text": "Dear Cosi, \n\nAlthough you are a chain, you represent the perfect break from the vanilla Panera Breads of the city (and suburbs). The presence of a brick oven earns you serious cred, in my book. Oh, and I absolutely adore your Turkey and Brie sandwich. \n\nNow that I've buttered you up, we need to talk... Just because you have a novel way of serving the general population sandwiches and squagel-bagels (haha, I said squagel) doesn't give you the right to serve mediocre pizza. I mean, seriously, YOU HAVE A BRICK OVEN. There is a certain expectation that the pizza will rock. Your BBQ pizza severely disappointed me. The sauce was okay, but don't be stingy, spoon that stuff on there! And the bread? I had flashbacks to my time in Chicago where deep dish lives. \n\nI expected better of you, Cosi. I thought you were the one."
    },
    {
        "id": 61,
        "text": "I miss XandO!! Did you know the original company which is now the coffee portion of COSI was called XandO? Yeah, it was. The XO stood for Hugs and Kisses while the \"and\" stood for the first initials of the owners Andy, Nick and Dave. How cool is that! Of course, they were much smaller than COSI whose presence was well known in NYC. So, X and O was swallowed into the COSI brand and we are now obsessed with salty, buttery bread! Amazing that you will actually spend $2.19 for a slice of COSI bread! God we are pieces of...bread! Oh, the review... I like COSI but I really miss XandO and I wish COSI was more like XandO! This location is also known as \"GAY COSI\". I remember hanging out with XandO friends here after work at one of the museums on the parkway. I was a farmer dufus with baggy jeans and boots topped off with a flannel jacket. I looked so south jeresey, it was crazy! Ah, memories. So, go to COSI and create some new ones. Try to forget about the old, it's not their fault... or is it?!?!"
    },
    {
        "id": 62,
        "text": "Ended up here trying to find some celebrities who were filming tbh. Got some pretty good bagels here as a result.  Overall friendly atmosphere and decent food."
    },
    {
        "id": 63,
        "text": "Please be careful here.  I was picked pocketed during lunch hours while eating here.  It is kinda dirty too."
    },
    {
        "id": 64,
        "text": "Disclaimer: This visit was on 12/1.  I ordered a Grilled Chicken Pesto.  I was pleasantly surprised that it was not inundated with salt.  The atmosphere is very relaxing, & I noticed people on their laptops apparently using wi-fi.  The prices seemed reasonable, & I would return in a future visit to Philly."
    },
    {
        "id": 65,
        "text": "Cosi is the coolest place to hang out in Midtown Village. It's a trendy atmosphere, has gorgeous big windows, the staff is always so friendly, and it has a really nice refillable drink station. When you want to chill for a little while, and grab something to eat and drink while you read or mingle, this is the spot in Midtown."
    },
    {
        "id": 66,
        "text": "I'm quite embarrassed to say that I've never been to Cosi until recently. Upon arrival, I was given a fresh piece of multigrain bread. Why? I have no clue. Did I eat it? No, I devoured it while in heaven. Seriously, their multigrain bread is on point. \n\nI ordered a caesar salad sandwich, obviously on multigrain bread. The sandwich didn't have that weird lettuce to dressing ratio that some caesar salad sandwiches have. It was perfect. I was really full half way through my meal so I was lucky enough to enjoy this the next day as well. \n\nI thought this location was clean and attentive. So glad I finally stopped in!"
    },
    {
        "id": 67,
        "text": "Meh. Very bland, corporate, and uninspired, even for a Cosi. The food is very average, but the ambiance is just a little off-putting and strange. Right next door, Starbucks is cozier and better for studying, and Chipotle has better food."
    }
]