[
    {
        "id": 1,
        "text": "Absolutely disgusting. Do yourself a favor and never order from here. Food is terrible"
    },
    {
        "id": 2,
        "text": "So I went to this fine establishment yesterday after a night out on the town. Was looking for some quality pizza and possibly some wings. The wait was a little long but not terrible considering the night rush. I got a large pepperoni and a dozen wings with a side of hot sauce. Everything sounds great right? Pizza tastes good, wings taste good. Me being slightly... buzzed thought nothing of the bill... after all my main mission was to get Pizza. It wasn't until I collected myself this morning that I realized how ridiculous it was that I spent 32 bucks on a pep pizza and a dozen wings. I think you guys can do the math. I got fleeced in my moment of drunkin pizza need. Anyway, go next door. These guys can't operate like decent human beings. I'm sure the owner will read this so my message is: yeah we might be drunk when we order but we remember the next day and apparently this isn't an isolated event according to my friends. Deuces. (Drops mic)"
    },
    {
        "id": 3,
        "text": "Came here one night back in March after being at mad river with a group of people. Came here and got two slices of their chicken honey mustard pizza and it was amazing. My roommates and I often find ourselves thinking about driving up to get some pizza weekly but the 45 minute drive seems to be a bit much just for pizza. Will stop by every time I'm in the area."
    },
    {
        "id": 4,
        "text": "I placed a delivery order at 6:44 and was told it would arrive through grub hub between 7:30 and 7:40. After they did not get there in the time frame, I called and they said it was out for delivery and would be there momentarily. Grub hub then updated the delivery time two more times delaying it further both times! It arrived at 8:11. The food was gross - nothing was even warm, let alone hot. It was soggy, not crispy and it all tasted bland- like no taste and over cooked. Order from somewhere else."
    },
    {
        "id": 5,
        "text": "Instead of ordering delivery from this place make a reservation at a nice fancy restaurant in center city.... You'll save money \n\nPizza wasn't bad tho"
    },
    {
        "id": 6,
        "text": "Stopped here on a late night before catching a movie. We all ordered burgers and fries, the food was OK nothing special. The woman behind the counter wasn't friendly at all. They had a few stools we thought we could eat at ..but the place was so cold inside we opted to eat in the car. Like it's the dead of winter an even the woman behind the counter was wearing a coat which is unsanitary. It was sooooo cold the cheese on my burger was not even melted. I'm sure there are other burger joints on main st. Maybe we should have stuck to the pizza!"
    },
    {
        "id": 7,
        "text": "We've tried just about every pizza shop in Manayunk & Roxborough. Wish we wouldve found this gem sooner! Can't beat the price!!! The pizza was good. I like the dusting of cornmeal on the dough. It gives the crust a nice texture instead of filling your mouth with flour like all the other pizza shops. The crust was thin, cooked light but not soggy, and the ingredient portions were spot on so nothing was overpowering."
    },
    {
        "id": 8,
        "text": "Ordered a roast pork hoagie with broccoli rabe, arrabiata pasta, and wedding soup from here.  Received a roast pork hoagie with jalapeño peppers, arrabiata pasta with jalapeño peppers (apparently the italian cherry peppers ran out, though I was told jalapeños are basically identical), and my soup was spilled all over the bag.  To their credit, they did replace the soup but the food overall was pretty awful.  I was also told to call back so they can make up the order to me (though I was literally currently on the phone with them regarding the current order).  The pork was incredibly fatty and putting jalapeño peppers in italian pasta is just asinine.  I would not order from here again but maybe by some slim chance the pizza is half decent."
    },
    {
        "id": 9,
        "text": "Went for the first time in a while very friendly food was made fresh and fast buffalo cheesesteak wrap is so yummy pizza hot and fresh everything was good!"
    },
    {
        "id": 10,
        "text": "The only reason I'm giving 2 stars instead of 1 is because my 2-year old liked the pizza.  The chicken cheese steak was overcooked chunks with no flavor....The wings were whole wings without the tips cut off, which just looks unappetizing.....The  cheese steak tasted like a cheap version of Steak-umms.  Oh, and the pizza is lousy!  I really wanted to like this place because they have a big patio and it is byob, but I can't eat there again."
    },
    {
        "id": 11,
        "text": "I love this place! Being from New York I'm very picky about my pizza. This is the only place in the neighborhood that I go to for pizza. The prices are affordable and the variety of pizza is great. The staff are always very friendly, quick, and kind. I would definitely recommend for lunch or a quick dinner. Out of all the pizza places on Main St. in manayunk, this is my favorite by far!"
    },
    {
        "id": 12,
        "text": "So this is review is not based on the quality of the food as they never delivered it! On May 26th, I ordered through Grubhub, which turned out to be a lifesaver. Why? Because when I attempted to call them they did not answer. I called back the next day and was told they would not refund me because they tried to deliver it, but no one answered the door. Yet, I never heard the knock, my dog never barked (she goes crazy when someone knocks), and I never got the confirmation that my food is on the way (that Grubhub sends when the restaurant confirms via their app that the food is out for delivery). Simply put, they tried to rip me off, which is something they apparently do to their customers on a fairly consistent basis, based on their other Yelp reviews. Luckily, sine I ordered through GH, they refunded me on their own. I am just pissed that I had included a 20% tip when I ordered. This is my only yelp review, in fact, I signed up just to post this. Customers beware!"
    },
    {
        "id": 13,
        "text": "Excellent pizza, surprising for the location. It's pretty rundown and watch out for drunk people. I recommend the honey mustard chicken pizza."
    },
    {
        "id": 14,
        "text": "Ordered for the first time a few weeks ago.  I was pleasantly surprised by the quality of the food and how delicious it was.  I ordered a pasta dish and the mozzarella sticks.  Both were hot when they arrived, the delivery driver was friendly and everything was in tact.  The mozzarella sticks did have a thick batter, but it states that on the menu.  I was sad when I found out they were closed on Sunday.  We have been ordering from Mimmo's Pizza for our pasta and while it is \"ok\" we were pleased to know that now can order for DeSandro on Main and enjoy quality fresh food.  Thanks!"
    },
    {
        "id": 15,
        "text": "Best pizza in manayunk, but they stopped delivering to my address one day out of nowhere, so now I go to couch tomato."
    },
    {
        "id": 16,
        "text": "We just got delivery from here. Got the tre-p with whole wheat pasta and chicken. The chicken never made it with the dish and the sauce may as well have been milk. We also go penne vodka with sausage... I've had better jarred sauces than this.  I get I paid $30 for the convenience of not having to make a dinner that I was more than capable of making but this was awful. We ended up eating leftovers from yesterday's dinner instead, should have done that in the first place and saved myself the money."
    },
    {
        "id": 17,
        "text": "Great quick service! I ordered on grubhub and was happily surprised at how quickly my food arrived- especially compared to other grubhub restaurants. Loved the pasta, very creamy and delicious. Will definitely be ordering again for their pizza and maybe try their milkshakes!"
    },
    {
        "id": 18,
        "text": "Good quality food at a great price and they deliver late..... Cant get any better. Oh! Did I mention they deliver milkshakes?!"
    },
    {
        "id": 19,
        "text": "Honestly would vote them less than a star. Ordered from here at 7pm for takeout. First said it would be delivered 7:50. Checked back at 7:50, delivery ETA changed to 8:20. Called at 8:30. Phone number does not work, saying cannot connect from my line, I have at&t unsure if anyone else has this problem...? Finally got ahold of someone from roommates phone, man sounded very unsure saying there was a lot of traffic, and food should be there \"in about 30..maybe... anywhere from 30-45?\" So we repeated that number back to him, he again confirmed. Called back at 9:15. Man answered saying \"look we've just started your food, it's real busy on the roads (side note: other roommates food got delivered from other location around corner from DeSandro, it took ten minutes), should be ready in ten and it'll go out.\" So I ask again, saying it has been 2 hours. Man says there's nothing he can do the food will be there within 45 minutes. 9:40 rolls around. Still no contact. Myself and roommate drive down to store. Streets are bare, cleared of all snow traffic rain/floodwaters, it took us five minutes to drive there. We walk in to a man yelling on the phone and we ask if our food is there. He begins yelling at us saying the food went out already, refused to show us the ticket, or go back and check on the order. Still yelling that the food went out. We head back home. It's now past 10:30 and still no call from a driver, manager, anybody about any status or even that our food or order has been cancelled. These guys are rude to paying customers, and wasted our evening, not even bothering to just tell us the order has been cancelled, still unsure about that since we HAVE NOT RECEIVED IT."
    },
    {
        "id": 20,
        "text": "Ok so I grew up im NY/NJ in italian neighborhoods and i certainly know good authentic pizza and this place is joke.. The only people stupid enough or care enough to eat here are all the drunk people across the street when the bar lets out. The three times i ate their was awful. I had the chicken parm.sandwhich and there was barely any chicken. It was dry and no sauce. I went there just to order a small salad and the owner told me i cant buy a small salad unless i buy an entree. I laughed and walked out. This place seems desperate and simply does not put the care and passion in italian food. There are so many delicious places to eat in manayunk right down the street on main. Take the extra 5 minutes of walking and enjoy yourself."
    },
    {
        "id": 21,
        "text": "This place is awesome! Food is great, LEGIT ITALIAN WITH HOMEMADE SAUCES, SOUPS AND ETC! The cook is absolutely wonderful and a blast, the delivery driver is awesome also, he keeps me laughing. I've traveled from Springfield Pa  to DeSandros get a slice a few times.. The owner is a pretty decent guy also, I've seen him do something kind things for patrons everytime I've been there. Greatest thing they are open till 3 a.m. if you're ever in Manayunk or Philadelphia shoot over to DeSandros, you'll love it!"
    },
    {
        "id": 22,
        "text": "Not sure where to start with this one so I guess Ill just take you on a walk thru of my entire experience. When I called to make an order for delivery I was frustrated within the first minute, the person who was taking my order sounded like they were high and what should have been a two minute phone order was almost a 10 minute ordeal. Finally got my food and was immediately upset when I opened the box of pizza and instead of green peppers like I asked for, they were red (okay okay its just a difference in color, no biggie) but also the pizza was barely warm. Weird since I only live two blocks away. Then, my boyfriend unwrapped his italian hoagie. We specifically asked for mayo plus sweet peppers and pickles, none of those items were on the sandwich. After a bite he realized instead of genoa salami they used cold pepperoni slices (in what world do italian hoagies come with pepperoni?) At this point we were both fed up so I decides to walk down the street to get my money back. I walk into the establishment, said excuse me to the man working the front counter and asked if I could speak to a manager. Maybe five minutes later a man from the back emerges and doesnt even glance at me for more than a second but proceeds to ask the person behind me what they need. I raised my voice loud enough to be heard and asked if he was the manager and he said yes. I told him the pizza was cold and the food was all wrong and instead of immediately apologizing like you'd think any self respecting manager would he tries arguing with me about my complaints. Finally after about five minutes and multiple stares from the other customers he agree to give me a full refund of my money. Not only was I upset with who ever made the food, but I was even more upset by the way this 'manager' handled the situation. Honestly I dont want to give this place any sort of good review but Ill give them 1 star ... Only because all they are good for is a sloppy slice of pizza to get you from the bar to your home on a drunken Friday night."
    },
    {
        "id": 23,
        "text": "This place was packed last night when me and my boyfriend went to get a pie. We went around 1 ish and omg! Its was like walking in on dinner for schmucks. Pizza was good, took about 30 minutes for our food...oh but what a show. There was this drunk girl ordering food in front of us...totally holding up the line. When the counter girl asked her to move over so she could take my order, she wouldnt...the drunk girl was completely obnoxious...one of her friends had to come to the counter to tell the douche bag to sit down...\nOverall, I like this place, but sometimes it gets a little annoying when you have to deal with drunk customers"
    },
    {
        "id": 24,
        "text": "This place not only has great customer service but excellent food. They didn't have what I wanted on the menu (bacon ranch chicken cheese steak) they had no problem making what I requested and it was fantastic. also love their Brooklyn style slices! Definitely my go to pizza place in manayunk."
    },
    {
        "id": 25,
        "text": "Excellent. They're open late on weekends, so you can grab some delicious food after a night on the town. Me and a friend split an order of the most delicious chicken fingers I've ever had, and the cook even divided the order into two separate boxes. The pizza is pretty good as well. I've only ever been there at night, and the crowd is the typical drunk college kids, but just get your food to go."
    },
    {
        "id": 26,
        "text": "This place is getting the extra star because it's byo and has a patio to eat outside.  With summer just starting this place is an awesome place to grab a slice and relax alfresco with some beers.  Had the large regular pizza which is probably one of the best values on Main St.  $12.50. Okay cheese and average sauce kind of reminds me of a pizza you'd get at a rollerskating rink or batting cages.  Wings were plays though, had the inferno and they were spicy.  By far though the waffle fries were the best."
    },
    {
        "id": 27,
        "text": "I ordered food from grub hub from here. Took 2 1/2 hours to get here. Good was cold, soggy and couldn't even eat it. They refused to refund me my money. Will never do that again not eat there."
    },
    {
        "id": 28,
        "text": "Saturday night - service was absolutely awful. There was no one but me & my brother. It took 30 minutes to get our food, there's no reason why it took so long. Food is very mediocre - you can get the same quality food at wawa. Do not come here, avoid at all costs. This place does not belong in a nice place like manayunk."
    },
    {
        "id": 29,
        "text": "Only getting 4 stars because their hours suck, everytime we check the hours online it says they're open and noone answers the phone. But it's probably the best pizza I've ever eaten. The bacon chicken ranch and buffalo chicken is amazing"
    },
    {
        "id": 30,
        "text": "Came here looking for a certain to quench up my alcohol.... The pizza was cold,  and the Buffalo chicken slice was lacking chicken"
    },
    {
        "id": 31,
        "text": "I am a crafter and was doing the Manayunk arts festival and this restaurant was right across the street so I decided we would get lunch there. First off I was told they were only serving a limited menu that they had on a chalk board above the counter. So I settled for what was on the menu and ordered and paid. Then while I was sitting there waiting for my order I proceeded to watch the counter guy take orders for things not on the limited menu. I asked him about this he said \"sorry man\". Then on top of everything they got the order wrong and the food was just okay. If you are thinking of eating here I suggest you step 30-40 feet down the street to mikes. We ate there the second day on someone else's recommendation and even if it looks a little like a hole in the wall the food is great as is the service."
    },
    {
        "id": 32,
        "text": "Stopped by around 11 on the other night. The man who I assume was the owner was so arrogant I felt a bit threatened by his glare. Everyone who I was with felt the same. Myself 2 girls and a guy all dress approiate completely sober. To say the least the pizza was so bad we threw it in the trash and walked next door to the other pizza place I think Mikes."
    },
    {
        "id": 33,
        "text": "Can I give zero stars? If I could I would. Absolutely horrible customer service, rude, and impolite. Also pizza tastes like cardboard. Also takes advantage of drunk people and charges however the guy feels like. Don't go here. Don't waste your time or calories."
    },
    {
        "id": 34,
        "text": "This place is the most convenient and delicious spot in the area!! Wide variety of pizzas, wings and fries and they're open until very late hours. The best place to be in Manayunk."
    },
    {
        "id": 35,
        "text": "I ordered a caesar salad, a square white pizza and a square plain with bacon. All were delicious! Best pizza I've had from Main street in a long time since Caputo's went out of business. They have a large menu with sandwiches and other food too. Definitely try it out! It said you could order online but it wasn't working when I tried so I called to place my order and picked it up. Keep up the good work!"
    },
    {
        "id": 36,
        "text": "After a long night of dancing we were sooo hungry!!! thankfully DeSandro on Main was still open! We always make sure to stop here because of how fun the staff is. They joke with us and always make us some great pizza. The other night we were feeling hungry but healthy, so veggie pizza it was! There wasn't any pies out so they custom made us a fresh one. He loaded it up with all the veggies even though it was a few minutes till closing. They have a huge selection of seating outside and it happened to be a beautiful night. We got to enjoy our huge veggie pizza pie under the moonlight sky. Thanks DeSandro on Main we loved it!"
    },
    {
        "id": 37,
        "text": "Quality food at good prices. Nice staff. Always had a good conversation while ordering. Open late. Suggest steak and fries."
    },
    {
        "id": 38,
        "text": "Secura? Sacada? I'm not sure. But you know who I am talking about. She was very rude to regular customers and gave them  a lot of attitude. It was out of line and it made me and everyone I was with not want to go back ever.. She said she was better then the job anyway so that might be a reason why she was so rude and didn't care how she treated her customers. I am so disappointed and can't believe you have an employee like her. Everyone else was so nice except her. She acted like she was the boss. I recommend any place else besides your pizza place. FIND ANOTHER COUNTER GIRL."
    },
    {
        "id": 39,
        "text": "Worst service ever. Quoted one price over the phone, was charged incorrectly. Fought with the manager about a refund, even after we offered to send it all back & he wouldn't accept. Do not order from here!"
    },
    {
        "id": 40,
        "text": "This place was unbelievably awful. After waiting over and hour and 30 mins to get our food we were delivered dry flavorless food. The chili looked like diarrhea, the Stromboli was burnt, my canoli was sour, and fries were cold. This place should be closed down. Very disappointing and very lousy. Just like my friend Cj."
    },
    {
        "id": 41,
        "text": "Best place to order food from if you're ever in the Manayunk area. Great prices even better hours, lots of late nights where I've ordered here at midnight or 1:00 in the morning. Desandro on main is by far one of my favorite places."
    }
]