[
    {
        "id": 1,
        "text": "I have been eating their food for over 25 years and no matter what I get its always delicious. Whether its take out or eat in its the best! The best pizzas, best hoagies, and sorry Genos and the other guys, the cheese steaks ever!! American cheese!! Not that  cheese whiz barf!! And no I'm not a paid spokes model!!! Its just the best!!!"
    },
    {
        "id": 2,
        "text": "Ordered wings dry, sauce on the side & cheese Ff for pick up. Got home & pulled everything out & thought they forgot the wing sauce until I dipped my FF in thinking it was the cheese sauce. Who has yellow wing sauce???? Not good!!!! Needless to say they did forget my cheese for my FF. I called & told them. They asked if I wanted to come pick it up or put a credit...NO, I want it on my FF that I ordered. So I'm sitting here waiting for it to be delivered as my FF's get cold. Don't think I will be ordering here anytime soon.  I dislike ordering & having my order messed up & being asked if I want to go back in my car, & drive for something that was their mistake. I already drove there once!"
    },
    {
        "id": 3,
        "text": "Quality Pizza is a cool little pizza place that has a nice little seating area.  Sometimes, my mom, my daughter and I go here for dinner.  It is nothing special but it is a nice little place to go right in the neighborhood.  Everything is pretty good but my favorite thing on the menu is the Cheeseburger Hoagie.  I actually got it by mistake once and I have been getting ever since.  The gyros here are good and so are fries.  The wait staff is pretty nice and they always remember us when we come back."
    },
    {
        "id": 4,
        "text": "I'm a fan. I work in the area and wanted a decent burger and fries. I've tried another local place and was not thrilled so I gave this place a shot and they exceeded my expectations. The burger was seasoned well and the fries nice and crispy. The portion was also very large,\n\nThe lunch specials are very reasonable in price and I will definitely return."
    },
    {
        "id": 5,
        "text": "I'll never order from them again. The food is average at best and the woman who takes orders over the phone is clueless as to what customer service is."
    },
    {
        "id": 6,
        "text": "My favorite go to. Literally walking distance to my house and great service.  Buffalo chicken tenders and pepperoni Stromboli are my faves.  Their food is delish and usually cooked quickly.  Prices are very reasonable."
    },
    {
        "id": 7,
        "text": "Quality is my pizza mecca. \n\nPeriod. \n\nThey have a revolving door of waitresses, all under the age of 21 and pregnant in stretched white t-shirts. But I. Don't. Care. The service is sporadic and shitty. The music is questionable. The regulars give me the stink-eye all the time because I'm not regular enough. I. Don't. Care. \n\nThis is the best pizza I have ever put in my mouth. I cried when I moved away, because Quality is something that just can't be replicated."
    },
    {
        "id": 8,
        "text": "Terrible customer service skills. The owner/workers had an attitude from the gate they all looked tired and tried to charge me for something I didn't order. I will NEVER order from that place again and the store looked very unsanitary, the owner/workers looked like they haven't took a shower in days I would not recommend eating there at all. First time and last time. The food was disgusting YUCK!!"
    },
    {
        "id": 9,
        "text": "I ordered and Italian hoagie and the salami was bad it was brown around the edges. I did not eat it because I did not went to get sick. The delivery took over 45 minutes and I live around the corner."
    },
    {
        "id": 10,
        "text": "My 5y old is picky with pizza. But they love their ham and pineapple pizza!! Its not greasy and not too thin. It's our new spot for now."
    },
    {
        "id": 11,
        "text": "Por fin encontre un Restaurante de calidad! Llevo varias ocasiones ordenando pizza, cheeseburguer, cheesesteak, chicken cheesesteak,  y esta noche ordene una pequeña pizza hawaiana y lo único que he lamentado es haberla ordenado pequeña. .lol.. su sabor, textura y presentacion wow excelente, adicional a esto lamento no haber ordenado un extra chicken cheesesteak para mi. El personal de la toma de orden y el servicio de delivery son muy atentos y responsables en cumplir con las expectativas del cliente. Los precios son justos. Realmente si son lo mejor de Philly!\nGracias por sus servicios."
    },
    {
        "id": 12,
        "text": "We used to order from Quality Pizza all of the time but the quality of service and food got so bad, I wont order from them again.  When you call, you talk to young arrogant girls that have attitudes and wont help you."
    },
    {
        "id": 13,
        "text": "Very disappointed with the 1 1/2 hr wait for delivery.  When the food came it was cold.  Spoke with the owner and she was very rude.  Very poor customer service.  They don't have any clue how customer service should be handle in situations like this."
    },
    {
        "id": 14,
        "text": "Clean and reasonably priced.  Waitress staff a bit to be desired - slow.  But good food nonetheless."
    },
    {
        "id": 15,
        "text": "My go to pizza place in this area! Bomb buffalo chicken pizza! And they have non pork meat toppings! Always quick! Always satisfied!"
    },
    {
        "id": 16,
        "text": "Poor communication. We ordered nearly two hours ago. No show. No call. It's now 11pm. Ugh. I'd be pissed if I didn't originally anticipate on cooking anyway. To bad there are plenty of other locally owned businesses we could be supporting. Besides the pizza has been hit or miss lately. Smh"
    },
    {
        "id": 17,
        "text": "My food took more then a hour to arrive during lunch on a weekday arrived super cold. Not to mention I ordered a cheeseburger platter and it had what seemed to be old lettuce. I was a regular here until I was told they have new owners NEVER AGAIN WILL I CALL HERE!"
    },
    {
        "id": 18,
        "text": "Ok so we have been ordering from here for a few months now one bad experience so far consisted of are food not arriving until an hour and a half later unfortunately I had to work and didn't want cold food so I turned it down we did give it another chance as the weight Pizza there is typically on point will continue giving them a chance"
    },
    {
        "id": 19,
        "text": "the worse pizza place in history of pizza places. and no i'm not playing. the owner, chinese lady, is a horrible person. she needs to go to a program or some form of training for some customer service skills. besides the poor service, they serve expired food and old food from earlier in the day. disgusting!!!!!!! do not order from this place."
    },
    {
        "id": 20,
        "text": "The food is below average for northeast Philadelphia pizza shops. They regularly mess up orders and when you eat in they bring your food on cheap paper plates. As a kid I loved coming to Quality but now as an adult I realize the the service and quality is terrible. They should seriously change their name."
    }
]