[
    {
        "id": 1,
        "text": "Was there to use a coupon, and wanted to try some of the unusual things on the menu. When I got there it was a tacky hole-in-the-wall with one rickety table and chair. They didn't have several oI f the items I wanted to try, and it took forever to make what I finally did order. The cheesesteak I got was the worst I've had in a long time. Don't bother, and definitely don't be swayed by the printed menu."
    },
    {
        "id": 2,
        "text": "Food was pretty good. We got the Fusion Appetizer, which was tasty, but not nearly as big as they had made it seem. Reckoned it would serve 4 people. Ended up working well for us both, with a bit leftover. \n\nWould definitely try again. This is a takeout/delivery only place."
    },
    {
        "id": 3,
        "text": "Second time I've had food from here. The first time the salad was atrociously bad - wilted lettuce and vegetables that tasted like they were several weeks old.  My friend had their special cheesteak and really liked it, but the fact that it took an hour later than usual, it wasn't worth it.\n\nNow today, tried to order some falafel because I had a hankering for it...\n\nAnd they never showed up. Period.\n\nContacted them about it and they were like \"yep we don't know.\"\n\nNice. So then we contacted Grubhub about it, and they had to speak with the guy. Apparently what happened was that they didn't have a DRIVER IN AT ALL TO DELIVER THE FOOD and NEVER SAID ANYTHING ABOUT IT.\n\nThe only good thing about it all is that we got $15 for our troubles (from Grubhub, not Fusion.) Will not be ordering again."
    },
    {
        "id": 4,
        "text": "The delivery guy took forever and when I got my food half the order was all wrong. The pizza isn't half bad wasn't worth the wait through"
    },
    {
        "id": 5,
        "text": "My son and I were there to pick up take up food on a Friday night.  The staff was friendly and helped us understand the menu.  We both like Indian food and were interested in trying their creative spin on two different tastes.  I had the chicken tikka with white rice and pita bread.  Very strong and spicy as the chef said, but it was excellent.  My son had a buffalo chicken quesadilla and enjoyed it as well.  I will gladly put it in my rotation of menus for me and my staff."
    },
    {
        "id": 6,
        "text": "Pizza is really good, so are the cheese fries... Delivery was fast... Will def order from them again."
    }
]