[
    {
        "id": 1,
        "text": "I was very surprised by how delicious the food was at this place. I got the squid ink pasta special and it was excellent! I definitely will be coming back. The service was excellent and the portions were big. The only bad part is that I think that they are getting a liquor license and I would much rather it stay a BYOB."
    },
    {
        "id": 2,
        "text": "Four of us ate here. Small portions. Veal was chewy and most not edible. Pasta with crab had 4 tiny pieces. Apparently it is run by Russians mow, not Italians like before.\nDisappointing\n3 stars for byob feature"
    },
    {
        "id": 3,
        "text": "Very good Italian food, standard selection and similar to the Philadelphia Italian restaurant scene, well done and well prepared and enjoyable. \n\nWe came just after it transitioned from the old La Buca to the new Buca D'Oro which I believe is under completely new ownership. Service was great, food was excellent, and at the time we came it was BYOB because they were waiting for their liquor license.\n\nThe interior decor is unchanged from the previous iteration, which I think had not changed in many decades, sort of like 1970s faux grotto / suburban basement rec room. It could use a little refreshing, would be my suggestion.  The diners seemed to be a range of normal people from young to old, and didn't seem to be filled with the old-time Philadelphia mafia lawyers that used to hang out there at the bar. \n\nGood luck to the new owners with the new start!"
    },
    {
        "id": 4,
        "text": "Had been dining at La Buca for 45 years.  Great food, service.  Having re-opened with a new menu and new name, it's pared down the menu to basic southern Italian-American fare.  Started off with the Trio of Mushrooms.  Really nice.  Mussels\nand Clams were garlicky and delicious.  The Dover Sole was terrific.  I had a simple side of capellini with their tasty gravy.  (Yeah, I'm from South Philly).  I will continue on with another 45 years of dining at Buca d'Oro!  P.S.  BYOB as of today."
    },
    {
        "id": 5,
        "text": "Super convenient, very nice service, delicious food. Been a couple of times, and it's my favorite Italian restaurant in the neighborhood. It's a treat to have such a good restaurant nearby and not too expensive. Food is very fresh. Wish I could still eat squid, because the fried calamari looks so good and lots of people order it. Don't miss hearing the specials. They're often hard to resist."
    }
]