[
    {
        "id": 1,
        "text": "The worst experience I've ever had at a restaurant, and I have eaten out a lot. At first, we were impressed by our server's friendliness and attentiveness. He helped us select our wine, and gave us samples before pouring our glasses. But then, it went all downhill from there. The server did not return to our table for at least 30 mins. We put in our order, which was just simple paninis. You'd like that would be a quick order. Time ticks by. And by. And by. We didn't get our food til nearly an hour later. And what arrived what paltry, to say the least. Literally, two slices of prosciutto, a bit of lettuce, and some cheese on bread. When we finally were able to get our server's attention again, we told him with unabashed honestly how we felt. Apparently, there were problems in the kitchen and our server had to spend time cooking. But, there were also other staff around. It made no sense that his time had to be so compromised. He told us dinner is on him. We left him a few bucks for the wine, and left. We will not be back there anytime soon. And I don't expect Di Vino to last even that long."
    },
    {
        "id": 2,
        "text": "Perfect for a low key happy hour.  Bar staff was super attentive and sweet.  They made sure we ordered up another round before HH ended- gotta love that!  $3 beers and $4 wine.  What a find.\n\nWe were here just for pre-dinner drinks, but part of me wanted to stay as soon as I got a whiff of some white truffle oil on a beautiful pizza that sailed by our table.\n\nRandom note: bathroom was super clean- germaphobics rejoice!"
    },
    {
        "id": 3,
        "text": "I came to DiVino wine bar, just south of Rittenhouse square on 19th street, with my kickball team after a game.  We had a large party, more than 10 of us, and the restaurant was very accomodating.  We sat in the back and enjoyed the mellow ambience.  The owner was very kind and came over to explain some additions to the menu as well as his vision for the restaurant.  Apparently, as has been noted in other reviews, DiVino will soon be changing to Cichetteria 19, focused on traditional Italian small plates.\n\nNow to the nitty gritty:  My girlfriend and I shared one of their pizzas and it was very good.  The crust was thin and crispy with good flavor, and the arugala and prosciutto were perfect toppings.  I was able to steal a few bites of the soup of the day from one of my friends.  It was a roasted garlic soup with squid, the broth was rich and hearty and the soup was satisfying.  One of my friends had the burger, served with 3 types of mushrooms and sweet gorgonzola.  He immediately declared it the best burger in Philadelphia, which means a lot coming from him since he has tried almost every joint in town and did not expect his current favorite to be dethroned.  \n\nThe wine list is impressive and definitely has something for every budget.  I can't wait to come back for happy hour, 5-7 every day with select wines and appetizers for only 5 bucks.  Looking forward to seeing the direction this place takes."
    },
    {
        "id": 4,
        "text": "I went here last night and I was very pleased. The happy hour prices were reasonable and the pizza was heavenly. I have never felt so welcome to a place before. Upon entering the bartender warmly welcomed us. The hostess seeing we were less than please with the large table suggested a smaller table at the back that was more intimate. The bartender and manager greeted us at the smaller table telling us that they were going to change the furniture for a more rustic feel. Several staff members checked on us through out our visit making my friends and I feel very much attended to. The food smells as good as it tastes. I would defiantly return."
    },
    {
        "id": 5,
        "text": "My friend and I had dinner and drinks here on Saturday night and we were less than impressed. It seems flatbread pizza is their staple; unfortunately, we didn't order any. We did order a risotto dish (Italian enough). What we thought was going to come out served in a creamy fashion, ended up coming out in two enormous fried balls. Even though it wasn't what we were expecting, the presentation was enticing enough. The consensus? The balls were mediocre at best.\n\nThe restaurant is small and intimate, but the intimate setting turns awkward when the music stops and it feels like everyone seated near you is listening in on your conversation. This happened a few times. \n\nOn the plus, our waitress was attentive and offered to let us taste the wine before committing. The 2 reds we picked were fantastic. The final bill seemed pretty reasonable too. So, I'd say this place is alright as long as you're not looking for anything earth-shaking."
    },
    {
        "id": 6,
        "text": "Went tonight and had an amazing night.  The food was excellent and the wine was great as well.  I actually went to my iphone app for yelp and looked around me and found this place.  I read a few reviews about how great it was and then two about it not being great.  I went with the majority and was pleasantly surprised.  The owner is true Italian and is not keeping the name or the menu the same.  He just took over and is revamping this place to be even better then the great place it is.  I started with the mussels and then had spaghetti and clams.  Finally we finished with the Margherita pizza which was off the recommendation of all of the reviews.  Overall the meal was great.  I wish I had room for the Nutella Pizza dessert because it looked amazing.  Just way too big for my little bit of room in my stomach.  I am thankful of each of you that reviewed this place as it was a pleasure to dine there.  I will update the site when the name changes and hope to dine here again soon.\n\nDivino is now renamed as Cichetteria"
    },
    {
        "id": 7,
        "text": "Went here for a friends birthday. The place was very accomodating to the fact that we started with three guests and soon turned into around 11. Wines were wonderful, but be careful with their suggestions as they might not take into account your budget. Prices were very reasonable and you can definitely find a great bottle within your range. Food was great, simpl flatbread pizza, perfect for a night wine drinking! \n\nI've also heard they have a great happy hour on Thursdays from 4-7 where all of the opened bottles of wine go for $4 a glass. Definitely worth it!"
    },
    {
        "id": 8,
        "text": "All I can say is heavenly.  I was not disappointed by any dish on the menu, which are all less than $20.  The lamb and tuna tartare stood out as my favorites.  The chocolate mouse dessert is decadent.  Don't even get me started on the cheese plate.  I could eat that for the rest of my life.\n\nAlso, the selection of wine is amazing.  It also helps that the semmalier is quite cute and very knowledgeable!\n\nVery romantic setting with a piano player on the weekends."
    },
    {
        "id": 9,
        "text": "Meh. I loved the place when it was Masimo's Valentino. Loved it. Now, it does have really great pizza. Flatbread. And it has a wine list. I just don't get the vibe of a place that used to have exquisite food being turned into a pizza and wine place. How does that figure?\n\nI guess if people want to pay $13 for a short pour of wine, it's fine. As fas as I can say, it is a good place to carry out pizzas. That's all I'll be doing."
    },
    {
        "id": 10,
        "text": "Last Thursday I ate at Di Vino for the second time this summer. I heard they had a great new chef - and what I heard was right. The food was fabulous, and what's best is that a full meal with wine didn't deplete me of the small amount of money I have to spend on treats such as eating out. \n\nThe wine selection is also great, and the bartender was extremely knowledgeable. After studying and traveling in Italy several times, I've been looking for a place in Philly that feels like Italy, and this is it!\n\nI also learned that they'll do customized menu's for large parties if you call ahead. I'll definitely be back again, and again."
    }
]