[
    {
        "id": 1,
        "text": "I've recently moved to the Olde Kensington neighborhood, and G.P. (aka Germantown Pizza) has always been solid. Fast, delivers, cheap, and delicious - perfect back up plan when you're not feeling in the mood to cook. Also, the guys here are extremely nice!\n\nThe only drawback is that they close at 10p on a sunday. Otherwise, they're usually open until 11p!"
    },
    {
        "id": 2,
        "text": "Multiple experiences with this place, has been off and on. Sometimes the pizza is just eh and sometimes it's really good, highly recommend getting it done crispy. Cheesesteak are big and to order. Not the best pizza for sure but definitely a good local spot to stop at now and then 3-4 stars"
    },
    {
        "id": 3,
        "text": "You know what, I had expected worse.  I gazed at the first slice, unremarkable with a champagne tinged crust.  Took a bite and the pizza fought back!  What I mean by this is the way well-formed dough stretches and refuses to be pulled apart.  Good pizza dough, with its high gluten content, is formed by constantly stretching its protein matrix so that it gives you that satisfying chew.  I was pleasantly surprised by this, and Germantown shall land on my call-back list for pizza.\n\nHowever, they don't open until 2pm on Sunday.  Football starts at 1pm, guys."
    },
    {
        "id": 4,
        "text": "this is where i get pizza when i'm drunk. never order anything but a plain cheese pizza, even extra cheese is really bad idea."
    },
    {
        "id": 5,
        "text": "Germantown Pizza is great if you just want a cheap slice.  It is greasy and the ingredients are nothing special, but for a slice of pizza for a buck fifty you can't expect anything out of this world.\nAlso I ordered a whole pie here once and would never do it again...If I remember correctly they make the dough for their slices differently from their whole pies.  I don't understand this, and it has been awhile, but this is how i remember it."
    },
    {
        "id": 6,
        "text": "The price is great, and everyone is really friendly. Best neighborhood pizza around!"
    },
    {
        "id": 7,
        "text": "This pizza is gross. El Greco is better if, like me,you prefer a New York style slice. This place uses low quality ingredients and the outcome is lackluster. The first time my husband and I have actually thrown away leftover pizza."
    },
    {
        "id": 8,
        "text": "I ordered a large veggie pizza which was around $16.  The crust was great and there wasn't too much sauce.  There were tons of veggies!  The cheese was pretty greasy, but I guess that's just cheese.  Called for delivery and it was here within 15 minutes.  I do only live about three blocks away though.  The was friendly and nice.  I will definitely order from there again."
    },
    {
        "id": 9,
        "text": "I like Germantown pizza.  It's probably my favorite regional pizza place in the city.  It easily beats out El Greco (four blocks away, here http://www.yelp.com/biz/el-greco-pizza-and-luncheonette-philadelphia) and maintains a lead over Kristina's (a block or two further, here http://www.yelp.com/biz/kristina-pizza-philadelphia).  It doesn't really compare with Rustica (seven blocks away), but that's Northern Liberties - a vastly different landscape than the three competitors I'm considering here.\n\nSo anyway, it's the neighborhood best - the neighborhood, here, being the American Ave Industrial area.  A fine feat, no doubt.\n\nOne of Germantown's best features is its location.  Germantown makes a great corner with 4th St., and Germantown Pizza occupies its acutest corner.  They use their narrow lot well - a small shop with a long, slender parking lot in front.  The parking lot was the first thing that I noticed about Germantown Pizza.  They've painted the lot with a palm tree and some funny lettering, and it's a sign of the kind of attitude I have whenever I eat there.\n\nThe pizza is good.  It has a fluffy but crispy crust, a balanced sauce, and good not-too-gooey cheese.  It's thinner, more flavorful and less stratified than El Greco, and has a crust that isn't as crackery as Kristina's.  It's flavorful, fulfilling and inexpensive.  Fantastic.\n\nPlus the crowd - the neighborhood - is great.  The employees are friendly and quick, and the clientèle is diverse and interesting.  The block is cool.  At Germantown and Jefferson is an Islamic primary school which is clean and well detailed, with an active yard.  At Germantown and Oxford is the beautiful (and badly neglected) Gretz brewery.  And 4th St. is a block that is sunny and alive.  The whole scene is a pleasure to experience.  \n\nAs I said, I like Germantown Pizza.  Going there is a treat."
    },
    {
        "id": 10,
        "text": "You really cant go wrong with Germantown Pizza. \n\nPretty much ALL of their Pizza is great, any topping, any size, you can't lose.\nBurgers are great too and they have pretty good fries.\n\nThey do, however, have average wings. Personally, I order my wings from only 1 place in the whole city (Key Pizza). But yeah, their wings are definitely okay, but not great.\n\nFriendly service, pretty quick delivery times (except for those Friday & Saturday nights, but hey, everyone takes a little longer on those nights),  GREAT pizza, yeah I order from this place about twice a week.\n\nEat there"
    },
    {
        "id": 11,
        "text": "Pizza good. Delivery reasonable. Grilled chicken salad ok. Turkey burger disgusting. I don't know what brand turkey burgers they use but its horrible."
    },
    {
        "id": 12,
        "text": "I figured I should write an updated review.  The last couple times I've ordered from here, the pizza hasn't been so great.  Also, anything other than pizza seems to be rather pricey for what you get.  I ordered a garden salad and it was mostly iceburg lettuce(which is bland and tasteless), a ton of onions(which i'm not a fan of in large quantities) a few black olives, a couple slices of green pepper and a chuck of a tomato.  The dressing average.  I think the large pizza and a salad was around $25.  If i wanted to spend that much I would have gotten something from Rustica or 2nd Street.  I haven't ordered from Germantown Pizza since and probably won't for awhile."
    },
    {
        "id": 13,
        "text": "Worst eggplant parm ever. Has anyone had this dish with no cheese on it. disgusting. Waste of money. Learned my lesson"
    },
    {
        "id": 14,
        "text": "This place has saved me when I was overcome by:\na) The Munchies\nb) Overpriced 'brick-oven' style gentifying pizza hostpots\nc) Long, tiring days at work. \n\nThey deliver, they're yummy, and their cheesesteak rivals that of Jim's."
    },
    {
        "id": 15,
        "text": "Worst pizza place in the neighborhood.  Ordered a salad, they sent the wrong dressing. That's fine. They delivered the right one. Open the salad, the lettuce was clearly not washed, there was dirt all over it and was very wilted. No green peppers. The egg on it smelled funny and was greenish. The lettuce on the gyro was filthy. And they gave us ceasar dressing for the wings instead of blue cheese. Seriously Dont waste your money. $30 for a wilted salad and some dry ass wings"
    },
    {
        "id": 16,
        "text": "The best cost effective pizza place in my area by far, can never go wrong with the special, 2 pies and a 2-liter for $17! They also have all kinds of assorted food stuffs for every taste...i'm from NY so I am a bit picky about my pizza, but over the last 6 years in Philly it has grown on me! Rustica is also good but a bit pricey to eat on a regular basis....\n\n(Autumn E. is out of her mind!)"
    },
    {
        "id": 17,
        "text": "We got the white sauce pizza and the Cheesesteak. The pizza was okay I wouldn't order it again though. The cheesesteak was really good, they add mayonnaise to it. I would definitely get that again."
    },
    {
        "id": 18,
        "text": "Good food for a cheap price.  Friendly people work there.  You couldn't really ask for more from a neighborhood pizza place.  Thanks G-Town!"
    },
    {
        "id": 19,
        "text": "Germantown pizza wins the award for the worse pizza in Philadelphia.\n\nI've tried the place several times, each time hoping maybe it'll be better. It never is. \n\nI think everything I've ever ordered off this menu is gross, and they take forever to deliver."
    },
    {
        "id": 20,
        "text": "Germantown is just fantastic. I've been ordering from them pretty consistently for the past three years, and sometimes my friends will find some new biddy to get their cheeses off, but those passions will fade. And fade they should. Because Germantown is the Marge to your Homer. The Lois to your Hal. Or the Lois to your Peter. The Peggy to your Hank. It will always be there, and it will always be what you need.\nSo please, do your soul a favor and order from this reliable pizzeria. It's not the best in the world, but it's consistent. And isn't that worth something?"
    },
    {
        "id": 21,
        "text": "Would not order from here again. When they answered the phone I got handed off to two different people before someone finally took my order. Food arrived in normal amount of time, but the large pizza looked more like a medium and the order of 10 wings was TINY and served with some celery in a baggie that was curled up because it was probably cut a week ago and just sitting in water. \n\nFor $27 for a tasteless undersized pizza and some tiny wings I will choose literally any other pizza spot in Philly next time before this place."
    }
]