[
    {
        "id": 1,
        "text": "My coworker steered me into a cab to go to this hole in the wall on Ritner.  There's no way I'd brave the narrow, car-lined streets to drive here either so you're already in about $18 for a cab ride if you're not a native and stay at a hotel near the airport.  The hoagies (wasn't really clear on what a hoagie was either before my visit here) are so over the top good that you may want to base your hotel choice on its proximity to this place so you're not subjected to hotel restaurant mediocrity and spend every last penny of your food budget on the good stuff.  Cacia's Bakery next door will seal that decision if you visit both shops like we did.  This is the first Primo and the friendly staff are obviously proud of that.  Locals flock here and really the sandwiches will sell themselves to anyone who goes here once.  The bread is soft but hearty enough to take the fixings.  I got a Bada Bing which was so tasty I almost cried I hadn't thought to buy the full sized one as I ate it on the plane home.  Despite frantic Yelp searches I haven't found a single shop in the greater Seattle area that can touch this franchise."
    },
    {
        "id": 2,
        "text": "Top flight establishment. That's all that needs to be said. Italian Hoagies and the other deli fair are some of the best in the city. Not much can beat their diablo sandwiches. The bread makes this place truly special. They serve a great seeded, thick Italian roll\n\nPrimo is a local chain. So you can't go wrong at any of the locations. \n\nPrices are reasonable for the quality you receive!"
    },
    {
        "id": 3,
        "text": "This is the original location of Primo's Hoagies! When you come here you can expect that old school South Philly hospitality. It's a tiny, no frills take out only corner shop selling really tasty hoagies (not subs for those out of towners). I actually think this particular location is the best out of all that we've tasted. \n\nWhat makes Primos hoagies so delicious is the perfectly crispy, toasted original Primo's Brand rolls. It's all in the roll if you ask me. \n\nIf you're not sure what to order, you can't go wrong with a classic Italian. Hubs go-to is the 'Chicken Diablo' and I prefer 'Nonna's Veggie'. It's absolutely incredible! Breaded eggplant, roasted red peppers and broccoli rabe with sharp provolone. They will leave it off if you're dairy-free and I feel even then, it doesn't miss a beat. \n\nThe sammies are reasonably priced and ready fairly quickly although there's definitely a steady lunch crowd around noon or so. Heading here at a slightly off time is your best bet especially for a legal parking spot also! Don't you dare block the street! \n\nKnocking off a star for their hours. They close at 4pm or whenever they run out of rolls. I can definitely appreciate them wanting to keep the rolls fresh but there have been many a times when we wanted to grab and easy dinner from here and it was impossible. That inconvenience is a total bummer. We would probably order from here a lot more often if their hours were more conducive to our schedule."
    },
    {
        "id": 4,
        "text": "I order lunch from this primo's about once a week.  The sandwiches are consistently fantastic and the service is always great too! Because of them I won't even look at a wawa hoagie anymore."
    },
    {
        "id": 5,
        "text": "Obviously, they have very good sandwiches. But try the sides, too. I had the tortellini parmesan and its was great."
    },
    {
        "id": 6,
        "text": "So good! Second time I have eaten Primos from this, the original location, and they do not disappoint! Last time I had the Italian, this time the Suprimo. While I definitely prefer the flavor-loaded Italian, both were excellent and filled me up just right! We called ahead today, and I particularly appreciated them double-checking with us that we were coming to that location--I can only imagine how many people call the wrong location of a chain to place an order! I'll be back soon- and Happy hoagie day!"
    },
    {
        "id": 7,
        "text": "Not much to say. Best Hoagie in the USA!! Friendly and professional staff. This is the original location and I still think it's better than the rest."
    },
    {
        "id": 8,
        "text": "I'm from north nj and I alway swore we had the best pizza and subs.  I am officially changing that to hoagies.  I had the most amazing turkey and american cheese in my whole life today.  The bread was extremely fresh. There was alot of meat the perfect amount of lettuce n onions and the hoagie wasnt drenched or vinegar and mayo it was just right.  I will definately be ordering from here atleast once a week this made me happy!!!"
    },
    {
        "id": 9,
        "text": ". I always call and order before I go, or you may wait 10-20 minutes depending on the current demand. It's never a ridiculous wait, and always quite worth it in the end. The staff is always sweet in my experience, and will always drop the \"babe,\" \"hon,\" and \"sweetie\" so common of most of us South Philly Italians. Overall a great place for a quick, super satisfying meal.\n\nPrimo is a local chain. So you can't go wrong at any of the locations. \n\nPrices are reasonable for the quality you receive!"
    },
    {
        "id": 10,
        "text": "Finally made it to the OG South Philly location and it was the exactly how you'd imagine it; quaint and totally S Philly'esque. \n\nI had the Tuna Diavlo, per Billy's recommendation. He also told me that my sammich is owner's favorite, so I was even more satisfied with my selection.\n\nMatic had the Corned Beef hoagie with all the fixins, cause that's his go-to.\n\nNow for the taste: AMAZING PER USUAL. \n\nThe staff is super friendly and helpful, the bread, meats, and condiments super fresh, tasty, and generous. We are Def coming back."
    },
    {
        "id": 11,
        "text": "i ate at the Primo's in Mt Laurel NJ today. this was my first time eating at any Primos. The roll was tougher than leather. i think i pulled a muscle in my jaw trying to chew that unpalatable thing. the meat was glazy from sitting in the heat too long.  I have eaten Hoagies all over the delaware valley and believe it or not, I ate a better sandwich in all of them. I have even eaten a better HOAGIE (not sub) in Illinois. I will never put myself through that again!"
    },
    {
        "id": 12,
        "text": "Primo's is absolutely delicious. The bread is always fresh, and every hoagie is packed with quality ingredients. I always call and order before I go, or you may wait 10-20 minutes depending on the current demand. It's never a ridiculous wait, and always quite worth it in the end. The staff is always sweet in my experience, and will always drop the \"babe,\" \"hon,\" and \"sweetie\" so common of most of us South Philly Italians. Overall a great place for a quick, super satisfying meal."
    },
    {
        "id": 13,
        "text": "The legends of Primo Hoagies are true! It really is out of this world! You can get a variety of primo sized hoagies for around 6-8 bux, and they're just amazing! The bread is very fresh, and the meat is plentiful and awesome! To get a memorable experience with a hoagie, head over to Primo Hoagies!"
    },
    {
        "id": 14,
        "text": "Just thinking about these hoagies makes me want to get on a plane. I am so sad that I live all the way in Dallas now and it will be a while before I am able to get another Bada Bing-chicken cutlet with broccoli rabe and cheese. YUMMY and my other favorite is the Primo-Prosciutto and fresh sliced mozzarella balls and roasted red peppers. Get the largest size you can, eat as much as you can before you start to fell uncomfortable and then put it in the fridge. Let it age a few hours (if you can resist) and you will find it gets better with time. \nThe entertainment part is when you go in and listen to the banter between co-workers and customers. Just about everyone is a regular and if your not you are still called \"honey\" or \"darling\".  I always felt like I was a stranger who snuck into someones house and was listening outside of their kitchen to family hour. That's what gives this place it's fifth star, it's as real as it gets and with everything homogenized these days it's so refreshing to see, hear and smell. \nParking can be a battle but no one will mind if you triple park and you are in and out so quick you really don't get tied up. Oh, and try going on a Sunday when the eagles are playing, just so you can walk through the neighborhood and listen to the game on every ones TV."
    },
    {
        "id": 15,
        "text": "Costly at nearly 10 dollars a piece. However it is well worth the money. Once you have a primo hoagie you will not want to go anywhere else."
    },
    {
        "id": 16,
        "text": "I would give this a 5 but delivery is rough. I have always picked up which seems the way to go. I called at like 1120am and got my two sandwiches at 1250pm. I snapped on the delivery guy but he was right, its a Promos problem. DO NOT GET IT DELIVERED IF YOU CAN HELP IT."
    },
    {
        "id": 17,
        "text": "Haven't been here since I moved back to south philly. While the rolls seem a little thinner, the ingredients are second to none, and taste great. My neighbors who swear by Primos always told me how fast the service was and they were absolutely right. \n\nPrice wise they are slightly higher than what I'm used to paying but well worth it. They have a great menu of traditional subs and even a section on the lighter side."
    },
    {
        "id": 18,
        "text": "The food was fine, but the delivery service is quite unprofessional. We ordered lunch delivered twice in one week; the first time it was 45 minutes late, the second time was over an hour.  When I called to inquire each time, I was told sorry it's on its way, and that was it. When I called again they said that they had really big orders come in that day so they were backed up, but gave no real estimated time. If that's the case, it's imperative for a business like that to let you know when your lunch is going to be an hour late, especially if you're entertaining business guests from out of town. Twice we had guests waiting for food for a very long time. \n\nIt's just extremely unreliable, and very unhelpful delivery service. If you like the food, great, but I would suggest never ordering delivery from them."
    },
    {
        "id": 19,
        "text": "I now know what the perfect hoagie tastes like thanks to this place. Old School Italian is as good as it gets."
    },
    {
        "id": 20,
        "text": "I had the old Italian hoagie and the pasta salad. I give the hoagie a 3.5 and the pasta a 3.0. The staff was friendly and the service was prompt."
    },
    {
        "id": 21,
        "text": "This place is great. It feels like a small, family-owned neighborhood business. I expected their customer service to totally suck, but the girl working there was super nice.\n\nThe hoagies are pretty good. And although the bread is delicious, I think the hoagies are a little too bready if you know what I mean and mine was a little on the dry side. But the upside to that is if you don't finish yours in one sitting you can easily go back and eat some more without it being all gross and soggy.\n\nOf course, this was my first time there and I made the mistake of ordering a whole hoagie. This thing is enormous--seriously it's like three hoagies in one. I normally have an embarassing appetite and it was too much for me.\n\nOne star removed for the breadiness and the fact that I called my order in, went 45 minutes later and still had to wait for my order."
    },
    {
        "id": 22,
        "text": "I was barely scraping by when I lived a few blocks from this Primo's, so I could only afford to splurge on a monstrous Primo's hoagie once or twice a month. But man, it's no exaggeration to say that they make the best sandwich I've ever eaten. If you're vegetarian, don't be deterred by the meaty offerings (which I hear are quite delicious) -- allow the Veggie Diablo with everything to astound you.\n\nIt was at this location that an old man recommended I call ahead and pick up an hour later to really let the oil soak in. That might sound gross, but it's making me salivate as I type this five years later. Primo, I love you forever."
    },
    {
        "id": 23,
        "text": "Today was our first day traveling to Primo to get a hoagie...we have each had them at catered events, but never ordered our own. We decided to split a Nonna's Veggie (Primo size). While we were a bit surprised at how long it took (we called ahead and we were the only ones in the shop), the sandwich was good. The bread was perfect, as expected, and the broccoli rabe added great flavor. I wouldn't say it's the best sandwich I've ever eaten, and I think my fiance liked it even more than I did. But I would definitely go back, especially to try one of the meaty sandwiches. And for $7 and change, 2 people were quite satisfied for a meal!"
    },
    {
        "id": 24,
        "text": "Favorite Primo location! Always fresh, fast and delicious!!! I'm a big fan of the Audiablo! The only downfall to this location is the 4pm closing."
    },
    {
        "id": 25,
        "text": "Worth the hype. I don't think there's a bad sandwich in this place. Great service, great conversation, and food that you'll return for. I'd suggest order 3 of the smaller sandwiches vs one big sandwich. Going back tomorrow for lunch tomorrow."
    },
    {
        "id": 26,
        "text": "For a little corner South Philly store, you wouldn't expect people to be as nice as these people!  Super nice people work here.   The sandwiches are ALWAYS awesome.  The only negative thing i have to say is that they do not carry Coke products, only Pepsi.. :("
    },
    {
        "id": 27,
        "text": "Primo Hoagies has the best hoagie in south Philly easily. Quality of the bread and meat can't be beat. If you're looking for the world's best, freshest hoagie. This is the place."
    },
    {
        "id": 28,
        "text": "Always fresh and the best! Wonderful staff that is always there like a family! I wished they had later hours but I make there or just wait until the next day. I ate from here during my entire pregnancy and never had an issue. I now bring my children (toddlers) and they love it too!"
    },
    {
        "id": 29,
        "text": "I dream of Primo Hoagies all the way in Sunny South FL. I'm not supposed to eat Gluten, but a Celiac Attack is so worth it. Primo Hoagies oozes South Philly. They're family owned, everyone is nice and the Hoagies are extremely delicious. It's a sandwich shop, you can't eat in here. I also think they close early, like before dinner."
    },
    {
        "id": 30,
        "text": "Omg the hoagies....delish. They are now on grub hub so u can get delivery!!! I absolutely die for their Italian hoagie, but the roast beef or turkey schwartzie is my JAM. Perf amount of meat, cole slaw and maybe slightly too much russian dressing - ask for light dressing if you prefer. Never disappoints, great pickles and chips avail if you're crazy like me and like putting chips on your hoagie!!!"
    },
    {
        "id": 31,
        "text": "I just wrote a review to Primo's website and realized that it would probably do them better if I posted on a website that customers frequent. I am so happy with the customer service I've received at the Ritner location that I had to share the accolades. I work for a large company in the navy yard and I am responsible for ordering lunch for our clients and executive personnel. Every time I call for a delivery order, Michelle responds with kindness and professionalism, with food to match that kind of excellence. For catering orders, we love to use Primo's because their Veggie Nonnas are outstanding for our vegetarians and then of course the roast beef is perfectly rare, the italians are fresh- everyone is happy! Please use them - other restaurants in the area sometimes sound like they're being inconvenienced when I call to place large orders but Primo's always expresses gratitude. Thankful to work with them :)"
    },
    {
        "id": 32,
        "text": "Best hoagies in town by far sometimes you might bump into local celebs/politcals takeout only. Selections are many more than expected great sides as well. Never a bad experience and I've been going there for years."
    },
    {
        "id": 33,
        "text": "Regular hoagies r the best,but beware of cheesesteak hoagies they r light on meat filling"
    },
    {
        "id": 34,
        "text": "We ordered tonight through Grubhub and we received an email saying that they were too busy to complete our order and canceled it. No phone call or anything. We will not be ordering from them again! You should not either!! This is for the Harleysville, PA Primos."
    },
    {
        "id": 35,
        "text": "I grew up in the neighborhood and go home to visit.  The ingredients are super fresh.  Food is so tasty.  Portions are generous and the prices are quite reasonable.  Some say the bread makes the sandwich and Primos uses the best bread."
    },
    {
        "id": 36,
        "text": "I love making sandwiches at home. Not to toot my own horn but I make a pretty damn good sandwich, however Primo's sandwiches are probably the best I ever had. When I first moved to Philly 3 months ago, I thought I would be enjoying the great cheesteaks, but Primo's has been the biggest surprise of all. \n\nI am starting to go once a week.\n\nThe best part of this place is this family who owns it. They are always prompt, courteous and probably the friendliest group of people I have ever met.\n\nEdit: my personal favorite is the Chicken Diablo... I actually get the Whole sub... this is not for people who cant handle spicy. I am asian and love spicy food and i have to say this is really spicy..."
    },
    {
        "id": 37,
        "text": "Horrible service and super expensive. I was waiting 25 minutes for a turkey & swiss sandwich. on top of it, the staff were dealing with a customer service issue while I was sitting and waiting patiently as my sandwiches sat on the counter. First and last time going there. RT 70 Marlton, NJ locatio."
    },
    {
        "id": 38,
        "text": "They have VERY unprofessional employees working at this particular location. I am extremely dissatisfied  with the service I received when I placed my last order here.I will be taking my business elsewhere for now on because they don't deserve it!"
    },
    {
        "id": 39,
        "text": "We did curbside pickup. My sandwich was not what I ordered. The other sandwich we ordered had pickles on the sandwich rather then on the side. There were no sides of pickles which we both ordred. There was so little turkey I cut the roll in half and put all the guts on one half of the roll. Not going back!"
    },
    {
        "id": 40,
        "text": "I arrived as they were closing but they still took my order. The italian hoagie is amazingly delicious. The bread is fresh, crunchy on the outside and chewy in the inside. The prosciutto, the hot capicola, the salami and the provolone are a match made in heaven. Great staff. I would definitely come back."
    },
    {
        "id": 41,
        "text": "Place is very disappointing anymore, staff is rude along with the old man who delivers very rude....every time you order I guarantee they mess the order up!"
    },
    {
        "id": 42,
        "text": "Primo's Hoagies is a chain of sandwich shops that originated here on Ritner st I love their Hoagies!! They start with the great seeded Sarcone Roll, Italian meats and Cheeses and fresh lettuce, tomato's and onion and their sandwiches are constructed very neatly so that you get a taste of everything in each bite. I like how they have Cheese, Pepperoni, and Olives for sale there to nosh on."
    },
    {
        "id": 43,
        "text": "I've been going to Primo's Hoagies for many many many years now probably since they've been open and you bring the location up in Bensalem PA before I moved in the Philadelphia I want in your tonight to get dinner yeah once in a while they get my food wrong and sometimes I may not be 100% clear where I forgot but I have not called the store in almost 3 years and complaining about anything I get chicken parm sandwich is there a lot I have some put lettuce tomato and onion on it and no sauce in the last couple years every time I come home not every time but when I come home sometimes there's sauce on there I asked him not to put spices on my sandwiches tonight when I was making my order I said to them I wanted to check in parm sandwich with lettuce tomato and onion on it and it didn't matter what kind of cheese donor spoke up and also he said don't put no red sauce on there he likes buffalo on the side well when I got home the sandwich was 100% wrong which was not a big deal but when I called they are which I feel that you have really awesome food there the owner was not nice hung up on me they offer me 10% off will my next sandwich than the off me 20% off after complaining a little bit then he said okay what will give you a free sandwich at that time my nerves were shot and I was overwhelmed and Ida said freak it are you just want to bring the sandwiches back to get my money back was it just wasn't worth it so I am running back over there and I am dropping the sandwiches off at the front door and leaving them near and I will never return there I am out 40 some dollars because prices went up what's the when I open the buffalo sauce it didn't smell or seem like the regular buffalo sauce I usually get there unless they didn't tell me that they might have changed their brands I'm on 100% sure it was fine last week when I was there and I'm not just saying this to complain I'm being honest I'm a long-term customers are for many years and I can't believe I just got treated the way I got treated at and I have enough going on my mind there's too much stuff going on in this world to be treated like crap and have the owner Tommy I always give the wrong order which I admit sometimes I don't give everything a hundred percent right that's why I had not called they are in the last three years and said anything about anything every time I get a turkey Hoagie there's always spices on there salt or whatever I asked him not to put it on it I don't want to call there and complain last time I got a chicken parm sandwich I guess for lettuce tomato and onion on it I did not call and complain and this time I felt you know what if it's going to cost me $47 out for three sandwiches especially when molds for a friend of mine I was going to say something about it this time I will never return to this location ever again they do make really great Hoagies don't get me wrong but how I was treated and how it has me shaking inside and they need to teach her staff to listen to a little bit more and maybe thinks we get done better I understand there's so much going on in the world right now I understand prices are going up and stuff like that I didn't mind paying the extra money I just kind of question is why so much 40 some dollars for 3 sandwich which I feel they owe me my money back and I will head to an email and email the head corporation on this one I thought the owner was very rude why you hanging up on me otherwise he's always been awesome to me and I feel horrible right now cuz I really like the guy and that really sucks I feel like I was treated like crap I understanding if I was treated a little bit different or if they would have said hey this brings if it would have been earlier I would have just brought the sandwich back and have them fix that but they were closing soon but I didn't need to be treated the way I was treated at that was the worst experience I ever had it any kind of restaurant or anything or any kind of sandwich plays if you could find something in there that I explain to you in the last 3 years I like you to show it to me because I have not as many times you got my sandwiches wrong I'm not said a bad word or anything I've always been nice polite and even tipped really upset with the owner for treating me that way like I said I will never return to this location never again and I will make it known to my friends and everybody that goes there I think was wrong and I think I owe an apology to me and my money back"
    }
]