[
    {
        "id": 1,
        "text": "O Sole Mio is a great addition to the neighborhood! We were welcomed by the friendliest owner who accommodated us with high chairs for the kids and cold waters on the hot day. Not a ton of seating options, but it worked perfectly for us to park our stroller right next to the outdoor tables. They also brought us a basket of bread just to help keep our kids occupied. We ordered the Caprese salad, buffalo margarita pizza, and the pesto pizza. They were so good and IMO better than some of the \"trendier\" options close by. I am rooting for this place to do well bc we will definitely be back!"
    },
    {
        "id": 2,
        "text": "Great pizza! We had the Diavolo and Arugula and Prosciutto, both were excellent! Friendly wait staff, great casual addition to the neighborhood."
    },
    {
        "id": 3,
        "text": "Delicious pizza! The crust was excellent and truly authentic.  We also had the tortellini with blush sauce, the sauce was a perfect balance of cream and tomato. Great neighborhood spot!"
    },
    {
        "id": 4,
        "text": "So happy to have this great new pizza spot in the area. The little balcony has a great view if you eat in. Service was great, very quick. Pizza was delicious and unique from other pizza places in the are, this pizza is more like traditional Italian pizza. Also recommend the burratta salad!"
    },
    {
        "id": 5,
        "text": "Delicious pizza and food overall was great (Rosa sauce, bread, salad!) Can't wait to go back. BYO as well."
    },
    {
        "id": 6,
        "text": "This is in our neighborhood and we had a lovely experience last night. Walked up and sat outside on a balmy summer evening. Pizza was excellent and the service outstanding. Everything is made by hand and the crust and sauce were perfect! We will definitely be back. Next time with a bottle of red wine in hand. It's a BYO."
    },
    {
        "id": 7,
        "text": "1st time in Philly from Jersey and I must say this place is nothing but amazing. The staff is amazingly great and very attentive. I came with my kids and they were very patient and very nice with them. The food was everything we expected and more, everything freshly done. You can bring your own bottle of wine. They even offer beer if that's your choice of drink.  When I'm back up here in Philly I will make it a priority to come in and eat again.. It was the best choice we made on our trip.."
    },
    {
        "id": 8,
        "text": "Yummy salads, bread, and pizza. BYOB. Very family friendly with high chairs available. We ate downstairs where there is a bigger dining area. Good service. Great addition to the Queen Village restaurant scene - definitely coming back soon!"
    },
    {
        "id": 9,
        "text": "The Spicy Diavolo Pizza is amaaaaazing! The honey on it is genius! The owner is very friendly. Everything is made fresh to order and made super fast. Outdoor and indoor seating."
    },
    {
        "id": 10,
        "text": "After reading the very positive reviews, I was excited to check out O Sole Mio. The pizza is just ok--didn't exactly taste like it came out of a wood fired oven and prices are comparable to much better spots like Nomad and Stella. I know the place is new so I understand that the restaurant is nervous. We even let go of the fact that they screwed up both our drink and pizza order. But honestly, the wait staff needs to relax. Too much hovering and asking how we liked everything. I felt like they were part of our dinner after a while. It's incredibly annoying to feel like every bite and every move is being watched. I wished they'd pay more attention to pizza quality and order accuracy instead of nervously hovering over patrons."
    },
    {
        "id": 11,
        "text": "Loved this place! Was staying at a friends around the corner and about 3 minutes to closing we called to see if we could come pick up a pie. Sure, no problem, come on in! The guys working there were so friendly and the pizza was done in a giffy. We had the margarita with cherry tomatoes added. It was so delicious, hands down one of the best I had while we were on the east coast between Philly, NJ and NYC."
    },
    {
        "id": 12,
        "text": "My daughter and son-in-law just moved to Queen Village and we got two pizzas from O Sole Mio today- a Margarita and a Prosciutto and Onion.  They both were delicious!  The owner was the cashier and pizza maker and he was so nice.  It was very clean inside, although we took the pies home to devour them!  If you like thin crusted brick over pizza, I highly suggest you try O Sole Mio!"
    },
    {
        "id": 13,
        "text": "We love the pizza, especially the broccoli rabe  with sausage!  Great place for midweek take out when you don't feel like cooking."
    },
    {
        "id": 14,
        "text": "The pizza here is absolutely delicious! So glad we finally tried this place. Great addition to the neighborhood."
    },
    {
        "id": 15,
        "text": "Absolutely amazing, the diavola pizza with honey was to die for! Great addition to south philly. Incredible customer service and efficiency!"
    },
    {
        "id": 16,
        "text": "Maybe different to dine in however, we ordered two pizzas delivered. The pizza came hot, except it was so soggy and the cheese was completely off the pizza and in a big glob in the corner of the box. Basically it was naked pizza by the time it arrived to our house. Had higher hopes, but next time I'll try to dine in. No more delivery from here that's for sure."
    },
    {
        "id": 17,
        "text": "Perfect pies, friendly staff. My favorite of the many pizza jawns in the neighborhood!"
    },
    {
        "id": 18,
        "text": "Really good pizza!! Friendly staff and a lovely addition to the neighborhood. They also deliver now."
    },
    {
        "id": 19,
        "text": "Amazing pizza. Some of the best in Philly. Simple, great ingredients and great service!"
    },
    {
        "id": 20,
        "text": "What a great beginning for the last full weekend of the summer. To begin with, the service from this family run restaurant is fantastic. They kept checking if anything was needed. The pizzas are delicioso."
    },
    {
        "id": 21,
        "text": "My husband and I have eaten here and taken out a few times so I think it is fair now to say that we've had enough experiences to leave a great review, without a shadow of a doubt! The first time we went was around the time they had officially opened - brought our bottle of wine and ate outside - it was great! The owner was super friendly, explained their intentions as a new establishment and recommended a few specialities form the menu, which we agreed to... have to shout out the Spicy Diavolo was sooooo good! What a unique blend of flavors with the sweet honey, spicy soppressata, spices like oregano and pepper flakes and then that sauce  For dessert, he recommended the tiramisu, his mom's recipe, and of course it was delicious, too! Since then we have taken out or ggotten delivery a few timesand everything has been consistently great. We have stuck to their brick oven pizza, so far, because they do it right. Tonight I asked for it to be well done and I did not regret that crispy crust! Definitely give them a try so we can hold onto this gem neighborhood for good!"
    },
    {
        "id": 22,
        "text": "Top notch hospitality and food that makes you joyful. I have been here five times in the past two months and will be a regular! The folks that work here really make you feel like you're part of the family.\n\nI tried the eggplant, pizza, tortollini, and ravioli. All are amazing and the pistachio cake was lovely. The homemade bread sets the tone and I could eat it everyday.\n\nThis is my first yelp review, and I'm not usually a fan of taking the time to rate things, but I really feel compelled to highlight this place. I have owned a small ice cream shop in the past, and I know it's tough to be in low foot traffic areas. I wanted to make sure people discovered this gem."
    },
    {
        "id": 23,
        "text": "Food is fine, delivery was late and incorrect and I wasn't credited by the restaurant for their mistakes."
    },
    {
        "id": 24,
        "text": "Best pizza around! We just moved here 6 months ago and have yet to find quality pizza until walking into O Sole Mio on a whim. Their pizza is fresh and made to order. The owner even made a buffalo chicken Stromboli for us even though it wasn't on the menu. The family that owns this business is extremely considerate and service is wonderful. We will be back! \n\nThank you for the warm welcome to the neighborhood!"
    },
    {
        "id": 25,
        "text": "Manja Manja! Food makes the world go round, but Italians make it worth the trip! Bravo to chef Salvatore, who changes the concept of the corner pizzeria. \n\nO Sole Mio is within walking distance to Fabric Row, South Street in Historic Queen Village. \n\nThe Napoli style brick oven pizza made me feel as if I traveled to Italy. \n\nThis restaurant deserves 5+ stars and is worth the trip."
    },
    {
        "id": 26,
        "text": "We ate there for the first time last night.  The food was excellent.  At our servers recommendation, we split a Ceasar salad, a margharita and also a pesto pizza, followed by lemon gelati. The service was attentive without being too much.  They even have a frequent guest punch card.  We will definitely be going back."
    },
    {
        "id": 27,
        "text": "A great neighborhood place - not just for pizza, but for the pasta dish specials they have! We get takeout from there often and the pasta and pizza have never disappointed us. Highly recommended!"
    },
    {
        "id": 28,
        "text": "I am not sure which I like more the pizza or the people but needless to say they are both wonderful. Our entire family really enjoys there pizza. They use great fresh ingredients made the traditional way. Very nice family from Naples."
    },
    {
        "id": 29,
        "text": "So I was in the mood for chicken parmigiana, after looking on yelp I came across O Sole Mio.  I called in and asked to substitute the penne pasta with ravioli, and the obliged (slight up charge). When waiting for food the chef asked if I'd like a slice of Nutella pizza, and obviously I said \"yes\". Not only was that very nice of him but it was amazing!!! Great dough, Nutella, bananas and walnuts. After driving home (about 25 mins) my food was still piping hot. 6 huge ravioli topped with mozzarella, and 4 whole pieces of delicious chicken parmigiana. It also came a very fresh side Caesar salad.  I definitely give this place 5 stars. \n\nAlthough I didn't eat in, I will in the future, place is nicely decorated and has beautiful Italian music playing."
    },
    {
        "id": 30,
        "text": "Took my wife and 2 young kids here last night. Our usually stop is Stella but this is definitely right up there with it and is truly an Italian old school authentic experience. Plus it is a BYOB and prices are low. Pizza was great, ravioli delicious , meatballs were homemade, and the dessert and coffee was .  Definitely be back!!"
    },
    {
        "id": 31,
        "text": "Just a walk away, I ordered takeout since I was craving pizza. The place is a small corner building and the order was ready quickly. There's a counter space as well as a couple tables in the back. Service was super nice, and I was in and out in a jiffy. \n\nI got the small spicy diavolo pizza, which was perfect for a person and half or one super hungry person. Although the sopressata wasn't super spicy there was small kick to it. They were generous with the meat and the honey which is a super interesting combination. \n\nI downed the pie real quick, but I do wish they cooked the pizza a tiny bit more. I love the burnt bubbles of pizza and the slight crispness to crusts and this one didn't really have that. Although this is wood fired, it didn't really taste like wood fired pizza. \n\nThey told me they're releasing a new menu so I'll be on the look for it and maybe give them a repeat."
    },
    {
        "id": 32,
        "text": "Delicious. Great people. Consistent. \nNice addition to the corner that already has a neighborhood dive bar and a Greek seafood restaurant."
    },
    {
        "id": 33,
        "text": "Grabbed dinner here before a show at the TLA. It's in the heart of the neighborhood at 3rd and Catherine. We came for the pizza, but they also have paninis, several pasta specials, dessert and espresso/cappuccino. The pies are personal size, but filling. The bottom of the pie is Neapolitan- thin with a wonderfully doughy, outer crust. The log-fired brick open produces pizza in 5 minutes with a nice char. My daughter really liked her margherita and she's picky about them. I had a the parma and burrata with basil, cherry tomatoes and Black olives. Delicious! Our server made us feel right at home. 2 pies, 2 cokes and a cappuccino came to $40. Great option if you want to escape the chaos of South Street."
    },
    {
        "id": 34,
        "text": "There have been several failed eateries in this spot over the years, but the curse may finally be broken with O Sole Mio who offers homemade Italian meals, along with gelati and espresso imported from Italy. I tried a margerita style pizza to see if the sauce and crust lived up to the homemade hype and found they did not disappoint. The crust in particular had the perfect balance of airiness and crunch from the brick oven bake. The sauce could have been more flavorful, but the fresh basil and burrata toppings picked up the slack to deliver a very tasty bite. I will be back to sample more menu items, but this was a promising start!"
    },
    {
        "id": 35,
        "text": "We decided to try someplace new for dinner. I've heard good things about this place online so we decided to place an order. There were two of us and we decided to order the Chicken Milanese, the Italian hoagie and a Pepperoni pizza. \n\nWe both really enjoyed the Chicken Milanese. We weren't sure if it was going to be an entree or sandwich. We received the entree and it came with a side Caesar salad and piece of garlic bread. We split this and were both sad when it was all gone!\n\nThe Italian hoagie wasn't bad. I felt like it was a bit dry and was missing something. I can't say that I would order this again because I've had better ones other places. \n\nWe really liked the pizza. The crust was soft and flavorful. I wish it came in 18 inch size. We pepperoni was food and it wasn't overly greasy. \n\nOverall we were pleased with our meal and would order from here again."
    },
    {
        "id": 36,
        "text": "I highly recommend!! The family/ownership is lovely and EVERYTHING I have had is delicious, high quality, and very reasonably priced! Our favorites are the margharita and the buffalo chicken pizzas."
    },
    {
        "id": 37,
        "text": "We were feeling Italian food, and decided on trying out O Sole Mio. We were pleasantly surprised! Fresh oven-baked bread was brought to our table almost immediately after we sat down, with olive oil and parmesan cheese. The quality of this bread was incredible - I would come back just to eat unlimited bread. We brought our own wine to go with our pizzas, so talking while they prepared our pizzas in the restaurant was very pleasant. Our waitress had helpful recommendations as well, if the long list of pizzas available leaves you in a paradox-of-choice situation. \n\nThe pizzas came out very quickly, and they were pretty good. The Marguerita: the person who ordered this had already eaten dinner, but still managed to eat half of their pizza. The Capricciosa: good, tastes just like what you get in Italy and with generous toppings. The Mimosa: excellent, it's a great mix of toppings, with a white sauce that doesn't overtake the taste of the cheese but just adds a creamy flavor. \n\nHands down, our new favorite pizza spot in the Queen Village area. We'll be coming back!"
    },
    {
        "id": 38,
        "text": "Had a phenomenal dinner with my wife, and in laws. Food was outrageous, and Sal and his family were wonderful people.\nCant suggest this place any stronger. Do your taste buds a favor, get to this place!"
    },
    {
        "id": 39,
        "text": "Purty durn tasty prosciutto & arugula. I forgive them being out of soda due to holiday rush. Delivery was timely and the delivery woman was Philly funny. I'd do it again, even at $33 fir a 12 inch & a bottle of Perrier."
    },
    {
        "id": 40,
        "text": "The best brick oven pizza in town!  Their dinners are fabulous.  All made fresh.  The staff is friendly and attentive.   Great food, great service, great family-owned and operated restaurant.   Nonna's tiramisu is out of this world!"
    },
    {
        "id": 41,
        "text": "Another OUTSTANDING meal!  Sal & his family have a great restaurant in O Sole Mio.  They are all great hosts, they make you feel like family.  And the food!!!!!  The food is outstanding!  Authentic Italian cuisine.   We've had everything from the salads to the pizza to the chicken, meatballs, eggplant and desserts!  Sal and his family never disappoint. My family & friends love O Sole Mio!"
    },
    {
        "id": 42,
        "text": "Oh my.... oh Mi oh My.  This is my 1st time trying this place and I grub hub'd it.  It took like an hour and some change.. so I didn't expect the pizza to be quite as good.  Boy was I wrong.  I ordered the Spicy Diavolo pizza (14\").  That spice with that honey is Ri-got-damn-diculous!  I literally ate half of this in under 10 min.  I had to force myself to put it away just so I can have it again later..\nI can only imagine how good this is right out the oven..\nThis place is now ON THE LIST and I am anxious to go there in person and try other items.\n\nBRAVO"
    },
    {
        "id": 43,
        "text": "Really enjoyed the Spicy Diavolo pizza, and the Margherita was also solid. Try the wings! We live in the neighborhood so we called to order for pickup, and it was quick and easy!"
    },
    {
        "id": 44,
        "text": "I was on a business trip in Philadelphia and wanted to try a local restaurant.  If you want to experience great Italian food in a small, casual atmosphere, you've got to try O Sole Mio!  The service was excellent!  The owner even came to our table to greet us and gave us a little history about his restaurant.  I will definitely visit his place again.  He wanted me to remind you that he is closed on Mondays.  Just a short Uber ride (10 minutes) outside town."
    },
    {
        "id": 45,
        "text": "Go for the food, but stay for the people/service.  My wife, daughter and I stopped by to try this pizza place since it is new to the neighborhood.  We were blown away by the gravy they used on their red pies (get the diavalo) and the overall service.  Our servers and the owners were constantly checking in on us making sure we had everything we need.  \n\nPizza review- Crust is thin and chewy and is better than what you get at Nomad.  Gravy was sweet, but complimented the heat of the hot soppressata.  \n\nDessert- get the lemon water ice and thank me later.  The ice makes John's look pedestrian!\n\nHighly recommend this place for an afternoon or early dinner spot to sit outside and enjoy a glass of wine before it gets too crowded and touristy!"
    },
    {
        "id": 46,
        "text": "It was my first time ordering from this place and I was thoroughly impressed with the pizza. I ordered the Spicy Diavolo and the Nomma tomato pie. This is the best pizza I've had in Philly. I will be ordering from here a lot!"
    },
    {
        "id": 47,
        "text": "Ordered take out on a weeknight. Pizza was amazing! Ready in about 5-10 minutes and reasonably prized. Glad they are in my neighborhood can't want to go back."
    },
    {
        "id": 48,
        "text": "FINALLY tried this place, its literally right around the corner from my house...I don't know what's wrong with me. \nMy boyfriend and I got take out a pizza and a caesar salad. Pizza was excellent but the caesar was a little confusing..more of a runny dressing than a creamy one. I've just never had a caesar like that..no big deal, I'll get the house salad next time. Can't wait to go back and actually dine in."
    },
    {
        "id": 49,
        "text": "The BEST brick oven pizza in Philly! Haven't had pizza this good since I was in Napoli! Very friendly family-owned, amazing homemade bread and BYO!"
    },
    {
        "id": 50,
        "text": "After having pizza in Naples, Italy, no other pizza lives up to the hype...that is until I discovered O Sole Mio.  We've only done take out, but I can't wait to dine in and experience the service everyone keeps raving about.  The crust is so good, fluffy and fresh making you want to eat every last bite of the crust.  Also tried the eggplant Florentine, which was also delicious.  The Rosa sauce is so flavorful I couldn't help eat it with a spoon once I finished all the eggplant.  The crust is a little droopy, but that's how it's supposed to be if it's authentic Napoli pizza!  So happy to have this place in Philly!"
    },
    {
        "id": 51,
        "text": "Great pizza, breads crust and wonderful toppings. House salad was delicious as we the gnocchi!"
    },
    {
        "id": 52,
        "text": "This place has quickly become my boyfriend and I's go to pizza place. We're pretty obsessed with their Spicy Diavolo and their Parma Burrata pizzas and have been ordering them almost weekly at this point. Every time we order I mean to take a picture to add to my reviews, but I can never resist just diving in to the beautiful pies and devouring them! I've also had the Caprese Salad in the past and it was great as well. Overall: SO delicious--and O Sole Mio is clearly a family owned business which I always love supporting! Highly recommend!"
    },
    {
        "id": 53,
        "text": "Very pricey for what we ended up receiving. $18 for 3 small \"stuffed\" mushrooms? The scallops and linguine were very disappointing, scallops were the size of nickels and had a taste taste that threw off everything. \n\nThey also didn't inform my table there was an up charge to pay with a card. There were times me an my date went 20 minutes without our waitress even interacting with us.  I'm usually not a harsh critic but this wasn't their best, very very very disappointing Vday meal to say the least."
    },
    {
        "id": 54,
        "text": "This is the kind of pizza I would drive all over town for, trying to find the best slice...whether: capofitto (RIP), Stella, Vetri, pizza brain, etc. I No longer have to do this since this place opened up in my neighborhood!! Yay!! So long other pizza places. I don't need you. \nAnd the service is hands down AMAZING! The owner is so sweet and accommodating. \nI really enjoyed this pizza. It was exactly what I wanted and the service was beyond outstanding. \nIt was New Year's day and pretty much everything was closed. By the time we had some time to ourselves after my sister's kids were asleep we realized we all still needed to eat dinner for adults and too tired to cook. \n3 minutes to closing, we hoped beyond all hope that they would take our silly little pizza order. He was SO happy to stay and make one more pizza and said to come by in 5 minutes. I apparently didn't know how to order my sister's favorite pizza and so as we got there my sister was in full blown panic that there wasn't tomato sauce on it. Well the owner again said no problem as he was just preparing our pizza dough and so we got exactly what both my sister and I wanted. \nThe wood fired brick oven was exactly the blazing temperature to get the pie perfectly flash fired for the perfect crust. The sauce was amazing and the cherry tomatoes on the margarita pizza popped and exploded. Delicious fresh mozza and basil. \nMan that was the perfect pizza.\nI've never been so happy to meet someone who loves to stay open on a holiday to feed the neighborhood and has amazing pizza."
    },
    {
        "id": 55,
        "text": "Father is the owner and chef ! the daughter was serving us. She was great and super sweet. Did great recommendations. Bread with olive oil is to die for ! He makes it with pizza dough! I bought one to go! Pasta pescatore was also great. Only great things to say !  But bear across the street because it is BYOB. I will bring my bottle of wine next time. I really want to try the white pizzas with ricotta, burrata and prosciutto....will love to come back."
    },
    {
        "id": 56,
        "text": "Got a special, Pesto gnocchi, for an app and it killed.  Then pizza diablo, pesto pizza and white sausage for main dishes.  All superb but the spicy diablo pizza is now my favorite pizza in all of Philly.  And the staff/ service might have even been better than the food.  Made my daughters first experience with pizza a great one.  Will be back for sure."
    },
    {
        "id": 57,
        "text": "With so many small businesses shuttered from the economic effects of the pandemic, it is great to see that family- owned and operated O Sole Mio is still open and serving tasty, authentic Italian classics. Tonight's order of Lasagne and Caprese Salad were as good as ever- a perfectly seasoned, light, and fresh meal that satiates the appetite and warms the soul. Its so easy to get simple foods wrong, but not at O Sole Mio. They treat their recipes with respect and understand the secret to a great meal is using fresh ingredients and bringing the best out of the food with a light touch, not covering it up in grease, sauce, or heavy-handed techniques. Bon Apetito!"
    },
    {
        "id": 58,
        "text": "The food (fresh homemade bread, homemade crust, sauce, etc.) were amazing. Only thing better than the food was the service. Can't wait to come back and try the other types of pies. BYOB too!"
    },
    {
        "id": 59,
        "text": "Excellent food and service \nHad the Burrata pizza , it was perfect from the crust to the burrata\n\nIf your in the area you gotta try them"
    },
    {
        "id": 60,
        "text": "Perfect pies, friendly staff. My favorite of the many pizza jawns in the neighborhood!"
    },
    {
        "id": 61,
        "text": "We decided to try O Sole Mio for my birthday! Everything we ordered was amazing! We will definitely be ordering from here again !"
    },
    {
        "id": 62,
        "text": "The search for a great Neapolitan pizza has finally come to an end! This is the place to be! Ordered first time through Grubhub and loved it! Come again for the 2nd time and it was even better.\n\nI have tried a lot of other pizzerias - Vetri, Nomad, Beddia, Pietro's, Santucci's... but O Sole Mio has the best Margherita pie: soft, thin but fluffy crust; amazing tomato sauce - most places the tomato sauce is too acidic. Every components of O Sole Mio's pizza tastes so fresh! Service is friendly. \n\nThis place deserves more recognition!"
    },
    {
        "id": 63,
        "text": "Great pizza for great prices. One of my favorite South Philly spots. Super friendly staff makes it a good spot to dine at."
    },
    {
        "id": 64,
        "text": "We had lunch here and everything was very good, I had white pizza with arugula and prosciutto, delicious. My wife had tHe eggplant parm, very good also and my son who is very difficult to please had the shrimp Alfredo & he enjoyed it. The pasta was al dente and sauces were  tasty. Service was very friendly."
    },
    {
        "id": 65,
        "text": "We just had a 5th birthday party for my oldest child here. The staff was gracious (despite VERY challenging guests- a group with many young kids, toddlers and babies) and the food was delicious and arrived quickly. They allowed us to bring our own cupcakes and the entire staff sang Happy Birthday to our son. Very, very glad to have them in the neighborhood!"
    },
    {
        "id": 66,
        "text": "Ordered a white pizza tonight on seamless/grubhub. The Pizza taste excellent. Great texture and flavors. The crust was also delicious. Looking forward to ordering other dishes off the menu."
    },
    {
        "id": 67,
        "text": "Full disclosure, we've never dined in here but we definitely won't order delivery again. The pizza had to be put in the oven as it was barely warm, let alone hot. The eggplant Florentine looked great but it tasted like fish. Maybe they used old oil at some point, I'm not sure, but I couldn't get even halfway through it. Salad was fine."
    },
    {
        "id": 68,
        "text": "This dinner was so good! I went with a group of friends from college and we all got different dishes. Everything was honestly so good, and the group that I came with was impressed. The server we had was incredible and even got one of my friends an appetizer salad despite not getting one as a result of his dinner. I got the eggplant rolantino which was veryyy good. I loved the flavor, and my friend thoroughly enjoyed the capalleni Bolognese."
    },
    {
        "id": 69,
        "text": "The pizzas at O Sole Mio are absolutely delicious from the dough to the ingredients. This is our new favourite place in QV!"
    },
    {
        "id": 70,
        "text": "Really a first class place. Between the delivery driver and hotel receptionist I did not get notified of my delivery so by the time I finally got my pizza it was cold. They called me To make sure I found it and when the gal heard it was cold, offered to replaced my pizza. I had another hot pizza in about 20 minutes and it was well worth the wait. Very fresh toppings, excellent tasting crust with the right amount of texture, and it was baked very well. I will definitely be ordering from O Sole Mio again."
    },
    {
        "id": 71,
        "text": "My extreme love of pizza and yelp reviews brought me to O Sole Mio. We walked in on a Tuesday evening to an empty restaurant we were greeted very promptly by the pizzaiolo and I assume owner. We were sat downstairs Italian music played in the background, offered up a simple menu of pizza and salads with a couple of specials. We ordered a buffalo Margherita pizza and the special tortellini in rosé sauce. Pizza was excellently cooked with a crispy thin darkened crust, fresh basil, and a delicate red sauce. Tortellini itself was absolutely delicious and left me wanting more. I have definitely found my new pizza place and recommend all pizza lovers to give it a try."
    },
    {
        "id": 72,
        "text": "When they asked me what I wanted, I looked over the counter, and kinda made up an entree, with Penne, Rosa sauce, and a couple of shingles of eggplant.  They put that all together, and made it to go.\n\nWhile I might deserve some credit for the combination, the flavors were spectacular.  The eggplant was perfect, and could be eaten by itself.  The sauce was rich and creamy, and had the perfect blend of spices, herbs, and some meat.\n\nThey haven't named the entree after me yet, but now that you know the ingredients, you can put your own name on it.  Sal is a great guy, and works really hard to provide an excellent experience for all of his guests."
    },
    {
        "id": 73,
        "text": "Good food. Really fresh. Really authentic.  Waiting lines are long.  Call and reserve before you come."
    },
    {
        "id": 74,
        "text": "We chose O Sole Mio because it was BYOB and because it had decent reviews. But when I walked into a pretty understated restaurant (with about 3 tables total), I wasn't really sure what to expect. \n\nWell, it turns out we made the right choice because our dinner at O Sole was a wonderful experience from start to finish. Our waitress was friendly and playful. And WOW. She almost immediately brought us this irresistibly soft, warm bread with a side of olive oil, herbs, and cheese. We could not get enough of this stuff. \n\nTo eat, we ordered three pizzas - the margarita, capriccioso, and the mimosa. (There are two categories to choose from: red pizzas and white ones!) Pizzas came out quickly and were delicious. They are probably the closest thing you can get to actual pizza from Italy - woodfired with thin crust that's soft in the middle and crispy on the outside. \n\nPro-tip, don't forget to check-in ;)"
    },
    {
        "id": 75,
        "text": "I initially ordered from here when they had there 2 large pizza special. One plain and other with onions. The pizza was great. Thin crust, thin slices of red onion. I ordered again tonight and I got the smaller pizza. the crust was a bit thicker, the red onions were thicker and sautéed! I have never seen that in my life. Was not good.  the pizza tasted different and we did not like.  Underwhelmed. Also ordered a prosciutto sandwich and they gave me a chicken cutlet with little meat and tons of broccoli rabe and cheese. I am not a fan but we tried and was greasy and way too much broccoli rabe. I contacted Slice immediately about wrong order and hopefully I will get reimbursed. I am on the fence about ordering again.\n\nFollowup.  I told them I do not want the sandwich anymore and the pizza place is sending someone out to deliver it anyway ! Now I will not reorder from them."
    },
    {
        "id": 76,
        "text": "Ok so I've been to Italy.... and this place has GOOD PASTA! Came with a Caesar salad that was also great. I had the shrimp scampi-- it was a mix between a white sauce and red. It was amazing. I ate every last bit. Great meal-- will totally be coming back here."
    },
    {
        "id": 77,
        "text": "Great place for dinner in this covid world. Took the family here for pizza and pasta.  The pizza crust is amazing! We had white and red pizza and both were good.  They allowed us to switch a few items which i loved.  The owner was very nice and asked us where we came from.\nThe only negative was that they charged an extra fee for using a card which i don't appreciate for businesses to do but will not count towards my review"
    },
    {
        "id": 78,
        "text": "The pizza and Italian specialties from O Sole Mio are delicious, as are the canolis. Our orders have always been ready on time, and you can get a three course dinner for two for less than $60. We've never had a less than great meal from O Sole Mio."
    },
    {
        "id": 79,
        "text": "Was looking for some Italian takeout Saturday night and had seen this place months prior when dining outdoors at Mari BYO, now closed (sad face emoji). \n\nThey've got literally everything, which can be a tad overwhelming: wood-fired pizzas and wings, hoagies, strombolis and calzones, pasta, chicken, seafood, sides, apps, etc. \n\nBF got the wood-fired BBQ wings and the Mimosa Pizza (ham, corn, basil) and I got the Linguine Pescatore in white butter sauce, which comes with mussels, clams and shrimp, and a side Caesar salad.\n\nOverall, everything was tasty (the mussels were my favorite!) but nothing stood out as fantastic, especially since the similar pescatore dish at Mari is still one of my favorite bang-for-your-buck meals in the city and is so light and delicate. The seafood was plentiful and fresh, but the broth was way salty.\n\nThe pizza had interesting toppings/flavor combinations, but was VERY thin/floppy (even for Napoli style) and also only 14\" as the largest size, and at approx. $18 I'm not sure it was worth it. BF did say his wings were excellent. If portions were a bit larger perhaps I would order again, but there's a million other Italian joints to try.\n\nStaff was very friendly, though."
    },
    {
        "id": 80,
        "text": "The service over the phone was awkward. I had missing toppings on my pizza. The pepperocini arrostoti con bufala mozzarella appetizer was all mangled and sloppy.The girl who took the order told the delivery driver I was paying cash tip. Put me in an awkward situation."
    },
    {
        "id": 81,
        "text": "I came here because I wanted to try their brick-oven. I made a reservation with google, it's so easy.\n\nI asked for indoor seating and got seated near the balcony with a nice view of the street. Our seating is also next to the kitchen who had Latino music being played. I felt like I was in a Mexican restaurant instead of at an Italian restaurant. \n\nThey served warm bread which used the same dough as the pizza. So delicious with the olive oil dipping.\n\nAppetizer: bruschetta. The bread was nicely toasted with generous chunks of tomatoes drizzled with balsamic vinegar. Highly recommended.\n\nI ordered salad with seafood. I was expecting a dinner size salad but it was served in a small bowl. It's quite expensive for $18.\n\nEggplant pizza: the crust is doughy in my opinion. Good stretch and chewiness but lack of some crispness of the crust.\n\nTiramisu is quite delicious, I enjoyed the lady fingers soaked with the espresso."
    },
    {
        "id": 82,
        "text": "This restaurant does not require their food suppliers to wear masks.\nThey do not care about your health.\nDo not buy from this restaurant. They put your life at risk."
    },
    {
        "id": 83,
        "text": "We had an amazing dinner for 7 people at o sole mio! Everything we ordered was delicious and our server was so friendly .  You can buy bottles of wine across the street from their \"wine on tap\" and bring them over at no charge. We had an amazing experience.  Try this place !"
    },
    {
        "id": 84,
        "text": "Great neighborhood spot.  Pizza is very good and they have a good assortment of other entrees.  More expensive than Little Italy but worth the extra price"
    },
    {
        "id": 85,
        "text": "My boyfriend and I were visiting from out of state, my brother and his wife who live here. They both have heard good things about the restaurant but had not stopped in yet until tonight. They're sold and we'll be coming back next time we visit! It's BYOB.. (I have never seen that before so I was caught off thinking it was a funny but it really is bring your own beer!) We were sat downstairs in quaint little area, the lighting was a little dark but overall not bad. Our server was BRAND new I believe it was her first night and she did so amazing! She had not tried anything on the menu yet, we appreciated her honesty, but she knew all the ingredients and information about the food either everything we asked her. She was very tentative to our table and we got an extra order of their bread with oil/vinegar...it's hard to have one serving it's way too good. We ordered three pizzas; cheese, a sweet type (it had honey on it), then one with kalomata olives and pepperoni I believe. (I'm sorry I don't remember the names of the pizzas!) but the one with honey was the best and I highly recommend it. The chef then came out with a 4th pizza, he said that he had overcooked our cheese pizza so he remade us one. We didn't even say anything or expect them to do that, we were still eating it anyway. The service was so nice, it was very nice of them and everything was delicious. Please go check them out!! Plus when you check in on yelp there's a discount ;) enjoy!"
    },
    {
        "id": 86,
        "text": "Was very much looking forward to giving our daughters their favorite pepperoni pizza. Placed order online specified hotel delivery, attempted to pay by credit card and was told I could pay via delivery person. Received subsequent call from delivery person who was at the wrong hotel. Called back O Sol Mio to report wrong delivery address. I was just connected during conversation. When delivery was finally made, credit card was not acceptable payment format and had to produce cash. Pizza was cold and most of cheese and pepperoni was stuck to top of box."
    },
    {
        "id": 87,
        "text": "I happened upon this place by accident we were actually in route to another restaurant. I was in the mood for flounder stuffed with crabmeat and sure enough on an A-frame outside of this restaurant was menu showing that flounder stuffed with crab meat was being served. From the street this restaurant looks like a pizza parlor and it is, however they have several small tables in the back were you good enjoy your pizza or another entree which which equates more to dinner. There were four of us and our waitress was the owner's daughter and her name was Anna and she was the best. The service was excellent the food was even better and we all enjoyed dinner that evening. I highly recommend this place and plan on going back to try some of those delicious looking pizzas."
    },
    {
        "id": 88,
        "text": "In town on way back from roadtrip. Booked a reservation through OpenTable couple days in advance. Meal and service was perfect. Waitress was super friendly and checked on us at all the right times and made us feel very welcome. Food was just awesome. In our group of 5, two had chicken parm, two had pizzas (one make your own and one Buffalo margherita), and one had another chicken dish. Ceasar salads that came with the entrees were simple and tasty. Everybody loved their food. At the end of the evening the owner / chef came out to say hello and he was super friendly and easy going. A great experience all around!"
    }
]