[
    {
        "id": 1,
        "text": "This place is top notch, with phenomenal service and such fantastic ambiance- how can you go elsewhere? All of the food looked and smelled amazing. I love how creative everything was.\nI CANT STOP DAYDREAMING ABOUT THE FOOD. Hands down, best brunch experience of my life. I don't even like french toast usually and theres was by far the most delicious food thats ever entered my mouth. I am literally drooling while writing this.\nThe chicken and waffles were unreal and standout A++++. \nI love the \"flinstones pushup-pop\" drink so creative and clever.\nEven the deviled eggs were the best I've personally ever had. They do everything right even when it comes to the music. It was super fun and such a great experience! Ignore any review thats not 4 stars because they must be delusional."
    },
    {
        "id": 2,
        "text": "Came here on a Saturday afternoon for brunch with some friends. Let me just say, my experience was AMAZING. So, where should I begin?.... OH.. Let's start with the Tiramisu french toast. Now, I'm not one to order from the sweeter side of breakfast, but these were basically screaming at me from the menu. These little slices of heaven came out fast (which I always appreciate) and were DELICIOUS. My other friend ordered the CANNOLI PANCAKES. UNREAL - no surprise there. Aside from the incredible food, the staff is extremely friendly and attentive. The overall vibe of this place was just so upbeat and really set a great tone for the rest of my day in Philly. Can't wait to go back!"
    },
    {
        "id": 3,
        "text": "This place is INCREDIBLE! It's American food with a twist. Start with a drink. Get the Flintstone one. It's frozenish and I promise you won't regret it. Food rundown: Mussels in a French onion soup broth, 10/10. Tiramisu French toast, 10/10. Marinated fried chicken and waffles 10/10. But one of my faves has got to be the avocado toast, a perfect ten. To die for. My recommendation is to go out for brunch with some friends and split all of this deliciousness. You won't regret it. Oh and also, the staff knows what's up."
    },
    {
        "id": 4,
        "text": "Outrageously overpriced for what it is. Insultingly so. It would be one thing if the cocktails warranted $12 but they simply do not. The bartender was very friendly so 2 stars for that but for that area and the subpar cocktails not even close to worth the price. Cannot speak to the food but definitely not a place I would go back to have a few drinks at."
    },
    {
        "id": 5,
        "text": "Ekks, how hard is it to serve food that isn't raw. I hate giving out 1 star but anyplace that serves 2 separate items from the menu to the table that are inedible deserves it. Food sucks, drinks are wayyy overpriced, outside still looks as sh*tty as it was when it was the Wishing Well. I'm so confused as to why people think they can just put a new bar top in and expect it to succeed. Get a real chef and price drinks according to demographics and neighborhood. How f*cking hard is it to do that people?!"
    },
    {
        "id": 6,
        "text": "Food here is AWESOME. Buffalo chicken egg rolls and lamb burger wrapped and prosciutto was unreal. Staff was really friendly. Great live music and hip atmosphere, definitely coming back!!"
    },
    {
        "id": 7,
        "text": "The best new bar in Philly. Amazing drink menu (and they taste as good as they sound), and delicious apps. The service is incredible and the bar is bustling with an energetic vibe that brings life to the quaint neighborhood. Thank you to Bar One for providing an atmosphere perfect for everyone!!! We can't to become regulars at Bar One!!!"
    },
    {
        "id": 8,
        "text": "We are obsessed with this place. The bartenders are so friendly and the drinks taste amazing! The happy hour is exceptional. My friends and I have tasted many items on the menu. We love their mussels & flatbread!"
    },
    {
        "id": 9,
        "text": "Have been here twice with my boyfriend. We had great food and service both times. The menu is a good size and there is an airy atmosphere to the place. Mike was behind the bar during the Italian Festival when we stopped in, and he was quite a fella. He was a great example of what good service looks like. The lamb burger is awesome!!"
    },
    {
        "id": 10,
        "text": "Stop waiting to come here and just eat a meal here already! The food is simple and delicious and once you go it'll be easier to get over Wishing Well closing. \n\nPesto deviled eggs OH MY. It's the perfect balance of everything you want in life. Creamy and milld yet somehow still packs a punch. Don't let any pine nuts go to waste on the plate either. \n\nI had the chicken cutlet sandwich. Perfect amount of spice. I wish they added more spread/sauce but the chicken was thin and breaded so that made up for it. Fries aren't really fries. More like less boring breakfast potatoes. They're whatever. \n\nThe pappardelle with arugula and ragu somehow mastered the perfect balance between filling and light. Flavorful but not overpowering in the way arugula can be. \n\nTwo thumbs up!"
    },
    {
        "id": 11,
        "text": "Best new bar in Philly! The menu and drinks are incredible and the staff is absolutely amazing - couldn't have had a better experience!"
    },
    {
        "id": 12,
        "text": "Was really excited to try bar one as I used to live less than a block away from the location. They did a really nice job renovating the bar, but I was not impressed by the food. We ordered four things:\n\ncheesesteak pretzels: were basically pretzel nuggets from the pretzel factory with a cheesesteak sauce to dip in\n\ntomato and mozzarella flatbread:The flatbread was over cooked and did not have much flavor\n\nchicken cutlet sandwich: bread was stale (hint:sarcones is across the street- USE THEM)\n\nbuffalo chicken egg rolls:were actually really good and the best part of our meal\n\nI hope these are just small problems for the restaurant to work out because it is a great location with a good concept for their restaurant, but right now the food needs improvement."
    },
    {
        "id": 13,
        "text": "First night.  Am here now.  Advertised free passed apps appetizers.  Corner table.  Ignored by EVERY server.  Other tables already had three apps!  If this is an indication of the future, FORGET IT!  And the music is too  loud!"
    },
    {
        "id": 14,
        "text": "Have been twice with my boyfriend and both times had great food and service. The menu is a good size and the place has a nice open airy atmosphere. Mike who was behind the bar is an awesome fella who went above and beyond to make sure we had a good time. The lamb burger was really really good. Check it out :)"
    },
    {
        "id": 15,
        "text": "By far, the least attentive service I've ever received at a bar or restaurant in Philadelphia. Don't waste your time or your money."
    },
    {
        "id": 16,
        "text": "If you are ever in the South Philly area be sure to stop by this new bar-restaurant! It is amazing! The staff is incredible & music is great! let's not forget the food an Italian take on bar food that is to die for! cannoli pancakes , tiramisu French toast , lamb burger, scampi mussels were all out of this world! They have a drink that has sorbet in it and tastes like a flint stones push up pop! I think we found our new spot for nights out!"
    },
    {
        "id": 17,
        "text": "Writing this review before I've even left the restaurant because it's so amazing that I can't wait to do it! This place is a neighborhood gem and south philly is so lucky that it went in! Tonight was the grand opening and they passed around FREE appetizers! Who does that?! Amazing restaurants, that's who. The prosciutto lamb burger is to die for and the buffalo chicken pasta melts in your mouth. BarOne does a fantastic job at Italian bar food and their drinks and atmosphere make me want to come back every week. Bravo, delizioso, mangia!!!!!"
    },
    {
        "id": 18,
        "text": "Great spot to hang with friends! Awesome atmosphere and very friendly staff. Their cocktails are delicious! I would totally recommend Bar One to anyone looking for a new, good spot in S Philly"
    },
    {
        "id": 19,
        "text": "They renovated the space well. The lighting & atmosphere are much more inviting than they were in its previous iteration. The food was decent & plates were 1/2 off for happy hour. The server was attentive but didn't know anything about the beers on tap. And to read the draft list on the chalkboard we had to walk up to it bc it's unreadable from more than 3 ft away. They should consider putting drink prices on the menu. Overall, it's an ok new spot. I'll go back out of convenience but wouldn't seek it out."
    },
    {
        "id": 20,
        "text": "I used to love coming to this bar when it was the wishing well and couldn't wait for Bar One to open. We were skeptical at first, but the drinks on the cocktail menu were fantastic and they had some decent local beers too. My boyfriend tried the old fashioned and the banana Jameson (Jameson soaked in banana and brown sugar!) and I tried the flinstones push pop and the spiked hot chocolate. The flinstones push pop had a scoop of berry sorbet, prosecco, and I believe a lavender liquor. It surprisingly wasn't too sweet and will definitely be a summertime favorite. The spiked hot chocolate was made from belgian chocolate and had a giant toasted marshmallow on top. It was honestly the best hot chocolate I have ever had and I definitely couldn't stop myself from slurping it down too fast! The old fashioned was pretty good too, and we definitely loved the banana Jameson. For the Irish whiskey lover it's a must try! Unfortunately we didn't try the food but we will definitely be back to try soon!"
    },
    {
        "id": 21,
        "text": "$6.50 for a Kenzinger and the bartender didn't even know what it was. Probably one of the most highly ordered beers in Philadelphia other then PBR. $7.50 for a shot of Jim Beam. I'm Wishing this place Well, but how did you not learn from the previous businesses downfall. No one in the neighborhood wants to pay center city cocktail bar prices, for  standard corner bar ambience, and a pretty average food menu. Better make some aggressive changes quickly or your gonna have Bar None ;)"
    },
    {
        "id": 22,
        "text": "Great neighborhood spot.  Very clean and well-maintained. Excellent pub grub. Fantastic burger. They always have Peroni on tap which works out just fine for me. Nice happy hour too."
    },
    {
        "id": 23,
        "text": "Such a nice improvement from the previous bar (even though we loved and miss the old one). Menu is great."
    },
    {
        "id": 24,
        "text": "Stop waiting to come here and just eat a meal here already! The food is simple and delicious and once you go it'll be easier to get over Wishing Well closing. \n\nPesto deviled eggs OH MY. It's the perfect balance of everything you want in life. Creamy and milld yet somehow still packs a punch. Don't let any pine nuts go to waste on the plate either. \n\nI had the chicken cutlet sandwich. Perfect amount of spice. I wish they added more spread/sauce but the chicken was thin and breaded so that made up for it. Fries aren't really fries. More like less boring breakfast potatoes. They're whatever. UPDATE: Came back a week later and my cutlet sandwich had bacon in it and I got more than double the serving of fries. So good! But I took a star off bc I'm annoyed at lack of consistency. But damn it's good. \n\nThe pappardelle with arugula and ragu somehow mastered the perfect balance between filling and light. Flavorful but not overpowering in the way arugula can be. \n\nTwo thumbs up!"
    },
    {
        "id": 25,
        "text": "Stopped in here last night for a nightcap after a fabulous dinner at Market on Ninth . So nice just to be able to walk over .  Can't beat this little spot .  Perfect city night ."
    },
    {
        "id": 26,
        "text": "I went here on Saturday to try the free(!) brunch and LOVED it. The space is cozy without feeling dive-y and the artwork adds a character that is unmatched. We ordered the breakfast sandwich and tiramisu french toast and both were delicious. The nice selection of local draft beer and specialty cocktails will keep me coming back. Very excited to try the dinner menu!"
    },
    {
        "id": 27,
        "text": "The dry-rub wings (that isn't the actual name) are the best wings I have ever had. Ever."
    },
    {
        "id": 28,
        "text": "Went there with friends for a last minute dinner last night.  Was outstanding!  Service, food, ambiance.  I had the Short Rib pasta - PERFECT!  The only thing that keeps it from being 5 star is that I just wanted a small side salad - (like one I saw on the online menu, but not on the menu that night).  Wasn't possible to 'create' - oh, well.   I'll be back!  It's also a great place to eat alone at the bar."
    },
    {
        "id": 29,
        "text": "My family and I were exploring the Italian market and realized we needed time out of the cold and lots of food. We were a group of 6 and most places had a long wait so we called and bar one could accommodate us right away. \n\nThe brunch menu was definitely unique for a bar but did not disappoint. It seems everyone found something they liked. \n\nI personally had the kale caesar and tried someone else's avocado toast. They were both tasty although the toast was slightly burnt.\n\nOverall service was okay but a few things were forgotten. Everyone seemed to like their meals but some of the portions were a little small depending on the dish. \n\nI'd definitely come back if I was in the area!"
    },
    {
        "id": 30,
        "text": "Update 3: continued inconsistency with my beloved chicken cutlet sandwich. Was missing bacon and the bread was different. Still delicious but why change something that has been perfected?!"
    },
    {
        "id": 31,
        "text": "Great neighborhood spot with outstanding mussels, great beer selection and excellent service. From the bartenders to the wait staff, everyone was friendly and attentive. We brought 2 kids and they had a blast. Best mussels we've had in a long time. I ordered beer mussels and my wife ordered scampi, both A+. My kids ordered mac & cheese which was prepared with homemade cavatelli, fantastic. Can't wait to go back!!"
    },
    {
        "id": 32,
        "text": "Tonight was one of Bar One's opening nights offering free apps, 10/21. It was crowded but that's expected when a bar is giving out free food. I was able to try their chicken and waffle, buffalo chicken pasta, lamb slider, and pork and Buffalo chicken spring rolls. They were all fabulous. The food is really amazing here. Think Bar food with a classy twist. They had live music (one guy with a guitar playing covers) which had a good vibe setting the mood all night. Their draught beer list comprises mainly of local craft brews. They had 4 big screen TVs showing the sports game. This is a new age neighborhood bar that I will definitely come back to. Definitely glad to see a new bar at this corner."
    },
    {
        "id": 33,
        "text": "Ralph's Italian restaurant was totally booked, so we took a chance on Bar One, directly across 9th st. As we walked in, I loved the corner bar atmosphere.. staff was wonderful... then I looked at the menu. OMG my heart sank...... just weird for an Italian market eatery... my friend ordered Bucatini, at $16, they could have added a few more noodles..... it looked like a side dish... hopefully these guys didn't invest their life savings in this place"
    },
    {
        "id": 34,
        "text": "I live a block away and have always wanted a good bar to move into this space. Unfortunately, for one reason or another, they never work out and I won't be surprised if Bar One follows suit. \n\nThe drink menu does not have prices. That should have been the biggest indicator. We ordered Kenzingers and Philly Pale Ales and the prices were absolutely ridiculous. Almost $7 for a single Kenzinger is unheard of, even in the most pretentious Center City bars, and this is South Philly. A shot of Jim Beam- $8. \n\nI'd rather walk a few blocks and go to literally any other bar then give this place my business again. \n\nTwo stars go towards the half-way decent music and I can't deny that the food smelled pretty good. Can't imagine how overpriced that must be, though..."
    },
    {
        "id": 35,
        "text": "A great quite, dive. Typical south Philly at its finest. Food was on point and drinks were delicious too"
    },
    {
        "id": 36,
        "text": "This bar is an awesome addition to the neighborhood! I came here for the grand opening and I wasn't disappointed. They passed out free delicious food to everyone and the beer selection was awesome (especially if you're a local beer lover like myself). Everyone seemed to be having a fun time and the live music was a great addition. I can definitely see myself coming back here in the future."
    },
    {
        "id": 37,
        "text": "This is a fun bar I enjoy the casual but trendy atmosphere. It has a good energy. The food is very good. I think the beer is pricey some exceed $7 for the typical 14 oz glass. Tuesday night at 8 pm is trivia night. I recently had the pappardelle and it was delicious!"
    },
    {
        "id": 38,
        "text": "Recently moved into the neighborhood from center city and decided to try out Bar One. My husband and I have been here multiple occasions since we have moved in and have had a great experience every time. Some top notch things:\n-Wonderful service! Mike and the other bartenders have been extremely attentive and friendly. \n-Dominic makes one of the best dirty martinis I have ever had...better than capital grille/delfriscos\n-Great draft list - always rotating \n-A must go for brunch. We went today and enjoyed a juicy burger and the barones special. Home fries were crispy and the pancake was delicious! That paired with their homemade bloody hit the spot. \n\nHighly recommend for people to check out, especially if you are as picky as me. I've been to countless spots for brunch / cocktails and this is among the best in philly. A great mix of solid fresh food, tasty cocktails, and draft craft beer... they also have TVs which is must have with the philly sports run. \n\nGo sixers #ttp"
    },
    {
        "id": 39,
        "text": "Cool bar, love the art work, the lamb burger and the inventive drinks. The space is good and I like the playfulness of the food. Hh is 1/2 off everything. Yeah I will be back."
    },
    {
        "id": 40,
        "text": "I have never had such delicious ice cream in my life. All natural with herbs chocolate cookie enhancements. The mint chocolate chip was the best I have ever had. The baklava had bits of sweetened philo, and the lavender enhanced cream brûlée had crunchy caramel throughout."
    },
    {
        "id": 41,
        "text": "Stopped by for HH before the Sixers game and I must say they have great HH deals. Certain appetizers are half off and their house wines are $4 a glass. The bar wasn't that busy as most people trickled in as the game began, but its a good space for friends to hang out and watch the game. \n\nThe stuffed long hots were the favorite. They are spicy and stuffed to the max with perfectly cooked sausage. \n\nThe flatbread on the other hand was meh. Its not on your usual flatbread. What i thought was going to be a naan or pita like texture was more like a cracker. It's so thin and the toppings are piled high which made the \"cracker\" soft and soggy. The taste of the veggies needed salt too. \n\nLast thing we ordered was the beet salad. Slices of tomato, beets, and mozzarella cheese with a balsamic vinegar drizzle. I didn't think i'd he a huge beet fan, but these were good. \n\nIf you get a chance to stop by for HH definitely hit up their drink specials and get the stuffed long hots!"
    },
    {
        "id": 42,
        "text": "Live in the neighborhood and it's much better than the bar prior. The staff is always attentive and nice. Food is pretty good, more bar style appetizers than real meals but nonetheless appetizing. They also make a great Moscow mule."
    },
    {
        "id": 43,
        "text": "Went in on a Sunday evening and it was very quiet. Nice bar with approximately 15 tables for seating. We sat at the bar and the bartenders were super friendly. We ordered spiedini and sausage and pepper spring rolls. Both appetizers arrived hot and both were delicious. \nNext up was the papardelle with short ribs topped with Arugala.  Absolutely outstanding!!  Highly recommend Bar One aka Barone!  Can't wait to try the Brunch menu too."
    },
    {
        "id": 44,
        "text": "Expensive and not the money.  Smug service and an overpriced breakfast sandwich with only one egg.  Wouldn't recommend, cute space in a nice neighborhood but better options for food considering the price."
    },
    {
        "id": 45,
        "text": "Went back on a Tuesday and were able to get a table for 8 easily. We want Barone to be our neighborhood spot, but they're making it hard to do so. My friend ordered the mussels which were delicious, but when she asked for bread they told her they only give out bread for sandwiches. Bread. Sarcones is right across the street. \nWe will come back because we understand that it's new and they may be working out the kinks still. Fingers crossed."
    },
    {
        "id": 46,
        "text": "I recently went to Bar One for  my second time which was as good as the first. The first time I had the short rib potato skins which were to die for and the second time the flat bread. Well I have to say the food is second behind the great bartender Mike. He was working his butt off and still trying to give everyone the attention they deserved. I will be back!"
    },
    {
        "id": 47,
        "text": "Good spot for a drink to two with some pretty good menu items too. Awesome and friendly staff in a really nice updated and clean space."
    },
    {
        "id": 48,
        "text": "Short rib potato skins and eggplant stack are awesome. Playlist of music in the bar thanks to Chris et. al is great. Atmosphere is fun and friendly and loud on week, but quieter on weeknights. Just as friendly and pleasant."
    },
    {
        "id": 49,
        "text": "Had really great experience this is my favorite place bartender was so attentive and knowledgeable my favorite drink was cucumber cooler We will be back again"
    },
    {
        "id": 50,
        "text": "There wasn't one dish that was anything short of phenomenal. You'll leave daydreaming of the cheesesteak mussels and lamb prosciutto burger for weeks.  Amazing drinks & atmosphere and friendly staff will make this your new go-to local bar in South Philly. Truly deserves SIX stars."
    },
    {
        "id": 51,
        "text": "Greta happy hour; 1/2 priced all drinks except premium liquor. We had the Flintstones push-up and Berry refreshing. I like the push-up pop, but I want it without the liqueur and I broke up the sorbet. I'm not sure how to capture the blood orange taste without the liqueur. Berry refreshing is very sweet and quenches your thirst. Careful you might drink it really fast, but if you go during happy hour you can two for the price of one so go ahead and drink up!\nOh and while you drink for 1/2 off at HH from 4-6 pm you can enjoyed 1/2 priced food and nightly specials too!!"
    },
    {
        "id": 52,
        "text": "So glad something finally opened on this corner and what did looks so much better inside. The room has a great flow to it and the art on the walls compliments the place well.  The beer list was better than average and the menu was interesting.\n\nUnfortunately there were some things that we really didn't like: the beer list has no prices nor does it specify what is on tap and what isn't. This made the final bill shocking as I didn't expect a PBC bottle to cost $8.99+. The tap list was illegible from the tables and the waiter suggested I go look at it to see what was on it. My flatbread came out over cooked and cold. Our waiter, while he tried and was nice, wasn't very knowledgeable about the food or beer.\n\n2.5 stars overall. Going to give it one more chance since it's so convenient but hope to see some basic changes to tighten up the experience."
    },
    {
        "id": 53,
        "text": "Came here with a large group of friends after eating at the Italian market and was fairly underwhelmed. It was jumping with people and they were showing sports on the TV which made my husband happy but I found the atmosphere to be lackluster. Also there are two bathrooms but one was out of use which made for a very long line. One thing to note - - if you forget to bring wine to your BYOB in the Italian Market they sell it here!"
    },
    {
        "id": 54,
        "text": "Pros: good food. Decent drinks. Nice neighborhood location. \n\nCons: the two male bartenders that were on were totally inattentive. They were pretty boys so I am assuming that's the reason they were hired. Seemed like they kept catching their reflection in the mirror and were too busy to help. Had to literally call out to them if you needed anything. I would rather have slightly less attractive people who were good at their jobs than have the pretty boys in there ignore me. Service is everything, it doesn't matter how good the libations, the service is what brings people back or keeps them away."
    },
    {
        "id": 55,
        "text": "Best bloody mary that I ever had. Very flavorful and spicy. Got try it"
    },
    {
        "id": 56,
        "text": "This place is hands down my favorite happy hour go-to spot. The staff is super friendly/cool, and the food is delicious! Wide variety of yummy drinks for really good prices during happy hour. Definitely recommend!"
    },
    {
        "id": 57,
        "text": "Good place for cocktails. Never eaten the food but looks good. The bartenders are friendly and it's usually easy to get a spot at the bar."
    },
    {
        "id": 58,
        "text": "It's was first time with friends.\nI had a mezacalito was ok .\nEggplant mozzarella was awesome.\nI had a pesto was ok bread was cold and hard.\nWasn't busy.\nBartender she was focused on only front guest.just looking us when we need anything.\nValue was ok.\nExperience was ok."
    },
    {
        "id": 59,
        "text": "Solid corner bar/restaurant in South Philly zone.  Owned by the family that owns Ralph's, across the street.  Beer is fresh and cold and service at the bar is friendly.  I sat at the bar and ate dinner and watched the Phillies on a sorta quiet Tuesday evening.  The food is good - not great - and not quite (but close!) to equal in taste/quality to the price.  I've been there a couple of times now and will definitely be back for a cold draft beer, friendly service and possibly, maybe, if-I'm-feeling-it... the food.  \n\nThanks!!"
    },
    {
        "id": 60,
        "text": "I love this bar!  I've been here twice, not during peak bar hours so I'm sure it's even more fun at night, but both times I've been I left wishing it was closer to where I live. \n\nThe first I came here was for a quick drink to kill time before my reservation at Ralph's (which owns this bar).  The bartender was super informative, even giving us tips on what to order at Ralph's since it was my first time there as well, and the drink I had was delish. \n\nThe second I went was this past Sunday for some food after bike riding. It was still brunch hours-I got the eggs benedict, my boyfriend got their special cheesesteak omelette, and we split the sausage and pepper spring rolls.  First off sausage and peppers is one of my very favorite foods so to see them offered in a unique way was really cool and they were really good. My eggs benedict was good too, but my boyfriends cheesesteak omelette, topped with their homemade wiz sauce, was beyond.  Both brunch entrees were served with spicy potatoes on the side which were tasty too. We had a different bartender this time and he was just as friendly and helpful as the one we had the first time. \n\nI've been here twice and I can't wait to go again."
    },
    {
        "id": 61,
        "text": "Bar One was truly outstanding, I cannot wait to come back!\n\nI came here with some friends on a Saturday afternoon for brunch, and every element of this restaurant was perfect.  The service was impeccable.  The wait staff were so attentive, my glass was never empty.  We all had these delicious \"Flintstones push pop\" drinks , you must get one!  It is a mimosa with a scoop of sorbet, the ideal brunch drink to wash down all of the great food.  \n\nThe food was to die for.  The pickle back wings & waffles dish was my favorite.  The marinade and seasoning of the chicken is one of a kind, combined with the sweetness of the waffles, HELLO flavor explosion!  The avocado toast was also tops. Avocado, egg and Texas toast...perfection.  Another stand out was the Tiramisu French Toast, this is what actual dreams are made of.\n\nI loved the overall ambiance of Bar One.  The art in the restaurant (and in the bathrooms) are really cool.  I wanted to take home one of the pieces hanging in the ladies room!  The music they were playing was awesome, everything from 90s alternative hits to Jay-Z.\n\nThank you Bar One for an amazing experience!!"
    },
    {
        "id": 62,
        "text": "Vaguely remember coming here when the bar went by a different name, but glad to see it now operating as a solid happy hour spot.  Decent discounts on drinks, and a fairly varied food menu for happy hour, too.  Was here on a Tuesday, and was impressed by the solid crowd that came in for trivia, as well."
    },
    {
        "id": 63,
        "text": "Nice neighborhood bar with good food and beer. They have sour monkey on tap which is one of my favorites! Huge plus. We got 2 apps and 2 entrees to split: pesto deviled eggs, Italian spring rolls, cavatelli, and the spicy chicken cutlet sandwich. Would skip the spring rolls (they kind of tasted like taquitos) but everything else was delicious! Cavatelli was the favorite for sure"
    },
    {
        "id": 64,
        "text": "My girlfriend & I stopped in here one night before our reservation at Ralph's. We had an hour before dinner and decided to sit and have a drink here. Oddly enough, we checked their reviews and decided to give it a try. We got to talking with the bartender and she informed us that Ralph's owned Bar One. We glanced at the menu while we had our drinks and both agreed that we had to come back here. \n\nFast forward a few months and we ended up back at Bar One for brunch. It was around 12:30 when we got there and I believe their brunch is 11-2:30 Then the kitchen closes for an hour and they start dinner at 3:30 PM. My girlfriend got Eggs Benedict that she really enjoyed. I ended up getting the cheesesteak omelette with their special wiz sauce on top. I didn't ask how they made their sauce but I suspect it's a mixture of wiz cheese and heavy cream; it was to die for. The entire meal was phenomenal. Their menu is also very eccentric which, as a foodie, I really enjoy. \n\nThe staff is very friendly and informative. They also have a lot of drink specials. If you love Bloody Mary's you'll love it there. \n\nThey seem to be a new bar so I wanted to make sure I gave them a good review to help spread the word. I definitely recommend Bar One and I'll be back."
    },
    {
        "id": 65,
        "text": "This was my first and definitely last time. I would not recommend. I was being generous to give it 2 stars the only good thing is that it was clean. The waitress was very slow and inpatient. She was unprofessional in sharing her feelings about my disappointment to her co worker!!. I said that my wings were not done. They were hot wings and the skin was soft and wet as if it was not cooked hard enough it was still light no color besides the sauce. In addition, the other 2 orders that were brought out at the same time had the same complaint from 2 other tables. She frowned up her face and said a thermometer was stuck in them and they are done. When she took them back ,it took another hour before the new ones were brought\n The lamb burger was seasoned great but had toooo much salt. To top it off, the pasta had a peice if hair in it. We did not complain or say another word. We just packed up and left"
    },
    {
        "id": 66,
        "text": "I've been on a search for a good, under $20, pasta option for a little while. Bar One isn't it.\n\n     Let's start with what it is, though. Can you go have a beer with your friends, and watch a little of the game? Yes, you definitely can. Do they have a beer list which comparable to other crafty, Philly spots? Yes, definitely. Is it crazy expensive, or crazy crowded? Nope...it's ostensibly a neighborhood bar.\n\n     By no stretch of the imagination is it an Italian restaurant. Frankly, I'm not sure why Bar One even bothers to pretend it is such...perhaps the neighborhood, or proximity to the market...but at any rate, fine Italian cuisine it is not. Excited to try a new spot, stopped in on a brisk Friday in November and, ordered the cavatelli with Gorgonzola sauce and sausage. The most notable issue was that there was no sausage. Strike one. I could not identify the flavor of Gorgonzola in the pale grey sauce either. Let it be know that I love blue cheese, and a little goes a long way with said ingredient; it's a strong flavor. This, however, tasted more like a bland rue. The pasta itself was stuck together in clumps, which made me wonder how it was prepared...pasta doesn't do that in a sauté pan.  It was thoroughly underwhelming. \n\n    It's also worth mentioning the staff...or at least one bartender.  My gent was fine. He seemed to have a little trouble getting around, but was courteous enough, and managed my order with no issues. There was another, much ruder, gent who spent the evening - or at least the time that I was there - trying to recruit customers into belittling the other bartender (the one serving me). \"Can you believe he has a degree in music?!?!...in MUSIC?\", he asked me with his absurd Thomas Shelby haircut and manicured beard. \"Who does that?!?\", he continued in his effort to impress himself. I absolutely did not take the bait; nor did most of the other customers, in what I can only expect was everyone trying to extend common kindness to a man just trying to do his job. \n\n     Let's have a reality check here. 1. Publicly belittling others lacks both character and professionalism. Full stop. 2. I have a degree in music, and what has been (so far, thanks be to God) a lasting & rewarding career in the Arts. So, what was meant only as unnecessary posturing between staff members, deeply offended your clientele. I chose not to engage the argument, because that is in no way what I'm looking for in a dinning experience...an argument with an arrogant, yet poorly-informed bartender. The phrase \"service industry\" springs to mind...SERVICE...since we like to repeat ourselves. In conclusion, the food was edible but not good; yet it was the utter pretension of Mr. Shelby which will ensure that I will neither spend another singular dollar, nor recommend Bar One to any of my friends or readers. #Service"
    },
    {
        "id": 67,
        "text": "Tonight was one of Bar One's opening night offering free apps, 10/21. It was crowded but that's expected when a bar is giving out free food. I was able to try their chicken and waffle, buffalo chicken pasta, lamb slider, and pork and Buffalo chicken spring rolls. They were all fabulous. The food is really amazing here. Think Bar food with a classy twist. They had live music (one guy with a guitar playing covers) which had a good vibe setting the mood all night. Their draught beer list comprises mainly of local craft brews. They had 4 big screen TVs showing the sports game. This is a new age neighborhood bar that I will definitely come back to. Definitely glad to see a new bar at this corner."
    },
    {
        "id": 68,
        "text": "My mother and I went to the Italian Festival last Saturday, as I work in the area. There was plenty of food, family, music, and vendors. \n\nI wanted to try a new place with great food and service. As always, I read the reviews and pick my spots. So attempting to visit Bar One was not out of the ordinary. Well, as we walked through the festival, we saw a young lady passing out flyers to everyone. To my surprise, as when we got closer, she looked us in our faces, and turned around...mine you, there was no other individuals close to her to pass out the flyers, then us. At this point, I replied that maybe the business that she was representing had an exclusion policy. At that point, an older gentleman standing near her, heard the remark, apologized, and passed us a flyer. \n\nTo my surprise, the flyer was from Bar One! At that point, we continued to walk to the end of the festival, and I was still interested in visiting Bar One. After reaching the end of the festival, we turned around and began to walk back. As we neared the Bar One vicinity, another gentleman was now passing out the flyers. As we approached closer to go near the front of the Bar One, the gentleman did not look at us to give a flyer to either. It was obvious that this second time within a 45 minute span was NOT an accident. We simply didn't fit the identity of their clientele. Point taken."
    },
    {
        "id": 69,
        "text": "I understand Bar One's attempts to change the traditional Italian food into bar food but a lot of it didn't make sense. \n\nThe Good - Let me say that I would RUN back for the french onion soup mussels, they were absolutely delicious and full of flavor. My favorite part were the french fries at the bottom of the bowl that were soaked with the french onion broth. \n\nThe service! Each waiter was extremely attentive and nice, never had to ask for anything as it was already taken care for me.\n\nThe drinks were delicious as well! would come to drink rather than eat. \n\nThe bad - the kale calamari salad. The calamari to salad ratio was way off, less calamari, more lettuce. The calamari it self was over salted and heavily coated. \n\nThe Mafaldine pasta - was WAYYY under cooked, I like my pasta al dente but this was still raw. Also the pasta is way too large to have small pieces of shrimp and asparagus with. Again, this dish was over salted. \n\nIn all, I would come back if improvements were made. I want to see this restaurant do well! Great location, and the place is cool."
    }
]