[
    {
        "id": 1,
        "text": "Definitely should have read the reviews first.   Ordered $100 worth of pizza for a 13 year Olds birthday.  Gave then 2 hours notice.  The pizza still showed up an hour late, cold and tasteless.  Absolutely awful.    Never again."
    },
    {
        "id": 2,
        "text": "I now remember why we don't order from this Pizza Hut anymore - a year ago, it took two and a half hours for the deliveryman to arrive, and we live three blocks away.  Today, we called to request an ETA an hour after delivery and were told the deliveryman would leave in five minutes.  Half an hour later, we called again and were put on hold twice.  When I said I'd been waiting an hour and a half, the person on the other end of the phone gave a sarcastic remark, so I told him to cancel the order.  The deliveryman showed up half an hour after that, and I turned him away.\n\nI will definitely never order from this Pizza Hut again."
    },
    {
        "id": 3,
        "text": "Delivery driver didn't bring entire delivery, said he would go back to store to grab it and didn't return. Store refused to refund money!"
    },
    {
        "id": 4,
        "text": "Every time I order from here it's a little late, but today it was almost 2 hours late. They did call but it was about an hour in and they said it would be coming soon, but it was another 45 minutes after they called. Not even an apology for being so late...horrible service!"
    },
    {
        "id": 5,
        "text": "Do NOT order from here if you want to receive the correct order. My boyfriend and I ordered a medium pizza (with the cheese bites crust and the garlic sauce) with onions and tomatoes on half and onions, bacon, and chicken on the other half. The pizza we received had chicken on the entire thing and had bacon on only two slices. This is a problem because I don't eat meat, hence meat only on half. They also forgot the dipping sauce for the cheese bites. We call to inform them that they messed up our order. They apologized and said another pizza would be there in half an hour. Half an hour later, we get another pizza. Guess what? This pizza still was not correct. At this point we gave up. It was not even worth calling at that point. Lesson learned, if you want the pizza you ordered do NOT order from this shop."
    },
    {
        "id": 6,
        "text": "It Pizza Hut nothing special. Just stop by to grab some wings. It a small take out branch right off of the high way. You would think it a big franchise. They would train the employees better food handling skills. Not what I saw. I've been working in the back of the house for 10 years. I know there is some corner cutting here and there. But never with touching food after you touch money. The guy literally gave me my change and went straight to the walk-in fridge. Grab a pre prep pizza, then proceed to add the toppings. All with out washing his hands or wearing food gloves. Money is dirty!!! He not the only one. The other man who looks like the manger or something is worse. He just grab change for a delivery. Then went to pack up cooked orders. Lucky for me, he spilled something cleaned it up washed his hands. Then gave me my order. Also they ran out of bags. By far this place bad. I can see there is no box of gloves anywhere insight in the kitchen. Matter of fact I don't think they train them to even wear gloves. Com'on even other fast food places wear gloves. This place is a joke!!!"
    },
    {
        "id": 7,
        "text": "Guess I should've read the Yelp review first. I ordered a dinner box at 12:08pm. The notification I received said my food would be delivered at 12:36. At 1pm when my food still hadn't arrived, I called the store and they assured me it would arrive in 5 minutes. The gentleman who answered was very nice. Finally, at 1:26, the driver (female) arrived. I was annoyed but she was apologetic and I empathized with her. At this point I'm starving, and I look in the box to see BLEU CHEESE dressing instead of icing. So now I can't eat the cinnastix and the pizza was cold. I tried to request a full refund as this was a total waste of time and money but the form submission on Pizza Hut's Contact Us page is broken so I couldn't even do that. I will say the employees were kind."
    },
    {
        "id": 8,
        "text": "I don't know what happened to this Pizza Hut.  \n\nThe food wasn't very good at all.  Pizza slices weren't even cut through all the way.  They forgot to cook the breadsticks in my order.  She rung me up and then realized the mistake so I had to wait additional time.  The breadsticks were undercooked when I got them.  \n\nThe pizza actually made me sick the rest of the night.  I was very disappointed.  However, I gave them 2 stars because they lady who was at the register was very friendly.  She even offered me a free soda for the mistake.  Without her, it was a 1 star experience."
    },
    {
        "id": 9,
        "text": "I have to say I used to hate Pizza Hut very much pizza was horrible!! I always said I would never eat from there again. So after seeing these commercials for there new recipes and toppings and crusts I decided to give it a try one day. It officially a good pizza place now in my books toppings and pizza were fresh!!!!  The new honey siracha drizzle is amazing!! Delivery was fast and food was still hot. The only reason I did not give 5 stars  because I do not know how there customer service is since I only have ordered thru them online!!"
    },
    {
        "id": 10,
        "text": "Visited this location because my nearby one was closed for the night. Though I didn't get delivery, the food was hot and better than my normal store. The toppings werent skimpy, all my sauces were included and the whole experience was pleasant.\n\nAlso, the woman working the counter was really pleasant!"
    },
    {
        "id": 11,
        "text": "It happened twice, so my family and I waited almost 2hr for the delivery! And it was the same delivery man was extremely late and delivered cold pizza. Are they striving to be out out business!?"
    },
    {
        "id": 12,
        "text": "Waited 1hr 30min and still waiting for my pizza to get delivered. I called to track my order but their excuse is,  \"we are still waiting for our driver to get back. He left with 4 orders. I don't know why so many people was ordering so many pizza this morning.\" I asked for a new estimate time of arrival and he said, \" um.. I can't really tell you that but maybe another 20mins. \" but  30mins just passed still no delivery. Unprofessional!"
    },
    {
        "id": 13,
        "text": "I don't understand the low reviews on here. Maybe I just got lucky. I've ordered from here twice in the past couple months to a hotel near by. Both times the food was fast, hot, and the drivers were nice."
    },
    {
        "id": 14,
        "text": "I'm not typically a person who visits or writes reviews for chain restaurants, but here we are. If you're interested in waiting well over an hour beyond the promised delivery time and being served cold pizza then this is the place for you! Last time we ordered (maybe 8 months ago) I called to let them know they didn't give me mushrooms as I had ordered. I was told that the mushrooms they had were moldy so that's why they didn't put them on. While I'm glad that they didn't give me moldy food, a call with a heads up would have been nice. I could have replaced it with something else. That time it was well over an hour beyond the promised delivery date and they forgot our sides. Decided to give them another try last night. We got two pizzas, one of which was meant to have extra cheese, the other was meant to be thin & crispy with light cheese. Both pizzas had the same amount of cheese, both were cold and his was far from crispy. It was limp, soggy and cold. So after waiting an hour longer than expected we had to preheat our oven and cook the pizza so that it was edible. How this place is still open with all of these reviews is beyond me. Just don't."
    },
    {
        "id": 15,
        "text": "Bought a voucher for this Pizza Hut for 12.50 from cbs...the lady told me that they do not accept its saying that she doesn't know how to put it in the machine. How does she not know how to do it when it clear has the Pizza Hut location. On there that they will accept the voucher .. If I've known I would of never order food from here"
    },
    {
        "id": 16,
        "text": "Delivery times are 2hrs +\n\nPlease be warned that if you order delivery, expect it 2-2.5 hours later."
    },
    {
        "id": 17,
        "text": "I like pizza. I like generic franchise pizza. Hell, I recently won a free year of pizza from Papa John's as a runner up in a big contest they had.\n\nI like Pizza Hut's stuffed crust pizza.\n\nThere. I said it.\n\nSo get past your hate of the CONCEPT of Pizza Hut, and just look at this review from the POV of someone who actually likes the product. Because I do.\n\nSo...\n\nTHIS Pizza Hut is a disaster. For 3+ years I have had nothing but problems with them, but I keep coming back because they're the only one in town. The usual issue is that I order pineapple and they put on pepperoni. But there's other issues. \n\nSometimes it takes 2 hours to deliver because they're constantly under-staffed. \n\nOn numerous occasions they run out of a certain type of crust, so they call me and tell me they can only make another kind; the problem is, if I've ordered online, my credit card has already been charged, so if I say \"No, I don't want thin crust, I ordered stuffed crust,\" it won't stop my card from having $20 taken off of it until 10 days later when the charge is reversed.\n\nThey also constantly forget to include side orders and drinks, and then the driver has to go back to the store, and come back to drop them off, which makes the driver pissed...which makes me uncomfortable.\n\nBut...I keep ordering, because, like I said...it's the only Pizza Hut in town."
    },
    {
        "id": 18,
        "text": "Fool me once, shame on you; fool me 3 times, shame on me.  I've ordered from this Pizza Hut 3 or 4 times now, and every trip has been a miserable experience.   \n\nThey say the pizza will be ready in 20-30 minutes, yet they tell you it will be another 20 minutes once you show up to pick up the pizza. I really should have kept this in mind whenever I have a thought of ordering from this location.  Please don't make the same mistake.\n\nAt least, as I'm sitting in my car, waiting for the pizza, I've seen 5 other people go in for their pizza, and no one has walked out with any - so at least I'm not the only one. Don't let it be you too.\n\nTo me, there is no excuse. Can't they hire more people or get a bigger location?!?!"
    },
    {
        "id": 19,
        "text": "I ordered a pizza at 7:20pm, the email said it would be delivered around 8:15-8:30. Figured that was fine. 9pm rolls around, still isn't here, I called and the night manager says \"i dont know what you want me to say\" okay I'll give the guy another 10-15 minutes, I don't live that far. 30 minutes later... (It's now 9:30pm) I call again \"hey sorry it's me again, just trying to get an eta. It's getting a little ridiculous\" the rude \"manager\" says \"i dont know what you want me to say i dont know.\" No answers, no apology, no trying to find a solution.. Just rudeness. Awful, awful, awful. Make it even better, fold was cold."
    },
    {
        "id": 20,
        "text": "Called tonight because the website said they couldn't deliver, but COULD take carry out. I was told the manager shut down online orders because \"For real real, all we have right now is large thin crust, and wings.\"\n\nWow."
    },
    {
        "id": 21,
        "text": "This place is a joke there should be a NO star option. it was 25 min late. The pizza was COLD and when I called to complain the man I spoke with said and I qote. \n\n\"I understand that your saying the pizza was cold even though I know it wasn't\"\n\nOn top of that when I called back they some how had messed up charging me so I only had been charged $1. Now they want me to pay for late and cold pizza. \n\nThis company has gone down hill. I lived in a different part of the city an if I got delivery it was late or cold as well. . . . only way to get fresh HOT pizza is pick-up. \n\nSo I will NEVER order pizza hut again. I have worked in the food industry for about 10+ years and if some one is not happy you don't charge them.. you comp the meal. Not say we'll your paying for this one we can give you your next free.. \n\nSo to recap. COLD pizza.  LATE pizza. And RUDE staff (except the delivery guy. He was nice.. late but nice. )"
    },
    {
        "id": 22,
        "text": "Third time we waited OVER TWO HOURS for delivery. Called at an hour in to check on our order, because the \"tracker\" hadn't moved past \"received order\". Girl who picked up was rude, informed us they only had one driver (on a Friday night), and that our order was done and \"still\" waiting there to go out. Ok, fine, at least it was made. Two hours in-Called 5 more times to ask they just cancel our order, and no one would speak after they picked up.  Sounded like they picked up, and shoved a cordless phone into a pocket. Way to run a business. Just as my husband and I were discussing who was going to drive down there to cancel in person and get a refund, guess who calls? Delivery girl just arrived, and literally almost dropped our order in front of my husband, but luckily caught it before it hit the ground. Fries were burnt, mozz sticks under cooked and everything was ice cold. NEVER. AGAIN."
    },
    {
        "id": 23,
        "text": "Worst customer service experience. Had some issues with the mobile website and it reverted to my old phone number. But when I called the store, the staff member basically blamed me and hung up. The manager called back and also blamed me for the delivery guy going to the wrong place (my additional instructions apparently did not go through on the website order). He said the driver might redeliver but that I was basically taking the hourly rate from the driver. I work in food service and would never tell a customer that they cost an employee money, even if it was true. He said I should wait out on the corner but never said the driver was definitely coming back. I waited 10 minutes but had to go back to work. My coworkers ordered from another place and got their food right as the driver showed up from PH (he didn't come in, one of my coworkers saw him outside and chased him down). One girl still wanted her food and I felt bad for the driver so I paid for all the food and tip so it was the most expensive personal pan pizza I've ever gotten ($13+) and at this point it was cold and the pizza box was pretty beat up.\n\nWe got our food an hour and a half after we ordered it and 45 minutes after the stated delivery time (on a Tuesday). It was not fresh and the staff was unaccomodating, not helpful and generally not pleasant.\n\nA previous experience with this location was when I placed an order online about 30-45 before their stated close time and they just never showed up. No online notice or call."
    },
    {
        "id": 24,
        "text": "was working here for a month now i get fired because customer called me names cursed me and i had no way to contcat store becuse the phones have been down over a month.\n\nHere comes the legal help now DO not order from here period.\n\nSeems like the cooks do not want to help drivers at all and this causes problems . \n\nYOUR order will be screwed up mising stuff or replaced with other food because they were out of what you wanted and the Gen mgr phone cant talk to you only text n e mail. LOL what a joke"
    },
    {
        "id": 25,
        "text": "I swear I haven't Yelped a review in ages but this place is so awful that I just HAD to warn people. The family and I have ordered from here since they've first opened several years ago. We've done both pick up and delivery numerous times and almost every single time it's like getting your teeth pulled. Pick up is ok, face to face customer service is mediocre (think checkout at our local S Philly Wal-Mart...yep), and the 15 min wait is 8 times outta 10 really 30 mins. Imagine a car with 2 toddlers, a elementary schooler and a hungry hubby at the end of a long day waiting outside of the Pizza Hut for 30 or so minutes. Oh yeah, I timed it. Delivery is AWFUL, AWFUL, AWFUL! The order NEVER arrives before an hour and once it took 2 hours. Of course the food was cold. We've never gotten hot food delivered to us NEVER! When I called to ask about the food,  someone answered with a \"we're closed\" and hung up the phone (sooo Wal-Mart).\n\nSo having not done business with these jerk offs for about a year, I decided to give them another chance because I'm a pretty forgiving, optimistic kinda gal. So about 2 weeks ago while visiting family about 6 blocks from the Pizza Hut on Front st, we ordered for delivery online. Our confirmation told us the expected arrival time was 2:54pm. Nice, that was about a 40 minute wait time. 3:00-nothing. 3:15-nothing. I call, guy with accent (Indian? Pakistani?) tells me delivery guy is out should be about 5 more minutes. Umm... we're 6 blocks away on an Oregon Ave intersection, the drive from there to P.Hut is only 3 minutes tops. I should know. I've drive thru-ed Mc D's, ordered, paid, received AND parked at the family's house in 5 minutes several times... GRRR! Anywho, about 3:40, we get a call saying delivery guy was outside. Open the door AND big fat NO FRIGGIN BODY! Car comes up the street pulls up and here's our order. FINALLY! He's like \"Sorry, there was traffic.\" I looked down the 6 blocks and then looked at him. Really? He just went there like I'm such an imbecile to believe that he was stuck in 40 minute traffic to get 6 FRIGGIN BLOCKS! Not even sure that I should mention that he sounded EXACTLY like the same guy who originally told me the delivery guy was already out."
    },
    {
        "id": 26,
        "text": "My friend ordered from here and the man that answered doesn't seem bright or is it just plain laziness? One time she went in on a Wednesday for the wacky wing Wednesday special. \"Uhhh I don't usually work Wednesdays so I can't give you that special\" she points out it's on the window advertising and he still refuses! \"I can give you a pizza nobody picked up\". Other time she calls for delivery. He answered the phone and told her it would be at least 2 1/2 hour wait for delivery. Ok fine. The food comes in a half an hour and the pizza wasn't cooked all the way through and the boneless wings were dry instead of being boneless and one with mild sauce and one with BBQ. Call the store. The guy says \"uhhhh I don't know what you want me to do\" she asks for a new order. \"I can't do that\" He offers a credit for next order! But I'm hungry now! \"I don't know what to say\". Seriously is this how you treat people. Ok let me speak to a manager. He says I'll have him call you back in an hour he's not here. After waiting she calls back and he says hold on and the SAME GUY gets on the phone and tries to change his voice lol. This place sounds like a joke. I wouldn't order from here and neither should you."
    },
    {
        "id": 27,
        "text": "OK all of you who cannot call the front st location 2715 s front st Call me on my cell 267-237-8458 or text the general mgr at 267-269-2565 his cell is broken cannot call or recive calls lol \n\nI can get the orders to the manager on duty today from 4 -11 tomorrow 11- 6 and mon. 11-5 \n\nDunno why they cant get phones fixed some weird company exclusive to pizza hut serves them."
    }
]