[
    {
        "id": 1,
        "text": "Last night we tried to get into the oldest Italian Restaurant in South Philly. Thankfully, they couldn't fit us in, so our son said lets try Angelina's  so we walked around the corner and into a small Italian Restaurant.  Immediatly we felt at home.  Angelina is cooking in the front of the resaurant and her husband is servicing. There were 3 of us and we started off with Eggplant and roasted pepper appetizer.  One bite and we were hooked.  We ordered the Veal Osso Bocca, Carbonara and lasagna.  Everything was absolutly DELISH!!  Can't wait to go back!!!"
    },
    {
        "id": 2,
        "text": "Loved everything about Angelina's Ristorante. The staff was amazing. While we sat there waiting for our meal we could see Angelina, the owner, cooking our food with fresh ingredients. The pasta was perfectly prepared and the sauce was absolutely delicious. We had a party of 16 to celebrate my daughter's graduation. The staff couldn't be nicer! I cannot wait to return to Angelina's."
    },
    {
        "id": 3,
        "text": "This place is great! It's a very cozy atmosphere, with around 10-12 tables.  The food was delicious - we had the Melanzane (eggplant parm) appetizer, as well as the Poleptta, which is basically a large meatball. The eggplant was huge, definitely enough to share. Same with the meatball, you only get one - but it's large. For the main course, I had the special of the night, which was fettucini, tomatoes, arugula, and shrimp mixed together with olive oil. Pretty basic, but delicious. My boyfriend had the gnocchi, which he also said was delicious.  Service was good, and the staff (basically one person) was super friendly and attentive. This spot is definitely worth checking out!"
    },
    {
        "id": 4,
        "text": "A small place in Queen Village. Food and service is excellent. The octopus appetizer was wonderful and the veal dinner was moist, tender and just perfect, this is my go to Italian place,"
    },
    {
        "id": 5,
        "text": "This is a place I have been looking forward to in the neighborhood. Keep in mind that this is a small space (7-8 tables), decor is not fancy.. but the service and food is fantastic. Angelina, is in the kitchen by her self, servicing the orders (this can be seen through a window in dining room). I did not have the chance this time to sample the main courses, but the  pasta was beyond fresh as was the burrata we had as an app -- I can't wait to work my way through the menu."
    },
    {
        "id": 6,
        "text": "Great spot for reasonably priced, delicious, and authentic Italian meal. Everything is made to order by one of the owners (Angelina?) in a small kitchen open to the dining area, which gives it such an intimate feel. Between the 4 of us we ordered 3 apps (burrata, octopus, meatballs), 3 pasta dishes (carbonara, gnocchi, rigatoni), and an entree (veal) and not a single dish disappointed. Honestly I had no idea a meatball could taste so good! The family that owns it is incredibly sweet and really cares about putting out the best food possible--even if that means a smaller restaurant. This is my new go to and I can't wait to go back!"
    },
    {
        "id": 7,
        "text": "I kind of don't want anyone else to know about Angelina's, but this review is a testament to the great experience I had there. This intimate cash-only BYOB restaurant looks like it occupies a former single-family home. There are only a few tables, and it is a small operation. I live in the neighborhood and when I walk by, I often see Angela herself in the small kitchen through the window on 8th Street. And that's how your food is prepared: carefully and thoughtfully by Angela, maybe with some help from her daughter. Angelina's is not inexpensive, but it's an affordable indulgence offering excellent quality (and service) for the price, which isn't true of many restaurants in Center City. My family enjoyed the salad, salmon, eggplant, spaghetti special, and tiramisu. That homemade tiramisu is incredible and generously portioned: one serving is plenty for two people. The only downside is that options are limited for vegetarians like me, but I realize that this follows traditional Italian cuisine. Our server was lovely and attentive, and he deserves an award for chasing us down the block after dinner with the prescription sunglasses we left behind."
    },
    {
        "id": 8,
        "text": "Reviewing Angelina's is easy. This is small, rustic Italian restaurant with only a handful of tables and it's sparsely decorated. If you are interested in beautiful furnishings and waiters in tuxedos, this is not your place. You will enjoy a full view of the wonderful food being prepared in the very clean kitchen as there is a large opening in the wall that separates the dining area from the kitchen. They have a BYOB policy which is always a good thing and the service is very attentive, knowledgeable and friendly. The food is what you come here for and it's the food that separates Angelina's from dozens of other Italian restaurants that can only dream of preparing & serving Italian food like this! Everything the 9 of us ate was great including the bread, Insulata Formaggi, Melanzane, Burrata, Polipo all Grilglia, Carpaccio Classico for appetizers and the Gnocci, Spaghetti all Carbonara, Pollo Angelina, Ossobuco, Braciola with meatballs & sausage for main courses. Each dish was prepared perfectly. For dessert, we shared the Tiramisu & the Ricotta Cheesecake and both were excellent. This was our first time dining @ Angelina's and we will definitely return on our next trip to Philly! Make sure you make a reservation! When we arrived, there was a long line of folks who didn't on the sidewalk waiting to get in."
    },
    {
        "id": 9,
        "text": "Angelina's is a hidden gem and a great addition to he neighborhood. It's very small so make reservations! The food was AMAZING! Angelina is literally cooking the orders herself. Everything was fresh and delicious. Our large group basically ordered one of everything and we loved every single dish. The service was excellent and we will definitely be back soon. \n\nCash only & BYOB"
    },
    {
        "id": 10,
        "text": "We had dinner at Angelina's this past Saturday. Four of our party of six are \"real Italians\", i.e., parents who are from Italy and cook great Italian food. My one cousin refuses to eat Italian food \"out\", as her mother lives with her and no restaurant meal has ever come close to her mom's cooking. Suffice it to say, she loved it. We all did. Everything was exquisite. Service was great and prices are more than reasonable. BYOB is a plus, as it is far more economical. Make reservations...there are only a few tables. And don't forget to bring cash, they do not take credit cards. We have already made another reservation for when we visit Philly again  in a couple of weeks (we live in Florida but visit our family in Philadelphia often, and we plan to bring them all here!)."
    },
    {
        "id": 11,
        "text": "It's amazing that so many other Italian restaurants have head chef's, sous chef's and countless others and still cannot prepare & serve food as good as Angelina's who basically does it by herself! If you have not been to Angelina's, it is a very small restaurant that is very simply decorated and you really need to make a reservation to avoid waiting on the line that forms on the sidewalk! Also, it's cash only. There is an opening in the wall that separates the kitchen from the dining area so you can watch the food being prepared and, it is a BYOB which is an added bonus!  The menu is not extensive but there are many wonderful selections to choose from. Everything we've had during our two visits was excellent from the pastas to the burrata and mozzarella, the eggplant and the shrimp with broccoli di rabe & chic peas. Angelina's is a very special restaurant!"
    },
    {
        "id": 12,
        "text": "Went to Angelina's tonight for the first time. Absolutely loved the place. The food was so delish, service was good. We had the salad, gnocchi and chicken with peppers and a light tomato sauce. The food was simple and good with enought to feel full but not overstuffed. Would definitely recommend and would go back again."
    },
    {
        "id": 13,
        "text": "We went here before a comedy show in town. We walked in and everything was clean, and the decor very charming. The waiter was very prompt and polite. The FOOD which is the most important part was INCREDIBLE!! We had 3 appetizers (don't judge lol). I live for the beet and burrata salad. I'm still dreaming about it! Also, the gnocchi is as soft as a down pillow. We finished our delicious meal off with 2 espressos and a perfectly sized slice of homemade Italian cheesecake. We were out the door in time to catch our show. I live about an hour away but I'm already plotting my next trip to Angelina' s. It's that good. If I lived close by I'd be there every week as prices are very reasonable for the quality of food served! I can't wait to visit again and see what else they have on special as well as order different things from the menu that we couldn't fit all into 1 dinner. Go and enjoy Chef Angelina's authentic Italian cooking."
    },
    {
        "id": 14,
        "text": "If you want Italian classic dishes prepared so wonderfully well that you may never eat them anywhere else again, eat here! The menu is a compact offering of apps, pastas and entrees, all dishes you have seen 1000's of times. The differences are apparent as the food is served-obviously only the finest ingredients are used and the balance of flavors is just perfect. The kitchen is open so you can watch the mother/daughter team prepare plates. How could spaghetti and meatballs taste so ridiculously amazing? You have to come here to find out! It's byo which we do love. \nService was attentive and good. The room is small so it can get noisy depending on the crowd. I'm glad we don't live closer cause this place could be addicting."
    },
    {
        "id": 15,
        "text": "I was totally blown away. The service was impeccable. The place had great atmosphere.....then the food. What a treat. I only had 3 nights in Phillie and my girlfriend and I contemplated going here twice. It was that good. Cannot praise highly enough."
    },
    {
        "id": 16,
        "text": "Loved the cooking while she was at Broad and Pine streets. Now that they have opened at a new location we had to go. I had the chicken parmesan and my wife had the salmone. After enjoying a great salad we were delighted with our main courses. The restaurant is very small (seating for about 25) and tastefully decorated. Bring your favorite wine and sit and enjoy a wonderful meal. Try it. I believe that you will like it."
    },
    {
        "id": 17,
        "text": "This is an adorable little restaurant and simply delicious! Our table got the Melazane and Burrata as appetizers and the Carbonara, Pappardelle, Salmon, Lasagna and Pollo Angelina for entrees. Everyone was basically licking their plates clean. The owners are literally the nicest people- overall it's a great neighborhood spot! We will absolutely be back!"
    },
    {
        "id": 18,
        "text": "An amazing little gem! I have eaten at almost every Italian BYOB in south philly and Angelina's has by far the most authentic Italian food.  It's a small restaurant (about 24 seats) which makes it an intimate setting. The service is friendly and you truly feel like you are eating at your family's house!"
    },
    {
        "id": 19,
        "text": "Best little gem we found! A BYOB small family owned Italian restaurant with a great family,  the freshest ingredients and they made us feel right at home. The food was absolutely wonderful and the atmosphere was superb. So if you get the chance to eat Angelina's cooking; you will not be disappointed. The bracciole, meatballs, sausage, sauce and pasta are the best best I've ever tasted. I will make it back to Philly and find my way to Angelina's!!!!!"
    },
    {
        "id": 20,
        "text": "Nice spot. BYOB Keeps it affordable great pasta and gravy. Very small handful of tables. Good service."
    },
    {
        "id": 21,
        "text": "Cash ONLY - but absolutely the greatest Italian food in the city!.  Hospitality was overwhelming and welcoming.  If your in Philly and you want great Italian food, in a small environment- head to Angelina's."
    },
    {
        "id": 22,
        "text": "Fantastic! Dined here with my wife for a Friday night date. Felt like we were walking into someone's living room for dinner. It's a small space, but it just adds to the intimacy of the experience. When it comes to Italian food, I'm one of the biggest snobs, but Angelina's did not disappoint ! The food was exceptional! Hands down the best meatball I've had while dining out. I will surely be back with other family members. Bravo!"
    },
    {
        "id": 23,
        "text": "Always wanted to try this hidden gem! Service was great - food was delicious. Recommend the lasagna, pappardelle with meat sauce, and the salmon special. Too full to try the ricotta cheesecake for dessert. Next time!"
    },
    {
        "id": 24,
        "text": "Angelina's is by far my favorite place to eat in Philadelphia!!!  The homemade pastas are simple and traditional yet so complex in flavor that you'll feel like your in Italy.  Tucked away a few blocks from the Italian market sits this warm and welcoming family owned restaurant.   The chef Angelina is always so sweet and cheerful and her husband Franco always makes it a point to stop by our table and see how we are doing.  My favorite dishes would have to be the Melanzane, the Carpaccio Classico, the pappardelle bolognese, and the veal chop Milanese.  No matter what you order, you won't go wrong.  Give Angelinas a try and you won't be disappointed!!!"
    },
    {
        "id": 25,
        "text": "I came here because there were so many great reviews and I wanted to take my girlfriend out to dinner for a special night. It was less than under whelming. We ordered for the octopus, bolagnase, osso bucco, and carbonara. Both the octopus and bolangnase were bland and tasteless. The carbonara was the best dish and still was not good. It was not fresh pasta, was still fairly bland, and there was not much panchetta in the dish. The osso bucco was dry and needed seasoning as well, and then had the pleasure of finding a hair in the dish. The server took it away, came back and tried to tell me it was from a vegetable..... seriously, a vegetable?  I was still charged for it on the bill. I won't be going back ever again."
    },
    {
        "id": 26,
        "text": "Of course I can't promise that this will happen to you, but when we were here a table of happy gentlemen gave us a bottle of very fine wine because they weren't going to get to it that evening. And we already had a bottle of our own! The guys were obviously great people. But I think it's the place -- this simple eatery -- that inspires generosity and joy. The tiny dining room shimmered with the delight of those few of us crammed in for dinner. It's a Mom and Pop and Grandpop restaurant, with grandson wiping down tables if he's done with his homework. The homemade pastas are fabulous -- silky pasta, rich sauces.  The veal chop was SUBLIME.  We heard them pounding it in the kitchen (which is basically in the dining room) and then we heard it frying and oh, the smell ... then of course the juicy delicious perfection of eating it. My new favorite restaurant in Philly!   And the creme brûlée -- Holy Mary Mother of God."
    },
    {
        "id": 27,
        "text": "Great atmosphere and really good authentic Italian food. The best gnocchi I have ever tasted!"
    },
    {
        "id": 28,
        "text": "I don't understand all of the 5 star reviews at this place.  The food my party ordered was all bland with everything either under or over cooked.  The octopus was bland and chewy, and my entree of the Bolognese was way over cooked with very little flavor.  The restaurant itself is cute and tiny, but outside of that, it's overpriced for not very good food.  Save your money and go elsewhere, or just make some boxed pasta with canned sauce at home."
    },
    {
        "id": 29,
        "text": "Angelina's is phenomenal. All of the food is home made Italian fresh and delicious. The Bolognese (gluten free or regular) is great. The osso buco is fantastic. Everyone is extremely nice."
    },
    {
        "id": 30,
        "text": "A true hidden gem and real winner!!! The owners are a sweet old couple from Naples! She does all the cooking. It was SPECTACULAR!!!!"
    },
    {
        "id": 31,
        "text": "Fantastic little local Byob!!! As authentic as it gets outside of having grandma cooking for you in Napoli!!! Felt so at home! Can't wait to go back."
    },
    {
        "id": 32,
        "text": "Awesome little place. Octopus and burrata were to die for! And the owners are fantastic."
    },
    {
        "id": 33,
        "text": "The food is to die for!!! Everything is home made by Angelina. The atmosphere and service is great! Safe to say this is my new favorite place in the neighborhood!"
    },
    {
        "id": 34,
        "text": "You feel welcomed into their home, as you pass by the kitchen on the way to your table, where a husband and wife team bring to bear their many years of experience at this charming location."
    },
    {
        "id": 35,
        "text": "What a gem of a restaurant! We happened upon Angelina's on our visit to Philadelphia today--so glad we did! Amazing food. Wonderful service. We'll be back for sure."
    },
    {
        "id": 36,
        "text": "Look we aren't big on rave reviews for many places we've been. This is mostly due to the fact that we cook at home and do what we know is great food. Somehow Angelina's has captured the essence of high quality low volume food that is unsurpassed by high ticket big fanfare places which always disappoint. \n\nWe ordered lasagna, amatriciana, bolognese, and the special shrimp arugula, pasta- carpaccio classic, octopus etc. All of it was authentic and on the money. \n\nProps to Angela and the kitchen. My compliments to them for keeping it real and as we remember good food. Craig LaBan we need more of this in your pursuit to bring Philly culture and great food to the forefront. \n\nCiao...."
    },
    {
        "id": 37,
        "text": "We are very glad we found this little gem not far from the Walnut Street Theatre.\nThe food was very good along with the service. It is a BYOB and cash only. Definitely worth it."
    },
    {
        "id": 38,
        "text": "Like walking into someone's home. The menu was pair-down and simple, a grand tour of Italy's finest. Pappardelle bolognese was some of the best I've ever had. The carbonara was smokey and rich, without being overly creamy. They even accommodated with a fabulous gluten-free pasta for all you allergy ridden people out there. BYOB heaven. A small kitchen right in front. Warm, friendly hosts and servers, most of whom have only recently come to America from Italy."
    },
    {
        "id": 39,
        "text": "Carbonara was to die for. We also loved the burrata. Great hidden gem in Bella Vista. Would go back! \n\nIt's a BYOB - remember to bring wine"
    },
    {
        "id": 40,
        "text": "This was such a delicious and fun experience I'm glad we found this adorable spot! My parents and I flew in from LA and arrive at Angelina's late but they warmly welcomed us. An Italian couple owns the restaurant, Angela makes everything homemade and we enjoyed chatting with Franco, immediately feeling like family. The gnocchi were like perfect pillows and their red sauce was simple with fresh ingredients. We had ricotta cake and chocolate mouse for dessert and they were amazing, we ate every bite! Cash only and BYOB with a wine shop a few blocks away. This spot is a must try for authentic homemade Italian food and great service in a quaint spot. Buon appetito!"
    },
    {
        "id": 41,
        "text": "A neighborhood gem! If you're looking for a family-owned, authentic Italian food, this is it! Food is very delicious. Service is attentive. Remember to make a reservation by calling. They do not have online reservations via Yelp or Opentable. Also, this is a Cash Only restaurant. The portions are average in size and could improve."
    },
    {
        "id": 42,
        "text": "Angelina's was able to fit us in for a reservation at the last minute, and we are so glad they did! The food was absolutely delicious. We got the meatball and burrata appetizers and the pappardelle and veal chop as main courses. All of it was amazing, but the pappardelle was the best I've had. The sauce was perfect and the noodles were nice and thin and homemade. It's a very small, family-owned operation with a mom and daughter doing the cooking. The service was great, and we had a chance to talk to the owner for a while at the end of the night - everyone was so friendly! We will definitely be back and recommend to all of our friends."
    },
    {
        "id": 43,
        "text": "Great food! We had this delivered and everything was fresh and tasty. Got the chicken parm and pasta and pasta with grilled chicken."
    },
    {
        "id": 44,
        "text": "Went there on a Tuesday night for a late dinner. Service was exceptional. It is a cozy, intimate place with limited tables so I would highly suggest reservations. I ordered the gnocchi and it was phenomenal. Large portion size, melt in your mouth delicious. For an appetizer we ordered the burrata, highly recommend as well. They are cash only and BYOB so bring cash and your wine! If you forget they're understanding and let you go to the ATM one block down if you need to. Overall reasonable price for a delicious, romantic date night!"
    },
    {
        "id": 45,
        "text": "We went to dinner last night at Angelina's after being recommend by a friend and it was out of this world. Such a wonderful BYOB. The place was so quaint and Angelina was in the kitchen cooking the food and it was amazing. I had the homemade Burrata and then the osso buco for dinner. Both absolutely delicious. We split the cheese cake and tiramisu for dessert. Both homemade and so enlightening. Can't wait to go back!! Great job!"
    },
    {
        "id": 46,
        "text": "This is a very tiny restaurant.  We walked here from our hotel on vacation. The food was really good. My sister fell in love with the spaghetti sauce. It was really light in color and seemed like it was barely there. But, the taste was delicious. We both enjoyed our meal."
    },
    {
        "id": 47,
        "text": "I first knew of this restaurant from Craig LaBan's review. I walked past the place one recent afternoon and saw Angela Iovino preparing food in the kitchen which is right behind the glass window in the front of the restaurant. I smiled at her and she smiled back. Last night, I went to eat there for the first time. We ordered the Polipo all Grilglia (grilled octopus), the Lasagna Napoletana, and the Pappardelle Bolognese. They were wonderful and perfect. As I was leaving the restaurant, I decided to tap gently on the window to get her attention. I waved at her with a smile and she waved back smiling and immediately returning to focusing on her cooking."
    },
    {
        "id": 48,
        "text": "At this small, 7 table, cash only, casual BYOB, you can see Angelina and her husband personally preparing their delicious fare in a small kitchen at the front of the restaurant. A paired down menu with a clear focus on quality food, clearly made with love and very friendly service. A hidden gem that shouldn't be hidden. Already been multiple times and as one review said, everyone was practically licking their plates clean. And If you have any special requests, just ask, they seem happy to want to make you happy. Meatballs, carbonara, eggplant, gnocchi, antipasto special, cannoli, tiramisu etc...All delicious. A must try, you won't be disappointed."
    },
    {
        "id": 49,
        "text": "I really liked the ambience of this small, family run Italian place in South Philadelphia. The staff were very friendly and helpful. The food came out in a reasonable time. I tried the meals of other people in my party too and I have to say the taste was not wowing me. Nothing was terrible, but nothing was amazing either. I've had amazing Italian food at other places in Philadelphia and New York City, and unfortunately, as much as the staff here were wonderful, the food was just not over the top. The tomato sauce didn't have much taste to it, the octopus appetizer had zero taste to it, and the gnocchi was very rich but nothing special. Also I found it odd that there were only two choices on the dessert menu, Ricota cheese cake snd tiramisu. We didn't end up having dessert because those two choices just weren't appealing to us that night, but perhaps those were good and we missed out."
    },
    {
        "id": 50,
        "text": "With there being many Italian BYOBs in Philadelphia, how do you stand out? Angelina's has the answer. Delicious, fresh food, exceptional service and a wonderful atmosphere. We were here for dinner last night. My sister in law made the reservation two months ago and thank goodness she did. There was a line when we got there and when we left! The menu is small, but that's fine by me. I started with the stuffed pepper appetizer, which was wonderful. Fresh red pepper stuffed with rice and cheese. For dinner, I had the veal chop which came with a salad of arugula and tomatoes, which cut the savoriness of the veal chop perfectly. We shared a dish of carbonara for the table. I wasn't in a pasta mood, but it was wonderful. We split two desserts - the bomba and the semifreddo. Everything was wonderful!"
    }
]