[
    {
        "id": 1,
        "text": "Everything I have tried here has been excellent! Service is good and quick. Staff is friendly, and welcoming.  Groupon has a good deal."
    },
    {
        "id": 2,
        "text": "I've definitely had better...ordered samosas and also the chicken tikka masala..both were disappointing..won't be eating from here again."
    },
    {
        "id": 3,
        "text": "I really want to give Taj India a break because I really appreciate them for being there. Northeast Philly is desperate for decent Indian food, and Taj is definitely decent Indian food. Decent. Sometimes great, sometimes kind of lacking, but almost always decent. However as far as Indian food goes I've had much better for the same or similar price within 20-30 minute driving distance. \n\nI never eat in the place, it's a little depressing looking and often with weird music playing...but it's clean...I just prefer home in this case.\n\nOh, they also have a wide array of Indian desserts but I think they  might be too authentic for most Americans' taste...not sure...I'm not into trying random sweets but that's what I've heard.\n\nStuff I love about Taj: they make dosas! but also do a good job at north Indian dishes like Channa Masala, fairly cheap, call in your order and pick it up! The food reheats fairly well in a warm oven or a quick dump into a pot on the stove. Viola! Like new! Oh and its all vegetarian! \n\nStuff I don't love: I have to ask 5 times to get enough mint chutney, the sambhar is a little salty at times, some of the curries aren't that good (don't do the black dahl! go for channa masala. Also the naans are really good as are a lot of the appetizers, including the samosas. \n\nAll in all, it's a great find for the area, but it's sometimes hit or miss on some of the dishes. However the naan, samosas, and channa masala have been consistantly good."
    },
    {
        "id": 4,
        "text": "This is probably my favorite Indian place in the city.  It has a great variety of food and each time I've gone it is served piping hot.  It's a great place to bring vegetarian friends.  My only recommendation is if you're sharing with a number of people don't get only dishes with the creamy sauce--it can be overwhelming.  I'd recommend the malai kofta."
    },
    {
        "id": 5,
        "text": "Came upon this place by accident and I'm so glad I did! \n\nMom and I had wanted to introduce my aunt to one of our favorite Indian restaurants, only to find it wasn't open for another hour... Lucky for us, Yelp directed us to Taj-India :)\n\nTaj was neat and tidy and the server was very attentive. I had two delicious samosas to start and then came my vegetable curry with basmati rice. It was yummy, though I underestimated my ability to handle the spice! :P \n\nThough I can't remember what my mom and aunt ordered, they loved their dinner as well. They also fell in love with the Indian coffee and vowed to find it and make it at home.\n\nOverall, definitely one of my new go-to spots when I'm in the Northeast. Doesn't hurt that the prices were modest for pretty sizable portions"
    },
    {
        "id": 6,
        "text": "I LOVE this place!  I've only eaten in the restaurant once and the service was friendly and efficient.  I order take-out once a week faithfully.  Everything is fresh and satisfying - and very spicy.  I appreciate having a vegetarian restaurant in the neighborhood, and it even satisfies my carnivorous husband!"
    },
    {
        "id": 7,
        "text": "I'm not vegetarian, which is why this wouldn't be my first choice for Indian. What I've had was very tasty though! Try the kofta! The food is decent, and offered mild or spicy. The Korma and Paneer Tikka Masala are on point!! The samosas are great as well. The location is convenient and prices are lower than most Indian Restaurants I've been to. It's  authentic and the portions are large. I highly recommend for vegan or vegetarian people!"
    },
    {
        "id": 8,
        "text": "Visited about 4 times now, always delicious food although service can be slow even on quiet day. Be careful in choosing your spice level...I find 3 or 4 comfortable. The channa masala is a favorite!"
    },
    {
        "id": 9,
        "text": "Bhature. It's bread that they fry. Fried bread. FRIED BREAD. It happens to be absolutely delicious, too. Their other breads [naan, kulcha, etc] were good and to standards you'd expect from a good Indian restaurant. But that goddamn Bhature, I'll have that all day.\n\nLet me first say that it's very nice inside, feels upscale and is definitely a nice place to take someone out on a date. They even play Bollywood flicks on the TV there, great distraction if the date starts talking about the Kardashians or her ex, so just lose yourself in the food and 100 people dancing on the screen.\n\nOpened up with the Pakoda, and having been craving it since I last been to Zaika, it hit the spot. A plate of it is perfect for four, a bit overwhelming for two. Since I'm an eternal fatass, I polished it off, but it didn't leave much room for the dinner...\n\nWHICH WAS INCREDIBLE. It was the Paneer Bhurji, and it will go down as one of the most tasty items I've ever had at any Indian joint. The waitress asked what level of hot I wanted it at, and I foolishly said 10 at first, but quickly revised it to a 7 when I saw her next. The lady friend insisted a 5 was intolerable last time she ate here, so I moved the heat index accordingly from my understanding of her tolerance.\n\nGood move, the curry made me sweat, but didn't break me. BEAST MODE MOTHERFUCKERS. The great thing about food from this region is how exotic it is in comparison to the foods we eat here everyday, so it's a real treat when they take so much care in its preparation and the outcome is as bangin' as my dinner was.\n\nThe place is entirely vegetarian, so the dish consisted of grated cheese, onions, and bell pepper with their special dash of spices in a curry. Wholly unexpected was the awesome dish placed in front of me, and staring down a dish of rice [it's included] and a whole basket of nom-tastic Indian breads. Having stuffed myself on the Pakoda, I had to force myself to eat the spicy dish until my stomach called it quits. Not sure if it was from the peppery goodness or just telling me that one man should not consume more than a couple pounds of food in a single sitting.\n\nLong and wordy, but you honestly just look at that star rating, and for there not being a lick of meat in the building, this place was unbelievably good."
    },
    {
        "id": 10,
        "text": "Deeply disappointed that this once vegetarian restaurant has started serving meat. At the same time, food quality in general seems to have taken a dip. I am grateful they still serve some vegan dishes, but things there have not changed for the better."
    },
    {
        "id": 11,
        "text": "My girlfriend and I got a groupon deal. The food was fantastic, so good in fact we got another groupon and will be back long after that too. We are both meat eaters but I left full and totally happy. Great food and service!"
    },
    {
        "id": 12,
        "text": "Small restaurant in a strip mall.  Started with 3 great soups, Nan breads and 3 different entrees - malai kafta,  bangen Barta, mushroom kabob. \n\nExcellent!  Probably the best Indian vegetarian food I've had! \n\nHighly recommended!"
    },
    {
        "id": 13,
        "text": "I'm somewhat ambivalent on Taj India. Here is my experience when ordering Paneer Tikka Masala last week during lunch.\n\nFirst, the restaurant is clean but way too cold. I could almost see my breath. They seriously need to dial up the heat a little bit. I did like the wall mounted TV screen playing BollyWood music videos. \n\nSecond, the food is only vegetarian and delicious. The Tikka Masala it self was some of the best I have ever had in Philadelphia. A bit spicy but nonetheless very good. Oddly enough, rice is not included.\n\nFinally, the cost. Way too high. The Paneer Tikka Masala and rice was around $14 I think. Buffet's are usually cheaper but Taj does not have one.\n\nI plan on returning one more time to check out their lunch special ($10). Hopefully the inside will be a bit warmer."
    },
    {
        "id": 14,
        "text": "Started by ESL student of mine, Bina,who has improved decor and, although menu remains solidly delightful."
    },
    {
        "id": 15,
        "text": "Fairly good Indian fare especially for this wasteland of Philly"
    },
    {
        "id": 16,
        "text": ".. Very okay place. Proportions were good, I have no idea what some people were complaining about. Def would recommend it to anyone"
    },
    {
        "id": 17,
        "text": "Great variety of vegetarian and vegan soups, appetizers, entrees. The waiter was informative, attentive and fun. Will definitely be returning,"
    },
    {
        "id": 18,
        "text": "I have came here 3 times for lunch, the service is good and food delicious. It is always empty, not sure why because the prices are very reasonable and food was good."
    },
    {
        "id": 19,
        "text": "O.M.G. delicious!!! Ordered delivery and all I can say, is WOW. Delivery process is effortless and quick. I ordered through the yelp app. Paneer tikka masala was great. The paneer tikka biryani even better. I have never seen anything like it! Naan is delish. I would say that the menu items are very unique. Only negative, prices are steep. But portions are good and food is even better."
    },
    {
        "id": 20,
        "text": "Found Taj-India when looking for a place via Yelp iPhone app :)\n\nI love Indian food, especially trying new places, so I checked it out. The location is in a strip mall, maybe not too inviting, but whatever. I'm a big fan of the little side places. The inside isn't anything to write about either, but it is clean and that, my friends, IS notable. The music is kind of weird, yes, but I felt like it added something. The place was totally empty and it was lunchtime on a Sunday afternoon. Weird, considering the place has to offer some great food. Our server was very nice and our food got to us quickly. I tried two soups, both were great, especially since I requested spiciness and received it! One customer did come to pick up something while we were eating, so it does seem like take-out is more popular. Would go back!!!"
    },
    {
        "id": 21,
        "text": "The food was very good, although a bit on the spicy side -- I didn't mind it but a word of warning to anyone who might have issues with that.  The service was also good, but we were the only people in the place so I can't say how it would have been if it was busy.\n\nI did feel that the prices were a bit on the high side, especially the section captioned \"Entrees.\"   Unless two people are ordering from that section, rice is extra, at an additional charge of $2.99, which I also feel is too high for a side of rice (considering 32 oz of Basmati is less than $5).  Anyway, that's why I'm rating it 4 starts instead of 5.  Good food, but expensive for Vegetarian Indian Cuisine, IMO."
    },
    {
        "id": 22,
        "text": "Food was very good, but service is very slow which is unusual for an Indian restaurant.  We've eaten in the restaurant and also gotten takeout. Last time they forgot to put part of my order in the bag, I didn't realize it until I got home, so be sure you check carefully before leaving."
    },
    {
        "id": 23,
        "text": "Love it, great flavors and portions, friendly staff and chill atmosphere. Been here many times and take-out is speedy and hot!"
    },
    {
        "id": 24,
        "text": "More like two and a half...\n\nI want to like this place, but overall it has been disappointing. First, Taj India is pretty much the only Indian restaurant I've ordered from where rice is not included with the curry dishes. Keep this in mind If you want rice since you will need to order it separately. Also, takeout arrived with just my small container of Chana masala and naan - no rice (as mentioned already, though luckily I remembered that from eating there several years ago), no napkins, and no utensils. Very no frills. The food is decent, I'd give it about three stars. It's not the best I've ever had but it's also not the worst."
    },
    {
        "id": 25,
        "text": "I LOVE indian food. Finding a place that makes it well is not that easy. I stopped by this place for lunch. I had the malai kofta extra extra spicy. It was SOOO good. I get takeout of the same thing about once a week. I get the cravings for it and HAVE to buy it. As I am typing this the cravings are starting. Guess what's for dinner?!?!  The people there are very nice. It seems to be a family that runs it.  Anywho the food is great. Be sure to try!!!"
    },
    {
        "id": 26,
        "text": "This place is great! My daughter that is not vegetarian and is very picky enjoys dining here. Everything I have tried has been excellent. Highly recommended."
    },
    {
        "id": 27,
        "text": "I almost feel bad about giving Taj 3 stars. It's definitely some of the best Indian food I've had, and if it were served in center city I'm sure it would be a hit. Unfortunately, it's in the northeast and not very many people frequent it. I'm also afraid my review won't be very specific... Indian food has an inventive and unique flavor combination that requires the use of spices that I'm sure I haven't even heard of before. And the names of the dishes are too difficult for me to remember if I've only had them once. \n\nAs I said, the food is great. We started with the vegetable appetizer platter, which had four different types of appetizers on it. But the amount of each type was so awkwardly decided: four of the onion fritter things, two of these other things, and just one of the spring roll and the giant other thing. For the entree, I had a lentil dish with a tomato-onion-spice sauce. This was delicous! But I was a bit put-off because they don't give you rice with your meal unless you buy two entrees. Since we were a party of two, we got the free rice but it was a small amount for two people. Not enough for the portion size of the entree, but just enough for the amount I actually ate in the restaurant. \n\nThe service and atmosphere are very meh. But I think that's okay for the northeast. In center city it definitely wouldn't fly. \n\nI would definitely consider this place if I were in the NE, but it's not worth a drive from CC just for it."
    },
    {
        "id": 28,
        "text": "My husband and I love bringing a bottle of wine in and enjoying the vegetarian food.  We always get an app, 2 entrees, and naan and are never let down.  We always have leftovers to bring home."
    },
    {
        "id": 29,
        "text": "The perfect meal: saag panner, cheese naan, falooda, and orange delight! Absolutely amazing!"
    },
    {
        "id": 30,
        "text": "Ordered from UberEATS. My main complaint is that their meals do not come with rice.  I obviously ordered from my phone and it could been the app but it was not clear, that their 16 oz did not include rice. It just initially looked like the difference was in in size. After I further invested a realized the difference Once again possibly an issue to take up with app. But it did not take away from the fact that I ordered my food, and I had tikka masala naan and no rice. So that was an instant bummer. It could've been more clear, or just charge me 2 dollars more and include rice with every meal. Also it is kinda expensive. The food isn't bad, but it is not anything spectacular."
    },
    {
        "id": 31,
        "text": "As a strict vegetarian, it is kind of difficult to go downtown all the time for great vegetarian cuisine. I come from the Northeast part of Philadelphia where the only thing vegetarian seems to be pizza fries.  Along comes one of the greatest surprises to come along in quite some time, Taj India. \n\nTaj India is without a doubt the best restaurant I have been to. The food is ALWAYS AMAZING!  The samosas are the best I have ever had from any Indian restaurant and the people at Taj India are always courteous and pleasant.  This is a restaurant both vegetarians and non-vegetarians can enjoy, the food is so good.  \n\nIf you are looking for amazing Indian food or just amazing food in general, look no further than Taj India. I guarantee you will love it and come back again and again!"
    },
    {
        "id": 32,
        "text": "We tried out Rangoli tonight and it was STELLAR.  Plenty of vegan dishes to choose from, and the staff knew exactly what was in each dish.  I had the Bhindi Masala and the Paratha, and I almost placed a second order to take Home for tomorrow...it was that good.  We will be back!"
    },
    {
        "id": 33,
        "text": "Food is good but not worth the price and customer service they have. They take forever to serve food. I have had bad customer service experience twice. They don't even look at you while taking order, there is no management of handling in house customers or taking orders on phone. Sometimes they forget to give you water eve after asking twice. And about food it is not that great. Samosa are hot from out side and you can still feel cold frozen masala inside."
    },
    {
        "id": 34,
        "text": "Great place with delish food.\nPotions are big, and not overpriced. naan is tasty, and coconut rice is to die for.samosas and sauce pairing are great as well.\nI Highly recommend this place."
    },
    {
        "id": 35,
        "text": "First impression was favorable.  The waitress was quick, and was helpful in recommending dishes to try.  We ordered the simosa, dal mahkani, and palak paneer.  All were amazingly good.  The food came out very fast, and was very delicious, and fresh tasting.  Spiciness level of the food will be more than you are expecting--I recommend going with mild if you are not sure.\n\nThe prices are very reasonable for the portion you get (a lot).  If you are ordering 2 or more entrees the rice is included.  Taj-India is a very good value and the food is amazing."
    },
    {
        "id": 36,
        "text": "I had dinner here after a friend's reccommendation. It absolutely exceeded my expectations! I had the palak paneer and samosas and they were fantastic! The palak paneer was creamy with slight heat and the samosas were very sizable, I had to save the second one for lunch! I will definitely be returning!\n\n(*Note - I had to change my review to 4 stars, the last time I ate here it really wasn't as great and they forgot to include my samosas and even the rice! I couldn't go back for it because I live pretty far away (about 45 minutes) and it just wasn't worth it. I will still go back but not as frequently as other Indian restaurants.)"
    },
    {
        "id": 37,
        "text": "Best indian food in the northeast! Very friendly service. Everything on the menu is delicious from beginning to end. Please support this place so they can continue to make delicious food for everyone :)"
    },
    {
        "id": 38,
        "text": "I'm not a Philly local, but I come here every time I'm in town, and everything I've had has been great.  \n\nThe restaurant is solely vegetarian, but meat lovers won't notice anything missing.  The food is excellent; it's incredibly flavorful, well spiced, and just plain delicious. Every dish I've had here has been excellent, but the Navaratna Korma is stunning."
    },
    {
        "id": 39,
        "text": "I ordered take out from here, staff was friendly and I did not have to wait too long. The mango lassi and mixed pakoras were fresh and definitely better than most indian restaurants in the NE area. However, the lamb samosas were not what I expected. You could barely tell that it was a lamb samosa as it was minimal amount of lamb and more potatoes. I will definitely not be getting that again. Also the wait staff could have been a little bit more clean between cleaning off tables from a large party and handling money and then wiping his hand on a table cloth to deal with checking my order and preparing the lassi."
    },
    {
        "id": 40,
        "text": "Pani Puri: 1/5\nIdli Sambhar: 2/5\nChole Bhatura: 4.5/5\n\nportions very small. got a groupon. kind of regret it. nice staff but the food is sub par. can find much better indian eateries for better prices."
    },
    {
        "id": 41,
        "text": "Got chicken tikka masala & garlic naan! Delivery was super quick which is a huge plus. (We ordered online). The masala was a tad too tomato-y/soupy for my taste, but was delicious nonetheless. The masala includes green peppers and nice portions of white chicken w/ jasmine rice. The size of the masala itself was really surprising as well, I think its the largest delivery serving I've gotten from an Indian place so far!"
    },
    {
        "id": 42,
        "text": "My husband and I got a gift certificate here, so we decided to give it a try. The food had amazing flavor and there was lots of leftovers. Pricing is typical to Indian restaurants. we had the bread basket, pav bahji, vegetable biryani, and karahi paneer.\n\nWould definitely try again."
    },
    {
        "id": 43,
        "text": "I love the food here and have been here several times. The atmosphere is delightful, the staff are helpful, warm, and friendly. The presentation, taste and service of the food is quite impressive also. Keep up the good work!"
    },
    {
        "id": 44,
        "text": "Staff was great! Very friendly! Food was very good!!!! Loved the mushrooms in gravy!!!! We  mistakenly stayed a half hour past closing and they were still really nice while asking us to go home!!!"
    },
    {
        "id": 45,
        "text": "My wife and I really enjoy going out for indian and we love this place. We wish we lived closer but instead always visit when we are in the area. There food isn't heavy like many Pakistani places. We always enjoy their nice and home like curries and breads. Give this place a try it is like eating Indian food at home."
    },
    {
        "id": 46,
        "text": "This is my probably bast restaurant,,,,if you're going this place met chef Brian . He work as a art food was amazing and delicious service also good we will come soon"
    },
    {
        "id": 47,
        "text": "My favorite for Goat Curry in the North East. The portions are always huge and the taste is always on point."
    },
    {
        "id": 48,
        "text": "First time eating Indian - knocked it out of the park. Service was quick and friendly. Server ensured we understood the menu and the level of spice in the food we ordered. Had two appetizers and shared a spinach entree - amazing flavors!! I'll be back"
    },
    {
        "id": 49,
        "text": "I'm not new to Indian cuisine, but it is my first time here!\nThe atmosphere is nice, relaxing, quiet and clean!\nThe staff is very nice and attentive, they did give suggestions on a few dishes I was not familiar with, the food was cooked fresh and to perfection!\nVery tasty!\nThis was my wife's first time trying Indian foods, we will return with other couples to eat here again in the very near future.\nBy the way I loved the fresh Indian style hot coffee very tasty!!\nDefinitely two thumbs up for this place!!"
    },
    {
        "id": 50,
        "text": "Vegans take note!! I did take out from this restaurant while visiting Philly on business. \n\nThe food was excellent! They have many vegan options. I tried 4 different things and all were delicious! I highly recommend the Baingan Bartha and Tandoori Roti (vegan bread option).\n\nThere are 2 reasons why I didn't give a 5 star review. Both items are easily fixed. First, takeout should either have utensils included or the customer should be asked if he/she needs utensils. Neither happened and I had to find my own.  Second, there was incense burning in the restaurant. This was a turnoff and I almost didn't order. A restaurant should NEVER smell of anything other than the yummie food.\n\nI will be back in Philly in 3 weeks. I want to try more of the vegan menu! I hope they fix these 2 things. If so, they will get 5 stars from me!"
    },
    {
        "id": 51,
        "text": "As a \"tester\" dish at new Indian restaurants, I always get Mattar Paneer. It was VERY GOOD here! You can choose a spice from between #1 to #10; I got 7 & my mouth was on fiiirreee but not too much that I couldn't taste ;) \n\nThe dish didn't have a metallic taste like MANY places have somehow made their Mattar Paneer taste. The only con was that there was no lunch buffet :-/ But prices are reasonable and they give you HUGE portions!"
    },
    {
        "id": 52,
        "text": "I visited this restaurant while on vacation from Texas. I'm glad we visited because no matter your taste preference, the food is great. My girlfriend enjoyed her spicy Dal Makhani while I was impressed by the sweet and savory Chicken Tikka Masala. I thoroughly enjoyed the Lamb Samosas as well. We both felt very welcomed and free to ask questions since the owner was attentive and friendly. I recommend you try it out!"
    },
    {
        "id": 53,
        "text": "what the crap are some of you people talking about here? they DO NOT serve any MEAT. so how good is the chicken again?"
    },
    {
        "id": 54,
        "text": "It was my first time ordering from Rangloli. I ordered chicken tikka masala (extra spicy), rice and  samosa. At first I was impressed on how hot and flavorful the food was. But then, I saw how many pieces of chicken (3) I got and was so disappointed. \n\nHonestly I would've ordered again if the portions were bigger. Also, this place is 5 mins away and delivery took over an hour. Besides that, the food was delicious and I hope customers get more for their buck next time."
    },
    {
        "id": 55,
        "text": "This stretch of Bustleton Avenue in Northeast Philadelphia is lined with one strip mall after another, and it is hard to tell them apart. Each has a few restaurants in them, but unless you know what you are looking for you are likely to become numb from their sameness and just keep driving. Taj India could unfortunately suffer than ignominious fate, but luckily is located right next door to the new Georgian Breads, and a street before the new Super Wawa.  It is worth finding. \n\nThis is a vegetarian house.  Their menu consists of six pages of mostly Kerala delights, with a little other North and South India thrown in to keep it interesting and popular. It was a perfect place to settle down after excellent foot massage right up the road at Lavendar Spa.  \n\nWe shared these dishes: Sweet Corn Soup, Chili Pakoda, Kaju Curry, Vegetable Jalfrezi and Garlic Naan.  All were good to near excellent, except for the Masala Tea which was tasteless and disappointing. I love most forms of corn soup, and this was fairly standard. Sweet kernels with a light dusting of curry. Not sure if it came from a fresh ear of corn or a can, but it was still good.  The Chili Pakora was a nice surprise - Jalapeno peppers stuffed with mashed potato and spices, dipped in a heavy pakora breading and deep fried.  Very spicy and a strong nod to Indo-Mex cuisine.  The Kaju (cashew) Curry was a cool play on nuttiness in a mild, almost sweet pale orange curry.  Terrific. Perfect for sopping up with the Garlic Naan, which was more lightly tandoored than most I have eaten.  The texture was not heavy with oil nor garlic, despite its strong taste.  Very well done. Finally, the Veggie Jalfrezi provided a mix of mostly standard local green is a pleasant moderately heated curry.  We went with Level 5 on all dishes, except the Chili, and found it adequate for our tastes.  Regardless, some were hotter than others, but quite satisfactory across the board.  \n\nService was friendly and efficient, and prices on the pleasant side of reasonable. $44 for all the above four dishes, naan and tea.\n\nThere are several decent Indian kitchens in this area, and Taj should be on your list when in the neighborhood and in the mood for quality vegetarian meals."
    },
    {
        "id": 56,
        "text": "Stopped by here for a quick lunch with my mom while in town and this was solid, no frills Indian food. She had the curry shrimp lunch, I had the goat saag and both came out quickly and were tasty. We both also found the portions deceptively large (I had enough leftovers for dinner). The naan was lovely while fresh, and the rice was totally fine, but not special. Service was prompt and friendly. All in, I would totally return when I'm next in the area."
    },
    {
        "id": 57,
        "text": "The best Indian food in philadelphia! Hands down!\nPolite staff, nice atmosphere and great food, we tried multiple dishes and all of them were great, something to be compared with the nice restaurants in ne"
    },
    {
        "id": 58,
        "text": "There food is absolutely to die for.\n I've been ordering food for takeout, and I can't get enough of the vegetable food.\nI have been in many Indian restaurant but this place is special if you like trying new restaurants definitely give this place a try... :)))"
    },
    {
        "id": 59,
        "text": "I was in the area for a course and this time fellow Yelp reviewers guided me in the right direction. \nI called ahead and confirmed that they did indeed make Masala dosas since a previous reviewer had mentioned that the menu listed on Yelp site wasn't accurate. I was happy to hear that they did have dosas. \nI was the only customer there at 11.45am on a Tuesday. The waitress was friendly. She turned on the big screen TV with Bollywood dance videos on for my entertainment as I sat there alone waiting for my dosa. \nWhen the dosa was brought out, I was happy with the portion size. The spiced potatoes inside were more than I needed. I couldn't finish them all. The Sambar & chutney were also good and tasty. They tasted fresh. \nMy only criticism is that the dosa and the potatoes were a bit oily (hence not giving them 5 stars). But they satisfied my late brunch/early lunch appetite. Half way through I did order a Mango lassi to go. It is Mango season after all (in India). \nThe lassi was made from canned Mango pulp not fresh mangoes. But it was tasty and helped me prevent 'agida' from the slightly oily dosa. \nOverall I was happy with my pick today. I would definitely go back here if I was in the area."
    },
    {
        "id": 60,
        "text": "I love Taj.  I'm not a vegetarian, but this purely vegetarian Indian restaurant is some of the best Indian food I've ever had.  It's located in a strip mall in northeast Philadelphia.  By looking at the place, you might think it's just another average joint.  Their decor is bland and they don't have a cool atmosphere going on, but the real magic is in the kitchen.  They serve up both Northern and Southern styles with delicious flavor combinations.  They have an array of naan to choose from, lassis, and Indian-style desserts.  My only complaint is that for some reason they're stingy about the rice.  It's the cheapest ingredient in the meal, yet they charge $2.99 for a side of white rice when it should come with your entree by default. Give them the pickle!"
    },
    {
        "id": 61,
        "text": "Taj India is the most authentic Indian vegetarian restaurant around (at least outside of Edison, NJ).  Many restaurants purport to have India cuisine. But what they are really serving is an Americanized version of Indian food that relies heavily on meat and poultry.  The food at those places may taste good, but it not true Indian. Taj India is the real deal. Masala Dosa is to kill for. So is their Chana Masala and sag mushroom. Now here's the problem: consistency. You ask for mild spice and you may get a bland dish or you may get a bowl of fire.  Sometimes a dish is too watery, sometimes its dried out, and sometimes its too greasy.  So they definitely need to pay more attention to detail."
    },
    {
        "id": 62,
        "text": "This place was my first taste of Indian Food and has sparked an obsession in me. My friend and I came here and got to-go orders, but the interior here is clean and nicely decorated, I would definitely stay to eat in during another occasion. I order the vegetable curry and the garlic naan. Everything was amazing. The food is well prepared and so full of flavor! The spices all mix well together and not one of them overwhelmed the others. The naan was perfectly baked and a great addition to scooping up my curry. Portions here are huge and the lunch I ordered was enough for me to have a great dinner that night too."
    },
    {
        "id": 63,
        "text": "Great Indian vegetarian food. The entrees and breads have always been fresh, and the service is good. The samosa's however were reheated, that too somewhat inadequately. \n\nOverall I love this place and will return often :-)"
    },
    {
        "id": 64,
        "text": "Excellent food dishes that are well presented and has wonderful ambience/decor. The restaurant is great for dine-in or take out!"
    },
    {
        "id": 65,
        "text": "The best Indian restaurant in north philly serves Authentic Indian food. BYOB which makes it much better place for a weekend dine out . Hot and Sour Soup and their tandoor dishes are must try."
    },
    {
        "id": 66,
        "text": "Tucked away in a fairly discrete strip mall, this place probably mainly does take out orders but does have a few tables where you can stop in if you want a flavorful and healthy('ish...i mean it's vegetarian right?) meal. As stated, there is no meat in this establishment, but that doesn't stop them from having some delicious Indian food anyways. Came here and got a lunch special of the Paneer Tikka Masala(which comes with a veggie samosa and your choice of naan or rice), along with the Mushroom Bhaji with rice. Everything tasted great and for lunch the paneer lover's platter(which was the aforementioned tikka masala, samosa, and naan or rice) was a great deal at $10.\n\nSome issues still stand; Apparently rice doesn't come with their meals normally and with the random sides here and there it can get a pricier than you'd expect. But that aside, the food is delicious and the portions we have had were plenty filling. For a wide selection of vegetarian options, I think I'll be back."
    },
    {
        "id": 67,
        "text": "They have the best chicken tikka masala in the area! Love getting lunch from here once in a while."
    },
    {
        "id": 68,
        "text": "Am I rating on quantity of food, or quantity of sauce? I ordered butter chicken, navratna korma, and saag paneer, as well as some naan. All of it was truly awful. There were so few pieces of chicken in the butter chicken. It was basically a big bowl of sauce. Same with the navratna korma - all orange sauce that tasted no different from the butter chicken sauce. It's not supposed to taste the same! And the saag paneer? It was like someone took greens and put them in the blender. So gross and not at all what saag is supposed to be like. For $123 dollars, this was the most expensive horrible food I've ever paid for. How are these folks even still in business?!?"
    },
    {
        "id": 69,
        "text": "My sister and I decided to try this restaurant out since they had a pretty good deal on groupon, despite some negative reviews. First thing we noticed when we walked in was the SMELL! It smelled like rubbing alcohol! Even the water started to taste like it. We even had to resort to putting lotion under our nose. We got some relief when the samosas came out since it masked the stench, but it was short lived since the samosas tasted rotten on the inside. After that major disappointment, the waiter came with our entree. The mutter paneer was actually awesome and made us forget the smell for a while. That's why we decided to give the restaurant 2 stars instead of 1. The waiter was also very attentive but we were the only people there. Maybe the smell isn't a regular occurrence but I would recommend pick up if you want their food."
    },
    {
        "id": 70,
        "text": "Ordered from Rangoli yesterday evening and I must say I was pleasantly surprised by how good everything was! Take out Indian can be hit or miss if you don't know the right place but I will DEFINITELY be ordering from here again. We ordered two meals and they were both delicious. I got the goat curry and traditional naan. The meat was tender and the curry was super flavorful. The naan was warm when it arrived as well. My mom got the shrimp biryani, gulab jamons and said everything was great. She also noted the serving size was generous. My only complaint is that I wish I was given more rice for the amount of curry, but that's what naan is for I guess! \n\nDo yourself a favor and order from this place!"
    },
    {
        "id": 71,
        "text": "Last night was the first time that my husband and I bought food there. I ordered the (mild) Lamb Rogan Josh, and my husband ordered the (medium spicy) Lamb Korma.  The lamb was tender, and we loved the sauce.  He is somewhat used to spiciness, but he would've preferred it less spicy.  He will order mild next time.  The  vegetable samosas were delicious!  I am happy that I don't need to move to India just to get good Indian food. -- ha!"
    },
    {
        "id": 72,
        "text": "um this place completely sucks. sorry, but true. \n\nThe staff is nice. The atmosphere is decent. The food sucks. \n\nNow i feel kind of harsh, but the food is just really bland. like don't have pani puri on your menu, if you can't make it right. take it off. today. seriously.\n\nMoving on, the masala dosa was just okay and the accompanying sambhar was badddd. first of all, they are so cheap that the one bowl of sambhar isn't even filled completely. Secondly the temperature is lukewarm. bad combo!\n\nif you like indian food like pani puri, go to desi chaat house. \nif you like sambhar, go to sitar. (they don't have dosas though)\nuh Indian garden in yardley is really good too! especially their paneer bhurji. \n\ni am going to give them the chole bhatura though. it was on point. right portions, spices, the bhatura was super soft. good job! \n\nHowever, this is not a restaurant that fills my indian food craving. This is the type of restaurant, where after you pay, you're filled with regrets. like, i could have just gone to wawa."
    },
    {
        "id": 73,
        "text": "Senior Management was feeling generous today, so off we went for dinner. SM had the Pani Puri; I had the Masala Papad. Fresh, tasty and well-prepared. Generous portions. Main courses of Masala Dosa (me) and Rangoli Special Grill (SM), featuring shrimp, lamb and chicken tandoori. I suspect SM ordered this, the most expensive entree on the menu, since SM was not hamstrung by my $10 entree ceiling. Everything was perfect. The tandoor was individually prepared and not pre-made and reheated. SM also ordered a mountainous Vegetable Biryani which was beyond tasty. Garlic and Cheese Kulcha served mop up duty. After we procured a U-Haul for the leftovers, dessert was Rasmalai and Pista Kulfi, both a fitting ending. SM pondered the $60+ bill with Masala Chai. SM will be back. Hope SM will consider to treat me again soon."
    },
    {
        "id": 74,
        "text": "Delicious food. I order from there all the time. Although it does seem a bit expensive than it should be"
    },
    {
        "id": 75,
        "text": "I have been here 4 times thus far, and always enjoy the food. My boyfriend did also. The same waitress has been there each time. Some things are better than others, but overall it was a good experience. I didn't think the decor was weird, I thought it was rather pleasant, but the absence of surrounding chatter can get a little creepy as 3 times out of 4 all other tables were empty. I hope they survive the recession."
    },
    {
        "id": 76,
        "text": "Good food. Not my favorite. Tikka masala and butter chicken aren't as thick and creamy. The naans are very good. And extra rice is an extra $3. Very expensive to me"
    },
    {
        "id": 77,
        "text": "This place is delicious.  Great vegan options,  definitely order the vegetable samosa,  and hot and sour soup.   We also had bhindi masala and aloo ghobi,  both good.   Order directly from restaurant, save on grub hub fees for pickup."
    },
    {
        "id": 78,
        "text": "Hands down the WORST indian food I ever had! Ordered dal yellow spicy number 2 (they asked from 1-10 how spicy she told me 1 being mild 10 being hottest), the spicy number 2 was like spicy number 5 or 6. It was SO damn hot. It was also very very watery almost soup like. The samosa was very salty and greasy and again very spicy, the sauce was spicy too! The nan was ok not great but it was too thick. Overall I would not come here again and Im really made I spent $22 for this crap!"
    },
    {
        "id": 79,
        "text": "This is easily the best South Asian food in the area. Food tastes great and is of quality. My only complaint is the quantity of chicken in some of their dishes, for the price I feel like it should've included a little more chicken. Nevertheless, if you want indian/paki food, this is the place to go if you are in NE Philly."
    },
    {
        "id": 80,
        "text": "Avoid at all cost! Bad service and even worse food. Even the dosa which is pretty much an item you cannot go wrong with was bad. It took ages for someone to take our order. The vada was half fried and the dahi vada tasted raw. The dosa was burnt at the edges. There surely must be better places for indian food than this one"
    },
    {
        "id": 81,
        "text": "I was extremely disappointed with my yesterday's order. The chicken tikka masala had no flavor. The chicken wasn't cook. And the sauce was awful. It was like tomato sauce not creamy at all :("
    },
    {
        "id": 82,
        "text": "One of the best places in the area for great  food. I've been here twice. The atmosphere is very cozy. The portion sizes are good; nice value for the amount paid for. I've been searching for a good vegetarian restaurant in this area and I believe I've found it!\nI love the vegetable samosas and naan bread! \nThe staff are very friendly and professional. I will be a regular customer while I'm in the area."
    },
    {
        "id": 83,
        "text": "Honestly, I can't tell you how much of my life is spent searching for new places to get a good piece of naan. Taj-India is one of those places that makes my entire quest worth while. Over the past week, I have made NUMEROUS visits just to order some freshly baked naan (garlic or masala) and a serving of onion kulcha.\n\nThis little store in a strip mall, which offers only strictly vegetarian foods and prepared dishes, seems to do most of its business in take-out and catering, as there's barely room for two families in the store itself. But if I lived closer, I'd have no reservations about grabbing lunch there; today, they had a 75 cent samosa special (they looked glorious) and the menu is filled South Indian dishes, curries, and --something that sounds interesting to me but I haven't tried -- several Vegetarian-Chinese dishes prepared \"Indian style.\""
    },
    {
        "id": 84,
        "text": "My husband and I ate here recently with a Groupon, and were really excited to try a new Indian place. It's not too far away from our house, so we hoped that it would become a regular spot.\n\nFirst impressions were fine- the place is nicely decorated and clean. The menu has a lot of options on it.\n\nWe ordered the garlic naan, I got the masala tofu, and my husband got the vegetable grill.\n\nThe food took a while to come (others were served before us who sat down after us). When it came...that's where the issues started. \n\nI do not have a huge appetite, so it is not often that I complain about portions being too small. However, this place had the tiniest portions that I have ever seen in an Indian restaurant. There were about 10 small pieces of charred/overcooked tofu on my plate, on a BED of onions. That's it. 1 small tomato, a smattering of peppers, and more onion than a person should ever eat in their lifetime. When I ordered Masala Tofu, that's what I wanted...not charred tiny tofu with masala onions.\n\nMy husband's meal was OK, but he didn't love it. The garlic naan was disappointing. I love naan, but this was not good. However, I was very hungry, so I ate it anyway. \n\nI wish that I could have rated this place more highly, I do admire their vegetarian menu as a great option for people who enjoy that, but the food was just awful, and the portions are absolutely tiny. There are many other Indian places in a 10-15 minute radius that are far better."
    },
    {
        "id": 85,
        "text": "I'm not an expert on Indian food, but I'm not new to it, either. I was upset to find that the Uduppi Dosa House in Bensalem had closed (according to a review I found online... If I'm wrong on that please correct me), so I did a Google search for Indian vegetarian restaurants near enough to Hatboro and Jenkintown to drive to in a reasonable amount of time. My wife and I wanted to have dinner with friends who are vegetarian and who also like Indian, as we do. Taj-India came up and I know the neighborhood so we went.\n\nIn my limited experience, I have to say it was the best Indian I have yet eaten. We talked to our server for awhile. She was very friendly and she recommended a number of dishes which we agreed to. For the life of me, I can't remember all their names, but the Palak Paneer, bread basket including naan, and the appetizer plate which included a giant and very well packed samosa were fantastic. The other dishes were curries. Again, I don't recall their names but they were excellent. According to our server, the chef has free reign and his dishes reflect his regional cuisine. I believe it is from Southern India. \n\nWe shall go again soon. It looks like the Indian expats in the area are having a bit of a hard time introducing their food, since there is a hearty expat community from Russia and Ukraine already there. There area some fine restaurants from that side of the world along Bustleton Ave., too. However, please check out Taj-India so they can do well and so my family and friends can enjoy it for a very long time. You will not be disappointed."
    },
    {
        "id": 86,
        "text": "I made a reservation for 15 for dinner on a Saturday night at this vegetarian Indian restaurant and was very pleased. The service was a bit slow and everyone got their food at drastically different times, but the appetizers came out quickly and we didn't notice the wait so much. This BYO restaurant in NE Philadelphia is a perfect place for all as many of the meals were vegan/vegetarian friendly. The tables are limited but I didn't see a time through the evening where it was particularly busy."
    },
    {
        "id": 87,
        "text": "Scam Alert!!  This restaurant is refusing to take valid local flavor certificates, even though they continue to sell certificates on the app??? 9/22/2020\n\nIn Reply to employee: I was told by you, you no longer take these certificates, even though they are valid and even though you continue to sell them, how is that not a scam? You agreed to take my certificate because the food was already made and you knew if you refused to take it I would have left the food there and not payed anything.  Then told me several times no more in the future, we no longer take these certificates. You made a deal with the local Flavor company to sell certificates on there app, now your refusing valid certificates, refusing to honor your obligations. 9/23/2020"
    },
    {
        "id": 88,
        "text": "My all time favorite Indian restaurant. Others do not compare. We started ordering takeout from here during the pandemic. Even if this place is a little further away, it's worth it."
    },
    {
        "id": 89,
        "text": "Biryani with aluminum scrubber pieces ?? I never imagine that recipe to eat!!! Owners should ensure you serve decent basic food to customers who with hunger!!"
    },
    {
        "id": 90,
        "text": "This is me and my boyfriend's favorite restaurant at the moment.  We go once a week and love everything we've gotten.  The stuffed paneer pakora is amazing.  The curries taste fresh and the flavors are very bold.  We order it very spicy and they still have an amazing flavor.  The staff is very nice and the portions are pretty big.  Definitely reccomend it!!"
    },
    {
        "id": 91,
        "text": "Just found this place by accident.  Me and my kids were in the mood for masala dosa, called around and they were the only once in the NE Phila area that said they have it.  We ordered masala dosas, butter chicken and naan.  The dosas were crispy and very flavorful.  Butter chicken and naan were also excellent.  By far the best Indian restaurant in NE Philadelphia.  I am extremely critical of food in general, especially Indian food.  I highly recommend this place!!!"
    }
]