[
    {
        "id": 1,
        "text": "Today again we went this restaurant.its lovely atmosphere and staff was friendly.i took two friends with they also happy about chicken tikka masala,chicken shahi korma and veggie somosa was yammy. We will back again."
    },
    {
        "id": 2,
        "text": "Excellent fresh large portions true North Indian vegetarian-friendly and great service. They supply complementary popadum as appetizer. Great garlic naan."
    },
    {
        "id": 3,
        "text": "Service was friendly and attentive and made us feel at home. Food was delicious, but I will say if you like heat, ask for \"spicy.\" I made the mistake of asking for medium and it was closer to mild. I suppose that's better than going overboard and having it be too much. But the flavors were fantastic.\n\nVery accessible menu for those who aren't fully acquainted with Indian food. We had a few questions and our server was very knowledgeable about the cooking process. The more you learn! They also have many options without being overwhelming. Plus they're a BYO and they have a rear seating area to impress your date with.\n\nI hope they're around a while, South Philly doesn't have many options for Indian. Definitely going back here."
    },
    {
        "id": 4,
        "text": "This was my first time coming here and it did not disappoint. The food was delicious and the service was good. Everytime I eat at an Indian restaurant,  I must order the samosa and nan. The samosa was crispy and was seasoned nicely,  the 3 sauces that came with it made it even better! The garlic nan was piping hot and was topped with the perfect  amount of herbs and garlic. I was hesistant on what to order for my entree so I played it safe and ordered the chicken tikki marsala. I asked the waiter to make it hot because I love spicy food. Lucky for me, it was spicy but not to the point where I couldn't enjoy and taste my food. The chicken was juicy and there was surprisingly a good amount of it because I couldn't finished and had to packed it to go. I can't wait to eat my leftovers tonight, so what does that tell you?"
    },
    {
        "id": 5,
        "text": "The food was fantastic! Full of flavor and spice but not all the cream at some Indian restaurants. The place was inviting and had a great location, even large enough for events. They even have an outdoor The wait staff was diligent and our food came out quickly! Overall a great restaurant that I will be bringing my friends back to."
    },
    {
        "id": 6,
        "text": "Best Indian food!!! Nice atmosphere and great service!!!! Specially Owner was very customer friendly. If anyone loves Indian food then highly recommended this restaurant!!!! Welcome to the neighborhood and best wishes for them!!!"
    },
    {
        "id": 7,
        "text": "Service was excellent, very attentive and friendly. Food was delicious, we ordered the lamb korma and a chicken dish with ginger (forget the name) and both were great. Also the garlic cheese naan was awesome. \n\nI'm super excited to see an Indian restaurant open in the neighborhood and hope they stick around."
    },
    {
        "id": 8,
        "text": "The food is simply amazing! We ordered lamb vindaloo, mixed tandoori, and a couple of other small dishes. The amount of butter and oil was just right and the taste was very authentic. The food came a little slow but it was worth the wait."
    },
    {
        "id": 9,
        "text": "This is a welcome addition to Passyunk. My first experience with this restaurant was ordering delivery. The food was excellent and delivered quickly. The second time was dining in. Service was prompt and attentive. The food was again excellent and combined authentic Indian flavors with accessibility. Like most Indian restaurants, it is very vegetarian friendly. The nan was great and the samosa chaat as well. They have a large outdoor patio similar to the magic garden on south street. When I went it was too hot to dine outside but I'd like to try it some day."
    },
    {
        "id": 10,
        "text": "I love Indian food and I found their food good especially the rice but the spice overwhelmed the dish. I couldn't taste anything else. Too many peas in the muttar paneer. But good other wise. I had the mild spice. I can't imagin the hot."
    },
    {
        "id": 11,
        "text": "Ordered delivery through Yelp and was pleasantly surprised my order arrived in 20-30 minutes! The food was very tasty. We ordered lamb samosas, lamb Rogan josh, chicken shahi korma, and naan. All of the items had great flavor. The chicken was fairly spicy even though I ordered mild, but I enjoy heat so wasn't a problem. We will be ordering again and will definitely be trying the dining in option."
    },
    {
        "id": 12,
        "text": "Yesterday was our second time visit \nThe Palace Of Indian , oh my god it was full of customers and we didn't reserved the table before any way They were able to give us seats, food was awesome as same my first visit . This place is so popular and busy so we can't expect like home service, restaurant was full and whatever they gave us service it was more than enough of our expectations, we visited so many restaurants and somewhere we have to wait outside fo long time for seating, so definitely we got the good service, and they have lot of delivery from Grubhub, \nDefinitely come back again,"
    },
    {
        "id": 13,
        "text": "Excellent food and nice atmosphere \nServices is awesome , we ordered Chicken Tikka\nMasala , veggie samosa and Garlic & cheese \nNaan , it was delicious and flavorful \nDefinitely we will be back"
    },
    {
        "id": 14,
        "text": "Just had lunch at this location. I typically choose Masala dishes. But the owner was super helpful in helping me select something just as tasty. I had a jumbo shrimp dish that was awesome! They have lunch specials until 3. Dinner starts at 4. Definitely a neighborhood gem!"
    },
    {
        "id": 15,
        "text": "This was our first time eating at this restaurant.  We were greeted and seated at a window seat over looking the singing fountain square in Passyunk.  The food was consistently delicious for the four diners.  The vegetarian appetizer offer a mixed pakora.  The entries were as familiar as chicken korma to more complex lamb dishes.  There is the option to select how much heat your taste buds can handle.   Service was very good and friendly.  Will definitely return to this restaurant."
    },
    {
        "id": 16,
        "text": "I was excited to see an Indian restaurant open up in East Passyunk. We ordered the chicken tikka masala, tandoori chicken, and the garlic naan to go. (We were in the neighborhood and didn't feel like dining in that night) I'd say the food isn't as authentic as other Indian places I have tried. However, I do think it's a good place for those who never tried Indian food before and would not get too overwhelmed by their strong flavors. Would I come back? It would depend if I'm going with friends who hasn't tried Indian cuisine before."
    },
    {
        "id": 17,
        "text": "We tried this place last night for the first time - it was fantastic! The staff was really friendly and worked with us on the menu, what level of spice and checked in just the right amount of times. The atmosphere is cozy and has a great view of the square. A bonus is that it's BYO as well. It's a bummer to see so many negative reviews but they seemed to have worked through their growing pains as a new spot in the neighborhood. I'd suggest it for groups too!"
    },
    {
        "id": 18,
        "text": "Loved it, sooo delicious ! I'm definitely coming back massively satisfied with the samosa chat. Be ready for the lady that runs it. She is a little pushy."
    },
    {
        "id": 19,
        "text": "Were on our way to visit another restaurant in the neighborhood and the mood struck, suddenly for Indian. \nWe were not disappointed with our choice. The Palace of Indian staff was very friendly, helpful and attentive. But ultimately, the food was wonderful. Goat Biryani, Lamb Korma & Tandoori Chicken along with vegetarian fritters and garlic naan suited out palates wonderfully. \nVery reasonable cost too!\nVisit our new friends."
    },
    {
        "id": 20,
        "text": "It's awesome! Quick delivery. Yelp wants me  to keep writing because my review is to short. So I'm just going to say it's awesome and it's in my neighborhood and I support it."
    },
    {
        "id": 21,
        "text": "The food and service were great.  The staff was very accommodating as we brought a stroller and they were about to seat us away from the crowd which we appreciated.\n\nWe each had the korma (my wife had chicken, I had lamb) and it was easily the best we've had in Philly. The naan (plain) was amazing...it tasted like the best brick-oven pizza I've had, just without toppings.\n\nIf you can get a table near the window, the view of the fountain is nice, and we want to return to eat I'm the back patio ASAP.  \n\nThey were very busy with Grub Hub deliveries, so we'll also be ordering from home soon. Great addition to Passyunk Ave!"
    },
    {
        "id": 22,
        "text": "First time going tonight. Spoke with owner, opened exactly one month ago, such nice people. \nExcellent food, great warm environment and extremely clean. Was so full we got to take leftovers home.  I will be back for sure!"
    },
    {
        "id": 23,
        "text": "I wouldn't of even bothered to leave a review if it weren't for how bad the service was. The food was very delicious and the portions were good but my god that service sucked, we were rushed through our entire meal, both servers were condescending. I could tell neither one of them wanted to be there and we asked questions about the menu but they were annoyed to answer. It was Friday night at 7:30pm. We were one of 4 tables. They close at 10:30. We didn't show up right before they closed so it was weird to get such rushed service. Go for the food but maybe just get take out to avoid the shitty service."
    },
    {
        "id": 24,
        "text": "Super tasty and the server, (maybe proprietor?) was hilariously funny!"
    },
    {
        "id": 25,
        "text": "I would sum up my experince in just 2 simple words.... revolting and vile !\nThe food was deep fried again. The paneer was clearly frozen. I wouldn't recommend this place to anyone."
    },
    {
        "id": 26,
        "text": "So delicious and authentic! Lots of choices! I ate family style with friends and everything I tasted was yummy, the chicken tikka masala being a personal favorite of mine. Also, ask to eat outside, as they have a back patio area with beautiful mosaic, reminiscent of the Philadelphia Magic Gardens."
    },
    {
        "id": 27,
        "text": "The other night I placed on order on grubhub that ended up coming over 30 mins past the time it was supposed to arrive. I get that grubhub is contracted by the restaurant and sort of its own entity, however when I called to ask about the food, what transpired was by far the rudest interaction I have ever had with an owner. \n\nWhen I gave my name, and address I was told there was no record of the order. After asking again, the owner eventually realized he did have my order, but said it's not his problem where the food is and that I needed to call grubhub. I have ordered food enough times to know that sometimes things happen, but I was just trying to find out if the order had been received by the restaurant and if it had left yet for delivery.  The owner was raising his voice to me throughout the call and dismissed the questions as the delivery service's problem. He wouldn't even tell me if the food had been made or was out for delivery. \n\nHad this review been solely based on the quality of food it would still only be two, maybe three stars. The chicken was dry, and the quantity was lacking. The paneer mutter was flavorless. Not surprisingly there were few cheese cubes. Garlic naan...not even sure what to say about this. Seems like they sprinkle freeze dried garlic on the bread before sticking in the microwave. We also ordered everything spicy and the food didn't have a hint of kick whatsoever. \n\nOn a side note, I have throughly enjoyed reading the owners responses to any reviews below fours stars. There is clearly a pattern of hostility. However, I am thankful to the owner because if it had not been for his flippant responses to my questions, I may not have discovered the much better, and friendlier place a few blocks south, which you should TOTALLY check out. Eagerly awaiting the response to this review."
    },
    {
        "id": 28,
        "text": "I've eaten here a few times and it's all so delicious. A great addition to the restaurants on the Ave. Twice they gave us a complimentary dish when we went with a larger party. The staff is friendly and the service is great. One of my favorites is the tandoori shrimp."
    },
    {
        "id": 29,
        "text": "Best Indian in South Philly -- so happy to have it in our neighborhood. Eat in or take out, service is awesome, people are great, and food is so, so good. Highly recommend, all!"
    },
    {
        "id": 30,
        "text": "This is the second time I've ordered from here. Last time, my partner and I both agreed that the meal was very bland, which is rare for him because he doesn't handle spicy very well. Today, I ordered some paneer makhani as a comfort food, I had a crazy dental procedure. Anyway, the curry sauce was very watery and the spice level wasn't accurate. (I ordered medium it was more of a mild). I'd love to try this place again, maybe third time is the charm?"
    },
    {
        "id": 31,
        "text": "I have been here several times. Both times, I had the chili paneer appetizer, which is just amazing. The naan bread is pretty decent, cooked at a high temperature and tasty. The lamb tikka masala tasted fresh but lacked some flavor development. Raita was runny and not very flavorful.\n\nService is friendly and the dining area and bathrooms are clean. The surrounding area is very safe and many tables have natural light with a view of the Fountain.\n\nThis is our go-to place when we must have Indian in South Philly. For even better flavor, though, we make a special trip to New Delhi in University City or King of Tandoor in Fairmount."
    },
    {
        "id": 32,
        "text": "Every dish we ordered was delicious! The baingan barhta (eggplant) was nuanced and smoky. The owners are very friendly and the service was great! So happy to have great Indian food on east Passyunk!!"
    },
    {
        "id": 33,
        "text": "Food is just ok. Not bad, not very good though.  The chicken tikka masala and rice were fine. However, the naan seemed doughy and undercooked, garlic was better than the plain. The palak paneer was a big let down, just not much flavor at all. My husband got mulligatawany soup, that was just confusing! Came in a small sauce container, seemed much more like a sauce than soup. We really only knew it was the soup by process of elimination from the rest of the order. Nothing was bad but I wouldnt order from again seeing there are many other better options."
    },
    {
        "id": 34,
        "text": "Just gave this place a shot as my husband and I live in the neighborhood. We won't be going back. Server was rude and flippant, food (malai kofta and lamb korma) both bland, the naan was fine, but oily, but besides the totally underwhelming food and rude waiter, it was SO HOT inside the restaurant that I literally wanted to get out of there after sitting at our table for 5 minutes. Complaining to the wait staff about the heat  at this establishment (even when you are 8.5 months pregnant) just gets you a to go box and smirked at. Don't waste your time and money here and if you're in the mood for good, authentic Indian, just go straight to Ekta.\n\n- update** - I'm not on Yelp to argue with business owners, but the fact that he felt the need to respond so defensively to my review AND accuse me off lying on top of that should really tell you something. AND.... what Indian restart charges for extra rice??? Ridiculous."
    },
    {
        "id": 35,
        "text": "This place is a gem! We got a variety of veggie and meat dishes and everything was delicious. The service was also very friendly."
    },
    {
        "id": 36,
        "text": "Delivery was timely and the driver was very nice. The chicken really seems like it was cooked on it's own and then tossed into the sauce, not simmered in the sauce."
    },
    {
        "id": 37,
        "text": "Ordered chicken Tikka Masala with Medium heat through Uber eats. Was delivered fairly quickly so that was nice but the chicken was over cooked and the sauce was watery(not creamy like it should be) and flavorless. Seems like they reheated leftovers and added water to make it liquid-y. Extremely disappointed."
    },
    {
        "id": 38,
        "text": "Had chicken tika masala with naan. The food was made with love, and it was neatly packaged. Will def order from them again"
    },
    {
        "id": 39,
        "text": "I am giving 3 stars, not because of the food but due to the service. I went with my wife and friend for lunch on a Sunday. We were the only patrons in the restaurant and decided to eat in the outdoor section in the back. It is gorgeous back there with beautiful mosaic art. Having lived in an Asian country, I found the food to be very authentic and not too Americanized. The spice was right, the meat was tender and the portions were huge! The server, however, was a bit standoffish and didn't seem as if we wanted to be there. When asking about WiFi he said they had it but he didn't know the password. We asked a little about certain dishes and he was unwilling to explain further. I will certainly give it another go, but might get take out instead of eating in."
    },
    {
        "id": 40,
        "text": "We ordered from here tonight for carry out. The portions are quite large and each entree can easily feed 2-3 people. We ordered the lamb biriyani, chicken tikka masala, shrimp, and chill chicken. \n\nThe ordering was very easy and the food was fresh and hot. We ordered most of our food at a \"hot\" level of spice and really enjoyed it. The food had a great kick. \n\nWe would definitely recommend this place and will be ordering from here again!"
    },
    {
        "id": 41,
        "text": "Literally so good. Ordered from here at least 10 if not more times and EVERY TIME it was delivered so fast and the food had me dreaming of what I ate. Had to leave a review because everyone deserves this much love in their food."
    },
    {
        "id": 42,
        "text": "In-person dining was incredibly slow and the waitress had an attitude problem. Spent most of the meal incredibly thirsty due to poor service. Food was average at best-- any redeeming qualities were overshadowed by the long wait time and rude treatment. My party was also over-charged on our bill-- when we asked our waitress about it she claimed she served us a dish we did not receive and refused to refund us. Would not recommend this place to anyone."
    },
    {
        "id": 43,
        "text": "I honestly would never support a business that treats it's customers so poorly just out of principle!! Worst restaurant experience of my entire life. My family was seated and there for over 2 hours while we watched them rush take out non stop and never tend to us. Our waitress (owner?) was very rude and didn't come to our table until 25 mins after we got there to take our drink order. She charged us for naan that we ordered \"to go\" but then we open the container at home and she only gave us a container of rice not naan?! We called and lady screamed at us on phone saying we are wrong? Insanity! Never met such a nasty woman in my life. Food wasn't that good either, don't order from here they will screw you over. The other bad reviews on here are right and some guy will probably comment on this and say we are wrong but he is trying to cover it up. What restaurant screams and yells on phone to its customers who just wanted to enjoy a nice night out ?"
    },
    {
        "id": 44,
        "text": "This is my new favorite Indian Delivery in Philadelphia. The veggies were so fresh and tasty. The sauces were amazing. The NAAN to die for. We had chicken vindaloo, chicken tikka masala, veggie curry, and spinach/potatoes. Each were the best I've ever had."
    },
    {
        "id": 45,
        "text": "This place is amazing \nFood is excellent and great service \nWe got chicken shahi korma \nLamb tikka masala and garlic naan\nEverything was so delicious \nWe will be back again"
    },
    {
        "id": 46,
        "text": "Really good, authentic Indian at a reasonable price. Super friendly owner and chill atmosphere (back patio in the warmer months has nice charm). I hope this place survives the crowded E. Passyunk neighborhood. It's a gem!"
    },
    {
        "id": 47,
        "text": "The food was ok, but a bit bland. We love Indian food, so we have experience with which to compare this. Here, medium spicy seems to mean bland. I will compliment them on the rice, as that is so often a weak point. \nThe real problem was the service. We were only the second table when we arrived, and the other was occupied by just one person. The woman server seemed nice enough, if not warm and friendly. But, the man was just rude. He doesn't even seem to know how to place dishes when they arrive; he just handed the platters/bowls to us and we had to set them down. His entire attitude was one of being irritated - by the presence of customers!  As we were leaving, he rushed up to a table of two women who arrived after we did. He snapped at them that they had to pay cash, because his card processor was down or something.  They were both startled and neither had enough cash on them. I don't know how that worked out. I'll just reiterate that this man, apparently the owner, is unpleasant. None of us at dinner - 3 of whom live nearby - will go back."
    },
    {
        "id": 48,
        "text": "Brian Newmark visited The Palace is Indian for the first time. WOW!  The food was excellent!!!\n\nWe over ordered way too much because there are so many great things on the menu. We had Chicken Tikka Masala, Tandoori mixed grill,Lamb Rohan Josh, Bhindi Masala, Dal Makhani, Mutter Mushroom Curry, maybe more. Everything was Great. \n\nI eat a lot of Indian food and can't say enough good things about Palace of Indian!!!!  Service was also great!  Don't forget rice pudding"
    },
    {
        "id": 49,
        "text": "We were a little desperate last night because many of the restaurants in the Passyunk area closed up really due to the curfew - there was confusion about the curfew time which was actually 8 pm.  We showed up unannounced at POI, ordered on the spot, and got our food quickly.  We want people to know that this place turns out FABULOUS Indian food.  Everything was excellent especially the chicken dish.  Such nice people too!"
    },
    {
        "id": 50,
        "text": "We ordered 3 items, chicken tika masala, paneer makhani, and palak paneer. The portions we got were great, they all came with a full serving of rice. Enough to share with another person. With that being said, the flavor for all three dishes was not there. It was very watered down, bland and sweet, not at all spicy. What we got looked nothing like the pictures posted on Yelp. I've eaten plenty of Indian food to know that's not how it's supposed to taste like. Very disappointed. Was hoping this place would be good. Wouldn't order again, although the workers were nice when we called to ask questions. The only reason for the 3 stars."
    },
    {
        "id": 51,
        "text": "The food was good. That would have earned a solid four stars from me but truthfully we discussed it and were seconds from leaving. The evening started out rough. My friend who made the reservation said it began with the call for a reservation. She described an abrupt rude call. When we arrived the table was reserved (restaurant wasn't full) and we were passed by again and again. We did have a reservation for four and one friend did not show, but it would not have made a difference for our table. There were three of us, so we would not have been able to occupy a two-top. A four-top (which is what we were sitting at) would have been the only option for us, so the no-show for our one friend did not make a difference for the table that we occupied. As we sat and waited, no water or menus and unopened bottle of wine was at our table. After around 20 minutes (and then more), after my friend flagged down what ended up being our server, we asked for water and opened wine as well as menus. Sparing more details, our server was rude, abrupt and presented as if he were doing us a favor by attending to us. I asked for two wine glasses each (when he asked how many glasses we wanted) because we had wine in addition to champagne. This appeared to aggravate him and he said, \"We can not do that.\" He must have changed his mind, but when he brought them to the table he appeared mad as he put them upside down at the end of the table. He was so overtly rude, it actually got a little awkward at times. At one point, when we asked for water he said, \"You are going to have to give me a minute. I have other tables and I am the only one working.\" That sounds challenging, but 1) you are a restaurant and that sounds as if it should be taken up with the owner (of which he might be...) as a staffing issue and 2) we had been waiting twenty minutes with not even an acknowledgment of our presence at the table  at this point and so asking for water isn't out of the question. We had decided to go and he showed up with menus one second before we were getting up to leave, so we stuck it out. The food was good. We ordered two orders of the samosa but received no sauce with either order. My friend ordered raita to be served with her meal. It didn't arrive until the meal was completed. She wasn't charged for it, so that was a plus. The chili fish appetizer was delicious. Perfect heat and flavor. Garlic naan was tasty as was my chicken tikka masala. Hopefully, they can work on the customer service issues. After spending a sizable chunk of money (for what it was) the lights came on and the same server came to our table and said, \"We are closed now.\" I understand that the restaurant closed at 10:30, but honestly, we didn't even get service until a half hour into being seated. My friends and I are very frequent diners in Philadelphia, and an owner actually coming to the table to tell customers to leave is a rare occurrence unless the restaurant is okay with communicating to the customer that their service is not appreciated. And we are conscientious diners. I don't think that when lights come on in a restaurant, one is entitled to hang out for as long as one wants. That's rude. So we would have left anyway without the rebuff because that would have been the thing to do. But we didn't have a chance.  As for my friends and me (one who happens to live very close to this restaurant and probably would have been a regular customer had things gone well) who eat out frequently, won't be back. There are too many restaurants in Philadelphia that not only offer great food, but great service as well.  I actually love giving glowing reviews, but when things go so wrong, I am hopeful that it is an opportunity for a  restaurant to grow and improve. Hope that's the case with this one."
    },
    {
        "id": 52,
        "text": "Consistently messes up delivery orders. Missing items and missing sauces. Every time. The food is good but can't enjoy when your order is incomplete. Every.damn.time."
    },
    {
        "id": 53,
        "text": "Ordered the malai kofta and lamb korma for delivery.  Both were incredibly delicious.  I have not been to the restaurant in person but will definitely have to check it out now.  Probably the best Lamb korma I've ever had.  The naan was also perfectly soft and warm."
    },
    {
        "id": 54,
        "text": "Visited for in person dining tonight, and although I've ordered takeout several times during pandemic, tonight's food stood out to me. Highly recommend eating in. They have a lovely back patio with mosaic walls, a remnant of a long past Italian restaurant. It's charming. But the food tonight was excellent. Wife and I shared /split the Tandoori Chicken entree as an appetizer.  Delicious.  Then she had the coconut chicken (mild) and I had the lamb vindaloo (indian spicy) with side of garlic naan. We both couldn't have been more pleased.  Naturally I got the head sweats from the spice of my dish, but it was amazing! Flavorful sauce and tender lamb. It's my go-to! Wife loved the mild coconut chicken, whose sauce I used to calm my mouth. It was very flavorful, just need to be spiced at my level! Ha!  Anyhow, service was pleasant. Bill was reasonable and byob is always a plus! I enjoyed eating in significantly more than my takeout experiences, which were never bad. Eating in is just better!"
    },
    {
        "id": 55,
        "text": "I was so excited to try this place. I've spent a lot of time in India and live just around the corner...\n\nSadly - the waiter (who I think might also be the owner) was very rude. He spoke on the telephone extremely loudly through much of our meal. I understand he needed to respond to delivery orders but there is no need to yell! He never checked to see how our food was and seemed annoyed when we hailed him down to ask him for things. He rushed us in our meal. And at the end, he asked us to get up and leave because he had people waiting for the table. We had just signed the check (which took forever to get processed) and were calling an Uber on a rainy night. I've never experienced anything like it in any restaurant!\n\nThe food was bland and unremarkable. Frozen palak paneer from Trader Joe's is better. I wish I could recommend - but I don't think I will ever go back.\n\n* note: see the owner's response. Every time someone has a bad review of this place, it is usually because he was rude. And then he responds to the criticism rudely - and with a different version of the experience - and with basic ignorance of restaurant practice. (i.e you never ask a customer to leave, especially when they have only just paid the check. And he certainly did not do so politely.)"
    },
    {
        "id": 56,
        "text": "Officially converted to this place after searching for Indian places in south philly. The service is a slow because they only have one waitress but the food is delicious! I highly recommend coming with the intention of taking your time but I bet the food will not stay on your table for long. I wish they would hire or staff it better during busy dinner times."
    },
    {
        "id": 57,
        "text": "I wish i could give a better review, honestly i was between a 2 and 3. The food was excellent, had the chicken tikka masala and butter chicken and both the salads. Portions are a good size compared so some others now.  The Naan was good, the rice tasted good too.  But like others said the service was very poor.  The waiter/ owner and one buser couldn't keep up with the amount of people nor service and phone calls. He was annoyed from the moment we walked in that we wanted a table for 2. He cleared a table which was finishing up then sat us and dumped a few plates and napkins in front of us and pretty much threw the placemats at me.  I understand if its busy (10 of 12 tables filled) on a Friday night but the service was so poor Im not sure i would ever go back despite the good food.  We had to ask for our wine to be opened and for water.  Maybe with more help the service would be better but for now go elsewhere... Poor attitude and service won't get you far or survive in this town."
    },
    {
        "id": 58,
        "text": "This place is amazing \nFood is excellent and great service \nWe got chicken shahi korma \nLamb tikka masala and garlic naan\nEverything was so delicious"
    },
    {
        "id": 59,
        "text": "Good Indian food in Philly\nFirst order, I was more than happy about the quality of the food, I took the tikka massala, the Vindaloo, the coconut curry, just a bit deceived by the appetizers (sampler). I order a few times since, and I ve been a little bit disappointed by the taste of the sauce sometimes or the quality of the meat, and appetizers are not really good everytime I try one new.\nIt still good and better than other indian place I ve tried in Philly, so I might order again if I m craving indian food, till I found a better place^^"
    },
    {
        "id": 60,
        "text": "This was the worst Indian restaurant I have ever been in.  When my friend and I chose to order a few things and share , we were told there was a fifteen dollar minimum per person!   No restaurant on the Avenue has any kind of minimum-- we were told that this restaurant was FINE DINING , not Mc Donald,s --- THAT should have been our cue to leave-- but we wanted to give  the place a chance --mistake!   Shrimp curry was OK.  Nan was good.  But the tandoori chicken was dry and stringy--- a complaint warranted no response at all.  I  am sure this restaurant will not last , so don t waste time going there.  As to your offer to refund, I have a minimum refund fee of $15 on top of the refund."
    },
    {
        "id": 61,
        "text": "I've only ordered takeout from here but I've never been disappointed. Although it's a bit expensive for Indian, I can't complain because it's actually really good and always consistent so it's worth it. \nWe usually get chicken tikka, panned, all of their naan is so good. And we finish everything \nI'm happy we have such a good variety of cuisine on E Passyunk, and they're great quality for the price."
    },
    {
        "id": 62,
        "text": "Great new Indian restaurant on Passyunk. Glad to have it in the neighborhood!"
    },
    {
        "id": 63,
        "text": "My first job was in an Indian restaurant many years ago.\nBasically I was enjoying this authentic food long before it became so well known.\nSo I give them a five star....\nFresh and robust ....\nThe food delicious, the service on the phone very polite and it's always always clean when I walk by...\nEven before COVID they were!"
    },
    {
        "id": 64,
        "text": "We have been to the Palace of Indian twice for dinner and will definitely be going back. The food was fantastic as is the service."
    },
    {
        "id": 65,
        "text": "I'd actually give it a 2.5 but that's not an option...\n\nThis location has been the home of numerous restaurants since we've been living in this neighborhood. We were excited when we saw it would be an Indian restaurant, and when we spotted the \"open\" sign a few days ago, we decided to have dinner here Saturday night. \n\nThe service was perfunctory. Not much effort shown here. We called ahead to find out if we could bring beer or wine in and we were told yes. When we arrived, I asked for an ice bucket so we could keep our beer cool. The server said they did not have any ice buckets and the best he could do was to put ice in our glass of beer. Whaaat?! No, thank you. (Whaaaaaat?!?!)\n\nWhen we received our appetizer, the vegetable samosas, we were given three sauces but the server didn't tell us what they were. The samosas were great, though, and seemed freshly made. \n\nI had the palak paneer and it was somewhat disappointing. I've had this dish all over the US and in the UK and I've never known it to be sweet. This version had a sweet taste that was off-putting. Maybe the chef had a bad night?\n\nMy husband had the chicken tikka which was serviceable but no better than Tiffin. \n\nThe best part of the meal was the naan -- fresh, hot and buttered. \n\nI think I'd be open to giving this place another try once it has the kinks worked out. After all, it did just open. \n\nI noticed there were some shallow, positive reviews here already and I'm thinking you should take these with a grain of salt. I'd love to hear the opinions of other people who have actually paid to eat here!"
    },
    {
        "id": 66,
        "text": "My spouse and I were looking for something different and local for dinner. We've heard great things about this place and to be honest we are not experts in Indian cuisine.( I also have to say we ordered thru yelp as a pick up so we couldn't get explanations for every menu item we looked at) We gave it a shot and the food is really good. We had the chicken tikka masala which was not too spicy but we chose mild instead of a higher spice level. It does come with rice however the description on the menu doesn't say that so we ended up ordering more rice. We also had the veggie samosas and mmmmmm they are delicious! Wonderfully spiced and crispy.  The naan bread is also super fresh and delicious coming in a variety of flavors as well. I'm only giving 4 stars simply because we haven't tried enough of the menu and I believe the menu could be more specific as to what is included with each entree. However we plan on returning to try more items on the menu."
    },
    {
        "id": 67,
        "text": "We ordered from here tonight for carry out. The portions are quite large and each entree can easily feed 2-3 people. We ordered the lamb biriyani, chicken tikka masala, shrimp, and chill chicken. \n\nThe ordering was very easy and the food was fresh and hot. We ordered most of our food at a \"hot\" level of spice and really enjoyed it. The food had a great kick. \n\nWe would definitely recommend this place and will be ordering from here again."
    },
    {
        "id": 68,
        "text": "Man, what a great spot this place is in! The indoor dining room is pretty inviting, but the outdoor seating in the back is even more stunning as it's coated in mosaics. Of course, I went on a Tuesday evening on a day where there was a flash food advisory, so there was only one other table besides us. Which means there was exceptional service!\n\nMy boyfriend and I got the Chat Papri for the appetizer, as well as Butter Chicken, Lamb Korma, and garlic naan. Wasn't too much of a fan of the Chat Papri (just wasn't my thing) but the entrees and naan were literally some of the best Indian food I've ever had. Not to mention the portions are well worth the price because this food could have easily fed 4 people, so we were forced to take leftovers home. \n\nI'm really excited at this new addition to the Avenue, and all Indian food lovers and the open-minded should definitely give this place a warm welcome!"
    },
    {
        "id": 69,
        "text": "We love this restaurant. During covid we walk through the restaurant straight to the back courtyard where it is the most serene and creative back area. We love the Mona Lisa mosaics all over and there is ample room. The food is always so great. So many options for everyone. Service is always great. So sit outside and check out this awesome BYOB. don't forget to try the veggie samosa and cauliflower appetizer for starters."
    },
    {
        "id": 70,
        "text": "This was one of the first places I dined after moving to Philadelphia from San Francisco. I work on Passyunk so this was super convenient for me.\nI was immediately happy with the atmosphere and service. The staff was friendly and patient and the food came out quickly and was delicious.\nI am vegetarian, leaning vegan, and I had all of the options I could have asked for.\nSince covid, I have ordered delivery to Point Breeze, and my order always arrives early and it is always correct and hot.\nI do wish the naan would come with more than two, but that's just because I'm a glutton and I love it.\nI love this place and highly recommend everyone give it a chance.\nThank you to the staff for your continued work through these weird times. Your food is amazing."
    },
    {
        "id": 71,
        "text": "My mom and I traveled to India, and we loved the food.  This place is as authentic as it gets.  Highly recommended.  Enjoy!"
    },
    {
        "id": 72,
        "text": "This the new delivery go-to for Indian cravings!\n\nFirstly: love an Indian restaurant where spicy actually *means* spicy. If I'm eating westernized Indian food, I choose the hottest spice level by default, as \"spicy\" usually translates to \"barely even mild\". Palace of Indian gives you SPICY (if you ask for it!) It is also A-OK for those of you who aren't interested in food that makes you sweat.\n\nWe went for the veggie samosas, garlic naan, Palak Paneer, Lamb Vindaloo, and Mattar Paneer (peas and paneer in an onion-y, tomato based cream sauce). All delicious. \n\nLamb vindaloo was outrageously spicy (beautiful) so if that's not your bag, go mild here! But would highly recommend: the lamb was fall-apart tender and full of flavor. The palak paneer had a nice body to it: some places blend the spinach so much it's more of a soup than a textured paste. The mattar paneer was decent: I probably wouldn't order it again as it wasn't as spice-forward as I would have liked, but it did serve as a nice neutral complement to our other options.\n\nSo happy we sprung for the garlic naan, it was a nice little touch. And samosas were chubby and full of pleasantly spiced goodness. The basmati rice was fluffy and perfect! \n\nA bit more pricy than other Indian options around Passyunk, but felt completely worth it for great flavor and hefty portions. K gotta go warm up some leftovers. Check it out!"
    },
    {
        "id": 73,
        "text": "I was their very first takeout customer! I ordered the chicken tikka and lamb curry. Both dishes were very tasty. Meat was extremely tender and the flavors were quite good. Only complaint on these dishes was the spice level. I asked for hot, and both dishes were quite mild. Might be a little hesitant to turn up the heat given that it just opened. \n\nAlso had the garlic naan, which I thought was just okay. It was more like a very thin crust pizza than the naan I'm used to. Would have preferred a little more softness. \n\nAll in all, very tasty meal. Very friendly owner. A little expensive, but good portions.  A little room for improvement. Will be back to eat in!"
    },
    {
        "id": 74,
        "text": "The restaurant is located in one of the busiest areas of East Passyunk and offers pretty uninspiring Indian food. The menu reads just like any other Indian restaurant, and nothing really stands out nor falls short. It just meets the bar and that's it. We had the Lamb Rogan Josh and the Butter Chicken. Both were okay. The rice comes in this typical aluminum containers that I swear makes the food taste metallic. Overall, I wasn't overly disappointed, but I wouldn't be raving anything from here anytime soon."
    },
    {
        "id": 75,
        "text": "Really terrible service and they prioritize take out orders instead of dine-in; we waited half an hour for our waitress to even come and take our drink orders and were there for over two hours altogether while we watched them fulfill numerous take-out orders. When we brought this up the waitress was rude and unapologetic. The food was good but there's plenty of Indian restaurants with food that's just as good or better in the area and with quality service"
    },
    {
        "id": 76,
        "text": "No no no no no. I got the paneer tikka masala which tasted exactly like Campbell's tomato soup, the naan was not crispy at all - more like the cook your own pizza dough from Shoprite before you cook it.  The rice was good if that helps.  Obviously should've just gone with Tiffin- they're on my Favorites in my contacts for a reason ! I will not be ordering this again. I definitely should've looked at these reviews before I ordered but it's around the corner from my house and I wanted something quick. Definitely regretting wasting $20 I'm about to just throw it out like it's literally terrible you guys.   \n\n*UPDATE: Someone pretending to be from Uber eats called my phone right after the delivery happened and was trying to get my opinion of the food and I tore it Park because that's exactly what it deserved. So after tearing him apart I then called Uber eats customer service and they told me they never had a representative call me and it was from a 215 number and after I called the number back they wouldn't respond so not only are they calling people and lying to them saying they're from Uber eats but they are selling some of the worst food I've ever had so don't worry this will be reported*"
    },
    {
        "id": 77,
        "text": "This was the worst Indian restaurant I have ever been in.  When my friend and I chose to order a few things and share , we were told there was a fifteen dollar minimum per person!   No restaurant on the Avenue has any kind of minimum-- we were told that this restaurant was FINE DINING , not Mc Donald,s --- THAT should have been our cue to leave-- but we wanted to give  the place a chance --mistake!   Shrimp curry was OK.  Nan was good.  But the tandoori chicken was dry and stringy--- a complaint warranted no response at all.    I  am sure this restaurant will not last , so don t waste time going there.\n\nI also noticed on all the poor reviews the owner comments on how it's their fault not his.  Own up buddy...you need to get your act together."
    },
    {
        "id": 78,
        "text": "Went for the first time and will definitely go back.\nNice atmosphere and service- very attentive to vegan vs. vegetarian needs, etc.\nWe shared appetizers, naan, and four vegetarian entrees which was way more than enough food for four. Everything was delicious. Amazing flavors really well balanced- just so good."
    },
    {
        "id": 79,
        "text": "This place has become my new go to for Indian food. The quality and flavor is always consistent and good. The flavors are very homemade and not over seasoned. I hope this place stays around forever."
    },
    {
        "id": 80,
        "text": "Ordered takeout. 2 main dishes, samosa, and naan. The portion size for the 2 main dishes were average and could improve. The overall taste was ok but we felt underwhelmed. The price is above average for Indian food."
    },
    {
        "id": 81,
        "text": "The food was pretty good (palak paneer and chicken tikka masala) but he garlic naan was amazing and really brought the whole meal up a notch. We were the only people in the dining room and staff there didn't seem especially pleased to see us for some reason."
    },
    {
        "id": 82,
        "text": "I and my wife went there for lunch in September. We ordered one mix. Vegetables, one kadhai paneer and a couple of tandoori rotis. The tandoori roti was made with stale dough and was tasting really bad . When we told the owner that he tried to fool us by saying he used the best golden temple atta, we weren't that naive to fall for that.\n\nHe finally exchanged those for naans though, hence 2 stars."
    },
    {
        "id": 83,
        "text": "We really enjoy this restaurant! Highly recommend their lamb dishes and garlic naan. We've found the staff to be super nice; it's a great family business vibe that's refreshing with some many restaurants in this neighborhood trying a little too hard to be chic. Reasonably priced with most dishes between $13-15. They offer three spice levels so you can adjust each dish to you tastes. They are generous on servings and a favorite in our household!"
    },
    {
        "id": 84,
        "text": "The food was really bad, and so was the service. I would never go back again. \nThe chicken I ordered was really dry, and the appetizers super bland. And worst of all was the service."
    },
    {
        "id": 85,
        "text": "Have been passing this restaurant whilst connecting buses and finally decided to go there for dinner. Not disappointed. The appetizers were quite substantial (could have easily split one), well seasoned, and interesting. I Had the Samosa chat and loved it. My husband had two large and tasty samosa. One samosa and 1/3 of the Samosa chat came home with us. For entrees, I had the coconut chicken and he had Chicken Madras, both of which were the exact right size and we finished both though we took the remainder of the delicious Basmati rice home. I must say that the limeade was a little too sweet for my taste even though it did say sweetened on the menu; next time a different choice of beverage. The chutney was copious and a perfect condiment for our chicken dishes. Only disappointment was the Peshawari naan. Rather than the expected and traditional nuggets of sultanas and small pieces of coconut, it was ground up so finely into the dough that there was no distinctive taste or texture to distinguish it from regular naan. \n\n     Henry Seigel - Philadelphia, PA"
    },
    {
        "id": 86,
        "text": "This place harasses customers after they post a review. The food is inedible and people are so rude."
    },
    {
        "id": 87,
        "text": "Ordered lamb seekh kabab and chicken tikka masala. The portion sizes were good and rice accompanying the meal was great. The lamb was great. The chicken tikka masala was average. The restaurant should mention that the chicken tikka masala entree comes with peppers and onions mixed in. I would have considered another entree had I known. Would go back again, but ask for no peppers and onions."
    },
    {
        "id": 88,
        "text": "Mediocre at best.  Will not return. \n\n(1) Food did not have much flavor.  \n\n(2) Restaurant forgot to include chutney with vegetable samosas.  \n\n(3) We ordered via Grubhub.  We requested masala sauce on the side of the chicken tikka and the the request was not fulfilled.  After receiving the food, I called the restaurant and the they said they don't offer that.  They should have called us and let us know beforehand.\n\nMany other better Indian restaurants in the area."
    },
    {
        "id": 89,
        "text": "I don't like to write a poor review, but I ordered delivery tonight and 3 items out of 4 were missing in the order. I called the restaurant to ask them if those items could be redelivered or even refunded and I was gaslighted and told several times they were 100% sure they included those items. I tried to acknowledge that maybe something had gotten lost in the delivery route and that I understand things happen but I was still looking for a resolution. I was still met with gaslighting and basically called a liar. He then told me he couldn't refund me and promptly hung up the phone when I was in mid thought. I know things happen, but please do better by your customers and come at your business interactions with the value of trust. I want to support businesses in my neighborhood but not if the process of supporting them leads to me being gaslighted and called a liar. I hope you all can do better by others.\n\nP.S. I have now cut into the masala and it is chicken when I ordered paneer."
    },
    {
        "id": 90,
        "text": "This is an outstanding restaurant. The food is intensely delicous and well prepared. Service is fine and the decour is very pleasant. I had the lamb and it was soft and savory. They offer 3 spice levels with the middle being a little spicey but well within the comfort zone. They have beautiful outside patio which we hope to enjoy next spring"
    },
    {
        "id": 91,
        "text": "Delicious! I have only ordered take out from here but have truly enjoyed it. The Malai Kebab is so delicately flavored in a yogurt marinade that it makes for a wonderful, light meal. Samosas are delicious."
    },
    {
        "id": 92,
        "text": "I had one place I would go for Indian food and that was the Taj Mahal in NY, no one cane close to it until now. I love the Palace of Indian. You can taste the love and passion in the food because the owner is passionate about what he serves. Chicken Korma (you had me at Cardamon) is my favorite with a side of Naan bread. The chicken is so tender.  Try not to eat it all if you can. Just tell yourself you need room for the amazing rice pudding!"
    },
    {
        "id": 93,
        "text": "After confirming the pickup location multiple times, Grubhub still screwed up my pickup order and routed it to this location which is not near me rather than the location I thought I was ordering from.  I was on call and didn't have time to go to the restaurant so the proprietor delivered the food to me himself.  I really appreciated him going out of his way to correct a situation that wasn't his or his restaurant's fault.  (The only solution Grubhub offered me was to reorder and pay again a 2nd time for the order.)  The food was still warm and very delicious with the right balance of flavor and spice for me.  I won't be using Grubhub any longer, but I would definitely order from this place again."
    },
    {
        "id": 94,
        "text": "Finally got around to checking this place out and I'm so glad we did. We ate inside. (But the back patio is very cool. Isaiah Zagar walls. Next time we'll get a table back there). The food is very traditional Indian and absolutely delicious. The Mulligatawny soup is amazing. It's not overpriced either. The service was great! We will definitely go back and order take out as well."
    }
]