[
    {
        "id": 1,
        "text": "Excellent food! We can be picky about Indian food but this place is a favorite. Generous portions(except for the Naan) but enough food for leftovers.  The rice is great and the curry spices can be ordered to suit your palate.  We get delivery and we are never disappointed."
    },
    {
        "id": 2,
        "text": "In town on business. In the mood for Indian. Great find. Great food. I'd come back here for sure. Try the Rogan Josh."
    },
    {
        "id": 3,
        "text": "Excellent food and great service. Very small lunch menu, no buffet. \n\nLarge portions, could not finish my meal. The meal came with an appetizer, vegetable of the day, main meal, rice, dessert and masala tea. \n\nGreat choice!"
    },
    {
        "id": 4,
        "text": "Went for lunch last week and went back for dinner 3 days later. I finally got my sister to try Indian food, she loved it. She keeps talking about the chicken 65, which was amazing! The people there are so nice and will explain the menu. You have a choice of mild, medium or hot. Don't be afraid to try Indian food, curry is bad at all. Not every plate is made with curry, so hurry and don't worry. The food is awesome!"
    },
    {
        "id": 5,
        "text": "Finally! \n\nMy husband and I have been looking for decent Indian food closer to home and this is it. Nice vegetarian options, and the spice level is exact what we asked for. Everything was fresh and full of flavor. We will be back!"
    },
    {
        "id": 6,
        "text": "Excellent food excellent owners overall excellent experience. I highly recommend the curry! But anything you order will be excellent. They also have a grub hub deal that allows you to get fast delivery of excellence Indian food for a reasonable price!"
    },
    {
        "id": 7,
        "text": "Went here with my husband on a Friday night . We ordered chicken 65 which was fantastic,; the chicken was full of  flavor and very tender; it was great. Also, the garlic naan was very good, we have to go back for it. my husband ordered the   hakka noodles they were so tasty. They  gave us a complimentary dessert which was rasmalai [fresh cheese balls soaked in sweet milk syrup] this dessert was delicious. Must go here, this place is a great welcome to this community. Service was VERY professional."
    },
    {
        "id": 8,
        "text": "Absolutely amazing experience. The food, staff, atmosphere (the 3 owners decorated themselves which is impressive). These guys are awesome, made my girlfriend and I very happy. They were funny and made us very comfortable.\n\nFood was tasty and flavorful. No issues, everything came out on time and presented well. The bill came out for $35 for two people and we're stuffed. Indian food favorites are here if you're craving chicken tikka, samosas, tandoori etc.it's all here.\n\nHighly recommend this spot :-) I don't leave that many comments here on yelp but this is absolutely necessary haha. Wishing these folks the best. We'll be back often."
    },
    {
        "id": 9,
        "text": "AMAZING. EAT HERE, NOW!\n\nWe saw this place on yelp and decided to give it a try. Fantastic experience. Friendly, prompt service. The food was perfect. Imaginative, well spiced, generous portions and all around excellent flavor. We will definitely come here again!"
    },
    {
        "id": 10,
        "text": "This is GREAT takeout. I'm used to being spoiled by Cafe Bombay in Bristol whenever I want Indian, so I guess I was expecting...well, not this. Great food.\n\nWe ordered the samosa chat, which is smashed samosas with yogurt, chickpeas and tomato chutney on top. Deeeeelicious! It was sweeter than I thought it would be and this was definitely a pleasant surprise. Also, I ordered two thinking they would be small, like samoas, but in reality these appetizers could probably feed three people each. Whoops.\n\nAlso ordered the chicken madras and the dal tadka, which is stewed lentils. We chose mild spice level, and it was still a little spicy...which is great for me, since I love spicy foods (my boyfriend does not share my enthusiasm), but might not be so great for someone very sensitive to spice. \n\nThe delivery guy was almost on time - he was almost ten minutes later than what grubhub suggested, and he promptly apologized for being late. No big deal, we're in an apartment complex and most people have trouble finding us, and the food was still very hot so no harm, no foul. I imagine the food tastes great the next day, too.\n\nVery, very happy this place is here!"
    },
    {
        "id": 11,
        "text": "Just got delivery from this place, and it was wonderful! I had the naan, lamb biryani, and gulab jamun. The naan was great, the biryani was a HUGE portion  with just enough spice for me (have PLENTY of leftovers - it was packed to the top of the container, almost bursting) and included TONS of lamb and a small container of yogurt sauce, and gulab jamun is just one of the greatest things ever. So good. They're also really good with delivery. Everything was in containers and wrapped on a bunch of plastic wrap, then put in the bag, so it stayed hot enough. Yay!"
    },
    {
        "id": 12,
        "text": "Food here was fantastic - only topped by the service!\n\nWe got the eggplant dish, chicken curry, naan and samosas for an appetizer. The portion sizes on all of these were quite substantial so a great place to go if you are hungry too!"
    },
    {
        "id": 13,
        "text": "Great food and not overly expensive. Everything tastes freshly cooked and the tables are kept clean and organized. I highly recommend getting the Rasavat Lemonade as it tastes great with anything you order."
    },
    {
        "id": 14,
        "text": "YELPERS, DO NOT OVERTHINK THIS!\n\nThe food is fantastic, spice levels are appropriate (my wife ordered it mild while I ordered my food spicy), and the owners are fantastic people!  Come out and support this gem, the place was nearly empty when we ate there.  I do not get to this area often; however, I do not want to see it closed the next time I go due to a lack of business!  Five stars, all the way!"
    },
    {
        "id": 15,
        "text": "Outstanding and delicious. My curries were out of this world..and the naan was so perfect. My mouth is watering... Can't wait to go back!"
    },
    {
        "id": 16,
        "text": "I really wanted to love this place, alas I can't do it. I ordered chicken biryani with medium spice.  There was no spice even leading up to that level.  I would say it was mild at best. The biryani itself tasted very good, but I was so disappointed in the lack of spice.  The chicken was very tender and moist.  I feel like they could have done a much better job of layering flavors. The vegetable samosas were good, but not the best.  I've had better."
    },
    {
        "id": 17,
        "text": "Amazing food! I'm from India, and I can comfortably say that the food here is amazing. Price is decent, not too expensive, but the serving size is huge! They also deliver for free!\n\nThey've got a regular customer in me for sure!"
    },
    {
        "id": 18,
        "text": "Excellent, excellent, excellent! Party of 3 dined in on a rainy Monday evening and we were provided excellent service. We ordered the samosa chaat, garlic naan, chicken tikka masala, lamb korma, rice pudding, pistachio ice cream, and 3 cokes.  Everything had such depth of favor - almost beyond comprehension. Naan was sooooo super thin and crispy but soft.  Tikka masala (ordered as \"very hot\") had a wonderful backend heat without the feeling of being scorched. The lamb korma was succulent and complex. Everything was just great. I can't wait to go back!!!!!"
    },
    {
        "id": 19,
        "text": "The vegetable samosa was exactly what I had been craving! Perfect. We ordered the lamb vindaloo spicy and holy moly was ever, but still super flavorful. This location has transformed into an Indian spot I could easily crave regularly."
    },
    {
        "id": 20,
        "text": "This place is great. I have been there twice and I plan on going back soon. Both times I have been there we had Lamb Samosa which was delicious. The first time I went my main course was the Mixed Grill and I really enjoyed it. My girlfriend had the Chicken Tikka Masala and she says it might be one of the best dishes she has ever had. Second time going there I had the Chicken Tikka Masala and I loved it. The Naan was amazing and perfect for dipping into the sauce. This time we both tried the Rasavat Lemonade and let me tell you, its the bomb, its a fizzy type of lemonade and they serve it in a tall glass with a little umbrella. \nThe service was great, they really make sure you have everything you need and they really do their best to give you a great experience. \nThe place has been nearly empty both times I have been there but I am sure it is because of the location, the neighborhood is safe and pretty nice but it is not really a booming place for restaurants.\nIf you are looking for Indian food go check this place out, I know you wont be disappointed."
    },
    {
        "id": 21,
        "text": "This is one of the best Indian restaurants. We were driving to Philly stopped to get some quick food. My family loved it and so did I. Wasn't expecting it to be this good and authentic."
    },
    {
        "id": 22,
        "text": "So upset that they are closed, best Indian food and wonderful friendly service. If this management has opened a different location I would love to know."
    },
    {
        "id": 23,
        "text": "Just got my order delivered right to my door! I got the Dal makhani, shrimp Goan curry, veg Samosa, garlic naan, and mango lassi! Yes, I ordered that for myself:) It was really good. I didn't think they would deliver because I'm about 15 mins from the restaurant, but they did! The guy got here quicker than the estimated time. He was super friendly and even shook my hand:) \nI will be ordering again!"
    },
    {
        "id": 24,
        "text": "Awesome food. Must try. We are vegetarian but the way every gravy of subji it is excellent. Service is excellent  too."
    },
    {
        "id": 25,
        "text": "Amazing food! Just ordered from Rasavat for the first time tonight. Food was perfect. Chicken Curry was delicious. Samosa Chat great. Naan amazing. Nice to have a GREAT Indian food place in the neighborhood! Highly recommend. Friendly service as well.\n\n** I've now been to 3 other Indian places in the greater Northeast and RASAVAT is leaps and bounds still the best. I order from here weekly now!"
    },
    {
        "id": 26,
        "text": "Quite easily the best Indian food in the area.  And they deliver!  The naan is so authentic.. just the right combination of soft and flaky texture.. Chichen Tikka Masala is to die for.. you won't be disappointed!"
    },
    {
        "id": 27,
        "text": "What delicious food! The naan was so crispy, the chicken and lamb were super tender, the mango lassi was creamy and sweet, and the gulab jamun was perfect! You can request that any dish be made mild, medium, or spicy. And this place is right in the neighborhood! It's definitely going to become one of our regular restaurants!"
    },
    {
        "id": 28,
        "text": "I had a craving for Indian food, decided to try Rasavat (they are the closest Indian restaraunt near me) and they were exactly what I needed. The food was great and delivery was fast. I ordered the Rasavat mixed grilled,(shrimp, chicken, lamb, and white rice)it was delicious. A large portion, worth the price."
    }
]