[
    {
        "id": 1,
        "text": "Went to this place last weekend, I ordered some Kathi-rolls and the chicken pizza.\n\nThe kathi-rolls were really good, but the pizza was pretty bad. The location was really horrible and it is street parking which is awful.\n\nIt is a good place to order kathi-rolls for take out."
    },
    {
        "id": 2,
        "text": "We went on a Friday night. The service was horrible!  We were the only ones in the dining are and it took 15 minutes to have the waiter to place our order.  The waiter mumbled and never asked us what spice/heat level we wanted our food.  Well what we received was bland, bland, bland! When we asked to take our food home.  The waiter just gave us the plastic containers and walked away.  Never asked if he could pack for us or took the food to the back to pack it.   We have eaten Indian in West Philly to Singapore.  I have never seen the lack of level of attention.  Save your $65."
    },
    {
        "id": 3,
        "text": "Tiffin is one of the best places in the city to get Indian food (along with New Delhi and sometimes Palace at the Ben). And the fact that they have kati rolls on their dine-in menu  for Tiffin Etc. doesn't hurt either.\n\nI was a bit confused as to how the menus worked when I first walked in, but that was cleared up after I figured out that people do take-out and seating is upstairs, where we could order from Tiffin and Tiffin Etc.'s menus.\n\nWe ordered a papdi chaat to start, which was pretty good (chaat is one of those things that I love eating, but then I realize that it's not that hard to make). When I saw kati rolls on Tiffin Etc.'s menu, I was giddy. Kati rolls are basically constructed of roti that may or may not be fried with eggs and then wrapped around tasty filling of your choice (hopefully). I really don't know why I get giddy when I see kati rolls on any menu, but I have to try them when I see them. (I have this same knee jerk reflex towards papdi chaat, masala dosas, and sometimes samosas. Yea, I'm into unhealthy Indian food.) I got the shami kebab kati roll which was great! My friend ordered his dish and a Masala Pepsi; obviously he didn't enjoy it because he didn't like the mix of cumin and salt in his Pepsi. But it brought me wonderful memories of India :)\n\nI'm not sure if they still offer diners both menus, but I would definitely order at least one item from the Tiffin Etc. menu; besides the pizza options that I didn't try, I think Tiffin tries their best to offer street/vendor type food here in Philly."
    },
    {
        "id": 4,
        "text": "This review is just for Tiffin Etc.\n\n1/2 Star for food: This place had ( yes I said it had) the best Kati Rolls. Loved the variety of rolls, with lot of chicken/lamb ...just under 6.50$. Amazing!!! Later they started reducing the size of the roll and the meat! Pizza is so so average. Don't ever order Pizza for delivery, you will get it cold!! I'm not kidding...read other reviews too.\n\n1/2 Star for In Restaurant Service: Service is avg and most of the time it would take 30 mins to bring in the Appetizers, 30 More mins to bring in Main course .\n\n1/2 star for Staff : Not very courteous. \n\n1/2 Star for Amebiance\n\n0 Star for delivery or take out : Never.. never... the order food for pick up or delivery!! You go there and have to wait for 15 -20 mins. If you prefer delivery ...you select the delivery time. But the food will there only 20-30 after that time. They fail  hands down in this category"
    },
    {
        "id": 5,
        "text": "Man was this food fantastic and a welcome change from standard Indian fare.  No tikki masala, no saag paneer - nope, none of that.  Instead, TiffinEtc was a wonderful way to spend my lunch hour and my coveted lunch money.\n\nI split three dishes with a friend, and this was the perfect amount.  First, the Indian Pizza.  We split a personal sized Saag Paneer pizza - the size would have been perfect for one very hungry person as your only meal.  The pizza was pretty good - I would only give it a three, but that might be because I was spoiled by amazing Indian Pizza when I lived in SF (http://www.zantespizza.com/).   There was a bit too much ricotta and not enough strong indian flavoring for my taste.\n\nNext we had the Gobhi Paratha, which was pretty fantastic.  The Paratha was a bit soggy, but not terribly so.  The innards of onions and cauliflower were amazing and the chutney was great (although not plentiful enough).  The raita was bizarrely tangy - I'm not sure if that was intentional or not, but it wasn't my thing.\n\nFinally, we had a Masala Aloo Kati rolls, which were fantastic.  It was basically an indian burrito (or is a burrito a mexican kati?) with delicious spicing and amazing potatoes.  \n\nAll in all, this was a fantastic meal, and all for $14.50!  \n\nI can't wait to go back to try the masala pepsi!"
    },
    {
        "id": 6,
        "text": "Indian Pizza. You may hesistate, but it is great.\n\nThe crust was thin, crispy on the outside with a little chew.  The toppings are minimal, but a personal pizza should fill you up.  We also ordered the parathas (small, very thin, flatbread sandwich) that were also excellent.    \n\nIt was very quiet and we were the first to sit down at 6:30pm on a Friday, in other words, not much atmosphere.  I would definitely return as the food is cheap, tasty, and filling.  I would recommed going with a few friends and ordering a variety of items to share."
    },
    {
        "id": 7,
        "text": "I had the tastiest Boti Pizza Kebab pizza from here last night.  It would have been better if it didn't take more than an hour to reach me and wasn't STONE FRIGGING COLD.  Seriously guys, get more drivers or narrow your delivery zone.  I won't order delivery from here again."
    },
    {
        "id": 8,
        "text": "It takes them 2 hours to deliver food and when it comes late and cold they are unsympathetic. They are very rude and have very poor customer service. They do not understand how to treat people. Do not order they are awful and don't deserve your business."
    },
    {
        "id": 9,
        "text": "Today was my first time trying Tiffin Etc.  I've eaten at Tiffin before and thought it was very good, not great but a solid 4 stars.  My Murgh Tikka Kati Roll from Tiffin Etc, well I would have given it 6 stars if I could, that is how delicious it was!  It may be a while before I go back to the original Tiffin because now I can't wait to try some of the other kati rolls and of course the Indian pizzas at Tiffin Etc.  Damn, that was yummy - perfect lunch for a rainy day."
    },
    {
        "id": 10,
        "text": "amazing indian pizzas\n\ntastey and fresh\n\nhighly recommended"
    },
    {
        "id": 11,
        "text": "Tiffin quietly expanded their menu a few weeks ago. This excellent Indian take out spot added a few new item, the most exciting being an arsenal of Indian inspired pizzas. Rachel and I ordered a few pies last night to try out the new offerings.\n\nThe first pizza was topped with tandoori chicken, crushed red peppers and mozzarella. After a few bites, the spices and heat really kick in. This is a great pie. But I liked the second one even better. It was topped with grilled lamb and little cherry tomatoes. Again, the subtle spices on the meat really make this pizza shine.\n\nWe also ordered two stuffed parathas. It's like a gourmet pancake filled with different vegetables. Although these were decent, they pailed next to the pizza. The only other part of the new menu includes wraps, and these don't seem too exciting.\n\n\nThe pizzas are excellent, and with six different options, there's bound to be one to please almost everyone. We ordered more than a enough food and the total was $17 for the two of us. Seriously? These pizzas are awesome and $5? You have no reason to avoid Tiffin's new pizza.\n\n\nThe worst part about all of this new stuff is finding the menu. Tiffin is great at Indian food, terrible at web design. Go on a scavenger hunt on their page to find the pizzas, or use this direct link for the menu :http://media.philly.com/documents/ETCMenu+v33-2.pdf.\n\nEssentials:\n712 W. Girard\n(215) 925-0770\nAvg Ent: 5-6\nCash only: No\nReservations: No\nBYOB: Yes"
    },
    {
        "id": 12,
        "text": "Personal-size murgh makhani pizza for $5. Get it! \nThe drinks are an acquired taste. Great, unique lunch spot on Girard."
    },
    {
        "id": 13,
        "text": "1st time, delivery took 2 hrs. 2nd time, 2.5 hrs, and food was cold/congealed. Delivery driver called me a d*ck when I wouldn't sign (I had paid in full online, he slowly realized his mistake)"
    },
    {
        "id": 14,
        "text": "The expansion of Tiffin into the airy, bright Tiffin Etc. (same entrance) is a welcome development.  The separate, easy to navigate menu, consisting of four equal parts (Signature Pizza, Stuffed Parathas, Kati Rolls, and Beverages) offers distinctly different options from its sibling next door.  While I understand the restaurant's eagerness to include the ubiquitous pizza option, I liked the parathas and kati rolls better.  The spices and herbs in the Masala Aloo made the freshly fried potatoes come alive  Stuffed wheatbreads (parathas) were distinctive depending on the filling - we liked lamb with cilantro and chilies and the marinated onion and herbs versions).  What is really unique are the beverages.  For the less adventurous, Thandai (almond flavored milk with fennel and rose) and the Nimbu Pani lemonade will make addictive companions to the food, the Jal Jeera, a drink described as \"Cumin,lemon, and black salt infused cooler\" will, admittedly, take a bit to get used to (I began to really like it about half-way through).  With the intensity of what seemed to be freshly pureed seaweed (earthy and very salty), this drink is really a very different beverage.  \n\nAs for the pizzas:  I have no complaints except that boredom creeps in when the hunger pangs are satisfied, I preferred eating the whole wheat flatbread parathas.   \n\nThe bill is easy on the wallet, the people at Tiffin could not be nicer, a really tasty and excellent lunch experience."
    },
    {
        "id": 15,
        "text": "Oh no! \n\nI love Tiffin. When they had their buffet I would go every weekend, sometimes on both Saturday and Sunday. I order from Tiffin several times a month. They make fantastic, fresh, and healthy Indian food.\n\nSo when Tiffin Etc was introduced (with e-mails and launch parties galore) my girlfriend and I couldn't wait to give it a try. Too bad the food was delivered ice cold, tasted bland at best, and was in no way of the quality that I would have expected.We ordered a large Murg Makhani pizza, a Seekh Kebab, and an Aloo Paratha. \n\nThe pizza was the best of the bunch, though that doesn't mean that I'd rush out to eat it again. The idea is interesting, and based on other reviews on yelp I thought that it would taste sort of like an inspired Nan covered with tandoori chicken. What we got was a dinner plate sized circle of undercooked dough covered with a few pieces of chewy, mildly flavored chicken. \n\nThe kebab was like something from a food cart that you know to avoid because it always has short lines. Bland minced meat with a few onions thrown in, luke-warm in a cold, too-thin wrap. The paratha tasted like they forgot to add any spice, and maybe any potato. Basically a close to empty thin pancake.\n\nI suggest to pass on trying Tiffin Etc. Just order what you normally would from the real Tiffin!"
    },
    {
        "id": 16,
        "text": "When I lived around the corner, I would visit Tiifin quite regularly and always enjoyed my meals.  When my girlfriend and I saw that they had had opened a pizza place next door we were pretty excited to try it.  \n\nUnfortunately the two pizza's we ordered left much to be desired.  We don't live around the corner anymore, but that's not an excuse for delivering our pizzas ice cold.  The Murg Makhani or Tandoori chicken was the better of the two, but still lacked substantial flavor and had absolutely no spice.  The Saag Paneer pizza was horrible, it was probably the most bland tasting pizza I've ever experienced, no flavor.  After piling on a few spices from the spice cabinet, they tasted slightly better, but we still thought we would have been better off ordering a regular cheese pizza from, oh i don't know, anywhere.  \n\nI was looking forward to the Ginger Mint Sharbat I ordered, ginger and mint spiked lemonade sounds delicious.  However, this was a disappointment as well.  This drink had no flavor of ginger, mint, or lemonade, instead it tasted like green salty water.  I thought if I stirred it up it would taste better, no dice.  I tried to get down a few sips, but ended up dumping it down the drain. \n\nStill Hungry.  What a waste of money."
    },
    {
        "id": 17,
        "text": "For those of you looking to satisfy a paratha-craving, Tiffin Etc. does the job. For those of you who are unclear what it is, a paratha is another kind of indian bread which is a cross between a naan and a chapati is taste and texture. Its a versatile and filling bread which can can be eaten alone, or used to soak up a curry. \n\nHighly recommend the aloo (seasoned potato) stuffed paratha. The smell alone brings back fond memories of India.\n\nDefinitely a must-try for all you carb-and-potato lovers out there."
    },
    {
        "id": 18,
        "text": "We decided to grab take out from Tiffin Etc on a whim, having already tried and loved the food from Tiffin itself. The open, airy dining room and kitchen set my mind at ease (it looks spotless, squeakily clean) and it wasn't crowded at all--we were able to drop in, order, and get out of there in under 15 minutes, and it was very pleasant waiting at the white-clothed table.\n\nBetween the two of us, we split the paneer tikka and hari mirch individual sized pizza and an aloo paratha. Although not as warm as it had been by the time we got it home, the pizza was fabulous. The crust was flat but thick and a little crispy; and the makhani sauce wasn't layered too thickly. The cheese had melted just a little bit; understandably paneer isn't a very melty cheese. The tastes and spices, however, were spot on. My favorite thing was how the heat snuck up on you, courtesy of expert spicing and thin circles of chopped up green chiles. \n\nThe paratha was a little disappointing, although the condiments it was served with were still pretty tasty. It was just a little soggy and bland. It might have been better if we'd eaten in, but next time I think I would just stick with the pizzas or maybe try the kati rolls.\n\nEither way, Tiffin Etc was quick, efficient, pleasant, and above all--deliciously spicy!"
    },
    {
        "id": 19,
        "text": "It takes a few minutes to get seated even though there is only one table occupied. Someone working in the kitchen came to take the order as an after thought. Ordered mango lasso which turned out to be sour. \nFood is just okay and staff could be more attentive to customers. \nParking could be a challenge as you need to part on a one way side street."
    },
    {
        "id": 20,
        "text": "I've only ordered from Tiffin Etc. for delivery, but I've been quite satisfied each time! It's always come in quickly, warm, and with no mistakes. \n\nBilling itself as \"Indian street food,\" Tiffin Etc. offers more casual fare than Tiffin itself. There's not a lot on the menu, but what there is, they do well. Indian pizza... brilliant! Not to mention filling. They are willing to honor any special requests, which is nice 'cause everyone's a bit picky about their pizza, right? I liked the tandoori subzi, which I guess is the equivalent of a \"garden\" pizza. The murg makhani & lal mirch pizza is excellent, as well. Two amazing foods, tandoori chicken and pizza, combined into one dish? Yes, please! Goes great with beer, too.\n\nTheir kati rolls are like the components of a typical Indian meal--meat, vegetables, chutney and sauce wrapped in bread--packaged to eat on the go... but feel free to take your time and savor them, too. If I could, I'd have one every day! I'd call the stuffed paratha the most boring of Tiffin Etc.'s offerings, but they're pretty good, too. I'd rather have them with a bowl of curry to dip in, myself."
    },
    {
        "id": 21,
        "text": "One of my biggest complaints about Tiffin is that although the food is so delicious, it is a little difficult to drop $30 on two entrees and naan when you're not super-crazy hungry.  The other issue is when you're by yourself and you just want a little, not two huge servings of Indian cuisine.  \n\nTo the rescue?  Tiffin*etc.  Here they serve smaller, individually portioned servings of some damn fine indian food that you seriously can't find elsewhere.  \n\nThe girlfriend and I had a individual pizza each but it was waaaay too much food when one could have held both of us over with our other dish, a Kati-Roll with potato in it, split between us.  The pizza was, as my girlfriend put it, like an indian dish's meat placed on a piece of naan.  You don't get the rice or the sauce but the quick essence of the dish is still there and it's still very delicious.  \n\nThe Kati-Roll was something entirely differently.  When it arrived to our table, I was expecting something small in a plain tortilla but it was something else, something further.  The wrap was crispy but soft on the inside and the roll was accompanied with an egg on the inside.  It was seriously delicious and led me to believe that although the dishes are $5, they are not lacking in quality.  \n\nI have to say that the entire experience was really, really great.  It's as if it's a Tiffin-lite scenario.  You want delicious indian food but you don't want to go crazy with it or you want to keep it light.  What a great idea!"
    }
]