[
    {
        "id": 1,
        "text": "Finally, a great Indian restaurant in Rittenhouse. They just opened up and we ordered Chat Papri-excellant. Great onion nan. Loved the Baingan Bharta. The palak paneer was ordered medium spicy and came mild and that is my only complaint. We really loved the food and will most definitely order from them again."
    },
    {
        "id": 2,
        "text": "Chicken tikka masala was disappointing, cubes of over cooked chicken breast in a sauce. Pricey for what it is... Samosa chaat was more like a stew. Hoping the next time the dishes will seem more like \"home\" cooked."
    },
    {
        "id": 3,
        "text": "Wow a serious disappointment. In fairness my review is the product of one disappointing Caviar delivery for three. Absolutely no service issues or grievances unrelated to the food (ie packaging, presentation etc). Quite simply the worst Indian delivery meal I have had in my memory. Insipid entrees, overcooked flavorless meats. I won't be giving this place a second chance obviously others might be more forgiving."
    },
    {
        "id": 4,
        "text": "Absolutely coming back to this place. Stopped in yesterday for dinner for the first time. Lamb samosa disappeared in about two seconds along with some standard, delicious, chutneys. We also ordered a Navratan korma which was pretty good and we ordered something neither of us had tried before...chicken Karahi... which was outstanding. The blend of spices with ginger and cinnamon along with well cooked chicken and vegetables was special. I almost forgot about the garlic naan which was fluffy, chewy, and savory - perfect."
    },
    {
        "id": 5,
        "text": "Me and the family were at The Royal Indian Cuisine a week ago and it was terrific. The restaurant had only been open for a week, but it looked like they had already gotten into a good rhythm. The food was excellent. The staff was friendly. \n\nWe ordered Butter Chicken, Lamp Saag and Malai Kofta and asked for it to be mild. And it was definitely mild.. which was particularly useful for our kids. \n\nThe breads and Samosa was perfectly cooked and moist. Will definitely be back."
    },
    {
        "id": 6,
        "text": "I was very excited to see an Indian BYO in Rittenhouse. Overall the food was good. I ordered take out and my main entree was mixed up with another customer. I had to return to the restaurant to have my order corrected -- major let down. The rosemary naan and mulligatwani soup were my favorite. The flavors were great. I also ordered chicken karahi which could have been much more spicer, next time I'll ask for a higher level. \n\nI will give this restaurant another chance but it left me still craving something more.."
    },
    {
        "id": 7,
        "text": "We are big fans of the sister restaurant Palace of India near Passyunk and Tasker. When we heard they opened a new restaurant near Rittenhouse we were THRILLED and finally made it there for dinner a few nights ago. We were not disappointed, the owner who we've come to know was there and greeted us like old friends. \n\nWe were not disappointed. We ordered the old standby Chicken Tikka Masal along with selections from our usual rotation, Saag Lamb, Curry Chicken and Mutter Mushroom Curry along with Naan. We were so happy to determine that to food at Royal Indian Cuisine is a good as the food at Palace of Indian. \n\nIf you are near South Philly, try Palace, if you are closer to Center City, don't miss Royal India, either will be much better than most Indian restaurants in the area, we've tried them ALL and few are as good as these two."
    },
    {
        "id": 8,
        "text": "This best Indian restaurant in Philly \nWe ordered chicken shahi korma \nLamb Karahi and beef boro kebab\nIt was so amazing, garlic & cheese naan was best \nExcellent service and friendly stuff\nDefinitely we will be back"
    },
    {
        "id": 9,
        "text": "We had a fantastic meal! The service was lovely and attentive and the food came out hot and in good timing. They spaced out the appetizers and main dishes perfectly. \n\nThe chicken tikka Marsala was incredible, so tender and flavorful. \n\nIt's also byob. We will definitely be back!"
    },
    {
        "id": 10,
        "text": "I was reluctant to go here. Indian restaurants I've been here has been ok. Alright, I prejudged. It's very yummy!! \n\nOnly one waiter though. But after being there a few times I realized he's the owner. It's BYOB. I love the naans and all the dishes. However I never had any of the veggie dishes. But I'm sure they are good!"
    },
    {
        "id": 11,
        "text": "So happy to have a Indian restaurant around the corner! Myself and two friends had dinner last night at Royal Indian and everything we ordered was delicious. We loved that we could choose the spice level. I will be ordering take out/eating in again."
    },
    {
        "id": 12,
        "text": "I have ordered from here before and was satisfied. This time however , it was awful. My garlic naan was decent but my Chicken Tikka Masala tasted like chicken in Ketchup with some Indian spices thrown in. The ketchup taste was overwhelming and I hate ketchup so I threw it out. On top of that I asked for hot and it was mild- I guess you can only spice up tomato ketchup so much. My food sucked"
    },
    {
        "id": 13,
        "text": "There were 2 bugs on the table that I sat at I had to change the table. That is when I should have left but I was feeling brave and I stayed the food I ordered tasted \"okay\" but then I got gulabjamun for dessert and I'm not joking when I say it was nothing like a gulabjamun it tasted more like a tofu. I won't recommend this place if you want good indian food go to Amma's."
    },
    {
        "id": 14,
        "text": "When you walk in, don't be surprised if the host asks you if you want Indian food. There is a Chinese restaurant next door, and apparently many people enter the wrong door.\nThe menu offers very many choices. Four of us ordered about 5 dishes to share - fish, shrimp, chicken, and vegetables and 2 kinds of naan, and we thought everything was delicious! The restaurant filled to capacity at dinnertime, and the service was as good as it could be with only one server who is also the host. \nThe main reason I did not give it 5 stars is because it is incredibly loud. People were literally yelling, and the noise reverberated to the point where we could not hear each other talk. There are ways the restaurant could mitigate this noise."
    },
    {
        "id": 15,
        "text": "Very solid local Indian joint.  Some delicious more unusual items, like the mustard greens.  Too heavy on the ghee and cream as few very places manage to escape.  Very happy to patronize them!"
    },
    {
        "id": 16,
        "text": "Small BYO spot close to the park. Delicious, the food compared to other spots in the area is much fresher and has way less holding time. Big fan of their vindaloo recipe. Garlic naan was piping hot and tasty. Prices are high, but understandable given the area."
    },
    {
        "id": 17,
        "text": "Desperately looking for open restaurants later on a Sunday night (around 9:20). This spot was open till 10, so confirmed via phone call and headed there as quickly as possible.\n\nWe arrived with half an hour to spare but at that point they were only doing takeout orders. Quickly went through the menu and ordered the Chili Chicken ($13) and Garlic Naan ($4). Food was ready after about 10 minutes - tightly packed in a to-go back, and thankfully with utensils after asking. Chili chicken is a large serviced of sliced chicken marinated in chili paste, tomato ketchup, and other spices. The overall taste is sweet because of all the tomato ketchup, with some spicy follow-through. Naan is your basic fare, not too much garlic but went well to scoop up the chicken.\n\nWas hoping for a sit-down meal, but they seemed ready to close out for the night. Plenty of options to choose from here, so could be hit or miss."
    },
    {
        "id": 18,
        "text": "Ordered takeout from here last week after passing by and reading the rave reviews. I love Indian food, I eat it several times a month, and I was hopeful to have found a new go to takeout spot. Unfortunately I was extremely disappointed. \n\nThe first giveaway that this may not meet expectations was that my food was ready in 5 minutes. 5!!! This restaurant does not have a buffet so it's not like they're constantly making fresh batches of popular staples. I was weary but hopeful to have my mind blown. \n\nThen, most importantly, the taste: bland, watery, clearly frozen vegetables with that sad frozen vegetable taste. This was the most tasteless Indian food I'd had in a while. I've attempted to make Indian vegetable dishes a couple times- it's turned out ok but not great - this was worse than that. The seasoning was SO off. I'm hoping it was an off night that's s not reflective of their quality and service but after throwing out almost all of a $14 dish, I'm not willing to try this place again any time soon."
    },
    {
        "id": 19,
        "text": "Very flavorful spices and chicken that melts in your mouth, a local go-to spot for excellent Indian cuisine. Would love to go again next time I am in the area!"
    },
    {
        "id": 20,
        "text": "This is a great addition to the neighborhood, the vindaloos, kormas and tikka masalas are excellent, naan are big and fluffy, best of all they do not skimp on the rice unlike some other places where they expect 2 people to share 1 rice serving."
    },
    {
        "id": 21,
        "text": "New place to tempt you pallet with delight from the middle of the word!. Curry dishes to sooth the mouth with herbs and spicies!. People seem friendly and comfortable. For eat in or take out a pleasant eatery to relax the day away!. In my view Indian Cuisine, attempting arengment of traditions and culture all wrap up in one?."
    },
    {
        "id": 22,
        "text": "Came here recently and LOVED the food. Best I've had in philly so far. Service was attentive and speedy as well. Highly recommend the coconut chicken curry"
    },
    {
        "id": 23,
        "text": "Great Sunday take out food, on time, flavorful and Open till late! Nothing more you can ask for"
    },
    {
        "id": 24,
        "text": "This food was some of the best Indian food I've had in Philadelphia. It was all fresh, the mango lassi tasted fresh, and the chicken vindaloo and chicken tiki masala were amazing. We barely left any leftovers, it was so good. Service was excellent and attentive. I hope to come back soon to this gem."
    },
    {
        "id": 25,
        "text": "The food was really good, the chicken was cook to perfection and the sauce was so buttery with the right amount of spice. The basmati rice complemented the sauce and the chicken perfectly. The service 10/10, parve one of the hostess provided great hospitality and treated me as though I was a guest dinning at her house. You can tell that the cooks cook with passion because the quality of the food was amazing. Lastly, if your in the area and are craving Indian food check this place out you will not be disappointed."
    },
    {
        "id": 26,
        "text": "A bit on the pricier side for Indian takeout but high quality food! Loved the lamb biryani- it is a bit in the oily  end but still extremely flavorful. Portions are okay."
    },
    {
        "id": 27,
        "text": "Quick delivery service, great food, west coast grade spice level (which is good). Would recommend highly."
    },
    {
        "id": 28,
        "text": "This was the best Indian food I've ever had. My boyfriend who normally won't even touch Indian food tried the lamb kabobs and loved them. I would definitely recommend!"
    }
]