[
    {
        "id": 1,
        "text": "What a wonderful find ! \n\nI stopped in for lunch the other day, which is a steal of a buffet at $7.99. The selection was tasty, hot and fresh. \n\nThe 'server' was a nice as could be, and just overall a terrific deal. \n\nDefinitely worth a return trip, again and again."
    },
    {
        "id": 2,
        "text": "This wonderful little place is owned by the nicest family, headed by Ravi, a super friendly man who personally greeted us and talked to us about life and the opening of his restaurant.  I just want to come there to give them business.\nOur favorite thing about it is the decor (I feel like I'm in a happy place in India), they even have a slightly separated part of the restaurant which is good for private parties.  Definitely their interior designer should come to my house.\n\nOur other favorite thing is the vegan chai tea.\nAnd, of course, the price. I love buffet style because I always want to try a little of everything so this is perfect for me."
    },
    {
        "id": 3,
        "text": "This place is garbage. Just awful. I don't even know where to begin. There used to be an Indian buffet here and I could've sworn it was also called Samosa Vegetarian, but that was 10 years ago, and this place has all kinds of signage about having a grand opening special and \"Lunch only, Dinner soon.\" But that part makes no sense either because there are also signs advertising dinner for a few dollars more than lunch, but there are no dinner hours posted. I asked the woman at the register and she said sometimes they have dinner, sometimes not. Okay...\n\nThe buffet had very few selections and what they did have wasn't good. The naan bread was kind of damp and floppy. The samosas were flat and unflavorful, as if they'd come out of a pre-prepared frozen bag. (The samosas at Sitar and New Delhi in West Philly are SO GOOD.) There were four dishes to choose from, I can't honestly even remember what they were but I can tell you the palak paneer had no paneer in it at ALL.\n\nThe tables and chairs are rickety and wiggle around underneath your body and the overall decor seems just old and decaying.\n\nAnd then the worst thing of all, an employee - possibly the owner? - was going around to tables asking if he could video them on his phone talking about how much they love the restaurant. It was so awkward. I just wanted to eat my lunch and be on my way, not listen to some bridge and tunnel rubes at the table next to mine talk for 3 minutes about how the \"mango juice is so great\" (mango lassi is not juice...)\n\nBasically I paid $7.99 which I thought was cheap yet somehow left feeling I'd paid too much. Will never, ever return."
    },
    {
        "id": 4,
        "text": "The owner was extremely nice but this spot needs some work. I came in on Friday at around 1pm and I felt like the restaurant was in shambles. When you arrive there are signs to seat yourself but in a half empty restaurant ALL the empty tables had stacks of dirty dishes on them. I had to wait while they filled the buffet for someone to finally free up to clean off the tables. \n\nWhen it comes to the food, it is really good! There's a small selection so I did get to try everything. My favorite dish was the spinach paneer. \n\nI don't think I will be back even though the food is good. Entering to see that they can't keep up with the dining room left me feeling weird. I know this is a new business but maybe they need to hire one more person to just manage the dining area. The owner seems stretched thin between managing the dining area, taking payments, and filling the buffet."
    },
    {
        "id": 5,
        "text": "I came for the lunch buffet today, which is inexpensive and savory.\nThe atmosphere is welcoming and the owner is on top of the things. He seems to be a nice and humble person. The ingredients are fresh and the food is hand-made. My return is certain and I am happy to have the new Samosa around the usual and sometimes boring suspects at Jefferson."
    },
    {
        "id": 6,
        "text": "So good. I've probably been here 6 times now and it's always worth the walk across the city. The only good Indian food in Philadelphia in my opinion. Has great selection (plenty of gluten free, vegan and veg options). Has really great chai (vegan and regular!) which is a treat. Ravi the owner is a super cool guy, always checking on everyone and helpful. You can taste the quality of the ingredients. Can't recommend enough."
    },
    {
        "id": 7,
        "text": "If I could give it 10 stars, I would. The amount of love everything is cooked with shines through each individual dish. Chef Ravi is so enthusiastic about his cooking and sharing his love of food with his customers it is incredible. Since this is a family-owned and operated establishment, I feel grateful for their hard work and willingness to bring delicious, extremely affordable vegan and vegetarian food to the masses of Philadelphia!"
    },
    {
        "id": 8,
        "text": "Great food, lunch buffet had nice options, replenished well and nice tea. Dining room was well kept by the staff that constantly came out to make sure everything is good, customer service was really good, especially prem singh who was very friendly."
    },
    {
        "id": 9,
        "text": "I don't usually expect much from buffet foods, but this was by far the best one. There was a decent selection of dishes and the vegan items were clearly labeled. The price of $7.95 can't be beat and includes mango juice and delicious vegan chai. The vegan soja halwa tasted amazing as well. \nThe owner is the nicest and sweetest guy you'll ever meet."
    },
    {
        "id": 10,
        "text": "Excellent vegetarian and vegan Indian buffet!\n- have you heard of vegan naan?\n- vegan masala chai?\n\nFood was fabulous. \nVery friendly staff. \n\nWill definitely dine here again!"
    },
    {
        "id": 11,
        "text": "Simple, unpretentious, welcoming.  A great place to eat.\n\nThe buffet doesn't have a huge number of selections as it's a fairly small space, but definitely has enough.  You can expect to find all the classics: saag, a brown dal, channa masala, naan, pakora, etc.  Everything is delicious - it even won over my carnivore coworker.\n\nNote that the entire restaurant is self-serve (you bring your own water pitcher to the table, place your used dishes in a plastic bin), but the food is delicious and the prices are quite cheap.\n\nThe owner is friendly and kind and a pleasure to interact with.  He is the type of person with whom you feel good spending your money."
    },
    {
        "id": 12,
        "text": "My Dad and my Mom used to eat at Samosa regularly when my Dad worked down the block. Now my Mom has been gone for 6 years and my Dad is in assisted living in the suburbs. When I bring him to Center City for his doctors' appointments, we always make a point of stopping by this very popular place for lunch. The owner remembered my Dad after all of these years and is always so kind and welcoming. You can't beat the price and the food is so fresh and tastes great. Soup, papadam, samosas, pakuras, two kinds of rice, pizza, many hot entrees including sag paneer, dal and various other excellent and authentic Indian dishes, a salad bar, desserts including gulab jamin and rice pudding, chai tea, mango juice and more. Find such a selection anywhere for $7.95 (lunch price)!"
    },
    {
        "id": 13,
        "text": "Very authentic, delicious food. We've been to other Indian places in Center City/University City and this is definitely one of the best. The buffet is no frills but the food was fresh and delicious. The owner (I think) came out and served us fresh naan and dosa as he brought it out for the buffet, and was very friendly to us and all the other patrons. Also very reasonably priced."
    },
    {
        "id": 14,
        "text": "Bar none the best value for money for lunch in Center City. All the food is delicious and there's a nice spice to everything - very flavorful."
    },
    {
        "id": 15,
        "text": "I have been here twice since it's opening...a very delicious buffet that is small enough to let you try everything, yet leave feeling satisfied. The host (I believe owner as well) is very friendly and outgoing. They could probably use one more person on staff to assist with keeping up during the lunch rush, as I think the owner is doing everything himself."
    },
    {
        "id": 16,
        "text": "I don't eat Indian food as often as I would like because if I'm by myself I know I won't get to try a nice variety which is how Indian food should be enjoyed. I was excited to try a buffet, but the $8 all you can eat should have served as a warning. The food was not inedible, but lacking in quality. The veggies were overcooked and each plate was mostly sauce. Many if the items were way oversalted. Finally they threw a pizza onto the serving station as if it naturally belonged there. Would not recommend if you like decent food."
    },
    {
        "id": 17,
        "text": "Finally reopened!! So glad too! The owner is so kind and positive. We came in just as they were shutting everything down, but he kept inviting people to take some to-go boxes so that they could enjoy the food. We tried almost everything on the buffet and it was all fantastic! The Gulab Jamun was the best I've ever had! It was so soft and perfectly flavored. It felt more like an at-home experience than a restaurant. I highly recommend giving it a try again. I was so happy to see them return"
    },
    {
        "id": 18,
        "text": "Great place with great food, all vegetarian with some vegan options as well. Normally when places say that they're vegan or vegetarian entirely or known for that I take it as a sign to be cautious because that'll could translate into more expensive prices, things that aren't as filling, etc. But I can confidently say that this restaurant exhibited nothing like that.\n\nOn top of that the buffet is pretty freaking cheap - we went for lunch and paid ~$10 with tax and all that jazz included! Plus the staff is super nice and even gave my friend a free meal! I will definitely be back."
    },
    {
        "id": 19,
        "text": "Nice Indian vegetarian buffet. Food is pretty good, not great. Nice variety; I tried a little of everything. The pureed spinach soup was nice. There were 5 items...saag paneer, Chana masala, mixed veg in cream sauce, eggplant & potato,and another dal. The sauce with the mix veg was very nice, the other curries were good, nothing that really wowed me. The saag paneer was basic,a little bland I thought& not sure paneer was even in there.  Naan was decent,and they offer two kinds of rice, white basmati & yellow tinged one w/vegetables. I really enjoyed the pakoras, which were mostly eggplant. A fresh batch was added on my second round, and they were excellent. There are some nice sauces and chutney to add..coriander, tamarind, hot ,sauce, coconut(didn't try),mango chutney..etc. There was a very tasty mixed bean salad in that area that deserves a try.\n\nOne complaint is that most of the food in the buffet wasn't hot(temperature). The owner is exceptionally nice and accommodating. When he brings fresh items to refill the buffet(like samosa & naan) he will go around the room offering them first. Samosa was nice, good size, nice filling when augmented with chutneys. Didn't try the naan pizza because there was only 2 old pieces , but the fresh one he brought out after my meal looked decent.\n\nDesserts were good, I preferred the Kheer, not too sweet,and a good amount of rice & nuts. Hoping for gajar halwa, they had sooji that day. It was ok, mine is better ha! Had some kind of sweet yogurt I didn't try. Mango lassi was thick and very sweet. Preferred the vegan chai to the regular.\n\nIn conclusion, the food is good here, nothing exceptional. The nice atmosphere, music, and congeniality of the owner makes me give 4stars and want to return"
    },
    {
        "id": 20,
        "text": "The food is extremely authentic, exactly like what you would find in North India. Chai is included with the buffet and is some of the best I've had in the USA. The service is great too! Very polite people, and food is replenished quickly! Highly recommend this place, especially the saag and the samosas!"
    },
    {
        "id": 21,
        "text": "This place is the best kept secret in the city. It's really hard to find something spicy and delicious and cheap in this area. They have every kind of Indian deliciousness that you can imagine, different types of bread, rice, lots of different choices for entree, and then desserts, tea and mango lassi. All for $8! And they make it less spicy like most Indian buffets to appease the masses. You will NOT be disappointed."
    },
    {
        "id": 22,
        "text": "The food was good this is a self serve buffet. It's nicely decorated, however they had limited hours when I went. The owner and his family are loved super sweet. He did spill water all over my jacket which normally isn't a big deal but it was winter so kind of disappointing. Overall, I can't wait to visit again when I am back in town."
    },
    {
        "id": 23,
        "text": "This place is great.  Its a fresh tasting vegetarian buffet.  The price is right at 7.99.   The owner Ravi is always welcoming asking how you are doing and how is the food today.  I've been in several times and the buffet adds different items every time.  The buffet is not huge but what is there is always fresh tasting.  The restaurant is always clean."
    },
    {
        "id": 24,
        "text": "Tasty food, and awesome management. Definitely recommend for anybody looking for all veg and/o vegan options!"
    },
    {
        "id": 25,
        "text": "Great little spot near TJU Hospital. No servers, you just walk in, immediately grab a plate, and pack on as much food as you want. All options are vegetarian. 3-5 main course choices, with a variety of sides to choose from, including salad and pizza. There is also a small dessert section. All you can eat for roughly 8 dollars. \n\nOverall: food 4.5 / environment 4 / value 5\n\nWill definitely be back!"
    },
    {
        "id": 26,
        "text": "Cozy little place offering buffet for a good price. Wide range of options and tasty food. Friendly staff."
    },
    {
        "id": 27,
        "text": "Amazing spot! Not only is the food delicious but the owner Ravi is an exceptionally generous and kind person. You walk in, help yourself to the buffet, and then walk up to pay when you're done. The food is delicious, and everything that is vegan is clearly labeled. They have amazing vegan chai tea! I'm visiting from out of town and first went with a group of friends, it was so tasty I went back again by myself. Great for a quick lunch or if you want to spend some time hanging out in a place with great energy!! Definitely going back the next time I'm in Philly!"
    },
    {
        "id": 28,
        "text": "Excellent cuisine, great price (for the buffet), the seating is okay. The customer service is excellent. I would highly recommend this establishment if you're looking for vegetarian options. I was impressed with the food."
    },
    {
        "id": 29,
        "text": "The buffet here is amazing. Authentic Indian food and meat free. The customer service is wonderful. And you can't beat the deal."
    },
    {
        "id": 30,
        "text": "The restaurant has a new name and has been completely renewed from what it was previously. The interiors are much better with a huge statute of Buddha and a unique decor in the back. Currently they're only serving lunch buffets and don't have a fixed menu. But that's actually a good thing. The pricing is inexpensive, the food is all vegetarian and the best part is that if tastes fantastic. \n\nThe Dal Makhni (black lentils) was amazing. It would be safe to say that it was the best in Philly! \n\nThe Gajar Halwa (carrot dessert) reminded me of the streets of Delhi and my mother's cooking. Delish!!!\n\nThe breads were hot, the other food items tasted good as well. \n\nThe owner was extremely friendly and unlike the previous owners, he is actually from India and knows what he is doing. \n\nThere are not many nice Indian restaurants in Philly. This is definitely one of the better ones. \n\nGo and try this for Lunch Philly. You won't be disappointed."
    },
    {
        "id": 31,
        "text": "Simple home cooked, flavorful food. The owner was really welcoming and atmosphere was warm and inviting.The food is simple, not greasy and without unnecessary addition of cream. Ample of choices for Vegans. In fact except for 2 to 3 dishes all dishes were vegan, including vegan options for dessert and vegan chai and vegan naan bread! My husband and daughter especially loved  the kheer Indian rice pudding and coconut burfi (kind of coconut fudge). At $7.95 for lunch buffet it was good value for money. In all I think we totally overrate!"
    },
    {
        "id": 32,
        "text": "Kind staff, cheap price, great food! Love the drink options too! I also love how they clearly label the vegan items"
    },
    {
        "id": 33,
        "text": "So glad Ravi is back!  I was a regular here in the 90s when it was Samosa.  Ravi, which I hope is the same Ravi I knew back then, is super friendly and would come over and hang at our table to talk.  Food was great back then too.  The original Samosa closed, apparently I heard Ravi had some health issues, and then it became several different restaurants over the years, but now it looks like Ravi is back!  Very happy to hear this!  Will definitely come by to say hello!  I've missed this place!  Sounds like the food is pretty awesome from other reviews."
    },
    {
        "id": 34,
        "text": "This is such a sweet place. We went for lunch and very much enjoyed our meal. The buffet was stocked with hot delicious Indian food. The naan was so good, saag, aloo mattar. Samosa was simple and crispy and so delicious. The gentleman and his wife who run this restaurant are friendly and so kind. The pizza was nice desi pizza. Best of all was the garma garam chai and halwa. We will be back!! Desi approved!!."
    },
    {
        "id": 35,
        "text": "My husband and I just happened to walk by and stopped in. The place is not fully open but we were greeted by Ravi (the owner) who had a big smile on his face. He very kindly offered us some food to try and we had a great conversation. \n\nThe Indian inspired pizza he was a sample of what we can expect in the upcoming months. There will be a buffet as well as an a la carte menu. \n\nWe are so excited to check out Samosa when it opens up soon!"
    },
    {
        "id": 36,
        "text": "great vegetarian north indian food. spice level is excellent, food is hot, and the chai is sweet and flavorful. it is a quiet restaurant and you walk in, grab your plate and eat, and check out in the back before you leave. probably one of the best indian buffets i have had.. tastes like home cooked food!"
    },
    {
        "id": 37,
        "text": "This is a difficult review to write. \n\nI am a vegetarian who loves Indian food. I want more vegetarian/vegan restaurants in the city. I will often go out of my way to support vegetarian/vegan restaurants. \n\nThat being said, it pains me to say that after three visits, the food here is just OK. (FWIW, my favorite Indian food is at Ekta in Fishtown and West Philly.) However, the price is right, thus the third star.\n\nNormally, I would end the review here, but there's this other thing. You see, the owner is a bit... intrusive. Allow me to explain.\n\nWhether you want to or not, you will likely find yourself in a conversation with the owner about the food. Usually, that's a great opportunity for diners to be heard and then the owner can decide to make adjustments based on this feedback. \n\nBut that's not what happens. Criticisms are waved aside, your fault, not his, while compliments, if they are not the ones he wants to hear, are met with dejection. It's so frustrating.\n\nSo hopefully the owner will read this and take it to heart. I really do want Samosa Vegetarian to succeed."
    },
    {
        "id": 38,
        "text": "This place is a must-visit! They have vegan chai, two different vegan desserts, vegan naan (a relative rarity!), and a good variety of dishes in the buffet. The owner is so nice and makes you feel at home when you're here.\n\nOh, and $7.99? Haven't seen that price point for a buffet-style restaurant since the mid-2000s, when I lived at International House and would go to Sitar India for breakfast every day around 2pm after playing Starcraft all night."
    },
    {
        "id": 39,
        "text": "Love this place, and try to get there once a week. The lentil and chickpea curries are fantastic, as is the paneer sag and they all have a nice level of spice! There's also great deep fried pakoras and sweet, handmade samosas, stuffed with potato and peas - you can watch the owner make them in his kitchen in one of the videos playing in the restaurant. Speaking of the owner, he is so welcoming and friendly, and even though he's always very busy he always takes the time to go the extra mile for his customers. All that and such an affordable price. I can't recommend this place enough."
    },
    {
        "id": 40,
        "text": "After passing by this storefront nearly every day for the past few years, I finally decided to stop by for a quick lunch. I was intrigued to see the super cheap price, which is sometimes suspicious for Indian buffets. \nThe restaurant is currently only open for lunch. You can grab a plate (and maybe a bowl or two), and load it up with curries, dal, naan, rice, and a variety of interesting cold salads. I tried out the dal makhani, channa masala, saag (with beans?), along with naan and rice. The curries were pretty flavorful and not too oily, and my favorite was the saag. It seems like they rotate the options, which is definitely appealing. Only complaint was that they were not very hot, and I do like my Indian food pretty warm. I also tried a spinach pakora, which was good, and samosa, which was slightly doughy. The naan didn't seem like a freshly made naan, rather more of a heated packaged naan. But it was soft and served the purpose. \nTo be quite honest, my favorite part of the meal was the \"masala pizza,\" topped with lots of cheese, jalapenos, and onions. The masala chai was also pretty good, albeit a bit too sweet. \nOverall, the meal was pretty good and I was happily full for a very low price. The owner of the store is also a very sweet man who checks in with all the customers to inquire if they are enjoying the meal, and to urge them to get some dessert. Reminds me of my mom! The convenience of this restaurant might just bring me back."
    },
    {
        "id": 41,
        "text": "We just happened to be walking by Samosa Vegetarian looking for a place to eat while we were visiting town and another patron was exiting the restaurant talking about how much they loved it there. Naturally our interest was piqued so we stopped in for lunch. That was the best decision! We tried almost everything on the buffet and loved everything!! If you're looking for amazing, spicy, vegetarian Indian food, you HAVE to try Samosa Vegetarian!!!"
    },
    {
        "id": 42,
        "text": "I know starting a review off talking about the owner is a weird flex, but bare with me lol.\nThe owner is by far one of the most humble and sweetest people you will ever meet! As soon as a friend and I walked into the restaurant, we were greeted by the wide smiled owner who was literally doing everything and being everywhere at once. The spot itself is small, but set up in a way where no matter where you sit, you always near the food lol. \nThe decor is nice and fitting for the type of food served.\nSince its all buffet style I did expect there to be more options, but there were only about 6 hot food options, a salad bar and about 2 desserts. \nI did like that fact that it was  100% vegetarian. Not that I'm vegetarian, but there are very few places like this in center city so its a great change of the norm imo. \nMy favorite of the hot food items was the spinach dish. It was flavorful and spicy just how I personally like it. I mean everything had some level of spice to it which I personally loved. The chickpea dish was okay, but not as flavorful as I expected it to be. \nFor the price point of around $8 for the lunch special, its totally worth the try. I'll be dining here again soon just to chat with the owner again and enjoy some good food."
    },
    {
        "id": 43,
        "text": "Imagine that a really nice Indian family invited you into their home and cooked fresh, undeniably authentic, vegetarian Indian dishes that you could eat to your heart's content. That's the experience you get at Samosa. Their lunch (dine in for the buffet or a take-out box) is a steal at only $8 per person, and each dish is made as if they paid careful attention to each one without any compromise in quality. Also, the owner was out and about waiting on tables, refilling the buffet items, and manning the cashier -- all with the nicest and most welcoming manner possible. This is their 2-week anniversary, and I can't wait to see what this restaurant will evolve into if they're this good at 2 weeks! I'll be back!"
    },
    {
        "id": 44,
        "text": "This place serves authentic Indian food which is super healthy and delicious. The owner Ravinder is so so sweet. I happened to mention it was my birthday and he didn't charge me for my meal, which is such an incredible gesture. I was so overwhelmed. \nThe samosas were crispy and fluffy. Saag was amazing and the jeera rice and dal were the best I've had in the US. Go here for the delicious food and the beautiful people who own the place."
    },
    {
        "id": 45,
        "text": "This place is value!! For $8, you can't beat this vegetarian Indian buffet. I started with the pakoras and samosas with chutney, which were both great, then moved onto the gravy veggies and lentils with naan and rice! There's also a salad bar and raita.\n\nHalfway through our meal, the owner brought out freshly baked pizza and offered us all a slice! I was so stuffed, but still couldn't resist the pizza haha \n\nI ended my meal with some hot chai (there's also a vegan chai) and jalebi. There was an assortment of sweets to choose from, including some sort of halwa and kheer. \n\nYou can also stuff to go boxes for the same price as dining in, price is by box and not by weight! \n\nThe owner's hospitality is second to none, and I know I'll be coming back soon!"
    },
    {
        "id": 46,
        "text": "First Indian restaurant in philly which serves only vegetarian food I guess. It was delicious. I went there with my colleagues and they had buffet for only $8 only. Had bunch of options to eat and especially they serve Indian style pizza which is kinda hard to find anywhere in US. \n\nOverall, it was such a good experience and owner (Ravi) is always there with the big smile."
    },
    {
        "id": 47,
        "text": "Vegetarian only, cheap, but filling, buffet-style.\n\nI've seen the advertisement and walked by this place so many times, but truth be told, if you curb your expectations and like paneer saag, Samosa Vegetarian is your spot for just $8 pp (lunch only). Also, I hear they serve food to the homeless at night, which is just a rumor, but if true, props to the owners.\n\nI think my favorite was paneer saag, the lentil soup and also the milk tea. I was actually quite surprised by the amount of fresh salads next to the classic indian dishes as well, and after my fourth plate of saag + spinach, I needed to unbuckle a notches on the belt and leave very full and happy. At the end of the day, all of the dishes taste homemade and authentic, and the service is quite attentive. So if you're hungry, come to Samosa!\n\nOf note I think their samosa could use some more spices and peas.\n\nFood: 4 stars\nService: 4 stars\nAmbiance: 3 stars\nPrice: 5 stars"
    },
    {
        "id": 48,
        "text": "All you can eat heaven! \n\nWe chose to come here for our Valentine's Day dinner on our trip to Philly. I was mainly drawn in by the fact this is ayce something we rarely see in BK. And for $11.99 for appetizers, entrees, desserts, beverages and amazing service this really can't be beat! \n\nWhat impressed me most was how kind the owner and his family were. So attentive and constantly checking in even though the dishes are self service (you place dishes In the bin and grab new ones). He even brought us a special carrot halva dessert. It was delicious. Really the service is well worth the trip here! \n\nFood: marvelous! I'm the first to be weary of an all vegetarian meal. But literally every element was so on point. You could taste the \"home cooked\" feel of the food here. You can't go wrong. But here are some of my favs \n\n1. The pizza! Whattt? Yes. They make these naan pizzas and they are so delicious! I'm not sure what makes it so great but wow. Def try a piece. \n\n2. The samosa- like the restaurant name suggests the Samosa are amazing. What makes it so good is the pastry. Reminds me of a crust on a chicken pot pie. So flaky. I had it with the tamarind sauce and mint chutney. Fantastic. \n\n3. My third favorite was the paneer curry. Something about the spices in that were amazing. \n\nDessert: don't forget the coconut halva. It looks unassuming in the tray but the flavors are magical. \n\nFood here is kosher friendly it was mentioned and vegan options on top of being vegetarian. Pretty awesome. \n\nHonestly I wish a place like this existed in nyc. Such kind people and you get an incredible bang for your buck. I wish them all the best-and come to the big Apple! Haha"
    },
    {
        "id": 49,
        "text": "Ravi is the sweetest restaurant owner I've ever met! I wanted to stay for hours just to chat with him. The food is great, the vegan options and spicy-spicy options are clearly labeled and if you still have questions, Ravi is happy to answer them! It's a very cute serve-yourself set up, you won't feel rushed or hurried at all. Alcohol is NOT allowed here, which is important to know as BYOB seems popular in Philly. I'm from out of town but will be definitely coming back to eat here any chance I get!"
    },
    {
        "id": 50,
        "text": "Anytime I visit Philly, stopping at Samosa for a meal is a must! The buffet always changes, and is always delicious. Inside, the atmosphere is warm and cozy with soft lighting, and it's always clean. \n\nA couple food staples are the delicious samosas (of course!), perfectly cooked rice, the carrot halwa, and the absolute highlight: vegan chai tea  You can't beat unlimited amazing food like this for such a reasonable price ($8 for lunch, $12 for dinner). \n\nThe cherry on top is the kindness of the owner, who goes out of his way to greet and chat with Samosa's patrons! It's amazing to see customer service at its finest, and is one of the many reasons I'll keep coming back and convincing whoever I can to join me! I'd 100% recommend Samosa to anyone, whether they love Indian food or have never tried it - there's something for everyone."
    },
    {
        "id": 51,
        "text": "We were here on Saturday for their lunch buffet. The food was great and the people there are really friendly too. And the price is very reasonable. I am not a vegetarian but I still love the vegetarian food there."
    },
    {
        "id": 52,
        "text": "This is a great little vegetarian place. I went there 30 years ago when his father had it, the sweetest kindest man, he didn't speak much English but his actions spoke load enough. It closed for a period of time and the son had taken it over. Still wonderful food,inexpensive.i try to attend as often as I am able. Soooo good\nBasically what Iam saying, they have a strong sense of family and kindness to others while nourishing your body."
    },
    {
        "id": 53,
        "text": "SO good!! The staff is so friendly, the food is fresh and delicious, and it's very reasonably priced. So many vegan options! New favorite lunch spot."
    },
    {
        "id": 54,
        "text": "Delicious!!! Some of the best naan and samosas I've had, and the lunch buffet is a steal at $8. HIGHLY recommend!"
    },
    {
        "id": 55,
        "text": "I've been waiting so long to eat here! And boy was it worth the wait! The kindest staff directed me to all of their (many) vegan options! The deserts, yum! Quick delicious food you can tell is made from the heart!"
    },
    {
        "id": 56,
        "text": "I  am glad i made a decision to come to this place. I can vouch for authentic indian taste. It's very reasonable priced and the extremely attentive and customer oriented staff. I love the ambience and the hospitality and strongly recommend you try this place."
    },
    {
        "id": 57,
        "text": "We arrived there almost at the closing hours, but they let us dine with smile and the food was awesome. We were out of bread, but they made fresh ones and served us. All foods were good and the sweets especially Coconut barfi and Jamun were extremely good. The seating was clean and nice and the price was reasonable, we definetly recommend this place and would visit again in future!!!"
    },
    {
        "id": 58,
        "text": "Great food and service. Came around serving fresh pizza to our table. Hot but plenty of water ready to cool you down. Will certainly eat here again"
    },
    {
        "id": 59,
        "text": "Most amazing Indian food ever especially when you're looking for your grandmas homemade food straight from Punjab. Took my parents here who are extremely picky about Indian food / prefer their own homemade food and they couldn't rave enough! The owner / staff are also super friendly and hospitable. Vegetarian, vegan and kosher friendly!"
    },
    {
        "id": 60,
        "text": "Great spot for lunch or dinner! I love walking out of the bustle of 12th & Walnut into the warm, calm atmosphere of Samosa Vegetarian. The food is self-serve, go at your own pace. I have brought co-workers, friends, family. Everybody is impressed. The food is tasty, with vegetarian and vegan options. Go for the fried ochre, samosa, and saag paneer over rice. There are cute instructional videos playing in the background that teach you how to cook Indian food. Love what this place is doing. Great addition to the neighborhood."
    },
    {
        "id": 61,
        "text": "Upon entering this restaurant, my father and I received an Indian greeting \"Namaste,\" from the owner. This is how you invite an \"athidi\" to your home. I Do not remember the last time an Indian owner greeted us in that manner. Then we saw the beautiful Buddha idol symbolizing the \"satwik\" food we will soon appreciate.\nThere was melodious instrumentals in the background along with television screens.\nThat introduction itself speaks a lot about this place.....wide variety of dishes and with vegan labels.\nEverything tasted like it was homemade.\nI only posted a few photos....there was a lot more there.\nCome and check out the ambience and appreciate the food offered here."
    },
    {
        "id": 62,
        "text": "Upon entering this restaurant, my father and I received an Indian greeting \"Namaste,\" from the owner. This is how you invite an \"athidi\" to your home. I Do not remember the last time an Indian owner greeted us in that manner. Then we saw the beautiful Buddha idol symbolizing the \"satwik\" food we will soon appreciate.\nThere was melodious instrumentals in the background along with television screens.\nThat introduction itself speaks a lot about this place.....wide variety of dishes and with vegan labels.\nEverything tasted like it was homemade.\nI only posted a few photos....there was a lot more there.\nCome and check out the ambience and appreciate the food offered here."
    },
    {
        "id": 63,
        "text": "Everything is delicious!  Very relaxing environment. The management is extremely friendly. I highly recommend it!"
    },
    {
        "id": 64,
        "text": "Yes yes yes this place is fantastic the food is great the people are super nice it's incredibly affordable it's in a great location and there's literally nothing bad I can say about this place. Go here you will not regret it"
    },
    {
        "id": 65,
        "text": "Samosa is the best local restaurant! The staff and owner are so sweet, and the food was absolutely delicious! Reminded me of home cooked food! Very authentic!"
    },
    {
        "id": 66,
        "text": "They deserve all the stars for having a variety of tasty vegan options, including vegan chai, and a great selection of your Indian food staples (e.g., saag, chana masala, veggie samosas, etc.).\n\nI loved the ambience as well. Very friendly and the music gave it a light hearted, warm vibe. Family friendly and also good for the solo traveler.\n\nDid I mention it was affordable? Will definitely be back."
    },
    {
        "id": 67,
        "text": "The distinguishing factor here is that there is love in the food! I recently revisited Samosa Vegetarian with my adult nephew who I have been teaching about foods from other cultures. My nephew was amazed at the difference in the taste of various dishes he was already familiar with from other Indian restaurants we frequented together. Here each dish had its own distinct flavor. Each dish complimented without over powering the other. Each dish was extraordinarily fresh. My mouth is watering as I remember just how delicious this food is. I hope I won't arrive too late to enjoy their food today."
    },
    {
        "id": 68,
        "text": "Oh this place is just lovely - first off, an Indian buffet at dinner time?! This is worth 5 stars right here! Food was tasty and fresh, the naan was vegan which is impressive in its own right, and the owners are super friendly and welcoming. I think it was like $12 for dinner per person, and WELL worth it. We'll be back often!"
    },
    {
        "id": 69,
        "text": "I adore this place. The food is, quite literally, warming to the soul. The owner is also lovely, checking in with every customer. His passion for cooking can be tasted in every dish. The buffet is always full of fresh, homemade dishes, all vegetarian. I have tried many new dishes here and never been disappointed. I cannot recommend this restaurant enough. \n\nPictured here is the Chana masala, saag paneer, and mattar paneer with rice and naan which were all delicious. The soy chai is amazing as well."
    },
    {
        "id": 70,
        "text": "Oooooo, so glad I stopped in! \n\nWhen it comes to Indian buffets, I am fiercely loyal to Sitar in West Philly. But today, when a serious craving for Indian came over me, coupled with a total unwillingness to walk further than 5 blocks, what did I do? 'Indian food near me' into Google. Then Yelp. Then Samosa. \n\nYou walk in the door, seat yourself, and head right to the buffet. Everything is vegetarian, but heads up fellow meat-eaters: it's all still delicious. You can tell the owner, Ravi, puts a lot of pride into preparing his dishes. And spices! Thank god for Indian food that is actually spicy! The curries had me sniffling halfway through the plate. The options were aromatic, freshly prepared, and full of flavor. \n\nThe lunch special is $7.95 for the full buffet - soup, curries, rice, naan, samosas, pakora, salad bar, and a full spread of dessert and drink - which is unbeatable. Looks like they only service the lunch crowd (for now, anyway) so be sure not to make dinner plans here. They close at 3PM.\n\nCan't recommend this spot enough."
    },
    {
        "id": 71,
        "text": "Wonderful food, warm casual ambiance, friendly staff. The buffet includes a much wider variety of options than I usually see. My favorites include the saag, chili paneer, chana masala, and lentils. The food was also more flavorful with some nice spicier options than what I am used to from a buffet (compared to the more expensive menu options that some places offer). The chai is also great."
    },
    {
        "id": 72,
        "text": "This lunch buffet was an amazing value for only $7.95. Right now, it's only open for a couple of hours a day, but they have a lot of options (i.e., 2-3 types of drinks, 5+ different curries, salad, 2-3 desserts, soup, curry pizza, etc.) - more than I've seen at most Indian buffets more expensive than this price. The only difference is that - of course - this buffet is entirely vegetarian and meatless: justifying a lower price, but promising a healthy, filling, and delicious meal. The restaurant space is on the smaller side, but I'd definitely recommend hitting this spot before it becomes busy consistently! The owner was super nice and I love that this place is family-owned. I also heard that if the place gets poppin' enough, the restaurant will consider opening for a dinner buffet. ;D I hope you do give it a try, and bring your friends!"
    },
    {
        "id": 73,
        "text": "Wonderful food, everything was great. Owner was super friendly too. Coming back asap."
    },
    {
        "id": 74,
        "text": "Such a nice spot with so many delicious vegetarian food options... the food is so fresh and warm.. I love their Saag Paneer the most.. it has got a nice kick to it.. uplifts your mood instantly"
    },
    {
        "id": 75,
        "text": "Tasty food, and awesome management. Definitely recommend for anybody looking for all veg and/or vegan options!"
    },
    {
        "id": 76,
        "text": "This place has delicious, authentic Indian food. It's a bit on the spicier side but if you can tolerate a little heat I highly recommend it. The owner Ravi is very sweet, he is very attentive and his food is phenominal. You also can't beat the price... $7.49 all you cab eat buffet. That's unheard of in the city."
    }
]