[
    {
        "id": 1,
        "text": "When I used to live in Philly and did not have a lot of money I went to this Indian restaurant, its cheap and you get a lot of food. While the quantity is great, it lacks quality, there are much better Indian restaurants in Philly this is not one of them. You get what you pay for, there used to be 2 other buffet Indian restaurants near this one."
    },
    {
        "id": 2,
        "text": "Drexel/Penn student joint. Good for a quick swing in for take-out or a buffet plate. Nothing to write home about. Reasonable prices and quality."
    },
    {
        "id": 3,
        "text": "I did have a bad review for this restaurant, but now that the manager has made contact with me and cleared up the issue, I decided to change my review. Not only is the food amazing, but the service is extremely friendly and cares about your food. Five stars from me."
    },
    {
        "id": 4,
        "text": "Ordered from grubhub waited an hour and a half for delivery so I called naturally no one picked up for another 20 minutes then when the guy answers his explanation was that they were on break and hadn't made my order yet and gave me the \" oh well\" attitude and didn't offer any kind of compensation."
    },
    {
        "id": 5,
        "text": "Went there for first time and had a buffet which for price is not bad considering the quantity of items served but quality wise it's not good at all in my opinion. I tried everything but really didn't like anything and specially I was eager to try the deserts kheer and gulab jamun and they were most terrible. I'm giving three starts because the manager was attentive and was doing his job very nice nicely. The restaurant is under renovation they are making it more appealing but in my opinion food quality and taste must be improved. Sorry for the bitter truth but writing this review in only hope that they improve. Good Luck!"
    },
    {
        "id": 6,
        "text": "Over the summer I ordered from here without incident. Then comes fall and a particularly cold evening.\n\nWe placed our order or tried at first. My friend repeated the order three times.  The repeated her card number 2 times.  Then became tired of repeating my address.  I gave them my address the 4th time.  We were told we'd get our Indian goodness in 30 - 45 minutes.  Not a problem.  We were fine with waiting.  We thought the repeating-ourselves-thing was pretty comical until...\n\nOver an hour later we had no Indian goodness.  We called the restaurant.  We let them know the time frame they gave us and that it was well past that time frame.  The person on the phone didn't seem to understand \"we've been waiting over an hour.  Can you tell us if the driver is near?\"  Several times.  This time the repetition wasn't comical.  Then came Irate Guy On Phone.  \"DO YOU WANT YOUR FOOD!? DO YOU WANT YOUR FOOD!? WHY DO I HAVE TO TELL YOU WHERE THE DRIVER IS!? WHY!?\"  My friend and I looked at each other as if to ask what just happened while Irate Guy On Phone kept screaming \"DO YOU WANT YOUR FOOD!?,\" Etc.  \n\nDriver finally showed up while this phone call was taking place.  My friend collected the food and paid the tab.  \n\nThe food, mediocre.  Before to night I was fine with waiting to get it on the latter end of the stated time.  Tonight, a little late because of a lovely nor'easter but the person who answered the phone left such a rotten taste in my mouth that next time I will get into my wheels and haul my butt to pick up from a much better restaurant with less abusive service.\n\nBad service made the mediocre food... meh.\nPortions or naan and poori: fail.  Yeeeeeaaahhh. No.\nWill I order take out or delivery again from this establishment? Nope.\n\nIn short, Tandoor India, you bite and not the way I like."
    },
    {
        "id": 7,
        "text": "Please do not go to this place. The food is just horrible. I thought of giving this place a second chance, and I was disappointed again.\nNot that Sitar and New Delhi are great, but they are much much better than Tandoor.\nPlease do not torture your taste buds by going to this place."
    },
    {
        "id": 8,
        "text": "The food is pretty low quality, it's almost always dead and the only reason we go there is for BYO'ing. \n\nDefinitely a place to steer clear of if you are looking for real Indian food."
    },
    {
        "id": 9,
        "text": "Came down to 40th Street to meet a good friend, and parked right in front of Tandoor India.  When he arrived, I asked where he wanted to go, and he pointed to the doorway right behind me.  Auspicious beginnings...\nFirst impression was of an old establishment somewhat in need of refurbishment, but with inviting scents of curry and coriander drawing us in.  I checked the buffet as we walked past to our table and saw an extensive collection of yellow, red, brown and rusty sauces, all looking fresh and inviting on a cold Sunday night.  The place was not crowded.  Settling in, I decided to take a look at the menu because I was not in the mood for a cascade of flavors and tastes, but wanted to relax with only a few.  We were given copies of the take out menu, which somewhat surprised me.  On the cover it said: \"We believe that the joy of eating lies in the art of fine cooking.\"\nI'll drink to that.\nWe ordered Tikka Masala (with Chicken), which came out in a fine pink sauce of tomato and ginger, and was quite good. The Baigan Bharta was tasty, but was chopped fine rather than with the chunky eggplant I expected.  They cheated a bit on the Garlic Naan by bringing us regular Naan painted with garlic butter.  It didn't work, as it was not integrated into the bread, but sat on the surface, and lacked the baked garlic pieces I love in true Garlic Naan.  A disappointing way to pay an extra buck. The Mango Lassi was pretty good,  but a little thin from using milk rather than yogurt.  A nice plate of rice came with the meal.  \nThis was a meal in which we were more engrossed in the conversation than attentive to our food.  The strong brotherhood carried the day, and the meal became background.  For the overall experience, I was quite satisfied.\nWe didn't solve any world problems, but agreed we would get together soon, and try again."
    },
    {
        "id": 10,
        "text": "Buffet is probably the best I've had in the area, and for only $7 one would really get their money's worth.  I love raita.  I could easily put it on anything, and thoroughly enjoy whatever I was eating, and they do raita the way it should be done here."
    },
    {
        "id": 11,
        "text": "Tandoor is good. The buffet is definitely worth 12 bucks. There's chai and desserts as well as a salad bar. I got 2 plates worth of food and was very satisfied. Seems like more of a take out or family style place but it's always quiet when I go. The service is alright but since I get the buffet it doesn't really matter. The waiter still came by the table very often. This will always be my go to for Indian food in Philadelphia."
    },
    {
        "id": 12,
        "text": "Delicious!!! Well priced. Friendly staff. My husband got the buffet and I got the chicken kabobs and garlic Naan. Naan was the best I've ever had. My husband tried goat meat on the buffet. Great curry."
    },
    {
        "id": 13,
        "text": "Had lunch here the other day.  Not bad, but I've had better. The Makhani Chicken was a little on the tough side.  Loved the Chana Masala, Saag Paneer, and the salad was crisp and fresh. The naan was ok, but they didn't have mango OR tamarind chutney. This was a major disappointment for me. Nevertheless, the Ghulab Jamun, Kheer and Chai tea were all okay."
    },
    {
        "id": 14,
        "text": "Great Indian place in West Philly. The buffet is very good, but the special orders, fresh from the kitchen, are the bomb ! Fresh and great tasting ! Awesome value and BYOB !"
    },
    {
        "id": 15,
        "text": "I come here every time when I am in university city. Food is good specially the chicken tika. Some of there other dishes or a bit on the greasy side. But overall is a good restaurant to take your family to for a nice dinner."
    },
    {
        "id": 16,
        "text": "The other reviews seem to say it all: the food just isn't that great.  Not to mention I came down with a terrible stomachache after eating here.  But, if you like your Indian food good and greasy - you're in the right place."
    },
    {
        "id": 17,
        "text": "My boyfriend and I really like this place and we prefer it over the other Indian restaurants we have tried in Philly.  It is reasonably priced and the portions are very filling with lots of protein in the meat dishes (we almost never finish both our curries).  Their naan is good but not the best that I've had.  I like their eggplant vegetarian curry although some people may not like that there is no texture to it becuase the eggplant is mushed up.  The chicken tikka masala and biryani are good but we prefer the lamb korma and the house special Makhani chicken.  The saag is also very delicious and the chili chicken is very good but it tastes more like a Chinese dish because the chicken is fried and there isnt really a curry sauce.\n\nTheir buffet is reliable, cheap and good as well but the atmosphere is a bit dingy so I prefer delivery.  They usually take about 30-40 minutes to the Domus on 34th and Chestnut."
    },
    {
        "id": 18,
        "text": "I waited to write this review as my first time being here was my first time having Indian food. I've eaten at several different places since so I feel I can give this place an accurate review. \n\nAs far as overall value goes, this is extremely affordable for the buffet and the options provided to you. The buffet can vary in options but generally has popular dishes most expect at an Indian place along with several vegetable and dessert options. \n\nThe customer service is very attentive and friendly and I often see that they have regulars that they are casual with and I think that's nice. \n\nI found out through a friend that they do serve lassi's (just ok tasting) and gulab jamun (included with buffet) but you have to request these which is a bit strange as they do not even offer a regular menu when ordering buffet. It kind of makes me wonder what else they offer via special request. \n\nRealistically I give this place 3.5 stars only because the food has been hit or miss when I come. Sometimes it's flavorful and excellent while other times there are several dishes lacking substance and flavor. I will continue to come here because the location is convenient and I like to have various options when eating ethnic food so I'm not restricted to a single dish I may not like. For the price, it's definitely worth mentioning or recommending to someone who's checking out places in University City."
    },
    {
        "id": 19,
        "text": "The server is attentive. The food is decent. However compare with the other choices nearby, their buffet has less option."
    },
    {
        "id": 20,
        "text": "Under new management, Tandoor has the best Indian food we have had in Philadelphia.\nThey reguiarly change their buffet offerings, are concerned about their ingredients, and offer wonderful flavors. Their vegetable soup is a particular favorite. They have done a great deal to improve the appearance of the restaurant (especially the bathrooms). We go there about once a week. My only reservation is their tandoor chicken. It is just OK. However, the rest of the food on the buffet is so good, the tandoor chicken can be easily ignored."
    },
    {
        "id": 21,
        "text": "The food was very tasty but spicy.  I'm not really a fan of Indian food so I'm not a great judge of this stuff but I think it was pretty good.  Very well done, but unbearably spicy.  The only items not spicy were the white rice, pita bread, and vegetable pakora.\n\nAside from the food, the people were very friendly.  And the lunch buffet was $8.99 which was fair.  My main complaint is the state of the restaurant. The interior is outdated and dark and the exterior is shady, but the atmosphere is comfortable."
    },
    {
        "id": 22,
        "text": "Absolutely horrible. I ordered grubhub for lunch today. I ordered chicken tikka masala and garlic/cheese naan. My order arrived not even 15 minutes later, (I work about a 15 min walk away). This really worried me because they have a menu where you can order your food and they have a lunch buffet. As soon as the driver called and said he has arrived I was not too happy because I was worried and assumed that my food was just scooped from the buffet. Well, I opened my food, COLD. COLD chicken, COLD naans. PISSED. being preggo and hungry and wanting a specific craving only to have it arrive cold and totally tasteless is such a let down. For 2 dinky naans and a 12oz container of food scooped from a buffet cost me $22. A freakin rip-off."
    },
    {
        "id": 23,
        "text": "We have always come to this small Indian buffet for almost 20 years. The food is fresh and delicious under the new chef and new management. The NAAN is wonderful! Don't be turned off by their shabby décor. It is as authentic as it gets. It is also very inexpensive. Love it!"
    },
    {
        "id": 24,
        "text": "I had a pretty disappointing lunch buffet here this past weekend. Their food was edible and okay at best. The various dishes were bland and a chore to eat. I had 2 plates and was still hungry, but nothing was notable (and dare I say bearable) enough for me to want to go back for a 3rd. As a self proclaimed glutton, that's saying something. I've definitely had better Indian food."
    },
    {
        "id": 25,
        "text": "Funniest thing...  I went here expecting a not-so-great meal... Why would I go somewhere expecting subpar food?  I don't really have an answer for that, just wanted to try it I guess.  And hey, I'm glad I did.  Everything there is clearly homemade, everything was really pretty damn solid.  \n\nThey had goat, which was the first time I had ever eaten goat.  And it was really tender and tastey.  \n\nDespite it being the last half hour of their lunch buffet everything was still pretty fresh.  \n\nI will say, I do still prefer New Delhi (which is right around the corner and the same damn price) but this place is a really solid alternative choice."
    },
    {
        "id": 26,
        "text": "Tandoor is one of the best Indian buffet restaurants. It's always consistent. Never too busy. Service is adequate. Since it's buffet you don't need much. The food is good and the husband/wife proprietor are very friendly. I eat here with some frequency and it's always worth while and no expensive. Easily recommended."
    },
    {
        "id": 27,
        "text": "Not the best buffet option in the area. Everything  is bland and tastes like it is reheated from frozen, samosas are especially mediocre.  Go around the corner to New Delhi or Sitar India."
    },
    {
        "id": 28,
        "text": "Tandoor is welcome newcomer to the neighborhood, with adequate portions, and reasonable prices.  I found that Tiffin and Ekta have raised their prices and lowered their portions.  \n\nI see people have given a lot of 3 star reviews, but then read and they chose the dinner buffet.  I get take-out and it's delicious, but if you choose a dinner buffet you should not be able to review it, or at least take that into account when doing so"
    },
    {
        "id": 29,
        "text": "Staff was uncourteous and refused to provide us service because we only wanted snacks and not a full meal. If it is a policy, please mention it on your menu. Walked a minute to New Delhi restaurant and had the most amazing veg platter ever."
    },
    {
        "id": 30,
        "text": "I had my food delivered to me, so I can't comment about the ambience or the atmosphere. However, the person who took my order over the phone was extraordinarily friendly and nice, and the food was absolutely terrific. I got the vegetable samosas, Chana masala, and some naan. Everything was well made and tasted wonderful. I highly recommend this place."
    },
    {
        "id": 31,
        "text": "So I use to go to this place back in 2005 with my family & haven't been there since, so I decided to go there with some friends. BAD DECISION! They quality of the food had went don't tremendously! We waited 20 minutes for some naan and the waiter got upset when we got new food because ours was cold. The place was NOT sanitary and the chicken had little pieces of rocks o_O Save your $$ and go to New Dali instead!   \nLast note: The tandoori chicken was raw, like still bleeding raw!!!"
    },
    {
        "id": 32,
        "text": "Ooops! I thought I reviewed this place when I first joined Yelp. \n\nLet me correct that over-sight now. \n\nThis is my favorite Indian buffet. Their food is always tasty the naan is not dry or overly greasy. The buffet items are always fresh & hot. I don't mind the lack of service really. Give me a pitcher of water and let me chow down & I'm good! The plate clearing is always pretty timely and the staff & owners are friendly. I love coming here when I want something cheap, quick, when in University City."
    },
    {
        "id": 33,
        "text": "Decent food for a great price with lots of vegetarian/vegan options at the buffet. They also have an awesome topping bar, which I enjoy."
    },
    {
        "id": 34,
        "text": "in our search of tasty indian food in west philly, we walked away disappointed.  the malai kofta balls were like clumpy cream of wheat. not so good.  \n\nit seemed to cater to the university student crowd with it's overemphasis on the buffet.  give me some love, not buckets of food.  \n\nok, enough knocking it.  the baigan bharta was decent. but we'll keep searching."
    },
    {
        "id": 35,
        "text": "I ate at Tandoor again yesterday and the food wasn't the only thing I ate; I had to eat my words from the previous review too. \n\nThe customer service this time was extraordinary! First, my wife and I went in with only about 15 minutes to go to closing time (on Xmas eve!), but the waiters were kind enough to request us to come in and have the buffet nevertheless. They kept the buffet open for a few minutes after closing time, allowing us to refill our plates. And once they closed the buffet, they brought dessert out specially for us right at our table. And throughout all of this, they were very friendly, courteous, and didn't make us feel hurried in the least. I've rarely experienced such a complete turnaround in customer service!\n\nThe food was also excellent: I've always liked their buffet's panner/chicken masalas and the palak paneer, but this time they also had a very delicious navratan korma (which thankfully wasn't sweet!). Their chicken biryani's quality was also up a few notches. The naans that they gave us were steaming hot, buttery and delicious. \n\nIt was by far the best experience I've had at Tandoor, and hope it stays this way in the future!"
    },
    {
        "id": 36,
        "text": "Last nite, I ordered take-out. The Appetizer 'samosa chaat' left me craving for more. The entrees 'chicken tikka masala' and 'lamb rogan josh' were prepared just the way I requested 'medium & mild spicy.' Chicken tikka masala had all white meat pieces and lamb rogan josh was succulent. However, the entrees had a home cooked taste to 'em.\n\nIt's a new restaurant so I will definitely try more selections from the menu."
    },
    {
        "id": 37,
        "text": "The Buffet was pretty mediocre. Chicken makhani had sugar in it. Goat curry and chicken curry was average. The dessert (gulab jamun) was good and masala tea on a cold night added a nice touch. The appetizer (Samosa and pakoras) were ok. We had to ask the staff to refill the empty dishes though. Maybe the restaurant was having an off night so I will try it again during daytime and order from the menu.\nI'm a New Yorker and have given up on finding a decent Indian restaurant in university city. My suggestion if you're craving Indian food, skip it!"
    },
    {
        "id": 38,
        "text": "the lunch buffet here is very solid. i was pleasantly surprised by the amount of vegetarian options! usually i find buffets are half meat half veg, but this was like 75% veg. i don't know if i just caught them on a veg heavy day, but i loved that. there was so much to try! all the food was super tasty. i'll definitely be back."
    },
    {
        "id": 39,
        "text": "Had dinner with my husband on 5/31/2015.  We've been regular diners since the restaurant opened.  \n\nThe food is always very satisfying.  My husband favors the Tandoori Chicken. I am partial to goat, the Gobi Gulistan and Spinach Paneer.  They serve fresh Naan to the table.  Chai tea is also available in the buffet.  The condiments are excellent: mint chutney, onion chutney, tamarind chutney, and raita.  Some Indian restaurants water down the chutneys, but this is not the case at the Tandoor India. We also like the Indian desserts.  Great value and delicious.  A great place to satisfy your desire for authentic Indian food.\n\nWe bring out-of-town guests here often.\n\nThe staff are friendly and attentive.  Great location."
    },
    {
        "id": 40,
        "text": "I love it here! The service is warm and welcoming; they're always by the door ready to greet you. I feel like I'm walking into one of my Auntie's houses and she's about to serve me a delicious dinner. I love the buffet at lunch and dinner, everything is delicious. It's like Indian comfort food for me."
    },
    {
        "id": 41,
        "text": "Having gone to India twice I can say that Tandoor India is on par with typical Indian cuisine.\n\nI am fiercely partial to the lunch time and dinner time buffet options.  The selections for the meat eater include goat and chicken.  I am particularly impressed with the meatless options that I had to choose from ever since becoming vegetarian.  Available during my visit were chick peas, hot spinach dishes, steamed cabbage, vegetables fritters all very very tasty.  \n\nThe staff is present attentive and well mannered but not intrusive and pushy.\nI like the traditional Indian music that plays from the PA system. \n\nThe current decor consists of framed currency from all over the world.\nIt's spacious enough that I have had several staff in-service meetings here but have also come here alone to feel as if I am transported to India for the length of my low lit flavorful meal and you can comfortably and not be rushed to leave.\n\nThis would be an ideal place to bring a date because the food is great and you will not feel crowded or overloaded with the modern day dining added amenities like a booming drowning television.  \n\n-BUFFET-\nWhen you arrive and are seated just know that you then have to get up, get a plate and serve yourself.  When you are done with your food leave your plate on your table, remove your eating utensils, and get up to get more food and your used plate will be removed by the staff.\n\nThe buffet is around $9.00 until 4:00pm and $11.00 after.\n\nShafi, the manager has always been good with me and aims to please his customers.  If this place ever renovates I hope it does not lose its attention to service that keeps so many people coming back for seconds."
    },
    {
        "id": 42,
        "text": "This buffet leaves a lot to be desired. I find that if you order off of the menu, you will have a much better experience."
    },
    {
        "id": 43,
        "text": "Tandoor India is the best Indian food in the city, hands down. Whenever I went to New Dehli, I felt like I was being shadowed by the Indian mafia. Besides that, their food was lackluster. Never been back. \n\nIf you're vegetarian or vegan, you absolutely have to get the Vegetable Shahi Kofta (they only serve it on weekends in the buffet) or get it from their menu. It's amazing. Everything else there is highly flavorful and the staff is super accommodating."
    },
    {
        "id": 44,
        "text": "Solid indian food, typical buffet. Sometimes the people who are taking-out, pick the big pieces of meat our of the curries, but that is not the restaurants fault. Nice place, since it was re-done inside. Good place to come for quick tasty food ."
    },
    {
        "id": 45,
        "text": "So I use to go to this place back in 2005 with my family & haven't been there since, so I decided to go there with some friends. BAD DECISION! They quality of the food had went don't tremendously! We waited 20 minutes for some naan and the waiter got upset when we got new food because ours was cold. The place was NOT sanitary and the chicken had little pieces of rocks o_O Save your $$ and go to New Dali instead!   \nLast note: The tandoori chicken was raw, like still bleeding raw!!!"
    },
    {
        "id": 46,
        "text": "I've had delivery from Tandoor India a few times.  Some of the vegetarian dishes I've tried are GREAT and definitely better than others I've had in Philly (including TIffin).  The meat dishes I've tried (chicken & lamb) have been disappointing, except the fish, which was tasty. The raita & veg samosa are not bad.\n\nI'd heartily recommend:\n- saag paneer\n- channa masala\n- malai kofta\n\n4 stars for the veg dishes but I'd avoid the meat dishes in general."
    },
    {
        "id": 47,
        "text": "I've been to this place a few times over the past two years. Not the best food in my opinion. They have a lunch and dinner buffet, but the options are slim compared to some of the other places around. Good thing is that its never very busy -- so finding an open table is fairly easy!"
    },
    {
        "id": 48,
        "text": "Yes, I'm a fan, though it's a bit hit-or-miss depending on the dish. The dosas and vadas are awesome and a great value, but the idli left and the buffet me disappointed. Still, it's great to have some South Indian veg stuff in Philly, which has had a lack of really good Indian restaurants since Ravi got sick and Samosa Vegetarian closed some years back."
    },
    {
        "id": 49,
        "text": "We had catered from Tandoor for a club event, and were incredibly happy with not only the food but also the awesome service! Brian, the owner, brought our food to our location himself and helped us rearrange our tables several times! He made sure to constantly check that everything was ok, and whether Tandoor could do anything else. I really think they went the extra mile! Tandoor offered the best price by far! We have already placed our next big order with Tandoor, and look forward to catering from them for many more events to come!"
    },
    {
        "id": 50,
        "text": "The minimum for delivery is $15 here, but the guy on the phone insists it's $20. He just called me back and continues to insist on a $20 minimum. As a courtesy, they should've let me slide, as my order was $16.14. Screw these folks! I'm hungry and angry."
    },
    {
        "id": 51,
        "text": "I've been tandoor a few times for lunch  with my family. The staff is always very friendly, and playful with my 3 year old son. My son says it's his favorite restaurant (even though he only drinks the mango lassi). Also, the food is stellar, and I enjoy that the bring out fresh naan bread to the table. Keep up the good work!"
    },
    {
        "id": 52,
        "text": "I would ideally give Tandoor a 2.5 rating, but since that's not an option, I'll go with a 3. Summary: It has slightly above average food, decent ambience, but below average staff.\n\nLonger version: Tandoor is one of the few Indian restaurants close to where I live and I've gone there many times. My principal reason for going to Tandoor is that it offers a reasonably priced dinner buffet and definitely has better food than the New Delhi restaurant next door: for about $10 it's all you can eat, which I think is a pretty good deal. They have a wide variety of foods to choose from, and most of them taste about adequate, but their gulab jamuns in particular are delectable. It's also usually clean, and not noisy, so it's a decent option if you just want to spend an evening conversing with friends.\n\nHowever, set against their above-average food and ambience is their dour, almost-hostile staff. They were never particularly welcoming or courteous, but on my last visit, they were actually rude. Besides, they don't bring out food on time either. Now, I expect this behavior from an inexpensive place like the nearby Dana Mandi (which by the way has the best Indian food in this area), but not from Tandoor. \n\nI see from other reviews that take-out is perhaps a better option; maybe the food tastes better and you won't have to deal with the staff. But for dining in, I wouldn't really recommend the place. And the sad part is that Tandoor can so easily fix their problem: all they need to do is to give their waiters some basic lessons in courtesy."
    },
    {
        "id": 53,
        "text": "The food is delicious. It's not fancy, it just tastes really good and isn't very expensive, either. The curry goat is delicious and has actually big pieces of goat (not lamb, goat). The food actually seems closer to Indo-Caribbean cuisine than traditional Indian... but what do I know about Indian food? Nothing, really. Except that I love it and I love it when they make it."
    },
    {
        "id": 54,
        "text": "Tandoor India has a great Indian buffet with all the essentials at a great price. They're constantly bringing out fresh trays -- granted, they sort of have to, with the popularity of the buffet -- so you never have to worry about getting old, cold, or dried out dishes.  \n\nMy favorite dish is the saag paneer. I could just keep loading my plate up with the stuff for hours, honestly. But the naan -- I love exploring the great breads of the world -- the naan is deliciously oily, and it you can pile whatever you want on top; it won't get too soggy. \n\nAt dinner, I believe the buffet is $9.95, and it includes a choice of desserts and coffee."
    },
    {
        "id": 55,
        "text": "I don't usually post reviews but I just wanted to say this place was absolutely amazing. We first ordered off of grubhub and the food was not as good as we expected. However, the Brian took care of the entire situation and made us go from never eating there again, to our future go to spot. He was very caring, professional, and handled a bad situation with absolute professionalism. It was everything you wanted to see out of an owner/manager. The food was absolutely amazing and so was the service. We really felt like royalty dining in there. I recommend everyone and anyone to try this place out!"
    },
    {
        "id": 56,
        "text": "Great improvement in customer service since last time! The buffet is great. The tandoori chicken at tandoor is the closest to the one back home in India. Chicken tikka was amazing. Will definitely visit again :) Thanks Brian!"
    },
    {
        "id": 57,
        "text": "Tonight I had dinner buffet at tandoor food is excellent chutney chicken , butter chicken and veg gobhi mussalim I never had my life .food is to delicious  I will back next time"
    },
    {
        "id": 58,
        "text": "Tandoor restaurant is one of my favorite indian restaurant! I love the food specially the chicken tika masala and fresh naan that is served on the buffet. Also i always eat kosher and halal which all of there food is which is a huge plus point for me. The wait staff is amazing! This is a go to lunch everyday place for me from now on. They also give 10% student discount too...it cant get any better..:)"
    },
    {
        "id": 59,
        "text": "A good place for Indian food. The place is small and the ambience is moderate. They have many choices and varieties. The place is moderately priced, the food taste good. I would recommend this place for lunch. The service is mediocre."
    },
    {
        "id": 60,
        "text": "This place was a decent Indian buffet, having a pretty good choice of foods. I decided to try this out with some friends on a Tuesday when sitar (our fave Indian buffet in Ucity). Their chutneys were not as flavorful as others I have tried, but i definitely was able to still enjoy my meal. I had their paneer tikka masala which was pretty good. Their butter chicken was very very sweet. Would recommend this place over New Delhi for sure."
    },
    {
        "id": 61,
        "text": "I had one of those days where you have an emergency need for Indian food - you know, one of those days. I needed to bring it to an event at a certain time, but the first two places I called couldn't accommodate me. New Delhi (4004 Chestnut Street, Philadelphia), in fact, was particularly difficult to deal with. They were absolutely unwilling to help me get the food even while I tried to be flexible. Tandoor India came to save the day! PICK TANDOOR INDIA OVER NEW DELHI! They were helpful, courteous, nice, eager to help, quick, friendly, all around a life-saver. I said, \"can you do this for me within 30 minutes?\" and they said \"absolutely\" and it happened! And the food was great also. I'm not a great judge of Indian food because I haven't had a lot of Indian food, but I really enjoyed it."
    },
    {
        "id": 62,
        "text": "Came here on a Thursday night around 8 pm. When I was walking towards the restaurant I see a worker (probably the manager) looking out the door, hoping to get some customers. Walking in, there were only 2 other occupied tables who were just about to be done (although to be fare, it might've been empty due to it being summer and their huge customer base left campus). The style of the resturant is nothing to rave about. The lighting was dimmed significantly. The buffet was in the middle of the restaurant, which felt kind of like a long hallway. \n\nMeat options are pretty standard for an Indian buffet, with choices of goat curry, chicken misala, chicken curry, and tandoori chicken. None of those left me with an impression that I had to get more. On top of that, the rice was a bit hard (either they undercooked their rice or used old rice cuz they didn't have a lot of customers recently).  The only side I went up to get again was the naan. Lastly, the chai tea tastes really watered down. If you want a better Indian buffet experience and a good chai tea at it, then I would recommend heading to Sitar which is just a few streets down from Tandoor."
    },
    {
        "id": 63,
        "text": "We went to Tandoor India in University City for dinner on Saturday, so glad we did. We've eaten at New Dehli and Sitar, before, but were never impressed.  The new owners are extremely friendly and shared that they have been retooling the Tandoor India brand.  Apparently, Tandoor has been there for more than 25 years, so it was in need of updating, which they are doing.  So far, the bathrooms are done and if they are any indication of what is to come in the dining room, it will be a beautiful restaurant when they are done.    \n\nMore importantly, about the food.  I usually order chicken korma at Indian, but they suggested lamb korma, it was fantastic.  They assured me that all of their meat is Halal and fresh.  After eating the lamb I'm certain it was fresh.  I've never had anything like this dish, the lamb was tender in a rich cashew based sauce, but it didn't taste like it was full of heavy cream, it was rich with spices, not cream.  Truly a wonderful indulgence.  The owner also recommended a pumpkin masala dish.  I had read great reviews about it before going, so we quickly agreed, glad we did. The dish healthy (by Indian restaurant standards) since there is no cream and minimal oil, but it has wonderful spices.  I highly recommend it!  \n\nThe owner said they brought on a new chef who is highly trained in both North Indian and South Indian dishes.  The chef will be putting one South Indian dish on their buffet every day (we didn't have the buffet, but next time we will).  I'm looking forward to trying South Indian flavors since all the other restaurants I know of cook Northern Indian.\n\nGood luck to the new owners, they are doing great things."
    },
    {
        "id": 64,
        "text": "I have been to Tandoor India countless times over the last 10 years.\n\nThe food is not the fanciest, but it is plentiful, tasty, and, best of all, the price is right.  We always get the buffet so we have a little of all the flavors.  I have always found the foods to taste fresh and homecooked (although I did not grow up on Indian food, so it may differ from your grandmother's recipe).\n\nThe decor has been the same for at least the decade that I have been going there.  It looks like a hole-in-the-wall type place, but the owners are present and very friendly.\n\nTo be fair, I have been to better, fancier Indian restaurants, so if you are looking for the high class, gourmet, impress-your-date experience, this may not be it.  But if you are looking for satisfying, tasty food at a great price this is a great choice."
    },
    {
        "id": 65,
        "text": "Out of all the three Indian eateries in University City, I would rank Tandoor as #3. The food was OK (could use more variety), but it was just the atmosphere that did not quite sell to me."
    },
    {
        "id": 66,
        "text": "I keep coming back to this place, and am always happy. Their take-out portions are very very generous, and a great value. I almost always end up ordering the Navratan Korma, which they make very spicy on request. It has all the vegetables I crave, and even sometimes comes with paneer cheese, which is a nice surprise. The raita sauce cools down the heat and balances the flavors. The take-out portion makes two good meals for me.\n\nThe buffet is good too when I'm in the mood for something quick, although I usually prefer to have leftovers. Although I found I prefer the chicken dishes on the buffet at Sitar, Tandoor's samosas and desserts are much better. I would say for the buffet I would switch between Sitar and Tandoor. I enjoyed my meal at New Dehli as well, but in the end I always end up back at Tandoor."
    },
    {
        "id": 67,
        "text": "This is my Indian/Pakistani restaurant. I love this place. Just got back from an Express Lunch where they treated me to a wonderful chicken kardhi, fluffy rice and perfect naan. There are two more Indian restaurants in the area and I've been to both. After I tried Tandoor India I can no longer visit those places. Sorry, but I found my Indian/Pakistani niche."
    },
    {
        "id": 68,
        "text": "Food was great as it was my first time eating at an Indian Restaurant. My friend and I went during lunch hour where there was a buffet. The buffet had many options that tasted great. It was indeed a refreshing experience. However, one small qualm is the change in price. We arrived during lunch hour which the waiter explained. Now we did leave after lunch hour was over and was charged the dinner hour's price. I don't know if there was some discrepancy since you'd think my friend and I should've paid the lunch hour's price. We should've paid first. They need to have the hours of lunch and dinner printed to see so there isn't a feeling of perceived unfairness. Would go back for the food on one condition that I am sure to pay the appropriate price during the appropriate hour."
    },
    {
        "id": 69,
        "text": "We went here on a Monday night as New Delhi was closed.  We would have been better off picking another cuisine instead of substituting with Tandoor India.  The staff were so dour that they would have been better suited for working for a funeral home than a restaurant.  All the food was mediocre at best and the selection on the buffet was very small compared to ND.  We finished our pitcher of water and were not provided a refill.  The rice in the rice pudding was overcooked.... and I got very bloated after eating here - a reaction I have never had in the past to eating anything.  My fiance had the same outcome."
    },
    {
        "id": 70,
        "text": "I really enjoyed this place! I went for a lunch buffet and had a positive experience. The service here is great - the servers were very attentive and the manager was very friendly. He even helped to point out which specific dishes would be safe for my food allergies, and he offered me a free sample of their mango lassi. The ambiance was cozy and the food was delicious. I loved the complimentary chai tea at the buffet! I decided to try this place out instead of opting for any other place in University City where I would have spent the same amount of money, if not more, for less food and mediocre service/ambiance. I look forward to coming back to this place soon!"
    },
    {
        "id": 71,
        "text": "Do not get catering from Tandoor with its new management. \n\nWe ordered chai tea and samosas and they brought our chai tea in a plastic gallon milk bottle (one bottle was $50, ridiculous). The tea itself is now awful too, completely bland.  We even saw traces of dried milk on the bottles, made us wonder if they even cleaned them. Also those bottles have very soft plastics that nearly melted with the hot chai. Previously, they brought a proper plastic container and for $50 we could serve 45+ people with no problem and it tasted great.  \n\nThe samosas are now also more expensive, we only got 33 with $50.  \n\nI haven't been to the buffet since the new management, so this review is strictly for their catering practices."
    },
    {
        "id": 72,
        "text": "Tandoor did not live up to expectations.  The food was bland and oily.  I highly question the palettes of people that are giving this place anything higher than 2 stars.\n\nMy roommate and I had take out from this place a little while ago.  We both agreed that the food was mediocre at best.  The next day, we were both sick from it.\n\nThey did throw in free desert, which was nice.  Perhaps they do this to win over customers who otherwise would not be satisfied.\n\nI'm never going back again."
    },
    {
        "id": 73,
        "text": "It's been all amazing.. My food was beyond great, everything was done to perfection. I have had my fair share of Indian in the last few months.wonderful atmosphere with attentive and personal staff!! Food is delectable"
    },
    {
        "id": 74,
        "text": "This place needs a lot of attention!! The man at front desk needs to learn how to treat customers! Upon my visit, I checked the buffet and while I was at door to call my other friends the front desk guy asked us to go and check the food in New Delhi restaurant next door!! I was surprised as hell we often dine in there and love the food but this guy made the night , A nightmare! Very disappointed and couldn't understand why was he referring us to the other restaurant?!!"
    },
    {
        "id": 75,
        "text": "I came for their Sunday buffet for the first time for brunch.  Brian, the owner was so gracious and attentive to our large group!  We were a party of 8 with a few vegans included.  Brian and the rest of the employees at Tandoor went out of their way to provide more vegan options for our group.  The food is absolutely delicious!!  I really had to resist the urge to make my 3rd trip up to the buffet.  We will be back again and again!"
    },
    {
        "id": 76,
        "text": "Not authentic Indian cuisine -- it tasted like the Indian version of a kraft dinner.  No music, a place for lonely people to eat lunch alone, plastic chicken, and microwaved naan.  Make sure you don't need to use the bathroom while you are there.  It is disgusting!  Redeeming qualities are decent dessert and cheap?"
    },
    {
        "id": 77,
        "text": "Food was very pathetic. NO taste and chicken was literally hard like rubber. Non cooperative staff. Seriously, if you are looking for Indian food, please do not waste your money and time going here. Highly disappointed. ZERO STAR."
    },
    {
        "id": 78,
        "text": "The samosa tasted so good! It's a must try here! Btw, the buffet price is not expensive which in sensible price. Try it!"
    },
    {
        "id": 79,
        "text": "The buffet is meh.  The selection is reasonable but the food is not exciting.  Given that the buffet is all you can eat, however, you will not leave hungry."
    },
    {
        "id": 80,
        "text": "Though I've still enjoyed some of the vegetarian dishes here, the quality has declined somewhat. (I never found the meat dishes good here before, so that hasn't changed.) Meanwhile, catering prices have gone up.\n\n1. Saag paneer had much less cheese, was greasier & not as flavourful. Cheese cubes hadn't softened & absorbed flavour.\n\n2. Aloo gobi (cauliflower & potato) seemed undercooked such that the flavours hadn't developed. The cauliflower was too raw & hadn't softened up sufficiently to absorb the flavours. The veggies either need to be cooked longer or cut into smaller pieces so they cook faster.\n\n3. Navratan Korma had a similar problem: vegetables are undercooked & lacking in flavour.\n\n4. Veg kofta was still tasty, but also a little undercooked (in the middle).\n\n5. Baigan bharta seemed greasier and not as tasty as before."
    },
    {
        "id": 81,
        "text": "I have a long standing preference for this restaurant! I have known the owner since he was a waiter in another restaurant on 2nd and Chestnut. The buffet always has several dishes that I want to eat and the desserts are always delightful. I enjoy the take out as well, if I am feeling virtuous I can turn them into 2 meals, but sometimes they are so tasty I eat the whole thing!"
    },
    {
        "id": 82,
        "text": "MM MM I'm a faithful patron. Great food, awesome price, very convienient! The bathroom could use sprucing up but the owner's wife  standing to greet & bid us farewell was a homey remedy of kindness to make up for it. I loved it and plan to visit again soon. :)"
    },
    {
        "id": 83,
        "text": "The service here was nice. The food was freshly prepared and refilled promptly. The workers were very nice to us. I would definetly come here again in the future!"
    },
    {
        "id": 84,
        "text": "Out of the 3 indian buffets in the Area (New Dehli, Sitar & Tandoor), I must say Tandoor is my personal fave. The food  is the most fresh, and the staff is super friendly. Plus they remodeled the place which was a plus. I wish they had bigger dessert options on the buffet but overall I'm definitely going there again."
    },
    {
        "id": 85,
        "text": "I love this Indian restaurant!  Their buffet is really good for a very good price: the curries, the side dishes and the tea is what I go for in this restaurant.  The service  is good too, and the people who work there are very friendly.  I would definitely recommend anyone in Philly to try this place at least once."
    },
    {
        "id": 86,
        "text": "Quality of the buffet food has seemed to decline a bit (kinda lacking in flavor in some foods). This appears to be an epidemic Philly but I'm still a loyal customer."
    },
    {
        "id": 87,
        "text": "Lunch takes four hours here -- 30 minutes to eat, three hours and 30 minutes to recover from the food coma. But, if you are looking for a classic American Indian lunch buffet near Penn, this is the place to go. While not inspired, the food is tasty and plentiful. I will be back."
    },
    {
        "id": 88,
        "text": "Dinner buffet was a huge let-down. The restaurant was shabby looking and completely empty, which should've been a sign to turn right back around. Food was clearly out all day and not flavored well. Naan was hard and cold. Appetizers and deserts were ok, but still not hot or delicious. Definitely won't be returning."
    },
    {
        "id": 89,
        "text": "Don't order from this place. I JUST got my delivery and it was close to horrible. But there are some good things that I can note. The food was ok and the packaging was great. I bought the traditional curry chicken and garlic naan (both were ok). But I ordered a masala chai and a mango lassi which was about 5 dollars, not much. When the guy came, I thought the bag was a little empty but I didn't know how big the dish was, so I said nothing, and I didn't look in the bag until I got to the kitchen. My order totalled 22 dollars and I have the man a 5 dollar tip. When he left and I got to my kitchen, both drinks were missing. I called the man again to ask if he had forgotten the drinks, and he said \"no the restaurant didn't have them.\" If they didn't have them why did he take all MY MONEY without question. I'm pissed. Ughhhh. Anyway, if you're going to eat from here, go inside, it's better."
    },
    {
        "id": 90,
        "text": "The buffet options taste pretty good and the price is right ($8 lunch, $12 dinner), but the food is *very* oily.  I've eaten here three times, and all three times I've ended up with a grease-induced stomachache. Given the choice, I'll take New Dehli every time."
    },
    {
        "id": 91,
        "text": "As Indian restaurants go, this is the bottom of the list for me. I try to give every India restaurant a chance, and when I heard this place had a buffet for DINNER, that clinched it. Unfortunately, everything I had lacked the taste I've come to expect. The chicken Makni tasted like it was made with spaghetti sauce, the shrimp masala was very fishy, and the naan bread looked and tasted like it had been on the steam table all night. For Indian in Philadelphia, the best so far is the Indian Restaurant, you'll see it under my other reviews. I should have known what I was in for in terms of service when the person who showed me to my table left the pitcher of water behind. No offer for anything else, I was on my own."
    },
    {
        "id": 92,
        "text": "So this was by no means the best indian food I have ever had, probably was not even in the to 50% BUT they have a cheap all you can eat dinner buffet (even cheaper if your a student), and it has samosas!\n\nI showed up right at the end of the dinner rush, so most of the food had just turned over, and was fresh, and the service was fine.\n\nI would skip the sambar though, it was just not good, but everything else I tried was."
    },
    {
        "id": 93,
        "text": "I've been there several times. I think the place has gone downhill a lot. The buffet is okay. None of the items is exceptional, but you can take a much as you want for a reasonable price. I find the food a bit blend though, and often to cold. The a la carte items are wat overpriced in my opinion.\nThe first time I came here, the restaurant still had the old interior. It gave the place a warmer atmosphere. Many people visited the place. One day, the owner decides to upgrade his interior to something with blue and white light. These colors probably work well in India, but in the West these are considered cold colors. It makes the place look like a butcher. Ever since, I have rarely seen more than two occupied tables here. My recommendation to the owner would therefore be that he restores the old interior."
    },
    {
        "id": 94,
        "text": "For a $9 buffet lunch, Tandoor is pretty good.  I really like palak and it was pretty decent here.  Their samosas weren't bad either.  Fellow diner enjoyed the chicken.  She had been a frequent customer a number of years ago and everybody working remembered her and was extremely friendly.  \n\nThe actual restaurant and buffet display leaves a lot to be desired.   I felt a little gnarly all day after eating here.  BUT, for a once a year cheap indian buffet lunch, I'd go back for the annual visit."
    },
    {
        "id": 95,
        "text": "The atmosphere is very nice and very family oriented/ accommodating. Once we parked the aroma of the food was the first thing that got our attention.  Then friendly staff and wonderful food makes this place a go to spot for me and my significant other for a long time coming."
    },
    {
        "id": 96,
        "text": "I've eaten here many times over the years and have never been disappointed.  It is not the best buffet around, but it's still quite delicous.  I'm amazed at how negative most of the reviews are.  Perhaps I should make another visit...since it's been awhile.  I just hope that the quality hasn't gone down since my last visit, because I really liked this place."
    },
    {
        "id": 97,
        "text": "if you like a quiet atmosphere and hospitable service, then you should check this place out. The manager and staff are polite and professional. Also sometimes buffets can have a somewhat raunchy feel to them, but that isn't the case with this place. The food is above average, and after eating you don't feel like you compromised on nutrition for the sake of taste. I enjoyed Chef Laddi's special of the day."
    },
    {
        "id": 98,
        "text": "Went for lunch and found it very well priced and filling. The buffet is well worth the money and you don't get the sense that the waiters are trying to shoo you out of the buffet. Sometimes that's what I felt like in New Delhi and Sitar which are very similar restaurants in the area."
    },
    {
        "id": 99,
        "text": "This place is great.  But, I have no idea if this is \"the real stuff\".  I just know, to me it's good.  The sauces are very flavorful and have the right amount of herbs and spices for me.  Some of the texture of the food is a bit off, but I have no idea if they are supposed to be mushy or chewy, because it's always been mushy or chewy wherever I had it, and people eat it, and they eat a lot of it, so it must be somewhat spot on.  And if it isn't, it's still good to me.  I must admit, their chicken Tika Masala, is fantastic. And their barbecued/grilled chicken is also really good.  We found this place during the Septa Strike.  I met my wife and we were walking home together and the place smelled really good so we went in.  We had to waddle back home.  There may be other places that are better in flavor, but it's a buffet that is like 11.00 a person.  You can't beat it.  I wish I could be more descriptive, but my knowledge on Indian cuisine is pretty poor.  I just know what I like.  happy eating!!"
    },
    {
        "id": 100,
        "text": "You can't go wrong with buffet style Indian food. They have a huge selection with items I had never even heard of-- try the chai tea and make sure to save room for the Gulab Jamun. The restaurant is calm and peaceful, and the staff is super friendly. Definitely will be back!"
    },
    {
        "id": 101,
        "text": "Visited just a few days after Ekta took over management.\n\nOrdered Chicken Tikka Masala and Paneer Palek. Both were amazingly spiced and fresh stews, served with a generous side of white rice. \n\nTikka Masala was zesty with a great underlying buttery sweetness. One of the best I've had. Paneer Palek was hearty and chuck full of flavorful spinach.\n\nDefinitely spicier than most Indian places in town, which may not be appealing to some people, but appreciated by true lovers of Indian cuisine. Can't wait to visit the buffet for some more variety of goodies soon!"
    },
    {
        "id": 102,
        "text": "My Friends and I stopped to have dinner after going ice-skating. When we walked in the place was quite empty for a saturday evening. There is a buffet for 11.95 which is pretty decent. I wished there were a littl more choice with the dessert and the salad bar. I took some chicken curry and chicken tikka massala. Overall the food tasted good but really didnt think it was the most amazing Indian food I have had. I wish they had some light music for the ambiance as the restaurant sounded very quiet and me and my friends felt like we were too loud in this atmosphere. The service overall was good."
    },
    {
        "id": 103,
        "text": "Relentlessly predictable with the dinner buffet the compelling reason to go, this friendly place is the default Indian restaurant on campus for Penn and Drexel students and faculty alike.  Outstanding Northern India and Moghli influenced specialties the quality and consistency of which hasn't varied an iota in the 20+ years that I have been a fan.  Up and across the street from the McDonald's at 40th & Walnut, whose Big Mac, Coke and fries cost not much less than Tandoor's wonderful and light years more healthy lunch.  Excellent place with each dish unique and given the quality of ingredients and preparation, one of the very best bargains in town.  Vindaloos are authentic, the nan addictive and the chicken issuing from the tandoor outstanding.  Bring beer or wine or drink their mango nectar."
    },
    {
        "id": 104,
        "text": "Honestly, the food tasted okay while I was eating it but afterwards my stomach felt a little uneasy. One of my friends who I ate with also said the same thing.\n\nThere really isn't anything specific to comment on-- I'd just say that Sitar and New Delhi are definitely the top two Indian buffets/restaurants in the area, and I'd definitely go to either of those over Tandoor. Pricing is around the same, and the dishes are also around the same in terms of variety. Taste is just better at Sitar and New Delhi.\n\nI will say that I enjoyed the pumpkin curry at Tandoor India, and that's something I haven't really seen at Sitar or New Delhi. \n\nBeware of dining here if your stomach is known to not react positively to Indian food. I'm Indian, and my stomach still reacted. Hm."
    },
    {
        "id": 105,
        "text": "Tandoor has a reasonably priced buffet, and although it's not always consistent we've had some delicious dishes here.  A couple of times we asked for black dal on the side because they didn't offer it in the buffet and they gave us the dish for free.  The proprietors and staff are courteous and quick, and the place is comfortable--you can tell it's family-operated.  For these reasons, we came to Tandoor regularly for over a year before switching our allegiance to New Delhi.  While we now prefer the latter, Tandoor is a reasonable neighborhood place run by good people who care about their restaurant and your experience.  One caveat about Tandoor is that we didn't have good luck with delivery--the one time we ordered our food delivered we decided the fare in the restaurant was exponentially better than what they deliver out."
    },
    {
        "id": 106,
        "text": "My club held a dinner here, and it was really great. The buffet is huge and has a decent number of options that is perfect for a large groups. It's great for large groups (they make it easy to split the bill) and BYO. \n\nThe service is what really made the experience worth it. The owner was really accommodating, and constantly made sure we had whatever we needed."
    },
    {
        "id": 107,
        "text": "this is definitely my go-to spot for indian food! the only problem i have with this place is, the deliciousness makes me want to overeat. i need to restrain myself from ordering from here every week. i'd be 1000 pounds if i could eat here everyday. it's that good...chicken in the tikka masala is soft, spices are perfect and the naan always comes warm, soft and delicious. yumm...so dang delicious! delivery is fast and the delivery guys are always friendly and so nice. AND they're never stingy with their servings!"
    },
    {
        "id": 108,
        "text": "I was so hung over and tired on Sunday, and the only thing that I wanted to eat was some Indian food.  After searching Yelp for a while, I decided to order from Lovash, but after entering my online order plus delivery charge to where I live, food for myself was over $40.  I tried a few other places and Tandoor was the only option that would deliver to my place.  (I really did not want to have to drive anywhere to pick it up, it was enough effort to get off the couch to answer the door).\n\nAfter placing my order, one hour and $29 later I was a happy camper. \nI do not have much Indian food experience, but I thought that the food (Chicken Korma and Saag Paneer) was pretty good.  The naan could have been better, it was very rubbery from being wrapped in foil for delivery."
    },
    {
        "id": 109,
        "text": "We had to have a catering event in two days and needed an Indian place really quick. Tandoor quickly responded to the phone call, stayed within the budget, and gave us amazing food. Brian the owner, even gave us utensils and plates for all the food, and kept the food heated till we picked it up. The event was a success and everyone loved the food! Highly recommend the place"
    },
    {
        "id": 110,
        "text": "I feel bad writing a poor review about this family-owned local restaurant... but... what I ate here was really less than average. \nThe food was mostly dried out and tasteless. I was hungry and had to pay for the meal no matter, so I did eat it. \nIf you're looking for a quality, tasty Indian meal, check out the one on 38th near Chilis OR the one at 40th and Chestnut- New Delhi. \nI will not make the same mistake twice."
    },
    {
        "id": 111,
        "text": "Very friendly service! Food is always good, and the inside of the restaurant is spacious and inviting"
    },
    {
        "id": 112,
        "text": "I gave food a three-star and service a four-star. The food and price was good. The only thing I didn't like was their vegetable soup."
    },
    {
        "id": 113,
        "text": "I often frequent Tandoor's sister restaurant in Fishtown and it is excellent! I am sad to say that this feeling didn't resonate at their establishment in University City. I encountered something that I wish to never encounter again- bland Indian food. I had the Chicken Tikka Masala- it was watery and lacking flavor. My friend had lamb saag- the highlight of her dish was the bland basmati rice. Needless to say, I do not plan on returning."
    },
    {
        "id": 114,
        "text": "They charge a good price for students' buffet -- right around $12. The staff is friendly and I certainly enjoy the taste of the food, but I'm probably going to avoid this place in the future because the last time I ate in there, 3 out of 5 people in my party were sick the next morning from the food, and then after that when I ate food that had been catered, I was the one who got sick (though not super sick -- I just felt like crap, but still). \n\nBut, I mean, if you're willing to risk eating bad food, like I said the staff is friendly and the decor is interesting. So, hung over Penn fratboys whose fathers donated a building to the school so you could drink yourselves stupid 5-7 days a week and go to Indian buffets right on the gentrification border of West Philly / U City, go for it!"
    },
    {
        "id": 115,
        "text": "My favorite of the Indian buffets on the block. Staff is super friendly and has always been before and after the change. \n\nI've always taken my friends and family here and it never disappoints. Food was delicious, both kinds of tea was a big draw for me, and most importantly it was actually spacious!"
    },
    {
        "id": 116,
        "text": "Food was OK. samosa, aalo tikki, chole, pakode, saag ki sabji, dal were gud. paneer disc didn't like much. Overall, decent food."
    },
    {
        "id": 117,
        "text": "OMG LOVE THIS PLACE!!! Some of the best Indian good in town!!! It is a must if you love Indian food or just flavorful food. I really love their buffets. It is my favorite buffet of any good genre. When I think of awesome Buffet this gets the blue ribbon. If you are a student in the area this place is a must (same for non-students)!!!!"
    },
    {
        "id": 118,
        "text": "So before I start my rant on Tandoor Indian I think you should know that I LOVE to cook. Sometimes I  wake up in the morning and the first thought that comes into my head is, \"what should I cook for dinner?\". My boyfriend, spoiled by homecooked meals every time he comes home from work, hardly ever gives me ideas as to what to cook so sometimes after a long day of work and grad school, I just feel like ordering....\n\nWhen days like this happen, I always seem to call on Tandoor Indian. They are like my superhero that saves me from a growling belly and an empty fridge. I have never been to the restaurant but from my experience of the food, the decor or interior of this place would have no effect on the rating- the food is just that good. \n\nI typically order the same dishes but sometimes try to be less predictable. Every time i order I find that they hook me up with a free order of some vegetable dish making my kitchen my own home Tandoor buffet. \n\nSeriously, I am getting hungry just writing this review.\n\nCheck this place... for really real people."
    },
    {
        "id": 119,
        "text": "I went here for the lunch buffet with my vegetarian co-worker. They had a pretty good selection of food--enough meat selections so that I didn't feel as though it was geared to vegetarians and enough veggie selections so that she didn't feel like her money was going to waste. \n\nI judge Indian food by the dish that I usually get, chicken tikka masala. It was ok; not horrible but not fantastic... \n\nThe price is good and the staff were friendly... I wouldn't mind going back again..."
    },
    {
        "id": 120,
        "text": "Not too impressed, but I think it's decent for Indian food if you have a craving. The place is clean, and the staff is friendly. I find it a expensive ($10.95 for the makhani chicken dish). The food is apparently more authentic and less \"creamy\" than the Americanized dishes. While I find this true, it's still pretty greasy. \n\nBut they had gulab jamun.. yum!"
    },
    {
        "id": 121,
        "text": "The good:  Very friendly service.  Well-stuffed samosas.  (I hate when all you get is crispy outside and no yummy peas-n-taters inside.)  Speedy preparation.\n\nThe bad:  Overcooked chicken swimming in a weird oil broth is NOT chicken tikka masala, at least not anywhere else that I've had it.  The naan is also really oily.  Bah."
    },
    {
        "id": 122,
        "text": "Delivery.  It was average Indian cuisine.  Kind of greasy, overly seasoned, and the chicken wasn't too tender.  It's fairly cheap and, if you go/went to Penn, you know that it breaks the cycle of garbage pizza and garbage Chinese in the area.  \n\nSeriously, for a college area, UCity really was awful for take-out options.  Tandoor ranks in the upper tier of take out options in the area...but that's not saying a ton."
    },
    {
        "id": 123,
        "text": "Negative reviews? Nice guys finish last I guess.\n\nAll I know is I have been eating here since my brother was a student at Penn and decided this was his favorite Indian place in West Philly. These days when we want Indian food one of us drives from East Falls all the way down to West Philly to get it here, and we have never had a bad experience or been disappointed. The staff have become friends.\n\nIn short, to me Tandoor India is what Indian food should be, and at good prices with friendly staff."
    },
    {
        "id": 124,
        "text": "eeek! I actually really like this place. It was my first indian buffet.\n\nThe service is alright, I was dining alone a couple of weeks ago and was ignored the entire time. I just got my own damn refills.\n\nThe food was great. They have fry bread, which most places don't.\nThe sauces here are my favorite. I love dessert and it's always those milk balls or barfi so I'm happy.\n\nI can say the New Dehli is better..but I like this place too."
    },
    {
        "id": 125,
        "text": "Just ordered delivery from here through campusfood.com\n\nTime of delivery to 21st street: Under an hour! Excellent for noon-time.\n\nFood quality: Good to very good. Had the chicken in the coconut cashew sauce, the nut bread, and the mixed pickles. \"Medium\" hotness was pretty spicy. I'd skip the ricotta cheese dessert next time (tasted freezer-burnt).\n\n\n\nOverall, it was a successful first-time experience. The order was correct, and hassle-free."
    },
    {
        "id": 126,
        "text": "this is our go-to indian lunch buffet when we're back east. They've got your standard selection of Indian buffet food, but it's solid & worth a trip. \n\nMy review - straight forward but reliable, just like Tandoor."
    },
    {
        "id": 127,
        "text": "I went here only a few times before the staff began to recognise me when I come in. They are incredibly polite, make sure everything is up to standard for you, and make great food. They recently added additional space to the buffet, so the selection expanded. I am always greeted with a smile, and make a point of it to suggest this place when I go out with friends. I could honestly say this is my favourite restaurant in Philadelphia."
    },
    {
        "id": 128,
        "text": "Expensive buffet, poorly seasoned and dry meats, the only thing bumping them up one star is that their vegetables are passable. Otherwise, I'm probably never going back here. Bad Indian food in my opinion, look elsewhere to get your Tandoori."
    },
    {
        "id": 129,
        "text": "This place is incredible, the owner and staff are ultra-courteous and the food is great"
    },
    {
        "id": 130,
        "text": "yum yum yum yum.. chomp chomp chomp... that's me .. uber fat indian food edition... The food is good.. and I love how when I go with my friend they bring us fresh piping hot naan! yummm .. the selection is not so great.. but I like the same stuff all the time so that doesn't bother me... I do prefer them for take out when you can specify the level of spice intensity you prefer.. then I can get it scorching spicy... student discount , CHECK.. either way its still cheaper than a north philly whore.... yuppppppp"
    },
    {
        "id": 131,
        "text": "So not as good as I remembered with a lot being pretty on the mild side for me, but still a very cheap buffet with a lot of options. Also the rasmalai is very good. But due to distance I'm definitely sticking to my local spot in the far NE for my Indian food fix."
    },
    {
        "id": 132,
        "text": "I'm a new grad student at Penn and being new to philly I stumbled apon tandoor India. I moved from Houston few months back and being a huge fan of Indian food almost immediately I started to look for Indian restaurants... I found 4 within 3 square blocks...amazing..and me being me I tried all 4 and guess what? Tandoor hit the spot. Fresh vegetables choices. Soft tender chicken and goat and specially there home made gulub jamon! Oh also these guys were the only ones that brought me fresh nan bread to the table! The place is a bit outdated but they look like there in the process of renovation which is always a goodthing. Keep it up guys! I will be frequently eating here!"
    },
    {
        "id": 133,
        "text": "From the buffet, the chicken biryani is very good.  They tend to make their tandoori chicken very spicy for my tastes, and other dishes seem to be heavier on spice than other places.  I'm sure that appeals to certain tastes.  We ordered chicken tikka from the menu which was decent, and channa masala which was ok.  The naan wasn't too inspiring, and the mango lassi was not the best I've ever had.  It's a good choice if Sitar and New Delhi are closed that day."
    },
    {
        "id": 134,
        "text": "I've tried the buffet and on another visit tried ordering off the menu since sometimes the buffet isn't the best way to judge a place. \n\nI don't like the food here. For me, a good Indian restaurant has to have good Chicken Makhani and there Chicken Makhani is not so good. I also was not very impressed by the naan or any of the other buffet items I tried (a little greasy and a little bland). \n\nI'm not going back."
    },
    {
        "id": 135,
        "text": "Food is great, good portion.\nFriendly staffs (family-run).\nLove their Curry lamb.\nBYOB\nThey have buffet (lunch and dinner). Take out buffet (dinner) is around $11, you can fill up the whole container.\n\nA good place for family dinner. If it is a dinner with a date, if would go with New Delhi on the next block. Tandoor's food is better than New Delhi, but ND has better atmosphere."
    },
    {
        "id": 136,
        "text": "I guess if you were famished and had no other option this would suffice. The Naan was disgusting! It was cracker like and tasted as though it was made using old oil. The korma was extremely oily, the rice was \"gummy\" and tasteless and the service was not particularly great. So incredibly disappointed"
    },
    {
        "id": 137,
        "text": "The place has new owners now. The food is much better and they had a complete makeover. The best Indian food for the price."
    },
    {
        "id": 138,
        "text": "I found the buffet here better than New Delhi, Sitar and Tarka. Being from Kolkata, I am very fond of lamb/goat dishes. Their lamb/goat dishes are much tender, juicier and tastier than the other Indian restaurants. The servers as well as the manager are very attentive. They also have a very good variety of delicious vegan dishes. They take the feedback very seriously. Once I asked to include gulab jamun as a desert. They did the next time I'd been there. You should also try their Mango lassi. One more thing better here than other Indian restaurants nearby is that they serve hot freshly cooked naan breads to your table."
    },
    {
        "id": 139,
        "text": "We just had dinner here for the first time and met the new owners and were really impressed.  They are amazingly gracious and are doing wonderful things with the menu and decor while honoring the 20 year tradition of this great restaurant. We left it to the chef to choose for us and were delighted with the chicken tikki masala, the tandoori mixed grill and the vegetables jalfrezi. They are doing great things with okra and we also had an amazing chicken based soup. The kulfi dessert was really delicious.  Having been to India, this place really made me smile. We are looking forward to going back soon and wish them all the best.  \n\nMichele & Dimitris"
    },
    {
        "id": 140,
        "text": "I came during the work week last week when a friend invited me to join them.\n\nThe buffet is usually what i get. it's a good deal. Inexpensive ($7.95 Lunch, $11.95 Dinner) for All-you-can-stuff in your mouth.\n\nTandoor India Restaurant, has a good selection of Vegetarian and Non_vegetarian dishes on their buffet. \n\nOf course, start out your meal with a salad, Veg Samosa and if you eat meat, Tandoori Chicken. It is delicately spiced with yogurt and cooked in clay oven. I don't think your palate will be satisfied with just one piece.\n\nI am always satisfied with the buffet because they have a favorite: Saag Paneer. Yum! Also, another house specialty Navrantan Korma which is mixed vegetables in a curry sauce. The night we went, they had the Kidney Bean Curry and Cabbage Curry. Both really good. Also, you can usually find Channa Masala, made with plump and tasty Chickpeas. Very nice.\n\nFor non-veg dishes: Try the Chicken Tikka Masala. Spicy and flavorful.They also had Chicken spare ribs. In a spicy sauce.\n\nI had two plates and was stuffed. But, not too stuffed for a little dessert:\nI had Pista Barfi which is ricotta cheese and Pistachios. Very nice."
    },
    {
        "id": 141,
        "text": "I reviewed this eatery by mistake."
    },
    {
        "id": 142,
        "text": "I ate here one Monday evening because New Delhi was closed and I was craving Indian food.  This place isn't that great.  I mean, the buffet line was almost out the door, but I highly doubt that that was reflective of the quality of the food. I ordered lamb saag, and it wasn't all that great.  In fact, I boxed up my leftovers, but ended up leaving them on the table.  I knew I wouldn't want to finish them.\n\nA homeless woman came in asking for change, and once she left they sprayed air freshener in the doorway.  I'm assuming it was necessary, but that just rubbed me the wrong way.  I'm sensitive, I know.\n\nAnywho, I won't be going back.  I'll just make sure that I time my cravings so they happen between Tuesday and Sunday.\n\nIf you're thinking about trying TIR, just walk around the corner to New Delhi."
    },
    {
        "id": 143,
        "text": "bad selection, and mediocre quality, as indian buffets go."
    },
    {
        "id": 144,
        "text": "Quality - 3 stars (Normal).\nPrice - $$ (Fair) Dinner / $ (Cheap) Lunch\nTaste - Normal and Rich\n\nCompare to all other Indian buffet near UPenn campus, I think this one so far didn't catch too much customers.\n\nThe food itself is fair, it doesn't taste stunning but fair.\n\nI most recommend people try their lunch, it's cheap for buffet price and if you ate a lot, you could possibly skip your dinner for a meal price under $15."
    },
    {
        "id": 145,
        "text": "Under new and sleazy management.\n\nThe food appears to be a good deal and it does taste fairly decent, but BE CAREFUL.  The waitstaff may offer you a beverage, acting as though it is on the house, but it is actually going to show up on your bill. Worse: you may find yourself sick the next day with food poisoning.  \n\nTo those with allergies: eat carefully.  Although there is a sign saying that you can inquire with the staff regarding the presence of allergens, don't expect the staff to actually know if there are any allergens in the the food!\n\nIf you have a problem during your visit, don't expect to receive the appropriate level of hospitality you would expect from staff in the restaurant industry.  Instead, you will be treated as though you are stupid.  During our visit, the bathroom door was broken and did not lock properly.  One of the girls went to the bathroom and had the unfortunate experience of being walked in on.  When confronted with this problem, the manager insisted that this did not happen to her and did not even apologize for the embarrassing event. \n\nThe meager difference in price between Tandoor's buffet and Sitar's buffet does not warrant my return visit to Tandoor."
    },
    {
        "id": 146,
        "text": "I have been coming here for 4 years. It is my favorite Indian buffet. The owners are nice as well as employees. The buffet is fresh. They always have standard favorites Saag Paneer, Chicken Tikka Masala, Chana Masala and of course,Tandoori Chicken. Last night we came for dinner and had the tandoori chicken fresh from clay oven. It was moist and delicious. They mix up which veggie dishes they have. Last night, the okra which was really savory and the cabbage, equally as good. You can also order off menu. They also serve chai tea which is a part of the buffet. I  Always have a relaxing meal."
    },
    {
        "id": 147,
        "text": "Seemed to me just like a very typical Indian buffet restaurant food-wise. There was nothing too spectacular about the food options there. The servers are very accommodating though, and they're really nice! I've never had an empty glass of water all the times I've eaten there. One unique aspect is that they have free chai with every buffet, which I absolutely adore!"
    },
    {
        "id": 148,
        "text": "As with nearby New Delhi and Sitar, the buffet deal (plus student discount) is the best value. I opted for this route, but the buffet food was surprisingly cold. I have to guess that this was because almost no one else was seated, so they don't have to make new food as often, but I've also never seen it particularly crowded when I pass by. The meat dishes were really spicy for me.\n\nThe service was fine, and the place is extremely dimly lit. I haven't been back since my first time... However, apparently now there is a new owner, so maybe it'll be different!"
    },
    {
        "id": 149,
        "text": "Tandoor is a good restaurant, it's just that everything they do New Delhi does a whole of a lot better. This wouldn't be much of a problem if they weren't less than a block away from each other.\n\nTandoor doesn't really offer much service to go along with their buffet, while New Delhi brings you out dessert and plenty of good drinks. Tandoor is BYOB while New Delhi has a stocked bar. it's these examples and a few more that just make Tandoor come up a bit shorter.\n\nYou almost get the same exact food with both. You pretty much pay the same exact prices at both. But New Delhi just offers more all around."
    },
    {
        "id": 150,
        "text": "Oh my goodness this place is good!!! Don't tell everyone about this place, I want it all to myself!!!  It's definitely a hidden gem!  I have to admit that I ate so much it hurt.  A close rival to New Delhi, I think it might be just a little better.  What really tiped the scale for me was desert at the buffet and more selections of main dishes.\nStale buffets are no fun, this is definitely not one of those.  We went on a rainy night during the week and the the buffet was moving nicely.\nThe family atmosphere only added to the experience.  Don't be shy about getting to Tandoor India. Top notch, perfectly flavored food; these people really know what they're doing."
    },
    {
        "id": 151,
        "text": "I have visited this place many times in the past. I am a huge fan of the goat made perfectly. Under new management the atmosphere has definitely changed. It is much cleaner and  updated. The problem I have now is that they DO NOT have the dinner buffet!! I wish there had have been some notice that it was being discontinued! I have not sat down and ordered off the menu because I liked the convenience of the buffet after work"
    },
    {
        "id": 152,
        "text": "Tandoor's lunch buffet is decent - everything tasted as it should. Of course, I sometimes pile spices on my food like there's no tomorrow, so perhaps I was unduly influenced. However, I'm pretty sure that I evaluated the food correctly, as my friend (herself a native of India) told me what to eat, how to eat, and the proper seasonings (including quantities) to apply.\n\nMind you, said friend and I ate at this small spot FOUR years ago (time flies when you're having fun), so take my comments with a grain of salt."
    },
    {
        "id": 153,
        "text": "I tend to be a stubborn and selective eater who harbors herself with bland and often plain foods. However I'm making the biggest (and delicious) effort I can to become an adventurous eater. Tandoor India has been one of those tasty excursions that truly made me fall in love with flavor and spice. The veggie samosas are delicious, and even though they're an appetizer (and kind of mild/not too spicy) they were part of my meal both occasions I've been there. Make sure to hit up the chick peas doused in a reasonably spicy sauce too.  Noodles fused with spicy veggies and naan bread are tasty as well. My friend got either goat or lamb  meat in a rich sauce and managed to clear her plate in no time. One of my favorite things here that I totally need to balance the meal is their Mango Lassi. Oh, and dessert at this place and world peace are essentially the same thing. The gulab jamun (basically tiny doughnut holes dipped in a warm honey sauce) and rice pudding (made with with cardamom and almonds) are sooooooo good. Make sure to drop in if you're around Upenn."
    },
    {
        "id": 154,
        "text": "So I order from here at least once a week (especially when exams start). I walk in, the owner and his wife (i believe) are super friendly always encouraging me to put more food in my container. Also, they always tell the waiters to make me fresh naan at no extra charge! Their food is by far the best indian food in the area. The food tastes much more authentic and there is a wide variety. The chicken masala and all of their vegetarian dishes are to die for. And do not miss out on their sambosa!! The place definitely needs a makeover but the food itself is delicious!"
    },
    {
        "id": 155,
        "text": "The food at Tandoor was good, not great, but definitely satisfied my craving. For reference, my friend and I chose to do the dinner buffet. For the price, 11.95, it was absolutely worth it. There was a pretty wide variety of options, though I was disappointed that puneer (spelling) was not offered at the buffet. We ended up ordering a plate of it off the menu and it was quite nice. I had never tried goat before, and though it was a little tough, the flavor was really nice and I went back for a little more. \n\nThe atmosphere of tandoor betrays it in my opinion. I think that if it were a little more upscale on the inside, it would improve the experience a lot. When we stepped inside, I initially wondered if we were going to regret our decision to eat there because it seemed almost dingy. Fortunately, the food was good and we were pleased with our decision. We will return."
    },
    {
        "id": 156,
        "text": "I've been to many Indian restaurants around Philly but just as it is, I find myself always coming back to the wonderful Tandoor. I've been going to this restaurant for about 10-12 years and as of most recent, I've noticed significant changes in the cosmetic appearance and the preparation of many dishes. I've also noticed an absence of a favorite or two or maybe I'm not there on the days which it is prepared but overall, this restaurant always receives a THUMBS UP!! \nKeep up the good work and I look forward to many more visits to my 40th street favorite. The slight change in the Chicken Tikka Masala is awesome and the fresh Naan right to the table is a great change to live with . Thank you and your server Khaled is always the GREATEST!!!!! Very kind, very attentive- for years."
    }
]