[
    {
        "id": 1,
        "text": "I have so far made two stops to pick up lunch from the buffet at Mumbai Bistro and can say, without any reservations, that it is perfectly adequate.  I have not been blown away by anything, and the flavors of the dishes I have sampled (Chicken Vindaloo, Chicken Tikka Masala, Mumbia Dal, and Navratan Korma) were fairly muted.  They also tout that the food is prepared without butter or ghee.  Um - I am not sure this is a good thing.  I enjoy the richness of Indian food; if I want light, I'll get a salad or something Mediterranean. The mumbai dal (a lentil dish) was so saucy and skimpy on the lentils that it might as well have been a broth-based soup.\n\nIn spite of my gripes, I do expect I will go back to Mumbai Bistro.  They fill a void for low-key, inexpensive Indian takeout in the immediate neighborhood.  They have a few tables set up to eat it, but it looks like their primary business is simple take-out.  The food (while somewhat uninspired) was all cooked well, and seemed fresh and hot in the buffet.  The space is clean, and the staff have all been friendly.  The idea of \"lighter\" Indian fare is not a bad one, but I would love to see them amp up their flavor a bit."
    },
    {
        "id": 2,
        "text": "Tip: Order on their website for fast, free delivery!\n\nMumbai is probably the cheapest indian takeout I've had. The food is great and tastes much healthier than the other Indian restaurants I've been to in the past. There are some really great vegan choices and everything is marked on the menu as well. \n\nI really like that you can go on their website and order food for very quick delivery. I only eaten inside the restaurant once and thought it was good. I think Mumbai is more useful for delivery as the place has a fast-food feel. \n\nI would definitely recommend Mumbai Bistro!"
    },
    {
        "id": 3,
        "text": "One of the worst tika masalas I ever tasted and i've order it many times from numerous places in various cities. This place is americanized and unauthentic."
    },
    {
        "id": 4,
        "text": "very clean establishment. the service was friendly enough, the food was piping hot, and the roti was delicious! good vegetarian options and they label which of their dishes are safe for vegans, gluten-free, lactose-free, etc.\n\nas said by others, this is basically indian fast food. i would recommend it!"
    },
    {
        "id": 5,
        "text": "For me it was easy and fast to order on my way to go.. delicious and best lamb biryani I ever had"
    },
    {
        "id": 6,
        "text": "I've done take-out from this restaurant several times when I'm in this part of Philly. \nIf you have read my other reviews on yelp, you know I have tried several different Indian restaurants, so I'm very familiar with the cuisine and what to expect.\nWhat I like about Mumbai Bistro:\n1) The prices -- most affordable Indian food. If you're on a budget like me, this is perfect.\n2) Simple, easy-to-understand menu. It also tells you what's spicy, what's gluten free, what contains dairy.\n3) Fast service. Even if you don't call in and order ahead for take-out, they get your to-go order ready in 5-10 mins.\n4) The food taste and quality is good. Good selection of appetizers and entrees. It's not THE best Indian food ever (you get what you pay for), but it's always good, enjoyable.\n\nThere's nothing I really dislike about this place."
    },
    {
        "id": 7,
        "text": "This place is fast and very reasonably priced. Their take-out portions are small, but only four or five bucks depending on what you get, so you can try a bunch of things without spending too much money. You can also order rice and nan in individual protions so you get just the right amont. \n\nOrdering online is easy too."
    },
    {
        "id": 8,
        "text": "the last time i came here, the food was \"off\" - not spoiled or inedible but lacking taste and texture. i got a to-go container of food from their buffet for a late lunch...a variety of different offerings from a chicken-based dish to a couple of vegetarian items (lentils and cauliflower). the flavor was so-so and the texture of the lentils and the chicken was rather \"soupy.\" i'm used to thicker sauces when i get indian food and was underwhelmed when i ended up with a pool of thin sauce underneath my rice.\n\ni'm rather surprised that this restaurant has the same \"star\" rating at the indian restaurant on south st near 16th. the latter is upscale and amazingly delicious while this place is on the cheaper end of quality and taste.\n\nof note, though, i still appreciate that mumbai bistro labels all of their food to safeguard those with dietary restrictions. the staff is also very friendly and gracious."
    },
    {
        "id": 9,
        "text": "We've never been inside, only ordered out:\nChicken Tikka Masala is delicious. Saag Paneer is good. Chicken Vindaloo is a bit watery, but delicious none the less. We were not a fan of their Lamb Samosa's but their vegetable ones are amazing. Their naan is good for the most part. Their curry needs a bit of work. They get 5 stars because of their affordable indian food that is also delicious and their AMAZING customer service. They accidentally screwed up the order, the guy in charge called me right back, apologized, told us to enjoy the mistake as they remade our food fresh! This was literally done in minutes. Unlike Gianfranco's Pizza Rustica when Mumbai Bistro makes a mistake they fix it and unlike Gianfranco's Pizza Rustica....... Mumbai Bistro was polite. This is now our go to spot when we have a craving for indian food. Mumbai Bistro we heart you. ; )"
    },
    {
        "id": 10,
        "text": "Mumbai is tasty and cheap Indian.  The buffet is sparse, but fresh, and although none of the food packs a real punch, it is well-flavored.\n\nIf you're looking for chicken vindaloo that is going to scald the tongue, this isn't the place, but it's fast, not too oily, and doesn't sit like a pit in the bottom of your stomach like some other Indian take out."
    },
    {
        "id": 11,
        "text": "I work nearby and get food from them about once a week. Everything I have gotten has been tasty and well made, and the prices are very reasonable. I generally get take-out, but there are some tables to sit inside as well."
    },
    {
        "id": 12,
        "text": "Is it the best Indian food that I have eaten? No; probably not in my top three, but the food is pretty good.  Living in South Jersey, it is good to find a spot to pick up a meal on the way home that doesn't require me going to a fast food our curb side pick-upchain. Good place to have a nice lunch, buffet is small but plentiful."
    },
    {
        "id": 13,
        "text": "This place is amazing! The food is incredibly cheap and insanely delicious. They even deliver and I can order online! I especially like that the vegan options are clearly marked. I have been here time and time again and will continue to return."
    },
    {
        "id": 14,
        "text": "This place is 2 blocks from my house and 3 blocks from my office, so it's convenient for both lunch and dinner options if I am in the mood for Indian.  Lucky for me that it happens to be tasty also!\n\nP.S.  It is buffet style with rice and 4 or 5 main course options.  You can order samosas or naan at the counter."
    },
    {
        "id": 15,
        "text": "The food was awesome and I would definitely recommend it. They have this buffet per pound system which costs you 5.25$ where you can select anything of your choice and a pound is usually quite filling. The food tasted great and it's worth going there once."
    },
    {
        "id": 16,
        "text": "So so good! One of the only places I don't freak out about branching out in terms of the menu. It gives you the chance to try it all without committing to the price of a larger dish. That said, no matter how much I mix it up VEGETABLE SOMOSAS ARE A MUST."
    },
    {
        "id": 17,
        "text": "Always delicious food, very convenient. They are quite friendly, but not in a pushy way. Affordable. I wish they have a more eco-friendly approach (even eat-in is served on disposable plates), but I can understand how that might not be affordable."
    },
    {
        "id": 18,
        "text": "If this was more of a restaurant I would give it four stars but it's really more of a cafeteria.  You get food by the weight and they really only have a couple things to choose from.  Food wasn't bad at all but I think they really could've done more with it and have a better selection of different Indian cuisine.  On the plus side it's really cheap I think my food was like four or five dollars for the plate so its worth it to check it out if in the neighborhood."
    },
    {
        "id": 19,
        "text": "Good tasting food and nice buffet.  Lots of vegetarian options and friendly manager.  Parking is a little weird but that's what u get for Philly.  Beware of the coconut water - zico brand is plastic tasting."
    },
    {
        "id": 20,
        "text": "Better off getting your food from the buffet since its constantly kept warm. If you order individual dishes from their menu their form of preparation is microwaving your food. The prices is not really that cheap compare to other Indian food and not the best ive ever tried ( then again i am from NYC)."
    },
    {
        "id": 21,
        "text": "went for the order at the counter instead of buffet. food & rice were all served in each individual 10oz containers separately.   \n\n-chicken tikka masala & garlic naan"
    },
    {
        "id": 22,
        "text": "I've bumped up to 5 stars after having a great lunch from there yesterday. The samosas were great and the saag paneer was the best I ever had! Chicken tikka masala- excellent. A lot of times I find chicken in an Indian buffet sub- par but this is good quality, well prepared moist white meat.Cauliflower-potato curry was excellent. I love the food here, always fresh and tasty. Don't forget to ask for hot sauce; it's extremely flavorful without being too hot.Skip the naan. I had a Trader Joes paratha with it instead!"
    },
    {
        "id": 23,
        "text": "Ordered delivery for lunch at work since I was starving, but not crazy enough to go out in this afwul heat and humidity. The food arrived in about 20-25 minutes so that was a great plus. Though, he didn't bring the food into the building and I had to meet him outside (ugh... that heat). Not a plus, but not at all the delivery guy's fault.\n\nI ordered the Chicken Tikka Masala with basmati rice and the gulab jamun for dessert. The chicken was well-cooked, tender, and probably had decent flavor. I say \"probably\", because the whole thing was so incredibly watery. I think they didn't use any yogurt or corn starch. Still, not the worst I've had (that prize goes to Nanee's Kitchen at Reading Terminal). The chicken wasn't really that bad and I still had dessert to look forward to. Nope. Instead of the sweet, spongey goodness usually associated with gulab jamun, it was hard and a little gritty.\n\nI could overlook the quality of the food if it was at least cheap, but it's not really that much cheaper than other places.\n\nDefinitely not a place to introduce someone to Indian cuisine if they've never had."
    },
    {
        "id": 24,
        "text": "Great food! I love their Paneer Masala and Saag Paneer. Very friendly service as well."
    },
    {
        "id": 25,
        "text": "I'm a little puzzled by all the rave reviews for this place. Don't get me wrong, I still continue to go here despite the \"meh\" food, but the attractiveness of Mumbai Bistro lies nearly entirely in the location and the price (which is why it gets 2 stars instead of 1).\n\nI am definitely glad that there is place in walking distance from both Jefferson and Pennsylvania hospital that serves ready-made Indian food I can grab on my lunch break. The standard hospital cafeteria fare can grow old quickly, and I often fantasize about a delicious curry when I contemplate grabbing something predictable from the hospital cafe. \n\nAnd I suppose it's a smart business strategy to serve Indian food that is palatable to pickier eaters or people who don't normally enjoy spicy cuisine, but for someone like me who loves Indian food for its vibrant and complex flavors, the food served here is a bland facsimile of familiar favorites. The malai kofta and the mixed vegetable curry are probably the best meatless dishes served here, but even those lack the expected richness and texture. The Gobi Malasa tends to be overcooked and mushy and the paneer masala is downright watery. The naan is somewhat soggy and seems like it has been microwaved.\n\nI don't like giving bad reviews, and I want this place to remain in business, but I think there are some very easy fixes they could do to improve the food here, namely not watering down dishes and not using a microwave to heat up naan. I think it is great that they do not use butter or ghee, but I've also made vegan Indian food in my own home that was more flavorful than this, so I don't find the health claims to be a valid excuse for blandness. I think the concept of a cheap vegan & celiac-friendly buffet that is 5$ a pound is a fantastic idea, but I don't think that it should come at the cost of flavor and consistency.\n\nIf you work close by and you're really craving some cheap and fast Indian food that meets your dietary restrictions, I suppose it wouldn't hurt to come here, but if you have your choice of Indian restaurants, I'd definitely recommend choosing a different one."
    },
    {
        "id": 26,
        "text": "Food poisoning anyone? I used to order their samosas frequently until I got severely sick recently. My husband also threw up all night. The two stars are because those samosas actually tasted good, but the threat of food poisoning again is just not worth it. I can only imagine the food was prepared in unsanitary conditions or/ and with expired products. Either way, I'm done with this place."
    },
    {
        "id": 27,
        "text": "The food was tasty but nothing particularly amazing.  I had some chicken tikka masala, saag paneer and navratan korma from the buffet.  The sauce on the chicken wasn't as thick and creamy as I'm used to, but I thought both of the vegetable dishes were good.\n\nIt was convenient and inexpensive.  It's fairly small inside, but I went at dinner and there were a couple tables open.  The guy behind the counter was friendly and was clearly familiar with several of the people who came in."
    },
    {
        "id": 28,
        "text": "Great cheap Indian. I'm not usually a prepared buffet person (and for what it's worth they do have some made-to-order food), but Mumbai Bistro is great for quick and inexpensive Indian. Lots of veggie, vegan and gluten-free dishes if that matters to you too."
    },
    {
        "id": 29,
        "text": "This place is good, if you work in the area and crave Indian food to go. There is a buffet of different Indian food, including the typical Chicken Tikka Masala. And you just grab what you want to pay by weight, which I'm pretty sure they don't subtract the weight of the styrofoam box. In any case, the price is decent for what you can get around the area. However, it doesn't come out as cheap as you would imagine. $7-12 for lunch plus tax. They don't give you much naan for the price, and it's usually not fresh.\n\nI do like the chai and chicken samosas. The chicken samosas are really big, 3 of them, and very filling for $4. Other than that, the flavors of the buffet-style dishes are sometimes lacking. But overall, I would come here again if I was in a rush to get food over a lunch break."
    },
    {
        "id": 30,
        "text": "It's a great deal. Choose from \"buffet\" and pay by pound. It's about $5 for a pound. Not too shabby. Also because it's self-serve, you can get your food and eat and out the door in 5 minutes (if you are fast eater). The food isn't anything to brag about but at this cost, you can't complain. The selection is about 3:2 ratio for meat:vegetable curry."
    },
    {
        "id": 31,
        "text": "Well, I read the reviews and went anyway. I must say, I wasn't disappointed. It is just as others have said, a very basic selection of standard Indian dishes and a few tables if you want to eat in. I grabbed my chicken vindaloo, chicken tikka masala, and naan to go, and when I got home and dug in, everything was up to par. Nothing was as spicy as I would have liked, but nothing ever is. Perils of being a spicy food junkie, I suppose.\n\nAll in all, if you want something fast and happen to be in the area, Mumbai Bistro is definitely worth considering. The prices are super reasonable, and the food gets the job done. Don't, however, expect something worth writing home about."
    },
    {
        "id": 32,
        "text": "I had lamb biryani and it was not a biryani. In stead it was fried rice with some lamb chunks. I could see that the rice was Jasmine or even lower quality rice unlike in other Indian restaurants where they use quality basmati rice. Biryani did not have any biryani masala or smell. \nThe rice was fried with cumin seeds. It was pre cooked like long time ago and they microwave in front of me instead of heating up in the cooking pan. The lamb pieces were so dry and over microwaved multiple times. Overall I was given some random foods. Certainly not biryani."
    },
    {
        "id": 33,
        "text": "Authentic Indian flavours and great prices! Tried the aloo paratha, garlic naan, and raita, all of which tasted great. The portions could've been a bit bigger, but I suppose it's fair for the price. Definite value for money. Can't wait to go back!"
    },
    {
        "id": 34,
        "text": "I came here because I wanted to introduce my vegan friend to a great restaurant instead of the opposite way for a change. Even though this isn't a vegetarian place, a lot of Indians are vegetarians so Mumbai Bistro was perfect for her. She loved the food and I did too! I'm a meat-eater but I also hate spicy food. The cashier was kind enough to cater to my tastes, assuring me that their Chicken Tikka Masala would not be spicy nor would they add any spice for me. The workers had the patience of saints for putting up with my weak tongue. The space is also nice and cozy, adding to the homey food."
    },
    {
        "id": 35,
        "text": "I would definitely come back to this restaurant! The entire menu had markings on it to show which items were gluten free, vegan, and lactose free.  The food was delicious, and they even had a gluten free flatbread which was fluffy and tasted like real bread! We ordered one flatbread to start, but then ended up buying two more because they were so good! We ordered several other dishes, all of which came out fast and packaged in plastics containers so that it was simple to pack up to take home.The restaurant had an a la carte menu as well as a buffet, so there were many options to choose from. I would definitely recommend it to anyone who has dietary restrictions, as well as those without."
    },
    {
        "id": 36,
        "text": "Tasty, fresh, and friendly.  Plus, a loyalty card!  I'm in.\n\nLots of med students grabbing a bite to eat, chefs constantly re-filling the buffet with fresh food from the kitchen, clean."
    },
    {
        "id": 37,
        "text": "Delivery order placed online was simple, paid cash when food arrived, food was hot and plentiful.  Samosas were large and 2 per order.  Nana, chickpea, and chicken curry were all tasty, though a bit mild to our taste.  Chicken in particular was very tender.  Total bill under thirty for 4 people."
    },
    {
        "id": 38,
        "text": "Just ordered delivery, and it's frankly inedible. I will NOT be going back. Sauces are super watery and oily, limited flavor, generally awful.\n\nVeggie samosa - soggy and floury.\n\nLamb korma - big chunks of boiled meat in greasy water, no texture / flavor at all.\n\nDal - watery and floury.\n\nNaan - edible but ordinary. If I had heated up a naan from the supermarket it would taste better.\n\n\nSeriously disappointing, I've just spent $15 to be hungry :-("
    },
    {
        "id": 39,
        "text": "Nice selection, both daily buffet and off the menu. Mango lassi outstanding. While targeted for take out, there are a few tables and the atmosphere and staff are very friendly and helpful. Very good value at a very reasonable price."
    },
    {
        "id": 40,
        "text": "Overpriced, dry rice, small rotis, terrible tea. As an Indian I will not be coming back here"
    },
    {
        "id": 41,
        "text": "Great cheap option when you need your Indian fix. Not the absolute best Indian I have every had but it was still satisfying and fixed my korma craving. I also had the garlic nann which was not that good- hardly had a garlic flavor. My buffet take out including the garlic nann was all under $7 (they weigh it for the price) so I couldn't beat it. Would go again!"
    },
    {
        "id": 42,
        "text": "This is my go-to Indian food spot. For delivery is fine, but you get the most for your money if you go in and hit the buffet. Most things are gluten-free, and are specified. The food is all fresh and thickened with yogurt (making it gluten-free). The ONLY thing I hate is that I ALWAYS crave them on Mondays and sadly they are closed. Such is the way. \n\nCheck out their website for the buffet's daily menu. Everything else can be made a la carte. Check them out!"
    },
    {
        "id": 43,
        "text": "Love this place. It's my neighborhood go-to for takeout. The food is really good quality and the staff is friendly. I have always gotten the buffet items - the dal is delicious and I can also vouch for the saag paneer."
    },
    {
        "id": 44,
        "text": "A good place for a quick lunch. Well priced and satisfying. Will return. I have had better, but I've also paid more and wouldn't necessarily go to those place routine. Mumbai serves it's purpose and it does it well."
    },
    {
        "id": 45,
        "text": "We ordered the paneer, dal and kofta. The food was horrible. There was no taste and the food was so watery."
    },
    {
        "id": 46,
        "text": "My office recently ordered samosas and tandoori chicken for an event from Mumbai Bistro.  The food was great and everyone loved it! The staff was also very accommodating for our need to pick-up the order prior to their opening time.  Great food, great prices and service."
    },
    {
        "id": 47,
        "text": "Great Indian food for a decent price. Located right down town so makes a great lunch spot."
    },
    {
        "id": 48,
        "text": "Pleasantly surprised was really good. Officially my go to spot for affordable Indian food."
    },
    {
        "id": 49,
        "text": "I've gotten delivery from here about a dozen times now. What I've enjoyed the most was the Veg Samosas, Channa Massala, and the Chicken Vindaloo. For the price I was pleasantly surprised by the good taste, and the the order gets delivered in less than 20 minutes sometimes. You get a bit less than many other restaurants because the prices are so low, but you get enough to feel satisfied.\n\nI ordered the Tikka Masala from them, which I imagine is the more popular order for many people when looking for Indian Food. While it was not bad by any stretch of the imagination, I tended to miss the richer (fattier) flavor of other classic Indian places that use more cream in their preparation. Most other orders I did not have this problem with. The only other problem I ran into was that the Nan was not as fresh and crispy as many other places.\n\nOverall a great experience. Definitely recommend it for those needing cheap dinner delivery."
    },
    {
        "id": 50,
        "text": "The food is inexpensive, and the service is quick, so I really appreciate that.  Though the convenience factor is here for sure (for a quick meal or delivery), I was not wowed with the food.  The sag paneer was sub-par at best, and the chicken tikka was not very good."
    },
    {
        "id": 51,
        "text": "What's not to like about a place where you can walk in, get a totally satisfying lunch in a matter of minutes from the buffet (plenty of vegan/vegetarian choices, traditional Indian dishes), all for $4.29. Mostly a takeout place, it's also handy for that quick lunch. For eating-in, you can also order from their menu, as the buffet is somewhat limited compared to the full menu. Seating is somewhat limited - as I say, it's mainly a takeout business - but stopping in for a late lunch recently, there were several empty tables."
    },
    {
        "id": 52,
        "text": "Not bad. Not in a rush to go home, so as this was conveniently located 2 doors away from the Patco train stop, it was easy to pop in here for dinner one night. There is a very small buffet, with perhaps 6 or 7 different offerings. You load up your take-away container and it is weighed and you pay by the pound. They offer free water if you are not in the mood to buy a drink.\n\nPricewise, it was perfect because I was hungry but not too hungry, so I paid under $10 for my plate.\n\nTastewise, it was AOK. Nothing too spectacular, but tasty enough for whatever 3 or 4 dishes I lumped together.\n\nTiny storefront with seating for about 20 people max. Sat by the windows for entertaining people-watching."
    },
    {
        "id": 53,
        "text": "A race finished strong is always good.\n\nMumbai Bistro is not a restaurant experience, it is an eating experience.  They host a buffet line by the weight or you can order from the kitchen in a standard portion.  \n\nDo they deliver?  Yes!\nAre they good for take out?  Yes!\nWas the Lamb Vindaloo with extra spicy curry delicious absolutely awesome?  Yes!\n\nSo what puts them from 4 to 5 stars, killer service.  I would never expect great service from a small joint that strikes me as a drive by take out but the gentleman working the cash register proved me wrong.  He did all the right stuff, greeted me when we came in, asked if I had any questions and offered to explain the menu.  He gave us the best thorough yet fast lowdown on everything and was very friendly about it.  I was so stunned by his service, I thanked him for it.  \n\nI'll be returning."
    },
    {
        "id": 54,
        "text": "The food was extremely tasty for it's price point. I am the happiest woman when I can get chicken tikka under $10 and actually enjoy it. I will definitely return again. I only wish that they delivered past Washington Avenue!!"
    },
    {
        "id": 55,
        "text": "For what it is (Indian take-out), I love this place. It is cheap, easy, clean, and the food is always tasty. I live very closeby, so I'm here at least a couple times a week. I'm in and out in five minutes with some tasty food from the buffet and usually some mango ice cream ($2, ask for it at the check-out). It is always spotlessly clean and I feel like the owners take a lot of pride in it. The selection is a little limited in that they do not serve meat aside from chicken, but what they do have they do very well. Plus, I like that it's probably a little healthier without all the butter."
    },
    {
        "id": 56,
        "text": "No. \n\nNo yogurt in the Tikka Masala and the chicken was Tandoori. \nNaan was hard - inedible. \n\nEverything poorly executed and cheaply made. I ordered because of 4 stars. \nNot deserved."
    },
    {
        "id": 57,
        "text": "Walked over half mile and stumbled upon this restaurant. Being Indian, I got excited looking at their menu. Due to the fact its janamastmi hubby n I were vegetarian for the weekend.  \n\nCame into the restaurant n there was a talk Punjabi man who was cleaning the buffet area. He didnt greet us til we sat down. I asked for paneer tikka masala just instead of paneer masala. He instantly said no. Hubby and i ordered navratan masala and paneer masal and two whole wheat rotis. I saw that he was Punjabi, I had no doubt in my mind the food would be chat pata (spicy). The food was brought out in 10 ounce plastic containers, rotis were in individual foil paper and they were reallll thick rotis. My mom would've kicked the @$$ of the persi n who made rtve rotis. Anyway the entrees tasted exactly rhe same and it was sweeter than most Gujarati food I've tried. I askes for a green chilli they gave me achar. A white man walks in n he was greeted instantly.  Really Punjabi man? Anytime we asked him for something, he had the ched type of guy cone out n give it to us...how dare he move. Not worth the walk. I should've went to Minar instead"
    },
    {
        "id": 58,
        "text": "What a find.  Indian buffet that is reliably fresh, quick and cheap.  Can it get any better than $5 for a POUND of food?  \n\nI'm a big fan of the chicken tikka masala.  It may not be the best you'll find in the city, but few indian food places in Philly are better. For the price and the convenience, it's a great choice for lunch or a low-priced takeout dinner."
    },
    {
        "id": 59,
        "text": "Great little place to feed your Indian food craving. Buffet was not so spicy and that translates to my kids loving it too. Menu items came out fast and over all the place was clean, well kept and the staff was friendly!"
    },
    {
        "id": 60,
        "text": "Ordered take out on 02/26/2016 while I was in the area for some work. The service was quick as always. The manager at the register is polite and professional. I love the prices! More affordable than any other Indian restaurant i have gone to. Of course, the food is not the greatest, but it's never totally disappointing either.\nHaving said that, I don't think i would order chicken biryani again. It's not basmati rice, and the taste is simply not authentic biryani.\nThe chicken curry had a pool of oil floating at the top -- not very healthy. But the chicken was perfectly tender.\nThe tandoori chicken appetizer was good, but it does contain red food coloring.\nI do like this restaurant -- it's clean, cozy, quick, affordable, and has a simple menu with gluten or lactose-free labels."
    },
    {
        "id": 61,
        "text": "By far the cheapest Indian take-out I've found in my travels.  $7.50 for Paneer Masala, Garlic Naan, and rice (including tax)?  Sign this girl up.\n\nLike the other reviews, it's middle of the road as far as quality.  It's great for what I needed it for: a night in with no frills.  I appreciated the vegetarian options, although I'm not a strict vegetarian, simply because I wasn't pigeonholed into getting the typical chicken. It was expediently made, and that's more than I can say for most places with such a cheap menu, but the masala was really watery and super safe as far as spices go.  The naan was definitely microwaved.  Don't expect all of the lesser-known dishes, but you can count on the old favorites.  All in all, it's a great place to visit if you're looking for cuisine that's quick and yummy (think fast-food Indian), but maybe not if you're looking for traditional, homestyle Indian."
    },
    {
        "id": 62,
        "text": "One thing that comes to mind after entering the place. Clean!\nIt does not smell like an Indian restaurant like Sitar, Karma or Samosa. The place has a seating for only 12-15 and the place is perfect for a quick in and out buffet. I would recommend this place only if the group is small and do not care about the ambiance as much as the taste of the food. The menu is very limited for the buffet. The price is per pound of food you take. If you are super hungry, 1.5 pounds of food will be perfect for you. Bread is extra. Overall - great food, hole in the wall."
    },
    {
        "id": 63,
        "text": "Phenomenal takeout/delivery spot. I LOVE the lack of unnecessary fats, vegan options and great prices. I'm not a vegetarian, but I crave the mumbai dal on a regular basis. I've been getting takeout/delivery since they opened and have never been disappointed."
    },
    {
        "id": 64,
        "text": "Amazing food.  Nice people.  Best Indian restaurant in Philly."
    },
    {
        "id": 65,
        "text": "Some of the best Indian food I've had.  The samosas were good everything we ordered was great.  Good vegan options too."
    },
    {
        "id": 66,
        "text": "What a great value! Lunch and dinner buffet by-the-pound take-out place with seating available for about 20. There is a rotating menu and I like the variety they offer for such a small buffet. I was able to sample 3 or 4 dishes, in little 5oz or so portions in my container. There was a little spicy tang to the food but overall it was mild and would appeal to many.  Only spent about $8 and got served a quick fresh 17oz lunch ($6) with a side of small mango juice ($2). This location is brand new as of July 2010 and they hope to expand to other locations soon.\n\nTheir to-go containers are self-sealing, and recyclable plastic, and that is thoroughly useful."
    },
    {
        "id": 67,
        "text": "Delicious and quick. The buffet helps you get in and out even faster. Not much sitting area inside, but I doubt most people stay there to eat like I did."
    },
    {
        "id": 68,
        "text": "I like Mumbai Bistro because it's a place you can go to when you get a craving for Indian food on the cheap ($4.95/lb bar, $1 samosas) or even something hot and more substantial than a sandwich, that's not chinese take out.  I congratulate it for tapping this market! \n\nThere is a hot bar with daily meat and veg courses that rotate- stocked with all your standards...chicken tikka masala, paneer masala, chicken korma, some lentil dishes, potato and cauliflower curry.  All these hot bar items were pretty fresh. \n\nThat being said, the quality of the dishes isn't quite Palace of the Ben worthy and they don't make their own naan (it's sorta weak).  My favorite offering was the Chicken Korma- avoid the dry Chicken Tikka Masala.  As far as Indian food goes, it's a little on the safer side with the spices pretty muted.  You also have to remember that for lunch (depending on how much you load in your to-go box) you could pay just a few bucks more and get an all you can eat buffet at Palace of the Ben with amazing naan and dessert included in the cost.\n\nAs I said above though, the ability to get pay-by-the pound Indian food in the neighborhood is pretty freakin' sweet for lunch!"
    },
    {
        "id": 69,
        "text": "Good, quick, inexpensive lunch spot. The dals and paneer were all very good. The naan didn't taste so fresh but it was wrapped in aluminum foil, so it might just be the wrapping."
    },
    {
        "id": 70,
        "text": "I've been a repeat offender of this place. It's solid Indian fare, that tastes great and is inexpensive (pay by weight). I am usually leery of weighing stations because, I don't like the idea of my price being contingent on how greedy I am. They make a variety of dishes but the standard is the buffet style set up, which has basmati rice and whatever vegetarian and meat options for the day. They have a mango chutney that's absolutely delicious! \n\nOne complaint- their naan is great, but sometimes you can tell its not fresh. For example, today I ordered the garlic naan and its fairly obvious that it was made yesterday.\n\nHonorable mention is the fact that the food doesn't send you running to the lavatory, which- If we're being honest, is a concern with spicier cuisine."
    },
    {
        "id": 71,
        "text": "Delicious food without any belly problems, which tells me that they make a good selection of ingredients. It is also fairly cheap. Went there for dinner and the other day for lunch, was that good!"
    },
    {
        "id": 72,
        "text": "Great price, great service, great food.  Can't ask for more!!....EXCEPT TO BE OPEN MONDAYS! Haha  I give them 5 stars because the food is always perfect, the service is wonderful and always on time, and you can't beat their prices.  I just wish they were open on Mondays!"
    },
    {
        "id": 73,
        "text": "Mumbai knows what it's doing. It's going for wide appeal and succeeding. With vegan-friendly, buffet-style curry at $4.95/lb, you aren't going to hear any complaints from this guy. They avoid the potential pitfall of inadequate heating on the buffet line, and for an additional buck, you can add a side of naan. \n\nI have frequently pointed people in Mumbai's direction not only because of the food quality, but also because of the unbeatable prices. Not to be the eternal pessimist, but this is not the best Indian food in Philly. It's the best price, without question, and the service is always friendly; however, there are some other options worth considering if you want top-notch Tikka Masala and other Westernized curry dishes. \n\nMumbai Bistro is definitely deserving of a 4-star review and while there may be nicer Indian restaurants in the city, few could compete with its accessibility. For those working in Center City, this is a staple."
    },
    {
        "id": 74,
        "text": "Probably more of a 3.5. They have great naan, and the samosas are pretty good, with good prices as well.\n\nHowever, the buffet line isn't that great. The curries, particularly the chicken ones, are rather watery. The lentil ones are pretty tasty though, and the rice is fine. \n\nThey have a minimum card order of $10, which is a bit of a bummer if you just want a light lunch. At least everyone's been pretty nice when I'm there. Overall though, I'd recommend it if you want something quick in the area (but wouldn't go out of my way to come here)."
    },
    {
        "id": 75,
        "text": "Just ordered delivery from here for dinner tonight... got the chicken vindaloo and lamb bryani.\n\nThoughts: \n\n1) The delivery service was very quick\n2) The food was good, right level of spice, and really cheap... One thing to note was that the food wasn't super hot so it warranted a quick nuke in the microwave but not a big deal\n3) We also ordered garlic naan which they forgot in the delivery. I called and the guys were super apologetic and nice about it. They took it off the bill (which was all I expected/wanted). They took it a step further and called Grub Hub to let them know what happened and Grub Hub took care of the situation by giving us a $5 credit.\n\nOverall, I was happy with the food and especially pleased with the customer service. Will definitely order from there again."
    },
    {
        "id": 76,
        "text": "After a long day, I got back to my weekend rental in Washington Park, exhausted, hungry and no clue what I wanted. I searched right here on Yelp for options nearby and topping the list was Mumbai Bistro. Indian food...yes!!!! When in doubt, Indian food is always the answer and with a 4-star average review, how could you go wrong? I can never seem to pick just a single item or two, so I ordered a trio, chicken vindaloo, channa masala and saag paneer with a side of rice. All of that for less than $20. I ordered online and my food arrived within 35 minutes. Side note: my delivery driver was cute. :-) The food was fantastic. The channa masala was definitely among the best I've ever had. I'm already thinking about the leftovers I'll polish off tonight."
    },
    {
        "id": 77,
        "text": "Interesting place - this is mainly a takeout place. If you eat in, you use plastic ware - plates, forks and cups.\n\nThey have a small buffet which is priced on weight and then you can order from the menu. I chose to do both. \n\nI ordered the veg curry, naan, and veg samosa. The food was good. From the buffet I had some basmati rice and aloo gobi - I'm a little disappointed in the buffet because the food was not hot, not even warm. That was a damper. \n\nIt was very inexpensive and tasted authentic. I would have liked the buffet food to be served hot and fresh!!"
    },
    {
        "id": 78,
        "text": "for $5/lb you get amazing, fresh indian food, to-go or sit-n-eat. they give you free water and hot sauce. 2x samosas for $2. and with your frequent flier card you get 10% off basically (every 10th LB free). i'm not a vegetarian but their veg dishes are so good, i almost never go with 'curry chicken,' just seems boring (if you are, bring your dates/sig other here). delivery is not as good a deal as the buffet but still fair, and same delicious food. agree w/other that service is top notch, very friendly and accommodating. my roomie is indian, we go here 2-3x/week, and he's picky."
    },
    {
        "id": 79,
        "text": "We had the food delivered (free delivery for a close radius) and was very impressed. Grubhub kept you apprised of the delivery time via email, and the food actually arrived early. Limited menu, but it is after all a small business. Saag Paneer and Chicken Korma were excellent, and you can't beat the price. I'm a fan..."
    },
    {
        "id": 80,
        "text": "This place was good for what it is: cheap, ready to go Indian food. However still not the best and I prefer takeout from other places nearby."
    },
    {
        "id": 81,
        "text": "Amazing Indian buffet -- tasty, fresh, healthy, and affordable. Plus, everyone's really nice and the food is incredibly consistent. Don't miss it!"
    },
    {
        "id": 82,
        "text": "Horrible horrible horrible food. So I chose to order from the menu than to do the buffet. $15 later I was horribly disappointed. The tandoori chicken was fried, tasted stale and nothing like tandoori chicken. The lamb vindaloo was just as horrible. Tasted like steamed beef in some nasty sauce. Total waste of money. Crap. Will never go back. Oh you have to pay $2 extra for rice that goes with the vindaloo. Couldn't eat more than a bite."
    },
    {
        "id": 83,
        "text": "Ordered pick up here last night. It was ready promptly and the food was SO good. My boyfriend was craving Indian food and I'm glad he was. \n\nWe got the garlic naan and a few other things. One of them was very spicy, and it was mild. The other was just perfect. I think I found my go-to place for when I want some comforting take out while I drink wine and binge on Netflix."
    },
    {
        "id": 84,
        "text": "I love Mumbai Bistro!  I work a few blocks away and their super fast, free delivery is a Godsend on those days I accidentally leave my lunch at home; I will admit that I sometimes accidentally-on-purpose leave my lunch at home these days just so I have an excuse to call the guys at Mumbai.  The food is crazy cheap for Indian, even the worst things on the menu are still decently good, and the small portions keep my pigginess in check.\n\nThe restaurant itself is reminiscent of a generic chain, but I actually think the food is quite good.  Others have mentioned the nan and veggie samosas could be improved.  I agree (and will add the tandoori chicken to that list), but they're still yummy.  Their chicken biryani, chicken vindaloo, paneer masala, channa masala, tikka masala, mixed veg curry, and basmati are all delicious.  I've probably been in or ordered delivery a dozen times since discovering them about 6 months ago and I have never had a disappointing meal.  Contrary to some other reviews, I think the food is aromatic and overall very good - some dishes are lacking in heat, but it's nothing a little hot sauce can't remedy.\n\nThe place is clean, the service is quick and friendly, the food rocks, it's cheap...what more could I ask for?"
    },
    {
        "id": 85,
        "text": "Yes, the food is cheap but I found it to be somewhat lacking in flavor or actually, richness.  When I want Indian, I expect my dishes to be prepared with a small amount of ghee to give it that rich taste, which was lacking in the entrees here.  I suppose my heart should thank me?  Anyhow, the chicken tandoori was a bit disappointing, as was the chicken tikka masala; both were a bit on the bland side.  While I have yet to find the perfect chicken tikka masala in the tri-state vicinity, the tandoori chicken at Mehek in Princeton remains to be surpassed.  The naan here was not that fantastic but still edible; it wasn't as crispy as i would have liked.  Overall, the place is a very clean, organized restaurant to grab an inexpensive meal that is pretty healthy.  Maybe a bit too healthy for my personal taste but it is cheap and fast.  Kind of like cafeteria-style Indian food."
    },
    {
        "id": 86,
        "text": "Pretty reasonable prices...and food were pretty good, the only complaint I have is the potatoes in the dishes I got were too big and not really that much seasoned. But all and all I would still go back and order again from them."
    },
    {
        "id": 87,
        "text": "I was a little sad when Shinju decided to re-locate and move on to bigger and better things (Fat Salmon).  But, Mumbai Bistro doesn't make me miss that restaurant at all, it is that good!!  Food is delicious.  Prices are really good/cheap and the people that work there are so nice and friendly.  I prefer to go on Tuesday or Saturday as I love their menu options on those days.  I also like the Mango lassi they sell too and it seems to be a popular item..they've run out of a few times.  This place is the whole package."
    },
    {
        "id": 88,
        "text": "Been to Mumbai countless times... Its great food at a cheap price. Cant beat it!... In all the times I've eaten here I've only had one complaint where my garlic naan was overcooked and hard. Other than that I have not one complaint. The food in the buffet is always fresh, the place is super clean, and the guys who work there are really nice. They have the best basmati rice I've ever tasted and the chicken tikka masala and chicken vindaloo never disappoint"
    },
    {
        "id": 89,
        "text": "Great Indian take-out! I typically order from their a la carte menu rather than the buffet and have zero complaints so far on all the different dishes I've tried. Standouts are the saag paneer, samosas, chicken vindaloo and chicken tikka masala. The food always tastes fresh, has lots of flavor and just enough spiciness. Wish I had discovered this place sooner."
    },
    {
        "id": 90,
        "text": "When I first saw the signs for Mumbai Bistro before it opened, I admit that I was slightly skeptical.  One day while passing by I decided to stop in for a veggie samosa and recognized one of the staff from New Delhi in University City.  I was happy to learn that in fact, Mumbai Bistro was affiliated with New Delhi.  Hearing this, I decided I had to return for dinner. \n\nSince that brief visit, I have been back numerous times  - so very happy to have another quick, inexpensive dinner option in my neighborhood & another good Indian option at that!  The menu lists the schedule of what is going to be served in the buffet each night, so I know what to expect and the food has been fresh and delicious every time we have stopped in.  The dishes rotate every day- a few meat dishes and mostly veggie dishes here.  If you have been to New Delhi then you know what to expect in terms of the food.  As the dishes in the buffet aren't super spicy, they will also throw in extra hot sauce if you ask. \n\nThe only problem we had with the food here is the Nan- it reminded us of the store bought kind you can get at whole foods and it usually ends up soggy by the time we arrive at home.  Because good Nan is such an essential element of Indian food, I have to deduct a start for that.  However, if the Nan improved, I would definitely rate Mumbai Bistro 4 stars. \n\nAlso of note- the staff here is always very friendly and helpful, and the restaurant is always clean.  The majority of customers here opt for takeout, however, there are a few tables in the restaurant so there is the option of eating in. Overall, a welcome addition to the neighborhood!"
    },
    {
        "id": 91,
        "text": "We get delivery from here all the time & it is incredible. They have some of the best Indian food in the city, especially the chicken curry. They are affordable & have exceptional service."
    },
    {
        "id": 92,
        "text": "Cheap, delicious, and healthy! You can't beat the price-to-quality ratio here.\n\nSometimes I feel a bit guilty eating Indian food when it's really oily, but Mumbai Bistro doesn't include butter or ghee and it doesn't taste too oily. I love the freedom of being able to choose exactly what you want, on your plate. (Sometimes I want naan, not rice.) Only thing is, it's so cheap and delicious, you might want to go back for seconds. $3 for two pieces of tandoori chicken and $1 naans are a steal compared to other places.\n\nFirst time trying malai kofta curry, loved it! Who knew little balls of spinach and potato could be so good. The chicken in the chicken tikka masala was still juicy and tender, and the actual curry broth was addictive. If you like cheese, the paneer masala was excellent, as well. The mumbai dal was probably the blandest out of the curries I had, but it tasted like exactly what it was supposed to: lentil bean curry.\n\nIt's pretty small, though, so either plan for takeout or don't bring too many people. The guy working the counter was really friendly. Don't forget to grab a frequent-eater card; if you try it once, you'll definitely be coming back."
    },
    {
        "id": 93,
        "text": "This is a great little place with lots of vegan options.  The prices are very reasonable, and it's clean with friendly staff.  I would definitely go again."
    },
    {
        "id": 94,
        "text": "Weak. The food was somewhat seasoned, but you can't really tell the difference between curry chicken and tikka masala. Saag paneer was pureed. Chana masala was ok, but watery. Curry was very oily.  The worst was the naan.  Inedible. Tough on the edges dry in the middle, rock hard in several places. Veg samosas were good.  Mango lassi was bottled, not fresh. \nDefinitely wouldn't do it again"
    },
    {
        "id": 95,
        "text": "Generally I think Indian is expensive, but Mumbai Bistro offers affordable, delicious food. I always go buffet, and they're always clean and courteous."
    },
    {
        "id": 96,
        "text": "I got this as delivery to my hotel through the DIningin website. The delivery was prompt and pleasant. Of the food I got, the saag paneer was definitely my favorite--it was perfectly seasoned and just the right texture. The Lamb Korma was very tasty, too, but the sauce was a little watery."
    },
    {
        "id": 97,
        "text": "Love this place! I've never dined in or gotten the lunch buffet which sounds like a great deal but this is my favorite place to get take out from. The lamb korma is amazing and the veggie samosas are honestly the best samosas I have ever had. Plus it's dinner for two for under $20 every time, can't beat that!"
    },
    {
        "id": 98,
        "text": "I was walking home in the cold of night when I suddenly had the craving for hot, delicious samosas. I Yelped around for a bit and found this place, which was nearby. Even though I popped in fifteen minutes before closing, they served me my heart's desire (hot and fresh samosas)-- and I didn't intend to, but the prices were so inexpensive that I ended up ordering a meal and chai along with it.\n\nI had gobi masala with garlic naan and mint chutney. The mint chutney was not as savory as I would've liked and I prefer it room temperature rather than cold, but these aren't really things to argue about.\n\nI came again with my Grandma and ordered the vegetables Malai Kofta and was similarly impressed. I want to try the buffet next. The impression I'm given is that while their food is pretty good (excellent even, considering the price range and neighborhood) their samosas are the real kings of the menu to me. A great go-to."
    },
    {
        "id": 99,
        "text": "If you at all a fan of good Indian food, please do not even try to eat here.  Just had some made-to-order dishes along with food from the buffet (was eating with friends), and it was all pretty terrible.  Then again, you get what you pay for, and the food here is incredibly cheap.  It also tastes cheap.  If you want quality Indian, try Ekta, which offers the best Indian food in the city.  You'll get twice as much food at twice the price, but the quality is incredible.  All the curries I tried here were watery and oily and pretty much inedible.  The naan was disgusting and tasted like it was made days ago prior to being blasted in a microwave and served.  It's really terrible.  I couldn't even finish what I ordered.  If you aren't that familiar with what great Indian food could taste like and are on a budget, perhaps you should give it a shot.  If you want the real thing, try a better spot.  Ekta is still my #1 in the city,"
    },
    {
        "id": 100,
        "text": "Food is definitely reasonably priced and pretty tasty.  Glad it is only two blocks away from me.  \n\nCheck out their website.  Did anybody else notice the pictures of the army guys that pops up for two seconds when you click on the homepage?  Trippy and subliminal."
    },
    {
        "id": 101,
        "text": "This is my favorite Indian spot in Philadelphia. I used to order from Indian restaurant on south street, but I am now loyal to this place. I always get some naan and the paneer masala which is amazing. They don't use butter so it's much healthier than any other Indian restaurant I have eaten at in the city. It is also significantly cheaper than any other Indian restaurant in the city. The paneer masala is $4.50 rather than $10-15 at other places. Affordable, quick delivery, and healthy options!"
    },
    {
        "id": 102,
        "text": "On the heels of being overstuffed, I thought I'd right a fresh review.  I've wanted to try this place since it opened about a month ago.  It didn't disappoint.  \n\nThis is buffet style and it looks like they slightly change up their offerings from day to day - but only by an item or so.  Today, I tried the chicken tikka masala, vegetables malai kofta, and the mixed veg curry.  I thought the chicken and veg. malai kofta were really good but the veg curry was just so-so.  \n\nI'm not a fan of spicy food so if I go back I'll have to ease up on the sauces.  However, if you like spicy food, they do offer free hot sauce.  \n\nIf you're in the mood for quick, cheap Indian food, Mumbai will hit the spot."
    },
    {
        "id": 103,
        "text": "I sampled mumbai bistro for lunch today and i was pleased.  small, bright, clean space.  \n\nI agree with the reviewer who mentioned that the flavors are a bit muted in the cuisine, arguably to be palatable to a wider audience, but the food is tasty nonetheless.\n\nI opted for the $4.95/lb buffet bar, which changes daily.  the chicken in the tikka masala was a bit dry.  my favorite was the navratan masala.  i've never had this dish before, but it is mixed veggies with onions and peppers in tomato sauce.  yum!  and mildly spicy.\n\none plus with regard to the buffet is that you can take-out, which i do not believe you can do at the palace at the ben.\n\nall in all, mumbai bistro is a pleasant alternative if you are not in the mood for your usual fare.  the prices are reasonable, the service friendly and fast, and the food decent.  I will definitely return."
    },
    {
        "id": 104,
        "text": "Mumbai Bistro\nOrdered On Dec 8 2013 at 1:05 PM\n1  Saag Paneer  $ 6.20\n1  Chicken Tikka Masala  $ 5.25\n3  Tandoori Naan  $ 3.75\n1  Paneer Masala  $ 4.25\n\nThe curries were watery and didn't have an even consistency.  I don't think I've had a Saag that has literally been served with a layer of liquid on top. The Masalas were like indian soups. The flavor was pretty good, but the chicken was dry and the paneer wasn't very soft. Delivery was speedy. You get a lot of Curry for the price. So if you are new to Indian food you probably won't mind the lack of quality. However, if you are quite experienced with the cuisine as I am then I suggest trying another restaurant in the city. I give the taste 1 star, but because it was very very affordable. I gave them another star. I don't ever award stars for service (but the delivery was fast and the driver was pleasant), so the rating stays at 2 stars."
    },
    {
        "id": 105,
        "text": "This is a snappy cafe to eat quick or hoard food in take-out containers and eat it at home.  The food is good and so cheap.  The guy who works there is also very friendly.   If this was close to me I would pop in for lunch all the time."
    },
    {
        "id": 106,
        "text": "My friend was in town visiting from NYC and we wanted to find some Indian Food near the gayborhood.  After checking yelp we found great reviews for the Mumbai Bistro.  We then invited our friends to drive from Germantown to meet up with us for dinner.\n\nWhen we arrived it was A LOT smaller and more casual than we were expecting.  Essentially it is Indian fast-food.  There are only about 6 small tables and a buffet of about 6 options.  We called in advance to make sure that it was BYOB and they assured us that it was, however, I think we may have been the only people in Mumbai Bistro history to take them up on that.  We felt a little silly downing our two bottles of wine in plastic cups while the only other patrons (a couple with two young children) eyed us suspiciously.\n\nWith that being said, the food was incredibly tasty and cheap.  My entire meal including Nan and drink was around $5.  It's neat the way they set it up where you weigh out your food from the buffet.  That way you get a range of options to choose from but don't have to pay a hefty buffet cost.  The saag paneeer was my favorite of the buffet dishes.  If there is something specific you like, the a la carte prices were also incredibly reasonable.\n\nThis place is truly awesome!  I wish they had one in my neighborhood!!"
    },
    {
        "id": 107,
        "text": "I have to admit that I was not a fan of Indian food before I came here! The buffet is a great option, and so cheap. It's a great way to try out new items. Always fresh and the people are really nice. I will always come here when I have an Indian craving!"
    },
    {
        "id": 108,
        "text": "I am new to Philly and was looking for a good, solid, Indian place to be my go-to. Unfortunately Mumbai Bistro will not be it. The prices were good but the portions small.   My Saag Paneer was very oily and the Chicken Tikka Masala was bland. We also had Garlic Naan which seemed to have been made looong before it ever made its way to us. Indian food is nothing if not flavorful, and I was disappointed. The search continues."
    },
    {
        "id": 109,
        "text": "One of the better Indian places in the city. Food looks and tastes fresh. Easy on the stomach and on the pocket. \nThe number of dishes may be less, but whatever is on the menu is cooked nicely. Nothing is overly done with cream or spices. Perfectly cooked. Today was my first time here, and I am definitely going to frequent this place.\n\nAlso, Mumbai Bistro is located on the intersection of DELHI street and Locust st. (between 9th and10th), which is kind of ironic :)"
    },
    {
        "id": 110,
        "text": "Awesome food - this is our go to takeout place.  Ordering online is super quick and the food is consistently great.  We make a lot of our own Indian fare and have had trouble duplicating the quality of the dishes on the menu."
    },
    {
        "id": 111,
        "text": "I've been walking past this place for months waiting for them to open, and was finally able to check them out on their second day. \n\nThe other reviews that mention that it's cheap and fresh with somewhat muted flavors are accurate. The samosas were awesome; really fresh and only $2 for 2 of them. That is insane. It'd be cheaper and more delicious for me to eat these samosas than cook any meals, so there's a good chance that that's what I'll do."
    },
    {
        "id": 112,
        "text": "Thrilled!  Gluten free Indian food!!  YES!!!\nThe food is awesome, I can eat without worries, its affordable AND they deliver.  This place is one of the greatest places on town!"
    },
    {
        "id": 113,
        "text": "Ordered takeout/delivery. Reasonably priced, appropriate for the quantity. The delivery menu is very limited compared to the regular menu. Threre is a 5.99 delivery charge and a $15 minimum, and you still have to tip the driver. Potato samosas: good. Chicken Curry: ok - very oily which is surprising as this is supposed to be \"healthy\". Chicken Biryani: good. Garlic Nan - ok, nothing great. Tandoori chicken - ok, a little dry. Lamb curry: good quality lamb chucks but very few pieces. Overall, not bad but nothing great."
    },
    {
        "id": 114,
        "text": "My absolute FAVORITE place for lunch by Jefferson. Food is fantastic, service is fast and friendly. Has great gluten free and vegan options. I probably eat here about 1-2 times per week. And you truly can't beat the prices anywhere around here. 10 stars for Mumbai Bistro."
    },
    {
        "id": 115,
        "text": "Kinda cheap, and not in the good way. No rice with delivery orders. Be warned. Employee at restaurant was not helpful when I called to ask where is the rice. Only Indian restaurant I've ever seen do this... And again,, not a good thing."
    },
    {
        "id": 116,
        "text": "Been here several times and is always tasty! The staff is friendly and the buffet is reasonably priced. I especially like the Naan and samosas."
    },
    {
        "id": 117,
        "text": "We did pay by the weight and paid $16 for about 4 servings of bomb Indian food.\n\nWhy would you NOT go?"
    },
    {
        "id": 118,
        "text": "So happy I passed by here on my way home from work. This little, cozy place is clean, doesn't reek of indian food 5 blocks away and is extremely affordable. I especially appreciate the dietary restriction awareness campaign they have going on (aka labeled V, GF, LF etc). \n\nI really enjoyed my dinner and the staff was so friendly! Of course I'll go back."
    },
    {
        "id": 119,
        "text": "Went here on a whim while waiting at the hospital and was glad to have found it! Very fast and affordable food served in a cute and clean storefront. The staff were all incredibly friendly and the food hit the spot, offering many selections for vegetarians, vegans and those who go gluten free. The complimentary water was a plus for someone like me who goes overboard on the spice! Definitely recommended for those looking for well priced food, some pretty good Indian cuisine or for those with dietary restrictions!"
    },
    {
        "id": 120,
        "text": "The food here is hot, fresh, and not that expensive but it's different from authentic Indian food. Perhaps because of all the gluten-free stuff. Tastes are different than what I'm used to but that happens at almost any Indian restaurant. Or it may have something do with them not using butter or ghee. The naan is also not their own I'm pretty sure. It looks like the frozen kind.\n\nI'll still come back every now and then, but only in a group. If it's up to me I'll always pick something else. \n\nNot a lot of seats here so the place can fill up fast during lunch.\n\nI did like that the samosas were big but they only had 1 type of chutney and I'm a spicy-mint chutney kind of guy, otherwise I can never really enjoy my samosa experience. \n\nIf you absolutely must have Indian food and don't want to venture out to University city or even a little farther into Center City, then this is an okay spot. When I go out for Indian food, taste is what I am looking for above all else. Other people may really like this place since they are gluten/butter/ghee free. I'm just not one of them. \n\nI can't really comment on the service because you serve yourself here. The best thing about this place is that it's consistent and managed well, but other than that, I can't say that this place really impresses me.\n\nWhen it comes to Indian food there are a huge number of recipes for any one dish. It might be a good idea for them to try a few different ones for each and see if they fare any better."
    },
    {
        "id": 121,
        "text": "Does not even deserve 1 star. Had lunch today during my short business trip. The buffet was so poor quality that I have hardly had in other Indian restaurants. Will never go there again."
    },
    {
        "id": 122,
        "text": "Lunch buffet is good. Decent number of choices.\nPrice is reasonable.Good crowd generally hospital staff which is nearby.\n\nPlace is a bit small. Difficult to find. Generic Indian food, might wanna try other Indian restaurant if u are looking for authentic taste."
    },
    {
        "id": 123,
        "text": "Mumbai bistro is great for convenient Indian food. It's very casual and I typically take my food to go. It's no New Deli, which is all the way in University City, but it curves my craving for Indian food. I always get their Mutter paneer, their chicken tikka masala, and basmati rice from the buffet bar with a side of naan.\n\nI haven't gotten anything from their take-out menu yet, but I'd only get the mutter paneer and chicken tikka anyway. Wonder if I'd get a better deal if I got those sides separately, with rice and naan?\n\nDefinitely coming back when I need my quick fix."
    },
    {
        "id": 124,
        "text": "not the best but not the worst indian food i've eaten. i was in a hurry and grabbed some food from their buffet. for less than 10 bucks, i had a very filling meal of chicken korma, chicken tikka masala, channa dal, and saag paneer over basmati rice. buffet food is based on price by weight and obviously very affordable. the flavor of the different dishes was comme-ci, comme-ca. i'd still head back to the indian restaurant on south st for future meals, but this place is completely acceptable for a quick, filling meal at an affordable price.\n\nbonus: staff is friendly.\nbonus2: the restaurant is super clean."
    },
    {
        "id": 125,
        "text": "Mmm Mmm!! I have eaten here quite a few times and I have always enjoyed the tasty food!\nI'm a vegetarian and there's a variety of options on the menu I could choose from. Usually my favorite choices are the veggie samosas for an appetizer, any of the naan breads, rice, sag paneer or channa masala, and a lassi to drink.\nI ordered for delivery before and they were right on time. I also did take out and dined in the restaurant. It is small in there, but the employees are friendly, and the food is always fresh!"
    },
    {
        "id": 126,
        "text": "Very convenient for if you need to grab food and go. They have a really small buffet with rice and maybe 6 different entrees, typically with like 2 chicken dishes. You can eat there, but there's only like 4 tables. \n\nThe food is cheap: $5.75 per pound, or you can alternatively purchase other stuff a la carte. Boo on no naan directly at the buffet.\n\nThe chicken tikka is really tasty, and so is their saag paneer."
    },
    {
        "id": 127,
        "text": "The food is fairly average Indian food - I've had better but its satisfying enough and for the affordable cost, I would recommend it. It would be hard to find a more inexpensive place for this volume of food, even if it isn't the highest quality. I did particularly enjoy the malai kofta, and this is something I'll order the next time I'm craving quick, cheap Indian food. It's buffet style/by the pound so you pay for however much you get. \n\nVery limited seating inside, but most people seem to get the food as takeout during lunch breaks and what not."
    },
    {
        "id": 128,
        "text": "They get the job done.  Not the best Indian cuisine but it satiates my taste for Indian food.  The are great with delivery and are within the time frame that they post.  Id order from them again if i'm in a crunch at work and cant run out."
    },
    {
        "id": 129,
        "text": "For someone like me who usually orders in most of my meals, this place is great..\nThis is as close to \"home cooked\" indian food as it gets - I just wish they had something like this closer in university city.\nTry their paneer masala, matar paneer and chana for sure."
    },
    {
        "id": 130,
        "text": "I got their chicken biryani and it was delicious. I would definitely get food from here again, but their delivery fee is too much for me (i tried ordering on he website and it said $5.99). Otherwise, i'd be ordering from here a lot more often."
    },
    {
        "id": 131,
        "text": "The atmosphere was friendly and the food was adequate. I went on a Thursday and had the chicken tikka masala which was okay but could have been much better. The vegetarian options on the other hand are absolutely delicious. Over all pretty good for what it is and I will come back."
    },
    {
        "id": 132,
        "text": "Very good, convenient, fast and inexpensive. I am a fan of indian food and have a few in the area, from Nala, Bagles in Exton and Spice in West Chester, to Tamarind of Tribeca in NY. Mumbai Bistro delivers the goods. Great concept, good service and satisfies my Indian food cravings during office lunch breaks, or when my wife and I are in a rush and cannot cook, quick take-out stop and we are set for a nice meal."
    },
    {
        "id": 133,
        "text": "Have gotten delivery from here many times. We like to get the lamb samosas, chicken tikka masala, chicken vindaloo or chicken curry. All white meat and spice levels can be adjusted-we like it pretty spicy. The onion and spinach naan are really tasty and arrive warm and fresh. Price points are reasonable. My only criticism would be I am not a fan of the biryani.  Definitely give the a shot. I believe the do a buffet at lunch."
    },
    {
        "id": 134,
        "text": "Great place to get delicious food cheaply and quickly. Love the easy online ordering from the website...I got takeout on short notice and the food was ready when I arrived. I got a pretty decent amount of chicken tikka masala, basmati rice and a garlic naan for less than $10, enough for a full dinner and some leftovers! Wish the chicken tikka masala sauce was a little spicier and thicker but it was otherwise good. \nLooking forward to the buffet another time!"
    },
    {
        "id": 135,
        "text": "I'll try not to be too harsh but originally I was going to give this place only one star. \n\nOk, I've just finished dinign at Mumbai Bistro where they sell Indian food for $4.95 a pound. The menu changes everyday and today we were greeted by four vegetarian dishes and two chicken dishes. My problems with the place is as follows:\n\n1. The location used to be a sushi place and it was relatively cool (temperature-wise), now that they are an Indian restaurant with a hot food kitchen in the open and a hot bath setting to keep the food hot. That place is a sauna, the ventilation is non-existent and eating inside is quite insufferable. \n\n2. Six items today, four of them are vegetarian, three of them are masalas that taste very much alike. By the time I get to the chicken masala, there were only two cubes of chicken left and I was forced to just get one cube so my friend can have some. Of the twenty minutes we were inside, they didn't think to replenish the food, so I guess customers who came after us won't get a taste.\n\n3. We got each a light plate, two sodas, two chutneys and shared one slice of onion naan and it cost us $19. With the selection so few and every item cost extra, you might as well pay a few more bucks and walk two more blocks to the larger all-you-can-eat buffets. \n\nThe food didn't taste bad, in fact it's nicely spiced but the heat is just too uncomfortable (maybe I wouldn't complain as much when its cold out), the value was just not good enough to make me go back unless I was famished and I'm too lazy to walk the two blocks then I might go back for take out."
    },
    {
        "id": 136,
        "text": "Inexpensive, hearty, healthy and tasty Indian buffet.  What more can I say and what more do you want?"
    },
    {
        "id": 137,
        "text": "So since my initial review, I came here 2 more times. That's three times within one week because it's just so good, so cheap, and delicious. I've had the lamb korma, the biryani, lamb curry and chicken tikka masala. I can't even say which one is my favorite because they're all great, but if I had to pick one I'd say the lamb korma. The garlic naan is also a must. \n\nTo keep it more affordable and so we could order more main dishes, my boyfriend and I made our own rice in the rice cooker right  before we left to pick the food up. The food was ready and so were we before the rice was even cooked. Now that's awesome."
    },
    {
        "id": 138,
        "text": "Wow! This food is so freash tasting & delicious, especially for the price. It's not all heavy in sauce and over spiced, as some Indian food can be. I got the Chicken Tikka Masala, basmati rice & a little vegetable curry on the side. I also got the garlic naan which was nice and warm, and delicious. It's also great that tehy have the self serve bar because there are so many different choices, and I have trouble picking one when they all look so delicious. I also got a coupon for $2.00 off when you sign up for the email list, so that was definitely a plus! I will without a doubt be going back here again, but it might become a dangerous addiction, seeing as my work is a block away."
    },
    {
        "id": 139,
        "text": "Excellent! I never eat Indian food and I really loved this place. It is very tiny, like 5 or 6 double tables but clean and modern. You can either choose to order from the menu on the wall or pay per plate/weight from the hot bar that has about 7 things to choose from. I chose the hot bar and and a full plate was $5.75/lb, my whole plate came to about $8. The food was SO tasty, like amazingly tasty but maybe that's because I never have these flavors. Overall great!"
    },
    {
        "id": 140,
        "text": "Great Indian - especially for delivery when you're in the mood for a really satisfying meal. I've really enjoyed everything on the delivery menu that I've tried.  The paneer dishes are great - so flavorful.  The chicken tika masala is solid. \n\nThe prices are incredibly affordable  but don't forget to order the rice separately for each dish. The rice and naan do not come with the dishes.   \n\nI also like that you can order delivery online. This is becoming a go-to delivery place for me. They're also very punctual!"
    },
    {
        "id": 141,
        "text": "After quite a bit of chatter, Mumbai bistro finally opened last week as a welcome addition to the buzzing neighborhood. The whole concept is to deliver fresh meals on a budget, and I believe delivering on a wholesome food promise without putting a dent on my wallet is a healthy proposition.\n\nThe is no décor per se, a small dining area if u want to eat in, and a fridge loaded wid goodies and ofcourse the buffet line complete the place. One of owners, Kyle manned the register and he patiently explained about the 4.95$ per pound of food,  the daily rotating food menu, the vegan and the lactose free menu items. The service is absolutely fantabulous and very welcoming.  \n\nIt is funny that I couldn't picture how much a single pound of food would look like, and I was pleasantly surprised to fill most of the plastic container with about a scoop of most things and a couple scoops each of my favs, all in 1.5 pounds. I am not a big fan of the buffet line, just cos I generally hog tooo much and am rendered useless for most of the afternoon but  this blows that theory out of the pond.\n\nThe menu changes daily, and includes fan favorites like chicken tikka and paneer masala, but there are also some of the more homely dishes like saag paneer (spinach / mustard leaf gravy) and aloo gobi ( potatoes and cauliflower ) which hold more appeal to me. I felt some of the curries were a bit bland, but nothing too bad. Only the entrees are lined on the buffet, but not the rice, breads and the appetizers, so that's an extra as u complete the meal. U can pick one of the lassi or mango drinks from the cooler to fight the heat and a dessert to seal the deal.\n\nSo if it is gluttony on the cheap u are looking for, this might not be the best bet. But if u want curries , kormas and vegetables to taste the way they intend to and not like overused baking soda u have chosen wisely my friends. Very Wisely.\n\nCheers"
    },
    {
        "id": 142,
        "text": "The food was a disappointment. The pickle smelled weird.\nWould not recommend this place to anyone looking for authentic indian food"
    },
    {
        "id": 143,
        "text": "I'm a big fan of Mumba Bistro. It's my go-to when i want to eat something for lunch that actually feels like a meal. I like the rotating menu and that the food always looks and tastes freshly prepared. Also, the prices are way more reasonable than you will find at any of the other Indian places in the area. I also really appreciate that they take cards and don't require a minimum purchase. Meatless options dominate the weekly rotating menu but i don't mind. The paneer masala is a particular favorite of mine. \n\nThere are only a couple of problems with Mumbai Bistro. The first is the size of the shop. It's really tiny with just a handful of tables. Dining in is usually not an option and you certainly can't go there for lunch with a group. The second little issue is that the naan is the kind you get frozen in bags at the grocery store. I understand that making fresh naan all day can be impractical for such a small operation, but i have to say i'd prefer it. I'd also prefer a freshly prepared mango lassi over the bottled ones they carry.\n\nDon't get me wrong, im just pointing out the drawbacks. I certainly recommend this place over any other lunch i can get in the area. The service is fast and friendly. The food is delicious. I set up my takeout with the same naan and mango lassi I was just \"complaining\" about so that shows how much i care about that."
    },
    {
        "id": 144,
        "text": "Delicious food on the per pound buffet, friendly service, nice ambiance, reasonably priced. I'll be back!"
    },
    {
        "id": 145,
        "text": "I had the chicken corma and a garlic naan. It was a little watery, and the naan was a little small. But ultimately it  was close, cheap and good. It wasn't the best I ever had, but it sure was better than the other options before me."
    },
    {
        "id": 146,
        "text": "My absolute FAVORITE place for lunch by Jefferson. Food is fantastic, service is fast and friendly. Has great gluten free and vegan options. I probably eat here about 1-2 times per week. And you truly can't beat the prices anywhere around here. 10 starts for Mumbai Bistro."
    },
    {
        "id": 147,
        "text": "It is so easy to eat at Mumbai Bistro as a vegan, everything is labelled, so you don't have to ask what has dairy/ghee/etc.! I really enjoy the vegan dal, but the buffet rotates daily (so check the menu before you go). You can also get a la carte items. I aways grab a vegan samosa and vegan naan! The interior has only a few tables, but you can eat around the Jefferson University campus if it is a nice day."
    },
    {
        "id": 148,
        "text": "This is a great spot if you're in desperate need for decent home-cooked Indian food but are in a rush and can't bare to wait for the food to be served to you. This place...I guess it could be called a restaurant given there are some tables and seats, has two sets of menu, one that is weight-based and one made to order. The food is about $6-$7 per pound, which can add up if you buy heavy items like chicken or lather on the sauce. I only tried the chicken vindaloo over the weigh-station, which was decent. My favorite was actually the mango lassi, served at a generous portion given the cost and the texture and complexity actually took my taste buds to do a double take.\n\nLong story short, come here for the lassi and while you're at it, maybe get some good ol' fashion Indian food as well."
    },
    {
        "id": 149,
        "text": "Great food - hot, fresh, tasty and a nice variety of dishes on the buffet. \n\nCheap prices - two people can eat heartily for around $15. \n\nClean atmosphere - the eating area is small, but immaculately clean. \n\nNice people - the guy at the register is incredibly friendly, an unexpected bonus. Other restaurants in the City could learn a lesson from this place, drop the pretension and serve good food at a decent price, while providing friendly service!"
    },
    {
        "id": 150,
        "text": "I'm not an Indian food connoisseur by any means. All I know is that the food here is good and the prices are great!"
    },
    {
        "id": 151,
        "text": "I am obsessed with this place. The guys who work there almost know me by name, which is kind of embarrassing. I always thought I hated indian food so I went here with a co-worker to give it another try. It's probably super americanized, but I don't care. This stuff is amazing. For $5/lb you can mix and match whatever you want from 5 daily rotating items. Recommended: mali kofta and chicken vindaloo. Don't forget the naan, the onion is delicious and has spices (cilantro?) in it. Since it's help yourself, I always get too much food but I never spend more than $9, and I am full for at least 5 or 6 hours after. They also have a frequent visitor card which I obviously have, 1 free pound for every 8 or 10 you buy."
    },
    {
        "id": 152,
        "text": "Delicious, cheap Indian food close to Washington Square.\n\nThe breaded veggie tots/dumplings were perfectly spiced, along with the paneer.  For $5.49/lb., the deal is tough to beat in center city.  \n\nI ordered takeout, but there are 3 or 4 tables for dining in.  They also have a more extensive menu, but I opted for the buffet.\n\nWhile the food wasn't piping hot, all but the black dal dish were exceptionally tasty.  6 out of the 8 options were veg-friendly, and of those  2-3 were vegan.  It doesn't beat Kabobeesh in West Philly (arriving soon on South St.), however I highly recommend Mumbai and will be back soon."
    },
    {
        "id": 153,
        "text": "Mumbai Bistro is good Indian food with a great price.  They have a pretty limited selection but the food they have is good quality and costs $4.95 per pound.  They also sell naan and stuff like that.\n\nIf you have a craving for some quick chicken tikka masala or chicken korma, and don't want to spend a lot of money, check them out for sure."
    },
    {
        "id": 154,
        "text": "Unfortunately I didn't like the food! Food came out way too fast lamb curry had no flavor! 4 cubes of lamb and rest were gravy. The decor and the area was really neat! Maybe I got the wrong item but I don't recommend lamb curry!"
    },
    {
        "id": 155,
        "text": "Ordered from here a few times, the food is decent, but i will say the last time I ordered the Chicken Tikka Masala it was very watery along with the chicken curry. I get it, it happens, but the food is consistent and they usually deliver pretty quickly and are very well priced!"
    },
    {
        "id": 156,
        "text": "This place is incredible.  On an average day I'm used to a run-of-the-mill hoagie for $6.50.  Now, I can go to Mumbai and get a much healthier and much more enjoyable meal for less.  \n\nDefinitely a great place for a quick, satisfying lunch."
    },
    {
        "id": 157,
        "text": "Finally found an Indian restaurant I can't get enough of! Praise to the heavens!\n\nFor my vegan foodies, vegetable biryani is mind blowing. Veggie samosas are hit or miss but mostly good; can be greasy at times. Great spot for lunch or take out.  I'm a fan!"
    },
    {
        "id": 158,
        "text": "This place is definitely one of the cheapest places in Philly!  Especially for the quality of what you get.  Tiki Masala and spicy chicken are very good.  Wouldn't recommend the tandoori which is only reason for 4 stars, everything else i've had is yummy"
    },
    {
        "id": 159,
        "text": "You can order online through their website.  They're super fast to make up your order, at least when I got takeout.  I had veggie byirani, veggies in tomato, and chana masala, all were very good, very cheap, and I would definitely have it again.  Leftovers were still yummy."
    },
    {
        "id": 160,
        "text": "So cheap, good service, nice spicy (not spicy hot) food. A pound of food for $5, I'm nearly done with my third \"buy 10 meals get one free\" card. And if you want something smaller and cheaper than a whole meal, get those samosas and the dipping sauce. Helps save a pathetic jeff dining scene."
    },
    {
        "id": 161,
        "text": "Really good, decently priced Indian food. I can only attest to their delivery but it's been amazing every time!"
    },
    {
        "id": 162,
        "text": "Fresh tasty buffet Indian food. Always pleases. Definitely a step above W. Philly Indian fare. Samosas are good but could use a bit more flavor. Still I always get them.Only complaint is whenever I go the choices 3-4 veg and 2 chicken options always seem to be the same. Still delicious however. Ask for hot sauce which is very flavorful w/o being too spicy."
    },
    {
        "id": 163,
        "text": "Pretty good, Ordered delivery and got the lamb korma, Veggie samosas and the tandoori chicken and a side of naan with paneer in it. I was happy with it, even though I think at the price it could come with rice. Still I'd order again."
    },
    {
        "id": 164,
        "text": "Discovered this place on lunch break with my coworker when we were looking for something something quick to satisfy our Indian cravings in Center City. It's tucked into a cozy corner in the Gayborhood and is surrounded by a number of other homey local businesses and boutiques.\n\nWhen I first came in, I noticed that their buffet options were a little limited, and I was feeling a little picky. Saag Paneer (minced spinach and cheese cubes with spices) is one of my favorite Indian dishes, and I was a little bummed that it wasn't available at the buffet (which is super cheap--$5.25/lb!), but ordering it as an entrée would have been a great economical option too, at only $4.75. The dishes available at the buffet were still great, though! I got both the Chicken Tikka Masala and its paneer counterpart, and they were flavorful and went well with rice. Their Gobi Masala (cauliflower and potatoes with spices), in my opinion, was the best thing I had there. It had a slight kick to it, but overall it had a good texture, was filling, and was definitely healthy and fresh. I also had a mango lassi, which was surprisingly creamy and a fresh way to round off a rich meal.\n\nThey don't use butter or ghee, and the vegetable oil they use to cook has 0% trans fat. Something great and healthy to keep in mind!\n\nOverall, the food was filling, healthy, and pleasantly affordable. I'll definitely be back!"
    },
    {
        "id": 165,
        "text": "I am sadder than can be imagined at the loss of MB. I'm the guy with the nose ring that came in all the time and ate my food within 5 minutes cause it was so damn good. Everyone in the kitchen would be so friendly and say hi every time. Please tell me where I can still find this food to keep my life from falling apart. Noooooooo"
    },
    {
        "id": 166,
        "text": "I am so lucky to live a block away from this place. Sometimes, it's difficult to resist stopping in, because I walk past it several times a day. I guess there are worse problems to have than knowing there is always fresh, delicious Indian food waiting for me! The vegetarian & vegan options are even so good that a big ol' meat eater like myself can't resist them. And while the food is wonderful, the space is always immaculate and I love working up to a free pound of food on my punch card - my favorite thing about this gem of a restaurant is each person who works there. I have never once been treated like a regular customer... I feel like I've known the guys there forever, and that they are my friends. We always strike up a great conversation and that makes me feel awesome."
    },
    {
        "id": 167,
        "text": "A friend and I who are Vegan and Celiac respectively decided to try this place out because it accommodated both of our restrictions and was a few blocks from his apartment. I think I've now found a new favorite takeout place.\n\nThe food was really good, particularly for takeout and you could taste that their claims of using fresh natural ingredients are true. The interior was very clean and well designed for such a small space with a food bar. The selection was well curated, which I appreciated because I am overwhelmed by food bars that are too big. I loved the prominent Gluten Free and Vegan labeling of all of the dishes. And, when we paid at the register I was shocked by how cheap everything was. I definitely have a new detour from the Whole Foods Salad Bar a few blocks away on South St. \n\nNote: As someone slightly neurotic about cleanliness, I thought that everything here felt super clean. Another reviewer noted that they thought they got food poisoning here because they were sick the night they had dinner here. Generally food poisoning (particularly from meat) takes at least 12 hours to develop (but we all tend to blame the last thing we ate) so this place may not have been responsible, but something eaten earlier in the day . . . just a thought."
    },
    {
        "id": 168,
        "text": "This place was a good surprise, I am really picky when it comes of Indian food. This place cooks and serves in a healthier version.\n\nThe concept of buffet here is little different here. The buffet includes here 4-5 curries like chicken tikka, dal, malai kofta, chicken vindaloo, Chana masala, rice. They do the buffet items for each day. One can buy the buffet style food and it is paid for each pound. Even if one fills up the entire plate it is still really inexpensive food. The only thing is that everything else like naan, roti, any appetizers are not included in the buffet and have to be ordered separately.\n\nI had the buffet with three curries-\n*Chicken Tikka\n*Malai kofta\n*Paneer masala\n*Rice\n\nI ordered naan, aloo paratha and tandoori chicken appetizer separately. Everything together was less $12 bucks and it was a lot of food.\n\nComing to the taste I really liked the paneer masala and chicken tikka. My naan and aloo paratha were really fresh too. The tandoori chicken was delish, really liked the sprinkling of chaat masala on top of my chicken . \n\nOverall a good place to dine in and enjoy healthy food!"
    },
    {
        "id": 169,
        "text": "YUMM!! The food was so tasty and flavorful. Also, definitely the cheapest indian food i've ever had which is great because usually indian food is 2-3x the price of this food so it's perfect for indian food on a budget. It was my first time ordering from there but i'm definitely going to be a regular customer from now on :)"
    },
    {
        "id": 170,
        "text": "Ok...So I'm big on authenticity of restaurants, unless they specify they are a fusion restaurant. Walking into Mumbai Bistro I was a bit cautious. There was no overwhelming fragrance you get at Indian establishments that wrap you and linger with you the rest of the day, it was an almost sterile environment. \n\nBut the food was still very aromatic (as Indian food is supposed to be) and not half bad. I would not make a special trip back, but if I was in the area and wanted a quick bite, I'd stop in again. {Had Paneer Masala + Naan + tea = $10}"
    },
    {
        "id": 171,
        "text": "Great prices, delicious food (my tandoori chicken was very tender). This restaurant is very clean and the staff are nice. I'll come back!"
    },
    {
        "id": 172,
        "text": "Absolute best Chicken Vindaloo in the city.  Food is always plentiful, lots of protein, expertly spiced, very clean restaurant, great prices."
    },
    {
        "id": 173,
        "text": "Mumbai Bistro has become one of my top lunch spots in the past few months, with me stopping in at least once a week. I love how fresh all the food is in the buffet, unlike some other local Indian places I will not mention. They switch the items offered in the buffet everyday, so you really know you're getting something new every day. The food has a great spice mix to it, and at $5/lb, it certainly gets you a great bang for your buck for a quick take-out lunch. I also like that they clearly label all the foods and add whether it's gluten free, vegan, etc. Extra bonus is the free hot sauce that comes with.\n\nThe gentleman at the counter is always super friendly and reminds you if you want to pick up some naan, which is an extra charge."
    },
    {
        "id": 174,
        "text": "Indian \"Fast-Food\" style.... yes please!  You can order an individual entree if you want, but I recommend just serving yourself at the buffet.  I got some chicken curry and tikka masala, in addition to daal and some sort of spicy vegetable dish.  All tasted great, and I was pleasantly surprised with the consistency of the basmati rice.  The staff were really nice and the place is small but meticulously kept.  I would give this place 5 stars if they included naan in the buffet."
    },
    {
        "id": 175,
        "text": "Affordable Indian lunch? Hell yes! Great naan. Food is self serve, pay-by-the-pound style. You can eat there but it's much better suited to grabbing and going. If you want a specific dish, I'd avoid it. They make what they make and replenish it regularly. It's usually chicken tikka mansala, some rices, some biriyani, paneer, etc. samosas and naan are extra but totally worth it. \n\nDisclaimer: this is not authentic Indian food. It is to Indian food hat your local Chinese place is to Szechuan cuisine. It's tasty but not the authentic article. But, to their credit, they don't position themselves as the \"authentic, home style Indian place.\""
    },
    {
        "id": 176,
        "text": "The website states that they try to make their food more healthy than typical Indian restaurant food. This is definitely a true statement- the food at Mumbai Bistro is the closest that I've had to what real homestyle Indian cooking is without having to cook it myself. The restaurant is right by the 10th and Locust PATCO stop, super convenient. Their dals (there's always at least one) are always flavorful. Chicken items are good, too."
    },
    {
        "id": 177,
        "text": "3.5!\nGood place for a fast, inexpensive meal.\nSaag paneer was okay, but I have definitely had better. It didn't seem like a lot of spinach was mixed in..sauce was thin.\nChicken tiki masala was good. Still sauce was very thin.\nLamb Vindaloo was spicy like they said it wood be.\nBasmati rice is shiny with some oil or butter. I prefer it plain.\nEverything taste good. All the sauces were thin.\nThey have a buffet and prices are inexpensive.\nI've definitely had better indian food, but this is good for a quick stop."
    },
    {
        "id": 178,
        "text": "Being a novice to Indian food, I was curious yet skeptical each time I passed Mumbai Bistro. Finally after a little encouragement from friends, I got over my hesitations, and finally tried out this place. If you are unfamiliar with Indian food, this is the right place to come try it out. The buffet holds many options with very clear descriptions of what it contains and how spicy it is. I can't really tell you what I got other than the chicken masala, dal, and a couple of vegetable things. They were all REALLY good, but extremely salty (is Indian food always like that? I have no idea). I ordered garlic naan on the side because carbs are carbs, and its hard to mess up a good thing. \n\nI would say that I brought home the plastic container and placed it in my fridge because I wasn't hungry yet, but then I didn't feel like microwaving the plastic later on was a good move, so I microwaved it on a plate. A lot of the things got mixed together. While that was not a bad thing flavor wise, it just left me with even more confusion over what I just ate, so I would advise dining in (its so nice inside!) or eating immediately when you get home. \n\nI need to mention that I have a SERIOUS hesitance to buffets. Like, I refuse to eat at them. This restaurant is so clean, well maintained and modern that I did not have any reservations. You really wont feel wary about dining here (something that I have high standards for!)\n\nI am looking forward to coming back to Mumbai Bistro, hopefully next time actually knowing what I eat :)"
    },
    {
        "id": 179,
        "text": "So I ordered delivery from this place last night. \n\nFirst thing you'll probably notice is that the options are incredibly cheap. Literally $6 for most of their \"entrees\". Reasonably, the quantity of food that is provided is on the skimpier end. If you're particularly famished, might I suggest ordering a few sides but good luck because your options are either rice, naan, or $0.50 dressing container of raita or a $0.75 container of pickled vegetables. \n\nDue to my binge eating tendencies and the dreaded delivery minimum I went with 2 of each of the sides and a saag paneer for myself and chicken curry for my main bish. \n\nGood news is that delivery via caviar is quick and painless. Food arrived in 30 min or less, just as promised. Food arrived actually even earlier than my friend lol. \n\nImmediately I noticed that my \"saag paneer\" was actually some paneer cubes with a touch of spinach and bowl of cooked onion slices. Literally I've seen french onion soup with less fucking onions in it. It was absolutely fucking vile and I couldn't eat it. If you love onions, good for you but this was repulsive to me as I hate those evil shit pieces. I literally just ate like 4-5 paneer cubes and had to throw the rest out. For the love of god I know Indian food has onions but they're usually like ground/diced and cooked down so much it doesn't bother me and I barely notice it. It seemed like they didn't feel like putting anything else besides onions in there. The flavor itself without the onions wasn't that great either, I've def had better indian food in Philly. \n\nThe pickled vegetables were the weirdest fucking flavor of shit I've ever tried. For one, I had no idea what the vegetable was. Secondly there was an odd sourness combined with a lot of heat. I couldn't eat this either.\n\nThe raita was good. I wish i had ordered more of it. Needless to say, I'd skip this place next time."
    },
    {
        "id": 180,
        "text": "Came here for take out. Clean, small, place. The staff were nice. $10 min for credit card. I got the lamb vindaloo which the menu indicated that it would be spicy, but man oh man it was intensely hot--and I am the person that takes her spicy food well!! Maybe I have been out of practice but the level of spicy actually made my stomach uncomfortable, especially the morning after....hence the lower rating. I won't mind going back and try their other dishes though. They claim to be gluten, vegan friendly which is great."
    },
    {
        "id": 181,
        "text": "I finally tired the buffet here for lunch the other day and was happy I did so. I have not had much Indian food in the city but this was especially good for buffet pay by the pound style. The names of most of the dishes elude me but the Tikka Masala stood out as my favorite of the 6 varieties they offered that day. There was about 3 veggie and 3 meat options which was a nice mix. In addition there was rice to build the base but this batch was the most disappointing part of the meal as it was pretty dry. My only other complaint was there was no spice in any of the dishes although they do offer free hot sauce to add on which helped a little.\n\nThe guy working was very friendly. Make sure you add on a piece of naan for an extra buck to soak up all the goodness. I will definitely be back as this was $9 well spent to get a little lunch variety."
    },
    {
        "id": 182,
        "text": "I work in Center City-Philadelphia and I am always looking for good spots to order  lunch from. Also, I'm always on the hunt for an authentic chicken biryani since my favorite spot shut down \"Palace at the Ben,\" I am so called a Biryani hunter.  While browsing yelp to find the lunch of the day, I decided to give Mumbai Bistro a try. \n\nMy chicken biryani tasted like home cooked biryani and the portion was decent. For less than $8, it turned out to be good, and I would order it again. However, my hunt for a delicious biryani still will not ends here.\n\nI tried for the first time the RasMalai and I absolutely loved it, probably it became my favorite indian dessert. It was soft balls or dumplings made from cottage cheese which I'm usually not a big fan of, but being soaked in the thickened and sweetened milk gave it a whole different taste and texture. The RasMalai was served chilled and garnished with nuts- I think I tasted crushed pistachios, almonds and definitely cardamom. My favorite spice: cardamom, the scent of it was just lavish! \n\nLunch for four people for $45! Good food and good prices! No restaurant can beat that in center city.\n\nFour Yelps!"
    },
    {
        "id": 183,
        "text": "Great place for cheap Indian food and for the vegans out there - everything is labeled veggie, vegan, gluten free, etc.  I think the buffet is the way to go; grab a side of nan for a buck and change, and you've got dinner for under $8.  Way better than getting a frozen Indian meal from Whole Foods for the same price...."
    },
    {
        "id": 184,
        "text": "Good delivery option, but stick to the chicken and be wary of ordering anything too exotic. \n\nThe best thing about Mumbai Bistro, besides the fact that they deliver, is the price: it's actually reasonable, unlike the $15-an-entree Indian places that seem to dominate Center City. You get a decent bit of food too for what you order and it's easy enough to order two entrees for what would normally be the price of one elsewhere. The most reliable of these is the Chicken Tikka Masala and the Chicken Makhni. I stick to these two now when I order because...\n\nThere's a lot of really weird, off-color flavors in some of the dishes. The chicken vindaloo I've gotten has been really oily and the flavors of most of the other curries, while alright, are definitely not the most \"authentic\" Indian that I've had. The lamb has been especially disappointing when I've ordered it: chewy sometimes, rubbery other times, and usually filled with lots of bone pieces everywhere. Avoid if you can. Even the mint and tamarind chutney of all things tastes off and isn't worth ordering. \n\nThe naan is okay--filling enough and alright for the price, but nothing to write home about. If you stick to one piece of naan per entree and order two entrees, you can order a nice full meal with 2 breads and 2 meats for the price of 1 meat and 1 bread at other places. Just be aware that the flavors may be a little lacking."
    },
    {
        "id": 185,
        "text": "vegan, cheap, Indian---only some of these words fit together. Luckily at Mumbai Bistro, it's all three.\n\nInside, there's a small little buffet of about 6-7 dishes clearly labelled vegan, veggie, etc, which you can take by the pound, or you can order off a menu to get the suggested/fixed portion and price. I immediately went for the two vegan dishes: the mumbai dal and gobi masala. I wasn't really expecting to like either but was very pleasantly surprised. The mumbai dal was especially great, and I seriously considered getting seconds even after eating close to a pound of Indian food (!!). The gobi masala also satisfied my craving, but I wouldn't necessarily recommend it if you're not vegan. \n\nThe shop is really clean inside and nice for a quick meal, but it's not big enough for a group over about 5 people or fancy-schmancy enough for a date-like atmosphere (it's $5 for a POUND of Indian food...what do you expect?!) . I'll definitely be coming back here ASAP. \n\n(also, protip: don't bother with delivery-I checked beforehand and it's an added $6 charge just to get delivery! craziness for a place with $5 entrees!)"
    },
    {
        "id": 186,
        "text": "It's hard to come by cheap Indian food if you're not in NYC or India, but you can't deny that Mumbai Bistro is incredibly affordable.  It's not the absolute best I've ever had, but for a $5 entree it's good quality food.\n\nChicken tikka masala was good, a little oily but tasty.  I'd eat this again.\nChicken vindaloo had some nasty pieces of chicken in it and was too oily for me - definitely not trying this one again.\nBasmati rice was exactly what it should be, although I did get a little chunk that must have been at the bottom for too long because it was burnt.\n\nI live just a couple of blocks away and it was literally only 10 minutes between the time I ordered and when it arrived, so if you're starving or impatient, this is the delivery place for you."
    },
    {
        "id": 187,
        "text": "Yuuuuuum. This was exactly what I was looking for. I walked in, grabbed a plate, and scooped up some saag paneer, chicken tikka masala, and chicken curry. Take it to the register and pay $5.99/lb no matter what you get. All three were rich, full flavored, and left me wanting more so I grabbed another plate and went back for seconds! I think their cafeteria style buffet offerings rotate depending on the day. You can use the link here on Yelp to get to their website and check out what they have on the buffet each day. I think you can also order entree items to be prepared fresh for different prices but can't vouch for that 100%. Will definitely return. 10/10 would recommend!"
    },
    {
        "id": 188,
        "text": "Meandered in here in my lunch break. The gentleman at the front was kind. He let me sample all that they had to eat. All dishes were so good. Fresh and healthy. Vegetarian and vegan friendly. And AFFORDABLE  I'm so happy there is this house made food that is affordable. A lunch for me=$4 + change. \nThank you!!"
    },
    {
        "id": 189,
        "text": "Opening an Indian restaurant in a neighborhood with at least 4 others in a 3 block radius is a gutsy move, but when the food is as good and as fast as Mumbai Bistro, there really isn't much competition. Where else can you walk in with $5 and get a filling, relatively healthy meal in less than 5 min?\n\nSure it's not a sit-down fine dining experience, but every time I'm in there, it's clean, food is fresh, and I'm outta there in less than 10 min with change left over."
    },
    {
        "id": 190,
        "text": "I did my usual sad little Yelp search for something cheap and vegan nearby on my phone yesterday evening, and I was surprised and excited to see this new Indian place pop up.  I jumped on my bike and headed over.  I was greeted by two friendly gentlemen who seemed so happy about their new restaurant that they were beaming at the customers. I was beaming too when I realized that there was not one but TWO vegan options at the buffet, clearly marked as such (gluten free dishes are also indicated).  I'm not a connoisseur of \"real\" Indian food, but I do know my Philadelphia Indian food, and I can assure you this was excellent.  I had the Mumbai Dal and the Gobi Masala, both of which were delicious and full of flavor, with a little hint of spiciness but not enough to overwhelm spice wimps like me. I just checked the menu on their website, and it looks like the buffet items change every day on a regular rotating schedule.  Hooray! I can't wait to try the other stuff!  You can't beat this place for fast, convenient, delicious food at a great price.  For better or for worse, this is going to be a staple of my diet."
    },
    {
        "id": 191,
        "text": "Good Indian food for the price but be careful not to overload your plate otherwise it will turn out too expensive. Overall great lunch spot if you're craving Indian."
    },
    {
        "id": 192,
        "text": "This is a little street restaurant near the Jefferson Medical Center in downtown Philadelphia..  We walked there from our hotel on Broad Street.   Lynn, my wife, and I are connoisseurs of Indian food.  So, we ordered form the menu instead of the buffet, which seemed a little sparse to us.  I selected the lamb vindaloo, spicy, as I like it, with an alu paratha (stuffed whole wheat bread) as a side.  Lynn had sag paneer (cheese and spinach dish), mild as she likes it, with a side order of Indian pickles.  We both had basmati rice and raita (Yogurt) as well.   Lynn also had masala chai as a drink.  THe food was fresh and excellently prepared.  We were disappointed that the ras mulai dessert was not available.  However, this venue is well worth the price.  Seating is limited, so it would be wise to come before or after noon.  Also, the staff is small so be prepared to wait a while for your food.    If you in the area and enjoy good Indian food, this would be a great \"fast food\" kind of place except that it is not fast."
    },
    {
        "id": 193,
        "text": "Good Indian food at a GREAT price! Try the Naan and Paneer masala! I got a full plate of food, a side salsa, naan, and a soda for 9.50"
    },
    {
        "id": 194,
        "text": "Really great value without sacrificing flavor.  Also, one of the cleanest Indian places I've ever been in.  It's a great concept that I wish we could get in Baltimore."
    },
    {
        "id": 195,
        "text": "The food there is as close to homemade as can be. It is not quite as spicy as most Indians would like it,  but the flavor is authentic. It is also reasonably priced.  \n\nThe food there is not going to be what most people are used to.  Most people are used to a very heavy creamy taste to Indian food.  That is because many restaurants use cream to make the base of the curry.  That is not authentic, very unhealthy,  and gives you terrible food coma; contrary to some of the reviews I saw. \n\nThe curry at this place is much closer to homemade curry and is going to be lighter. \n\nBecause it did not quite hit the spice level i like, I gave them 4 stars,  although I did have buffet and not made to order."
    },
    {
        "id": 196,
        "text": "Value for money...good food quality...helpful and courteous staff. The naan and roti were fluppy and soft. Th curries had the right spice and not too sweet or too hot...\nMy son loved their rice..would definately recommend for quick meals"
    },
    {
        "id": 197,
        "text": "My absolute favorite place to go for lunch. For under $8, i can get a whole plate full of Indian food, and a piece of naan and be completely satisfied.\n\nThe buffet is the best deal in Washington Square West. At $4.95/lb you can load up on rice and a variety of main dishes, including multiple vegetarian and vegan choices (tip: the vegetarian stuff is lighter, so your lunch will cost less). The buffet is always moving, so you can be in and out and back to work in 10 minutes, if you work close by. I really like the masala and lentil dishes best, but I am always open to trying whatever is available. As a member of the frequent buyer program, I have already received a free pound of food already. Working on card #2 now.\n\nTo top off the already perfect lunch spot, the guys that work here are NICE. Really, really nice people."
    },
    {
        "id": 198,
        "text": "What can I say about the best Indian food in Philly? Well, for starters, it's the best Indian food in Philly. How do I know this? I spent a month in India... I know what good Indian food is. Until someone can tell me otherwise, I'm going to stick with what I know.\n\nWhat makes it good? Aside from its departure from the heat Indian food might usually pack, this place makes authentic cuisine. Don't worry... they have a delicious chicken tikka masala for all of you who order it.\n\nThe Saag Paneer is excellent (spinach and cubes of cheese) , as are the lamb samosas. I'm not a huge fan of the veggie samosa though - it's dry and kind of bland. Last time I ordered the chicken vindaloo which was very good as well. Great naan options (onion is my favorite).  \n\nIf you're looking to dine in, this place offers a very small, cozy dining room. I'd recommend taking out or delivery (there is a 6 or 7 dollar charge, since it's through a third party service). They don't accept delivery orders over the phone, but don't let that stop you.\n\nI hope they start making kathi rolls (Mumbai Bistro, if you're reading this, then take that as a plea!).\n\nRemember this the next time you're looking for Indian food. Over and out."
    },
    {
        "id": 199,
        "text": "I had to take off 2 stars because the garlic naan that was delivered to me, was hard. It seems like it got that way because it's likely microwaved/frozen. The veggie samosas and chicken tikka masala were yummy, though.\n\nPlease make your bread fresh and stop microwaving it. And if it IS made fresh and not microwaved, then make sure your customers have SOFT naan before you pack up an order."
    },
    {
        "id": 200,
        "text": "Delicious food without any belly problems, which tells me that they make a good selection of ingredients. It is also fairly cheap. Went there for dinner and the other day for lunch, was that good!"
    },
    {
        "id": 201,
        "text": "This is based off of a delivery order. Wow! This was some of the best Indian food I've had; do keep in mind this was a delivery order. I had the Vegetarian Malai Kofta, rice, garlic naan, and vegetarian samosa. Everything was so flavorful; just deliciousness. I'll probably eat here before my visit to Philly is over."
    },
    {
        "id": 202,
        "text": "This place has great Indian food and they're so fast. I've been here a bunch and it's great every time!"
    },
    {
        "id": 203,
        "text": "I get the chicken biryani every time I go. The last time I was there, there was a table of three older Indian men who each ordered their own chicken biryani. This validated my choice greatly.\n\nThe guy at the register is so friendly!"
    },
    {
        "id": 204,
        "text": "Can I just say that is place is expensive for the quantity they serve! I ordered for delivery - paneer tikka masala, vindaaloo, onion naan, naan, garlic and chilli naan and my total came upto around $63. The food arrived hot. I liked their paneer tikka masala it tasted really fresh and healthy unlike the oily version that most Indian places serve! The vindaloo had way too much flavor in it, it was a tell that they recooked it with spices! Their naan portions are small so I would suggest to order extra if you're with a group. Also, I wasn't a huge fan of their onion naan. Would I try this place again? Maybe if they have a lunch deal lol."
    },
    {
        "id": 205,
        "text": "Delivery guy was very polite and on time. The food was warm and the flavors were on point. The vindaloo was exceptionally spicy.  More so than at other Indian restaurants in the area. That being said, between the glasses of milk and water, it was delicious.  Will without a doubt order or visit the restaurant again."
    },
    {
        "id": 206,
        "text": "If you order biriyani and you never liked in 1st or 2nd attempt .. most of time they do serve previous day even older food to customers, not a worth if u r ordering"
    },
    {
        "id": 207,
        "text": "I'm saddened by the closing of this amazing restaurant. Their food was everything I'd wished Indian food would taste like: delicious but didn't burn my freaking mouth off! Any time I've ordered mild Indian food my mouth was still on fire, but not here! They had all the flavor without the pain, and plenty of gluten free options!\n\n**Someone please tell me where I can get gluten free Naan now that MB is closed!!!"
    },
    {
        "id": 208,
        "text": "It is rare that a 5 dollar bill means that I will achieve satiety in this day and age.  Mumbai Bistro is one of the few establishments where I can simultaneously satisfy my impulses of gluttony and greed.  Gluttony is happy because I am full.  Greed is happy because I have saved money.\n\nThat being said, envy, pride, and lust cannot be counted on to be fulfilled at this establishment.\n\nas for the food...\n\nIf you like New Dehli, you will like Mumbai Bistro because they both share the same head chef.  Seriously, I could smell the similarities in the food as I walked into the establishment.  My suspicions were confirmed when I recognized the guy at the register as a waiter from New Dehli.\n\nToe-to-toe, none of their selections beat similar dishes at other Indian restaurants(Sitar, Palace at the Ben, Karma)...but they are not beat by a large margin.  Also, Mumbai Bistro is much, much cheaper.  \n\nI recommend going in and just piling on a spoonful of everything they've got on your plate, paying like 5 bucks, and stuffing yourself silly.\n\nThis place is perfect for a meal on a budget and a time crunch.  This is not gourmet, fancy Indian cuisine.  This is basically fast food."
    },
    {
        "id": 209,
        "text": "Ok Indian food at a good price. Had the chicken curry, basmati rice, onion naan, and the gulab jamun for desert, all for about $10 bucks. They pride themselves on cooking healthy Indian food, with vegan and gluten free options. Probably the reason the food seemed to be missing something. Hard to pinpoint, but the food just isn't quite on the mark (not spicy enough, missing spices, etc..) and the menu is very limited. For example, no lamb curry on the menu, in fact the only lamb dish they had was available at the buffet. Never been to an Indian restaurant that did not have an ample selection of lamb on the menu. The gulab jamun was also not right. The syrup seemed to be lite and the balls seemed to be missing the ghee. Overall the place is bright and clean, the service good and friendly."
    },
    {
        "id": 210,
        "text": "My office orders often from here for lunch and it is the one restaurant that pleases everyone!  It is a great value for the size of the portion and quality of food.  I get the chicken tikka masala almost every time and it is delicious.  The sag paneer is also solid, but not as good as the chicken.  The only reason this place does not get 5 stars from me is because the naan is only so-so, kinda mushy and without much flavor."
    },
    {
        "id": 211,
        "text": "I have eaten Indian food ( yes I am Indian) my whole life so note I may have a bias or more critics while writing this review. The reason  I went to this place in the first place was because it was highly recommend by a coworker.\n\nFirst, I absolutely love the area where this place is located! \n\nSecond, entering the restaurant I realized I was looking for a quick food and I was very picky this day. \n\nI decided to go for the buffet that is weighed by the pound. I Was not satisfied by the food because it did not have an authentic Indian food taste ( also was not spicy at all and could not alter it with condiments).  But I did note the food did have healthy, fresh. ingredients.  I think the restaurant was altered to catered to the environment of the restaurant ( healthy proactive neighborhood) so I commend that! \n\n\n\nEnjoy and cheers!"
    },
    {
        "id": 212,
        "text": "SO I'm brown.  DUH. It's pretty obvious by my name and my foto.  And by brown, I am implying that I am Indian.  Not mixed, not really light skinned African American - Indian as in FROM INDIA.  Well, not me, but my parents.  Anywho, as a result of being Indian, I consider myself something of an expert on Indian food. I mean I have had it OFTEN.  Most of my life in fact.  And it's of course my fav cuisine in the whole wide world.  So when I read about Mumbai Bistro on Foobooz, I naturally wanted to go there instantly.  \n\nMumbai Bistro is interesting. I give it 4 stars - mostly b/c it's so cheap.  And the concept is neat - food per pound! I can't even eat a whole pound of food - no matter what I do. So for me it works out well. \nAdditionally, they label all their food for people with dietary restrictions - vegan, lactose free, spicy, etc.  Additionally, their menu changes often, and the things like raita, chutney's, pickles, lassi's, naan, and samosa's are extra. \n\nThe samosa was okay, the outer shell was great, but the filling was subpar.  The rice was well cooked. The naan was not that great - it was pretty much roghani naan from the grocery store.  The channa I had was also only okay, not great.  \n\nHOWEVER me and my companion ate for $16 - and we each got samosa, naan, rice, etc.  AND my dinner companion had meat! \n\nAddittionally, it's BYOB, which is always fun. \n\nDefinitely eat here if you are around - but if  you have the chance to choose Indian food - go to Ekta or Tiffin."
    },
    {
        "id": 213,
        "text": "Great little quick Indian food joint with meals comparable to proper waiter service restaurants (that cost alot more).  I had the chicken curry, which was properly spiced and was really pretty delicious.  Also, they have whole wheat roti if you are watching your belly.  The chai was awesome and alot like homemade.  The only complaint is the wasteful use of plastic for dine in customers.  The food comes out in a plastic container and you get plastic plates and utencils, all of which could be avoided for dine in customers.  Otherwise, awesome experience, great location, good people watching, and friendly staff."
    },
    {
        "id": 214,
        "text": "Great place to pick up Indian food on the go!\n\nIt's conveniently located right by Jefferson. There are tables to sit at inside, but they have a buffet that is really popular, especially at lunch time. I usually go and pick up from the buffet, but they have a much wider selection on their menu and that food is also excellent. \n\nThey are closed on Mondays, so keep that in mind. Be sure to get their rewards card which they stamp each time you go - after 10 stamps you get up to 1lb of food free. \n\nNote: in order to cash in your free meal, you must choose food from the buffet. I made the mistake once of ordering food off of the menu and then having to pay full price because the voucher was only for up to 1lb of food from the buffet. It was frustrating to find that out at the register (that rule was not clearly stated on the rewards card), so I say that here to give you a heads up. \n\nOverall, it's a great place!"
    },
    {
        "id": 215,
        "text": "Our service was great! We were able to keep our tab open as we kept ordering more and more food. The food came out quickly and they brought it right to our table. The restaurant was very clean and not too crowded so we easily found a spot for all of us.\n\nThere is a self serve section where you pay by weight but you can also order by item. We ordered Chana masala and mixed vegetable curry. Both were very tasty! The mango lassi was also delicious! \n\nIf you're in the area and up for some great and quick Indian food this is the place to go for sure!"
    },
    {
        "id": 216,
        "text": "Background: I've eaten here at least 20 times over the last 2 years (its close to work and delicious).\n\nWhat I like:  I love this place.  The buffet style gives you the opportunity to load up or take it easy, depending on the day.  The naan comes out  hot and they do a good job of keeping the buffet trays fresh.  For beverages, there is a delicious yogurt lassi (mango is my favorite) that just tops off a great, modest-priced meal.  The guys working the place are very friendly and as an added bonus, they give you a card that you can stamp each time you visit.  After 10 visits, you get 1 free pound.   \n\nWhat I don't like: Its a little small so getting a table is tough if you go around 12-12:30pm.  Be prepared to get \"to go\" if you plan to eat around then.\n\nRecommendation:  Go at 11:30am when it opens or around 1:30pm- after the lunch rush hour.  If you're looking for a good, filling meal this is the place to go."
    },
    {
        "id": 217,
        "text": "I would probably give this place 5 stars but I have only eaten at 2 other indian places so considering my lack of experience with indian I'll say 4. The food here is buffet style or you can order individual entrées. I personally like a little bit of everything so I go buffet. The food is 4.95$ a pound, and even though it's buffet the food is always fresh anytime of day. I work nearby so I have been there for lunch, dinner, and the odd in between hours. Service is top notch, staff is friendly, and I have not eaten a bad thing there yet. I highly highly recommend."
    },
    {
        "id": 218,
        "text": "Wonderfully cheap and delicious! I got the paneer masala, and the flavor was really good. I just wish you didn't have to pay for rice and naan separately!"
    },
    {
        "id": 219,
        "text": "Found this place thanks to my Yelp gal pals Anupma, Farha, and Sari. The idea of by the weight buffet Indian food is amazing because, especially with Indian food, just one curry is beyond boring. \n\nThis place is $5.50/lb I'm pretty sure which is enough to fill a standard to-go box and spend roughly $7 I'd say. Garlic naan $1.50 and raita $0.75. Good price!\n\nI had the saag paneer and the navaratan koorma. Both were made properly with good spices. Sounds obvious, but you'd be surprised how many places in Philly seem to not know how to make a saag paneer which is so basic. \n\nWhat made me really like this place though was that their paneer was really paneer! All these Indian places these days are using some sort of fake paneer that is terrible! Yay!\n\nThey also have a rotating menu so not every day has the same curries out. Neat! Check their website before. Also they have brief, but helpful descriptions of the food and also tons of gluten free and vegan options which they have indicated. \n\nWill be returning, but not ready to give the 5 stars yet."
    },
    {
        "id": 220,
        "text": "SO good  so friendly and welcoming! 0% trans fats - only veg oils - no butter or ghee  vegan options abound and clearly marked on the menu. totally coming back. Chana Marsala & Mumbai Dal were very well seasoned and served fresh. This tiny spot in adorable and clean"
    },
    {
        "id": 221,
        "text": "this place is awesome. surprised about the number of bad reviews but its good quality food, fast and tastey. right on my campus so its realy easy to grab a quick bite. pay per pounds buffet style appeals to people who dont eat that much but still want the buffet selection without the price. 5 or 6 bucks fills me up with some leftovers"
    },
    {
        "id": 222,
        "text": "This was a fun stop in downtown Philly for a quick lunch. The food was surprisingly oil-free and very fresh. The Vegetable Samosas, Mumbai Dal (black lentils), Channa Masala and  Gobi Masala were all excellent and tasted like home cooked food - only better. \n\nThe Paneer Masala was a bit of a downer and didn't taste fresh. So was the chai - a very watery version of the original Bombay tea. \n\nPortions were decent - not the typical huge portions served in Indian restaurants, but didn't mind it, as the quality was great. Suggest you opt for the ala carte selection, as it's a better value than the buffet by weight."
    },
    {
        "id": 223,
        "text": "Love love love the spinach and *ALL* the variations of chicken!!!  The only thing keeping me from giving it the full five stars is that it's currently not in an amazing program that benefits **EVERYBODY**!  Check it out:\n\nhttps://www.shop.com/shoplocal/merchants\n\nGet on it, Mumbai Bistro!"
    }
]