[
    {
        "id": 1,
        "text": "Placed an order at 6:18pm. They took the ordered at 6:19pm.  Delivery said 7:05pm.  7:30 I cantacted Grubhub because the restaurant refused to answer the the phone.   The restaurant said 10 more mins.   8:30pm I contacted Grubhub again the restaurant said 20 more mins.  At this point I cancelled the order and since it's curfew at 8pm today.  I ended up with ramen noodles.   I will order Indian food at my regular place tomorrow. I shouldn't have given a new place a try.  So disappointed"
    },
    {
        "id": 2,
        "text": "So happy we have a fresh option in the neighborhood. Actually got some takeout on their opening day and certainly didn't disappoint. I love the fact that you can choose spice levels so my boyfriend and I varied it between dishes and didn't disappoint. Definitely check it out, totally being selfish but I need this to stay in Pennsport."
    },
    {
        "id": 3,
        "text": "We saw a sign for them and were super excited to try this place so when we saw them on Xavier tonight we took the plunge and tried them. I must admit that I was so happy to try this authentic, slightly spice and very flavorful new place. This is the type of authentic Indian I'm used to getting in New York. Give them a try and I am sure you will not be disappointed."
    },
    {
        "id": 4,
        "text": "The chicken tikka masala was really yummy but I felt like it was a small portion for the money, and the mixed pakora was kind of cold and not very good. First time ordering from here, I'm not sure I'll be ordering again. Over-all wasn't bad but not great for the money."
    },
    {
        "id": 5,
        "text": "I ordered from tandoor on door dash but when it came it was from Kurry shack.  I got the salmon makhani and the gobi Manchurian. The Manchurian was amazing! One of the best flavor wise I've had in the city.  The salmon makhani's taste was also good....but there was SO much oil sitting on top....also more than I have seen (ever) when ordering this plate which made me bring the stars down."
    },
    {
        "id": 6,
        "text": "I would highly suggest going here. We went the first day of there soft opening. And the food was fantastic! Very flavorful and fresh ! Not to mention everyone was friendly at the restaurant.  We will be back soon!"
    },
    {
        "id": 7,
        "text": "Delicious! Plenty of options for everyone; vegetarian, vegan and gluten free options. Halal. Customizable spice level. Ordered takeout. Prompt and friendly service."
    },
    {
        "id": 8,
        "text": "I have to admit... the kitschy name made my pause slightly, as I take \"Indian\" food very seriously. That's why I was pleasantly surprised by my delivery from Kurry Shack. The Chicken Vindaloo was just spicy enough to please while still being very flavorful, and I decided to try the vegetable pakora - and I'm hopeful that this is the standard because I really liked this first time (for me) treat. The only thing I would've liked is a (slightly) larger portion (compared to the nicely done, tender Basmati rice). It was definitely \"enough,\" though, and I'll definitely order from them again!"
    },
    {
        "id": 9,
        "text": "We thoroughly enjoyed the meal.  Spices were just right, the somosas were crispy and tasty. The lamb in the sagg was tender, the garlic naan was great.   My 92 old mother enjoyed too.  The DoorDash guy was great."
    },
    {
        "id": 10,
        "text": "Seriously one of my favorite Indian places to eat. Personally I recommend the land Rogan josh, chicken tiki masala, aloo gobi, and the bread basket. Seriously some great dishes"
    },
    {
        "id": 11,
        "text": "Not sure what has changed here but the food is not as good as it used to be, also the delivery service used to be great and on time but has slowed down recently. The food is either overly spiced or too sweet. The chicken tikka masala is overly sweet and the pakoras were oily and stale.  Need to find a new Indian spot with better food and dependable delivery."
    },
    {
        "id": 12,
        "text": "We were super excited to find out there was an Indian restaurant close to our apartment within walking distance, as me and my boyfriend love Indian food. Unfortunately we were disappointed with a below average meal. Naan and Veggie platter were average. Paneer Tikka Masala was below average - very oily on top and not creamy. We originally were going to go with hot level of spicy, but we were advised that it was very hot. So we went with medium level spiciness for both dishes. We should have gotten hot because there was barely any kick to it at all. Saag was also just average. Probably would not go here again."
    },
    {
        "id": 13,
        "text": "Wow, this place is good. We ordered from here based off a suggestion from a coworker who noted that the delivery was very fast (due to COVID-19 places have been taking a long time to arrive). Sure enough, they delivered very quickly..so quickly my husband didn't answer the phone when they first called thinking they couldn't possibly be here already. I ordered the palak paneer and it was absolutely delicious. Plenty of huge chunks of paneer that was perfectly spicy (but not too spicy - juuust right) that came with rice. My husband got the lamb vindaloo but I don't like lamb so I didn't try it.  We also got garlic naan and peshwari naan. My only complaints would be that 1) there wasn't enough rice. Tip: order extra rice and 2) the peshwari nann, which is usually filled with coconut and raisins, wasn't filled with anything. Sure, it had the correct flavor but I like when peshwari naan is actually stuffed with the ingredients and doesn't just taste like the ingredients. \n\nAll in all, we'll definitely order from here again. Compared to other local places, the prices are a lot better and we were happy not to have to drop $45 on one meal."
    },
    {
        "id": 14,
        "text": "Open when says it's closed, closed when it says it's open. Terrible customer service, food is good but a pain just to get a hold. They need someone who knows how to use the internet"
    },
    {
        "id": 15,
        "text": "Ordered the chicken Tikka masala. Because of other reviews I ordered it extra spicy. Still not spicy at all. The naan was soft and chewy. And they replaced the meat the samosas with veggie without contacting me, as requested. Flavor wasn't terrible but with so many other great Indian places around, I won't be ordering from here again."
    },
    {
        "id": 16,
        "text": "We ordered the coconut curry, Makhani, garlic cheese naan, chicken biryani and red curry dish. The food hit the spot. It tasted fresh. The levels of spicy : mild, medium and spicy. The mild option was mild. If you like hot try the medium first. The medium was spicy enough to for me. I almost order spicy, glad I didn't. I still wanted to taste my food. The garlic naan was good too! We will be back."
    },
    {
        "id": 17,
        "text": "Excellent services, prices and food! We ordered the chicken tikka masala, chicken korma, garlic naan and mixed pakora. Chicken was very tender and everything was well spiced. We went with spicy but it lacked heat so you will probably want to ask for extra spicy if you want a real kick. Convenient takeout and delivery. It's a no frills, order at the counter kind of shop!"
    },
    {
        "id": 18,
        "text": "We ordered via grubhub and then carried out. We got the garlic naan, the coconut naan, the coconut chicken, chicken tikka masala and the veggie platter. I thought the veggie platter would be bigger, based upon the photo we saw on grubhub, but it was still very delicious and I liked the sauces that came with it. I didn't realize we could choose the spice level via grubhub and so nothing we got was spicy. Much of the food was borderline sweet, actually. So next time we'll up the spice level quite a bit. We are super happy to have this place in the neighborhood and are looking forward to trying many more items."
    },
    {
        "id": 19,
        "text": "I ordered a lot of food including samosa, when i took the first bite in samosa it smelled bad like stale. I was really stale and slimy. I called the restaurant and they said they will give me refund, However it's not acceptable to give stale and spoiled food. I will never ever order from this place"
    },
    {
        "id": 20,
        "text": "Update at bottom - got food poisoning for sure from the Chicken Korma. \n\nOriginal review: Man, what happened Kurry Shack? You were my go to! Right around the corner, always decent sized portions, food was hot, spicey and delivered with quickness.\n\nI ordered one of my usuals tonight - Chicken Korma, and basically got no chicken and a funky tasting curry. Has some extra tang to it in a bad way, something is off. And on top of that, literally the least amount of chicken I've ever gotten from them. 4.83 ounces, absolutely pitiful compared to other neighborhood Indian places, even compared to Kurry Shack 3 or 4 months ago this is just sad. \n\nI weigh and measure everything I eat for dietary reasons and Kurry Shack used to clock in with 6.5 to 8 ounces of chicken in the various curry dishes (Tikka, Korma, etc). I have an order from July clocking in at 7.7 ounces, and June at 6.5 ounces, among others in a similar range. \n\nThis is barely 40 grams of protein. Really a damn shame as Kurry Shack used to have just phenomenal flavor and portions.\n\nUPDATE: Got EXTREMELY sick after eating this and leaving the review last night. Woke up this morning and I'm still sick. Will spare yelp the gruesome details but the aftermath of this rotten curry IS NOT pretty. Would avoid at all costs. Bumping the review down to 1 star for banishing me to the toilet for two days."
    },
    {
        "id": 21,
        "text": "Love that this replaced \"the wild burrito\" in my neighborhood! This place is great, the Tika Masala is my recommendation... either chicken or lamb is my go to"
    },
    {
        "id": 22,
        "text": "This is soooo good! I just came here with family twice in 2 days! The flavor takes me back to my favorite South Indian restaurant. My favorite aloo gobi and Rogan Josh. The staff and chef are great and it's very close by my home. They give lots of fragrant basmati rice and naan, delicious garlic naan. I say just get the bread basket, it's worth it. I can't wait to go back again, next week tho, cuz it is a bit pricy, about $30-50 for a meal for 2-3 people, with 2-3 dishes plus naan. \n\nAgain, food is amazing, definitely worth a try. And go with friends so you can try different dishes and share! \n\nYummmmm! Best alooo gobi and mushroom curry, oh and remember to order more spicy if u like a little kick, as spice level medium is like American level spicy (so NOT spicy)."
    },
    {
        "id": 23,
        "text": "West Philly seems to have the only indian food that we truly enjoy. Kurry shack is so close that we hoped it would satisfy our cravings, but it just didn't. The samosas weren't as delicious, the tika masala was meh. The chicken vindaloo was better and you really have to try hard to need up naan. The best part of the meal for me was the rice, which has great flavor. The alu palak was okay, and the spice level of medium was great. We won't be back though."
    },
    {
        "id": 24,
        "text": "I'm always hesitant to try new restaurants due to my having gastrointestinal issues. I love Indian food and wanted to order in tonight. I have to say the food was great. Spicy enough for my stomach to handle and the food was not dripping in greasy sauces. I asked for non spicy and no ghee since I can't handle dairy. The food was perfect. Glad I found this place. Don't think it's been open too long but has really good reviews. This will be my place to order Indian food from now on."
    },
    {
        "id": 25,
        "text": "This place is the real deal right in Pennsport. I ordered pickup and got the chicken tikka masala (ordered spicy) paired with the garlic naan, the chili chicken, and the veggie platter. The chicken tikka masala spicy level was more of a medium-spicy, but still absolutely amazing and packed with authentic flavor. The chicken wasn't dry or overcooked which is the main problem when you order this dish. It was just simply incredible and they give you so much! I think it was perfect at this spicy level but if you want that burn go for the super hot. The chili chicken was also a hit and had such a nice kick to it. It was probably the best chili chicken I've had in the city so far. The veggie platter was good but the other two dishes outshined them by a mile. I love my naan a little more crispy than doughy but it's hard to do if it's packed to go. Overall, I am so happy there is something like this close to me, but ecstatic that it's the real f'n deal!! AUTHENTIC DISHES ONLY!\n\nAlso, phone orders will give you a 10% discount but you have to ask."
    },
    {
        "id": 26,
        "text": "My typical Indian restaurant was closed so I decided to order here for the first time and I was not disappointed. The shrimp Tikka masala was so good including the rice. The garlic naan was to perfection . Will definitely order again!"
    },
    {
        "id": 27,
        "text": "Completely wrong order which is normally not that bad if the restaurant is willing to correct their mistake and send you a new order. However they decided to blame the driver and the driver decided to blame the restaurant so we are shit out luck eating 1/3 of a meal that we spent over $100 on. Terrible service."
    },
    {
        "id": 28,
        "text": "Had been wanting to try this place for years, my only disappointment is that I waited so long! Everything was delicious, from the Karahi, Shrimp Biryani, Shrimp Tikka. The garlic Naan was fresh, warm and fragrant. Absolutely can't wait to order again."
    },
    {
        "id": 29,
        "text": "My boyfriend and I ordered on a whim this past Wednesday and despite some negative reviews, we were pleasantly surprised. We ordered the chicken kabob, Indian wings, Naan basket and vegetable korma. Everything was delicious. I highly suggest calling ahead for hours and picking up your order if possible. It's definitely worth it."
    },
    {
        "id": 30,
        "text": "Update: they refunded us our money so that's something. Perhaps getting it right in the first place would save us all some trouble."
    },
    {
        "id": 31,
        "text": "I wish I didn't even have to give it 1 star which is so sad because I have always loved this place the few times I've been. \n\nMe and my 2 daughters WALKED here because we wanted their food so bad.. BUT.. the customer service I just received was literally.. by far.. the worst customer service I've ever experienced in my 34 years. \n\nNo one was at the counter when we came in.. I finally notice a self serve area to electronically place order but I had a question. After waiting 15 minutes thinking someone would eventually come from the back to great us.. I became frustrated with waiting and called \"hello\" (not rudely) to the kitchen thinking maybe they just didn't realize we had been waiting. Still ignored for about 5 minutes a man that was in the kitchen cooking came to the front and literally started yelling at me \"do you not see we are busy\" \"no one is up front\" \"we are in the back busy\" \nSo I reply.. \"of course I can't see what is going on in the back and we've been here for 20 min waiting with no one to help and I have a question\" \nHe again yells at me \"we are busy\" \nSo I ask \"who am I suppose to ask my question to so I can finish my order\" \n\nHe literally ignored my question and walked away. STILL NOT HELPING ME!! \nNever.. and I mean never.. will this place ever receive my money again. Horrible, HORRIBLE customer service and if that's the way they treat people that pay to keep their business open then I hope their business sinks!"
    }
]