[
    {
        "id": 1,
        "text": "I went there with a group of people and everyone enjoyed their meal.  The service was friendly and the décor is festive.  If you like Cajun/creole food, I think you should give Acadia a try.  You'll love it."
    },
    {
        "id": 2,
        "text": "30 minutes for corn bread, no signs for men's/women's restrooms, not a fan. Oh and the hush puppies were worse than Long John Silvers. But Lee the bartender is a good dude...thumbs up Lee!"
    },
    {
        "id": 3,
        "text": "So my fiancé and I decided to check Acadia out tonight.  We have been wanting to go for a while since it is around the corner and based on the 4.7 rating we figured why not.  We definitely did not have a great experience at all.\n\nThe only good part was our waitress, she handled everything well.  The food came out quick but maybe a little too quick.  Our appetizer, spinach and artichoke bites, came out frozen in the middle (they took them off the bill luckily).  \n\nAs for the main course, we both got Po-boys (one shrimp and the other catfish).  We expected full sandwiches considering we paid $14 and $16 but they were half sandwiches.  The fries tasted like they were fried twice, in fact everything we had tasted like it was fried, frozen and then fried again.  \n\nWe definitely won't be trying Acadia again anytime soon."
    },
    {
        "id": 4,
        "text": "I was invited out for dinner at Acadia. I was very excited to explore the creole themed restaurant. When you walk in you can hear New Orleans music  in the air, I immediately felt like I was in New Orleans. The restaurant is decorated according to theme and the ambience is very relaxed which is very nice. In review of the menu there were a lot of options to choose from that includes starters and entrees. We chose the gumbo. The ingredients made your mouth water and yes we were hungry. The gumbo came with a side of potato salad and a side of bread. We started our meal with small muffin shaped cornbread. It wasn't what I am generally use to;but,it was good and it had the texture of a cupcake. \n\nMoving on we had the potato salad, I really enjoyed it and didn't miss the boiled egg that usually accompanies this dish. The spicy bite of the salad was very unexpected but it was a pleasant surprise. Finally, we were prepared to dive into the gumbo. The gumbo was quit dark but I went in with a open mind. With the first bite we both noticed the scorched flavor of the entree. The chicken and the andouille was over cooked. Being a novice cook myself I immediately notice the meat and how I couldn't taste the flavor of the sausage at all. The chicken was mush. We explained to our waitress that the gumbo was over cooked. She stated that she would discuss with the chef. She then shared that the roux is darker and that may be the flavor we are tasting. Ok.\n\nMy mother and I then questioned if the roux would taste like smoke or scorched. My mother has been to New Orleans before and she stated that this gumbo is not from New Orleans. I've tasted gumbo before and have made it for my family numerous times and I was very disappointed in my meal. We didn't eat it. My mother ordered shrimp on her gumbo so we picked the shrimp off of her plate to have something. \n\nAhhh dessert,my mother ordered the baguettes as she remember enjoying them last year in New Orleans. I must say, they were delicious ! \n\nSuggestions: change the gumbo recipe, offer other options for customers to choose another entree, assure that staff is sharing the specials for the night(we overheard another waitress sharing the specials and had to ask our waitress for details) honestly I would have ordered the special if we were offered another option. Brown rice should also be an option. Our cups should be periodically filled with water we only received one glass no refill. \n\nAlso, we paid for our meal even though we did not have a meal we sent it back. We had drinks, cornbread, a few shrimp shared from my mother's plate and baguettes . A customer should not have to pay for a meal they didn't eat. Our meal was over cooked, scorched and we just didn't like it. We didn't eat it because we didn't want to get sick from eating burnt food. We didn't agitate, but wondered why we had to pay, our concerns.....ignored. We paid our bill and we also provided a tip and now please take this tip and adjust the service at Acadia. We originally came because my mother saw your restaurant featured on FYI Philly. \n\nAgain, enjoyed the dessert,cornbread, and potato salad. We removed the voodoo doll from our table to another table..........freakkkkkky!"
    },
    {
        "id": 5,
        "text": "We love Creole and Cajun food and this place has an amazing selection. The drinks were delicious and the vibe is really nice. I think they need to hire one or two other servers. There was only one server and she was trying to do her best but she needed help. They gave me the wrong order but quickly fixed that, though I wasnt in awe of the vegetarian jambalaya dish. However, chicken wings are wonderful. We would have wanted to try to oysters but were out of those. As they are new, I understand they are trying to get the hang of things. I hope it only gets better! Also free cornbread!!!"
    },
    {
        "id": 6,
        "text": "The service was slow and waitress no so engaging but polite. The food is far from authentic Louisiana, I would categorize it more french than Creole or Cajun fare. It did have traditional Louisiana brew. Two stars because the red beans were decent, wings DELICIOUS, and oyster poboy actually was served on french poboy bread."
    },
    {
        "id": 7,
        "text": "I had a great experience here! The server was super friendly and helpful with recommendations. It was nice that the chef came out to speak with us. I was just in New Orleans a few months ago and was craving some Creole food in Philadelphia. The red beans and rice was delicious as well as the gumbo and jambalaya."
    },
    {
        "id": 8,
        "text": "Awesome food, drinks, decor and staff! If you're a fan of New Orleans then is a MUST hit! If you're not, it's also a MUST hit!"
    },
    {
        "id": 9,
        "text": "Had a reservation but when we arrived they said there were issues because they had a big party and we should just try to find a table. We managed that but sat unattended for 15 minutes. Ordered drinks to start and waters. Three different people showed up with waters despite our having received them. Drinks came 15 minutes later - and they were beer so no special prep. After 45-50 minutes we had no food - table next to us was in even worse shape. Never going back - on the positive side we walked into the restaurant down the street and had a lovely meal despite no reservation.  We will definitely return to that place can't possible recommend Acadia to anyone."
    },
    {
        "id": 10,
        "text": "Stopped in for brunch, I think we may have been the first ones there. Service was friendly albeit on the slow side considering how many people were there. \nMe and my friend found the music too loud. Not sure if it was the empty room or what but it was kind of hard to have a conversation. \nOrdered the Cajun poutine I think it was, pretty good. Felt kind of overpriced at $15 for two eggs and sausage on a stack of fries. Other than the fries not sure what was actually poutine about it. Was expecting cheese curds or what not. \n\nI'll probably be back to try lunch. I didn't see that many Cajun things on the brunch menu. No muffuletta sandwich etc kinda bummed by brunch."
    },
    {
        "id": 11,
        "text": "Just got back from a wonderful brunch.  The beignets, bacon, home fries and lemon pancakes drizzled with molasses were soooo good.  Staff was very friendly.  Looking forward to going back."
    },
    {
        "id": 12,
        "text": "We really liked Acadia. Food was delicious and so were the drinks. He had the jambalaya, which was refreshingly not over-sauced, and I had the fried catfish with tasty maque choux. Cornbread was sweet for my taste,  but still good. Our server was great and the bartender was really nice too. They were very accommodating with our baby. We love New Orleans, so it's really nice to have a local place that gets the food and the vibe right."
    },
    {
        "id": 13,
        "text": "Don't eat here. Owner was on his own and complained nonstop, making us feel unwelcome. Food mediocre. Not good"
    },
    {
        "id": 14,
        "text": "As a REAL creole person who has grown up his whole life with this food and culture I just have one thing to say..... NICE TRY. The name alone is so corny that anyone from Louisiana would say \"oh look another restaurant called Acadia\" (be original). Roux isn't right and that is the key to any gumbo. Secondly I can tell this restaurant doesn't know the true history of Creole food and the fact that pretty much all \"Cajun\" dishes are stolen from Creole culture. Fresh is key to Creole dishes, but unfortunately the lack of quality agriculture in this region shows how it can impact good Creole dishes.  If I could give it 1.5 I would. If you are a rookie when it comes to Creole cuisine then this is your place. Otherwise if you're actually Creole this is not your place. This is another example of how if you don't grow up in the culture you won't ever get the dishes right. Looking forward to someone telling me about my own culture."
    },
    {
        "id": 15,
        "text": "What's not to love about a true blue New Orleans restaurant.ibhave been here a few times including Mardi Gras and not once have I had a bad experience. At this point we've had the entire menu and I tell you eat everything and  anything here. The staff the owners  the the chef the jazz all always perfect. So much love is put in to this place and you can taste it. Oh and the chicken is no joke , absolutely amazing. Phenomenal restaurant you haven't lived until you've had true New Orleans food"
    },
    {
        "id": 16,
        "text": "Had a good time. Food and service was great! Would be cool if they did some live music/jazz here."
    },
    {
        "id": 17,
        "text": "Good food. Awful service. My boyfriend and I ordered wings during their 5 Dollar Happy Hour. People came in after us and got their orders of wings, yet no one was coming to our table to even see how we were doing. 45 minutes later and still no wings. They waited until they gave us our entree to tell us that they ran out of shrimp and FORGOT to tell us. (???? who does that) We got our entree (the seafood boil)- in which they forgot the SHRIMP (the most essential part of the boil) and added sausage when we specifically said no sausage (I'm Muslim and don't eat pork). Mediocre service. I'm very disappointed and we won't be coming back here."
    },
    {
        "id": 18,
        "text": "We came here for my friends birthday. It was empty on a Sunday night. And it's like 89 degrees outside. Upon walking in, it's very humid and muggy, it's like they don't invest in the air cooling system. So we requested if they can turn on the air and the response was, I'll see what I can do. \nIt wasn't meant in a rude way, and I can start to feel the air now- but on a hot hot day, you expect to come in a restaurant where you can feel cool and comidrta\n\nWe ordered the crab cakes and the Mac and cheese bites- both were a little bigger than the size of a quarter... very disappointed. \n\nWe also ordered the chefs boiling bag and the seasoning was pretty good, we got the one up the normal- and it had a little kick to it. And i enjoyed it. \nThe bags were kinda small but it wasn't overly expensive. \n\nDon't think I'd come back, but def a place to go to if you're in the area and craving seafood/soul food."
    },
    {
        "id": 19,
        "text": "We came for Sunday brunch and absolutely loved it! The cocktails were delicious and so was the food. The waitress didn't show, so the bartender and chef, who were both super nice, jumped in to wait on the tables! Yes, it took a bit longer than it usually would, but it was such a  nice meal that it didn't matter! Definitely going back for dinner!"
    },
    {
        "id": 20,
        "text": "Oh my god.  Order the Sazerac, the shrimp etouffet, and the beignets.  There should have been many more people there."
    },
    {
        "id": 21,
        "text": "This is a new neighborhood gem. Reasonably priced food and drinks. Authentic flavor. A place your would find in New Orleans for sure. The staff is dynamic and the food has a kick but is delicious. Simple but tasty menu. I would recommend the Chardonnay on draft, but they are also carrying Abita beers. #nolavibes"
    },
    {
        "id": 22,
        "text": "This is a new neighborhood gem. Reasonably priced food and drinks. Authentic flavor. A place your would find in New Orleans for sure. The staff is dynamic and the food has a kick but is delicious. Simple, but tasty menu. I would recommend the Chardonnay on draft, but they are also carrying Abita beers. #nolavibes"
    },
    {
        "id": 23,
        "text": "I was fully prepared to be disappointed. I am a huge fan of Khyber pass and have been to New Orleans many, many times. I was pleasantly surprised. This place is pretty legit and does a nice, inexpensive happy hour. Wife was pleased with their house Chardonnay and was actually shocked when they told me their well vodka is stateside- the only time I have ever heard that. But, hey, works for me. \n\nI had a cup of red beans and rice and wife had a cup of gumbo; both authentic and tasty and $5 each off hh menu. For entrees I had the blackened catfish with a side of corn salad and potato salad. Wife had the shrimp po boy. The catfish was spicy but slightly undercooked. Wife really enjoyed her Po boy and said the shrimp were cooked perfectly. \n\nThe 2 bartenders were very friendly. There have been a lot of failed restaurants in this location so I am touting for them!"
    },
    {
        "id": 24,
        "text": "I was a huge fan of Couer, so maybe my expectations were too high for Acadia, but I found it just okay. The food was good, my favorite item was actually the happy hour slider, but everything could have been kicked up a notch. I had the catfish, which was good, but the corn side dish it came with was eh and you could tell the corn wasn't fresh. Both the salad and the fish would have been greatly improved with some acidity. My boyfriend had the jambalaya which we thought was just okay. I would like to go back to try the po boys and grilled oysters, hopefully they will be better!"
    },
    {
        "id": 25,
        "text": "Came in for happy hour and the menu selection is fair. Food has a lot of flavor. However, was a bit salty. There weren't any drink specials but the price was average compared to most places. Unfortunately I didn't get to try the seafood. I would come back to try that!"
    },
    {
        "id": 26,
        "text": "Fantastic beer selection with a few New Orleans brews, tasty cocktails, great atmosphere and delicious food make this new restaurant a great place to go anytime."
    },
    {
        "id": 27,
        "text": "Fantastic little spot right off the Italian Market. Had a great time at brunch there. Huge portions. You can't beat the bottomless mimosas for $18 with four different juice flavors either!"
    },
    {
        "id": 28,
        "text": "Absolutely love this place. Food is spot on and the waitstaff is genuine and friendly. The only knock on this place is that people don't seem to know there's an awesome Cajun joint right in the neighborhood.  It feels like it ought to be packed every night, but it tends to be pretty quiet. Who knows how long that will last. One of my favorites."
    },
    {
        "id": 29,
        "text": "New place, but the food is awesome! The staff are trying to still figure out how to smooth the kinks when it comes to service...but the food was fantastic. Well cooked, perfectly balanced, but definitely spiced well. Bloody Marys were amazing. Icing on the case is that they have a vegetarian option! Something you won't find in New Orleans"
    },
    {
        "id": 30,
        "text": "My wife, who wants to one day move to, live in, die in, and subsequently haunt New Orleans for all eternity, bummed last week when Fat Tuesday came and went and the best we managed was a Popeye's po boy to show for it. So I wanted to surprise her. I found Arcadia in a search and since several years ago we found Catahoula a little underwhelming, I surprised her with dinner on Saturday night.\n\nI made a reservation even though I thought that reserving a table for two was kind of silly. It turned out to not be as silly when the gentleman couldn't find me. I got an email confirmation but didn't think to save it to my phone or anything. I saved it here to show I wasn't crazy. We wound up sitting at the bar which was not ideal though the bartender Nikki did a nice job (it wasn't her, the wife is a shorty short and big bar stools are not comfortable for her for dining.)\n\nGot her a Sazerac which was good. I got an absinthe chilled and drawn through the sugar cube for that sweet mentholated taste I love so much and a Voodoo Cowbell Imperial Oatmeal Milk Stout which might have been the most luscious beer ever made. Good start.\n\nWe decided to turn it into tapas to try as much as we could so we got a shrimp po boy and substituted collards for the fries and medium size orders of the jambalaya and shrimp etouffee and we would split all three of them.\n\nBoth of the prepared dishes came out really tasty and flavorful.\n\nThe po boy tasted great - it might have been the best-tasting po boy in Philly. But it was also the worst value - six fried shrimp on what looked to be smaller than a WAWA shortie roll.\n\nWe had asked them to cut it in half and we literally thought that they misheard that we wanted half a po boy and gave us something from the lunch menu! Alas that was what $16 gets you. Damn shame. Forget about the principle of the matter, it just won't fill you up.\n\nWe left without getting Beignets because we had plans at 8 nearby.\n\nBeware when leaving Acadia: There is a huge step and the wife wound up hurting her ankle when she fell as we left. There may be a sign posted to beware the step, but I don't recall seeing it. If there isn't one, I recommend they put one there.\n\nOverall despite the fact the beginning started with a lost reservation and ended with an injury, we would probably give them another shot (though we're also gonna try Catahoula again to see if they've gotten any better), such is the dearth of quality NOLA cuisine in Philly. But we won't be getting po boys."
    },
    {
        "id": 31,
        "text": "I came with my husband and my cousin on a Saturday night. The bartender and waitresses were very nice. The chef came out to make sure we enjoyed our food. I had the fried chicken wings as an appetizer and the chicken and andouille gumbo which was really good. The beignets were also very good. I would definitely go back"
    },
    {
        "id": 32,
        "text": "Excellent New Orleans style cuisine! The gumbo was delicious, just the right amount of spicy. And their wings were amazing. Great service as well."
    },
    {
        "id": 33,
        "text": "It pains me to write this because it was my all time favorite place in Philly. We arrived last night around 6pm and we should've walked out then. None of the tables were cleared and there was 1 person being the waiter, bartender, and food runner. Waited 20 minutes to get out beers, only to find that they were skunked and didn't taste ok. Went with a coke, no flavor. Tried to order a few things and they were \"all out\". Pondered for a little on what to order (while we sweat in the 80 degree room). As we sat there, tables around us were sending food back for tasting bad so we decided not to order, especially because the waiter didn't tell others that the gumbo of the day was mussels and shrimp, when it's usually non seafood there. Got the appetizers and were extremely disappointed. It took us 2 hours to leave that place. Service was terrible, but the guy was doing the best he could. Beignets could've broken a window, they were hard and not fresh. Very sad because this place had a good thing going, but they can't get their act together. Will not come back."
    },
    {
        "id": 34,
        "text": "We came here tonight due to a Facebook \"Seafood Boil Bag\" event. They are piloting a new recipe so each bag was only $15 for tonight only.\n\nThe interior decoration is very classy and clean. The bathroom is beautiful and heated (it was very cold outside).We were promptly sat down at a pre-set table and the waitresses was very friendly. \n\nThe food arrives shortly after and smelled great. Right away, we could smell shrimp paste in the sauce! This is a lot more Asian authentic than the normal Cajun boil other restaurants serve. We were very pleasantly surprised with the taste and quantity of food. There was a snow crab cluster, a whole blue crab, one corn, plenty of clams, shrimps, mussels, sausages, and potatoes."
    },
    {
        "id": 35,
        "text": "Excellent food. Excellent service. Wonderful cocktails."
    },
    {
        "id": 36,
        "text": "Love. This. Place. The seafood boil is incredible. The beignets are to die for. The fried chicken is some of the best I've ever had at a restaurant and then staff is amazing...from the bartenders to the servers to the chef. Hands down one of my favorite places to dine."
    },
    {
        "id": 37,
        "text": "Great food for an affordable price, I went the other day with a couple friends and we sampled the Jambalaya, Gumbo, Shrimp Monica, and the Red beans and Rice.  All four dishes were delicious and will be ordered again! The chef/owner came out and the atmosphere of the restaurant was delightful.  The spirit of New Orleans lingers in this restaurant and I look forward to sampling everything else on the menu!"
    },
    {
        "id": 38,
        "text": "Our party of six had a great time at Acadia. We had the gumbo, jambalaya, veggie jambalaya, shrimp po boy, catfish, and shrimp pasta. My gumbo was very tasty, and the side potato salad spot-on. Comes with some nice bread, and we were given some free cornbread when we first arrived. Paired with a Sazerac and an Abita Purple Haze and I was happy. Service was attentive and friendly, and the chef came out to chat. They also have a kids menu. Will be back, want to check out happy hour here."
    },
    {
        "id": 39,
        "text": "My family and I had an 11 o'clock for Sunday Brunch for Mother's Day. The restaurant was surprisingly but happily uncrowded. The bar was empty and there were just a few families at some tables in the back. Two musicians set the mood with smooth jazz and our server Brian promptly set out waters for us.\n\nI was a little baffled by the plastic cups the water came in especially when we were given a small carafe of water for refills in a lovely glass jar. Along with the beautiful vases if flowers the kiddie cups just didn't fit. My group started with a round of cocktails, an absinthe and champagne concoction called \"Death in the Afternoon\", fried chicken for the table, shrimp and grits, shrimp Etouffe and a vegan waffle plate.\n\nThe chicken was definitely fried to order and came out piping hot. The flavor for me was spot on, others said it was salty. I would have preferred some flats in the mix but we were given all drums.\n\nThe entrees were up next and unfortunately the presentation was ruined when the young lady who delivered the shrimp and grits brought it to our table by hoisting the plates from the back of our booth and slide them between us. The result was one plate spilled over directly onto my hand bag. I was not pleased. I was however glad it was my bag and not my moms white shirt. The proprietor who had been present came over to see about the problem but that's all she did. There was no inquiry about damage and I wasn't even offered a cloth to wipe my bag. She just blew it off and  is the main reason for low rating.\n\nThe brunch went on without any other incident. Brian was consistently amazing. Everyone enjoyed their meal but we agreed the consistency of the grits were better suited to the use of a spoon which was not provided. Instead of picking up a nice heapful most of the grits simply slid threw the fork. I would also rethink the shallow dishes they came in. If your crew has the harrowing task of getting the plate to the table by leaning over the back of the banquet and sliding it past your patrons lap maybe you need a deep bowl. A bowl and a spoon."
    },
    {
        "id": 40,
        "text": "A fabulous meal to end a lovely day, I went with a date during a massive early summer rainstorm. The team there was on point and super friendly, and it was a delicious and fabulous dining experience. The beer list is great and the cocktails and wine are top notch. The atmosphere and ambiance are lovely, and it is a really nicely appointed physical space. The music was perfect, and glancing out at the falling rain it felt like the only thing missing was a second line parading by. We began with the goat cheese and honey bites, which were so delicious we had to order another set. Flavorful, warm, perfect. We split two entrees, and both enjoyed the Chicken and Andouille Gumbo and the Shrimp Monica. The gumbo was done in traditional NOLA style, and served with Crystal as it should be. Yum! I was very impressed with the Shrimp Monica, which was absolutely a triumph. The shrimp was meaty and prepped perfectly, and the rotini was a nice compliment. The cream based sauce had a nice spicy beat to it, andI would absolutely order this again. I'm excited to make a return trip and have dessert next time. Great spot, thanks for an awesome time!"
    },
    {
        "id": 41,
        "text": "I love New Orleans and lived there for a couple years.  I know a thing or two about cajun/creole cooking.  This place is authentic.  Started with Abita and an IPA, complimentary corn muffins, totally delicious.  The gumbo was good, the oysters were amazing.  Wings were meaty and the acadia spice was zingy spicy. Moved on to PBC Kenzinger and Prima Pils.  Next we tried the shrimp po and jambalaya.  Both were authentic.  I liked the spicy fried shrimp in the po boy.  For desert we tried the bread pudding and peach cobbler, 7 bucks each.  We were stuffed since portions were large.  I feel like this is a good go-to place in Philly if you want to get your Nawlins on.  If you miss Mother's, this is your place."
    },
    {
        "id": 42,
        "text": "I've been eating and drinking at Acadia for months now, and really like this place. They have recently extended their happy hour to 8:00 which is amazing, and this last Thursday they had an amazing Dixieland/Blues musician playing. I'm normally not a big fan of live music at bars, but this was really a treat. \n\nService is great. They have a well curated selection of craft beer. I've always enjoyed the food, but recently its reached a new high. I don't know if they got a new chef or what, but I've never had a better poboy or hush puppies. I'm a pescatarian but they have great veggie options here too. \n\nIt's offer slow here, which I kinda love, and want to keep it a secret, but know it's not good for business. This place deserves to succeed, so if your looking to be well taken care of and have a delicious meal and drink Acadia is well worth a visit."
    },
    {
        "id": 43,
        "text": "I absolutely loved this place! My sister and I came in here on a Saturday night. The decor was pure New Orleans and the atmosphere was welcoming. There was also a singer providing entertainment. The food itself was phenomenal. We had the chicken wings and the jambalaya and the corn bread. I'm glad we ordered all of those things because it gave us a good sampling of what the restaurant had to offer. The chef came by our table half way through our meal to ask us if we enjoyed it and just chat us up a little bit and we really appreciated that. I would recommend this place to anyone looking for a break from traditional cuisine found anywhere. Especially because it's one of the few places in the area that was still serving food that late (we got there after 9)."
    },
    {
        "id": 44,
        "text": "The place looks cozy and the server was nice. We were the only customers on the Halloween night and later another couple joined. Considering that it was only three of us in the restaurant the service was extremely slow. They got one of my friend's drink first and the rest of us had to wait another 10-15 minutes for our drinks. Which was odd. I didnt like my drink because it was too sweet. My friend didn't like her Hurricane drink because there was too much rosemary. Till here I would give them three stars. The reason I'm giving one star and if I could I would have given zero is that they brought the food for my two friends after a while but they failed to bring mine. \nMy friends were done with their food when my food finally arrived. And I need to mention again that we and one other couple are the only patrons in the place. I told the waitress I would like to return the food and just leave because this is obviously too late. She said ok and take my food back. After few minutes she came back with my food in a box and said the chef says we already made the food so you must take it! I checked the bill and they charged me for it. I said I don't think I should pay for this and I'm not taking it. She went back to the kitchen and after another 15 minutes of wait she said ok you don't have to pay and she took the box with her too.\nThis is so weird. I have never heard of a place that the service is so unprofessional and late and then they tell you must take the food because we already made it!! Clearly the owner doesn't know how to run a business...\nMy friend who had a jambalaya hated it because it was again too much rosemary. The other friend who had pasta and shrimp liked his food but then he was also frustrated with the service. Overall, they ruined our Halloween night! I would never set foot here again."
    },
    {
        "id": 45,
        "text": "We had a friend visiting from California and wanted to find a seafood boil place and this came up on Yelp so we decided to give it a try.  If you like Louisiana/Cajun style food with a kick, try this place out.  We liked every dish we tried and plus with the check in , we got a free food cup .  We had the seafood boil.  The only things missing were the mussels so they gave extra shrimp instead.  We also tried the étouffée with shrimp, gumbo, fried chicken, fries and had the beignets for dessert.  Everything was so tasty and it was a great ending with the dessert.  We went during happy hour and had champagne and the hurricane.  The prices are very reasonable for happy hour.  The waitress/bartender's service was excellent. The only recommendation for improvement I would make is to have other selections of flavoring for the boil.  I would recommend this place if you want Cajun food.  The flavors are delicious and you won't be disappointed!"
    },
    {
        "id": 46,
        "text": "Where do I begin? From the moment we stepped out of the car, the curb appeal was very positive. Then, we step inside a beautifully decorated, warm and cozy place that gives you that 'at home' feel. Great job on just getting us in the door. But way, there's more!\n\nOnce we were seated, near the perfect fire place, near the big screen TV, we were immediately impressed by the friendliness of the staff. Smiling, approachable, ready to help. Based on some great recommendations from both, we had some yummy drinks and ordered some great food.\n\nBeing from Baton Rouge, I am familiar with the southern Louisiana traditions that Acadia carries forward. The food has that delicious flavor I haven't had in a while, yet makes me feel like I'm at home. I appreciate the combinations that Acadia has put together, combining two different flavors into a wonderfully delicious duet of flavor. From the nutmeg-n-rice base, to the wonderful Bearnaise sauce, the Egg Acadia was a great compliment to the overall experience. And the Shrimp Etouffee was absolutely amazing -- exactly what I was craving.\n\nFinally, we met the chef who gave his a wonderful history of the restaurant, as well as some really awesome plans for the future (i.e. Mardi Gras being just around the corner). He was very nice, and was a joy to chat with. Certainly has a lot of passion to make our dining experience truly wonderful! \n\nAll in, A+\n\nWe WILL be back, and will be telling everyone about this amazing place! Now, Laissez les bons temps rouler!! And THANK YOU for making a little piece of Louisiana right here in Philadelphia!!"
    },
    {
        "id": 47,
        "text": "The food was amazing!! Chef Sean our did himself!!! Brian our server was fantastic! We can't say enough about the wonderful experience my fiancé and I have had here at Acadia. Seafood has been ruined for us forever! This dining experience is making us look forward even more to our honeymoon in New Orleans. We will certainly be coming back again!!!"
    },
    {
        "id": 48,
        "text": "The food was delicious for the most part, our bar tender Nikki was fantastic, however the portion of the Catfish Po-Boy was completely unacceptable. It's literally half a sandwich for what Catahoula and Khyber charge for a whole. Don't get me wrong, absolutely delicious and flavorful, but it left me feeling unfulfilled. Also the wings were nothing to rave about.\n\nI'd say take your money to Catahoula and get a full portion for the same price."
    },
    {
        "id": 49,
        "text": "OMG! I love coming here as it reminds me of being in Nola! The drinks! The food! The service! It's like I'm back in New Orleans. Repeat offenders because the drinks are on point."
    },
    {
        "id": 50,
        "text": "It was the first time for Acadia. They have a good menu for happy hour.\nSomething New Orleans style bar in City.\nBartender (luare)was very helpful."
    },
    {
        "id": 51,
        "text": "Loved everything about our recent trip to Acadia! We made a reservation for 2 on Friday at 630pm so we could enjoy the happy hour (which lasts until 8pm). We did not need a reservation. Our server was helpful and lovely. He was the only server besides the bartender so as it got busier he wasn't quite as available but we weren't in a hurry and it's not like we were ever left waiting/wanting. We had 2 happy hour cups- etouffe and gumbo- both super delicious. We couldn't quite pick a favorite BUT maybe the etouffe had a slight edge. We then split the chefs boil bag (crawfish, shrimp, crab legs, mussels) and added sausage, corn and potatoes. Got the original sauce bc I'm a little bit of a wuss about my spice and it was perfect. A little spicy but not too much. It was everything I'd hoped it'd be!!! The flavors were amazing. We then couldn't pass up beignets and got an order that was hot and fresh and exactly as you'd expect! Cannot wait to go back! I highly recommend anyone to go and support this awesome establishment!"
    },
    {
        "id": 52,
        "text": "I will definitely be coming back to this place! \n\nMy boyfriend and I have tried Acadia twice. The first time when the restaurant was very new and still having issues with staffing and workflow. That night there were only a few customers in the restaurant and yet our food took forever to come out (I mean FORVER). When the food did finally come, it was actually the wrong dish entirely....but it was really good. They also served this awesome corn bread that was fresh out of the oven. Because the food was so good, we gave it another try. Last night was much smoother. Our waiter did a good job serving and our food came out in an appropriate amount of time (and was the correct order). This time we got the jambalaya again and the blackened catfish. Both were excellent. We also met the chef and owner who came out to ask us what we thought and get some feedback. He told us about how he spent time in New Orleans studying the cuisine and seemed really passionate about his recipes, which made me appreciate them even more.\n\nBy the way I love that they have also a vegan jambalaya option and a nice cocktail menu. We were pleasantly surprised to see they also serve happy hour on Fridays until 7 which is a huge plus! I hope this place catches on and starts to fill up because I really would love to see it grow. \nI think having the liquor license still posted on the door makes it look like it's still not open, especially since the doors are tinted and you can't see how cute it is  decorated inside (New Orleans theme, cute little touches around the restaurant like jars with candles wrapped in Mardi Gras beads and unique art pieces on the walls). \n\nIf you are curious about a new neighborhood spot with a different kind of cuisine than new American, give this place a try. There's not a lot of New Orleans themed places in Philly (and the bars that do have it are heavily focused on fried food). It's definitely worth a try."
    },
    {
        "id": 53,
        "text": "Great drinks! Amazing happy hour! Draft wine and chicken wings are a must. Absolutely worth the visit."
    },
    {
        "id": 54,
        "text": "The hubs and I have been to Acadia several times since they opened recently. We have had a great experience every time. I appreciate that they have several vegetarian options on the menu, including vegetarian jambalaya (made with vegan sausage, excellent level of heat!) and a tofu po boy. The blackened catfish entree was superb. Overall everything we've had there seems to have just the right seasoning and heat/spiciness. I could eat the bread pudding for every meal! If you go for happy hour on Tuesday, it's Vinyl Tuesdays and bartender Keith is playing a great collection of jazz records. You can also bring your own to be played."
    },
    {
        "id": 55,
        "text": "THE WORST SERVICE I HAVE EVER EXPERIENCED.  A friend recommended this location.  I decided to throw a quick birthday dinner for my mother. But things went all wrong from the onset!! They assigned a new waitress to a party of 15. She was unfamiliar with a some of the dishes and the  market prices. TWO (2) hours LATER WE ARE STILL WAITING. The worst. Never ever ever going back. Keep walking...go to another restaurant."
    },
    {
        "id": 56,
        "text": "I have been to Acadia a number of times and have enjoyed most everything they have to offer. They have a robust Happy Hour that runs from 5-8pm Tue - Fri with $5 food and $5 drinks.  Until $8pm !! Incredible deal for late working folks. \n\nMy favorite cocktail is Le Petit Mort which has a rosemary infused vodka, gin, lemon juice, rosemary simple syrup and grapefruit juice, shaken and then strained into a glass with a blow-torch seared spear of fresh rosemary (such a dramatic sight for the whole bar to see). I want to try other cocktails, but always am drawn to Let Petit Mort. The Hurricane is also delicious. They have fresh beers on tap flown in direct from NOLA, so Acadia is the only place in Philly that serves Abita Amber Lager. Red and White wines are also on tap and served by the glass, 1/2 carafe or full carafe.\n\nI love the Viet-Cajun Boil which is super flavorful as is, while my husband likes Burn Yo' House Down style, which is super hot. The shrimp Étouffée has deep flavors and the Creole Jambalaya is outstanding. I also enjoyed the Blackened Catfish with collard greens and mashed potatoes one evening. The remoulade sauce on the Shrimp Po Boy is classic tasty. While the roll is about 6\", it was plenty for me as it is served with seasoned fries. The chicken wings are the best I've ever had, with deep, soulful Cajun flavors. \n\nI just went for brunch this past weekend and was not disappointed. Bottomless Mimosas with whatever juice you prefer for $18. All the classic lunch and dinner Acadia dishes and then some great new breakfast options. \n\nThe beignets are a winner and they also serve chicory coffee.\n\nDid I mention that there is Comedy Night on Wednesdays with no cover and you will find live music regularly? They also show Saints games on Sundays. \n\nThis is a great little spot with beautiful decor and furnishings and very caring staff. Always a diverse crowd and always a great experience. Like a trip to New Orleans without the airfare."
    },
    {
        "id": 57,
        "text": "I was with a group of 10 for dinner this past weekend and the food and experience were superb. We all loved the wings in particular, and my shrimp etouffee was excellent! The live band made me feel like I was back on Frenchman street. The restaurant was also very accommodating for our large group, which included a baby. Not to be missed."
    },
    {
        "id": 58,
        "text": "Chargrilled oysters were bomb but the seafood bag that I got wasn't. The flavor was bland and the seafood was dry. The crab legs were so small too. Got some mussels that didn't even open aka you can't eat them- not worth it. Service was slow and semi-friendly. I will not be coming back."
    },
    {
        "id": 59,
        "text": "I am new to this area of Philadelphia, and apparently Acadia arrived around the time we did. Wow! As Italian Americans, my wife and I are looking for alternatives to the many Italian restaurants here, and Acadia fills the bill wonderfully. What makes this restaurant particularly special is is its Cajun/Creole cuisine. (I will note that New Orleans is one of the favorite places in the world of me and my wife.)\nWe brought friends from other sections of Philly and even out of town here, and we were all impressed. There was a wide variety of starters available, from buidin balls (a type of hush puppy), jalapeno poppers, and chicken wings that were tastier than any I got elsewhere.\nOur entrees were also all good, from jambalaya, etouille (not sure of the spelling), catfish exquisitely prepared, and great collard greens as a side dish.\nWe will be sure to return, as this type of cuisine is hard to find in the first place, let alone prepared so well. I also want to soak in that NOLA atmosphere every once in a while."
    },
    {
        "id": 60,
        "text": "Was here twice and both times underwhelmed by the food and service. it is a shame as i was really hoping that this would be a favorite spot of mine. \nI love NOLA and have visited often.  Obviously i was't expecting perfection but at least something good.  i have tried the wings and they are good.  But i came for some good ole fashion NoLa cuisine and i didn't get anything close to that.  The gumbo and jambalaya were both unseasoned.  my husband's sandwich also very bland.  the beignets nothing like a beignet should be and on the heavy dough side.  the waitress took a long time, despite us being the only ones in there for over an hour for dinner time.  she took a long it me to come back and forth to tell us that various dishes were not being served or that they were out of something that came with whatever we chose.  She also was not able to answer basic questions and stated that she had not tried such and such on the menu so gave no opinion or favorites.\nI will stick to traveling to NoLa for now"
    },
    {
        "id": 61,
        "text": "Went for brunch. I was looking forward to it since I love the food in New Orleans and they offer a lot of gluten free options. The gluten free waffles were frozen waffles that you can get from the frozen food section in the supermarket! I'm suppose to pay $14 for that? The bacon was one step shy of burnt. The mimosas were very juice heavy, which is ok...I guess. We left and went to eat at the Reading Terminal. Never going back."
    },
    {
        "id": 62,
        "text": "I am so excited for this addition to the neighborhood. The vibe inside is comfortable and relaxed and the food is exceptional -- nice portions with powerful flavors -- I've had three meals here and enjoyed each one fully, particularly seafood dishes. The New Orleans infusion is excellent, and they have a great bar to boot. I'm looking forward to coming back to try brunch. Keep it up!"
    },
    {
        "id": 63,
        "text": "This is one of my new favorite spots in philly to eat/drink! The red beans and rice was just as good as New Orleans! I also loved the way they make their hurricanes and they have a lot of great beers! Check it out!"
    },
    {
        "id": 64,
        "text": "This place rocks. The chef, server, and bartender I met were all amazing and friendly. True blue NOLA experience here, and that's a high compliment coming from me, as NOLA is my favorite place on Earth. Every bite of food and sip of drink were sublime and the wife and I will be regulars. Highlights: French 75, Hurricane, char-grilled oysters, gumbo. I'd give Acadia six stars if I could."
    },
    {
        "id": 65,
        "text": "I've been craving some Cajun cuisine after visiting NOLA for the first time last summer, so I really wanted to love this place. I came with two friends to have Saturday brunch early afternoon and there was not much of a crowd, so we were seated immediately. The service was warm, fast, and attentive. Unfortunately, the food left a bit to be desired. I ordered the Southern Comfort molasses lemon pancakes and the pancakes were flavorless. I never like wasting food, but I only managed to finish one pancake of three---part of that was due to the molasses making the pancakes super heavy, but it was mostly because the pancakes were bland and largely inedible.\n\nThat said, I should note that the beignets were fantastic---honestly better than the ones I had at Cafe du Monde last August. It appears they've changed their menu a bit since I last visited, so despite the mediocre meal the first time around, I will definitely be trying this place at least one more time."
    },
    {
        "id": 66,
        "text": "Great Food & Pleasant Atmosphere. My best friend and I met for Lunch but we arrived a tad late for their lunch menu and was asked to return at 3pm. Being that it was only an hour wait and we were walking distance to South Street, we decided to wait and I am glad we did! The fried chicken was magical. Enjoyed my waiter and cocktails. It's a very cozy space and we felt like we were at an Aunties house for dinner. This is a great find."
    },
    {
        "id": 67,
        "text": "My husband and I stopped here for dinner Friday night.  Neither of us has ever been to New Orleans; but, we heard good things about this restaurant.  I half expected to burn my face off but I like an adventure and just hoped my husband would find something mild enough for himself.  We were amazed that we loved the food so much!!  The red beans and rice were so flavorful and savory!  The shrimp Monica and shrimp Étouffée were out of this world!!!  It was a perfect evening to dine outside \n\nThe decision was made to return on Sunday with the whole family to try the brunch menu.  Oh sooo good!  Something for everyone with a very special kids menu.  We each ordered a different dish and shared.  Everything was delicious: Grillades-N-Grits mmmm, shrimp-N-grits, eggs Acadia and Acadia breakfast Poutine with a super special cheese sauce!  \n\nSince it was raining we were inside for brunch.  It was so colorful and cheerful on a dreary day :) Fun paintings on the walls, colorful chairs!  The thing that surprised me was that there were three other large parties like ours and the place was large enough that we each had our own private area and yet still festive with the other groups celebrating birthdays, enjoying the game on TV, just brunching like us.  Can't wait to return!!!"
    },
    {
        "id": 68,
        "text": "Came here for dinner on a Saturday and were seated right away. Service was super friendly and attentive. You get a free cornbread muffin, which was good - moist and not super crumbly. \n\nThe food is just okay. I wasn't wowed by anything specific, but it was decent. The sweet potato fries were excellent though and my husband said they made a fantastic sazerac. \n\nIf you're in the area, give it a try."
    },
    {
        "id": 69,
        "text": "We randomly found this restaurant and could not believe how good the food was! I had a hamburger and bacon Mac and cheese bites and it was mouth watering. The fries are really made differently then other places! They were delicious! I also had a hurricane for a drink and tried the goat cheese bites. This was so good I came back for brunch! The servers are really nice and friendly and as for the look of the place it literally feels like NO. They play the saints games on Sunday and have plenty of specials!"
    },
    {
        "id": 70,
        "text": "Great price of $27 for the boil with crawfish that I split with my partner. Bag contained 1/2 pd each of shrimp, blue crab, mussels, snow crab legs and we were lucky to get crawfish. The chef even came out at one point to show me how to eat the crawfish since I've never had it. We didn't get any sides but we were offered bread. Looking back we shouldn't have declined; because the regular Viet-Cadia seasoning was recommended by the waiter and was to die for. The meal was amazing and I'm looking forward to going back soon!"
    },
    {
        "id": 71,
        "text": "I don't normally take the time to write reviews, but this place is really great. We love Cajun food and their gumbo was amazing and the best we have had. Chicken wings were incredibly moist and tasty.  We love the atmosphere particularly we date next to the fire place.  We met Shawn (sp?) who seemed like a great guy who took a lot of pride in his work. Will definitely return."
    },
    {
        "id": 72,
        "text": "We wanted some seafood that night and i'm kinf of familiar with boiling seafood....the place was regular not like a crazy new orleans decoration like i saw on the previous reviews...still cute ,colorful chairs i saw a cheminee too so maybe need to check it out on winter.chargrilled oysters was good , the risotto cheese croquettes ...mmm...ok didn't really taste the cheese.and then the boil seafood bag which was verrrrrry salty and i eat already salty so if i said that it was salty it was salty!! I asked also for mild but ut was veryyyyy spicy!!! But the flavors was there so i kept traying and traying and my mouth was on fire!!!!\nAlso i asked for potatoes they put the entire whole potatoes inside  at least small ones or cut it so it can absorbs the spices a little bit .\nIn general im not saying that it was a bad experience but it could be really better or maybe was not my day‍"
    },
    {
        "id": 73,
        "text": "This is the new Creole/Cajun style restaurant that took the place of Couer. They just opened, so my girlfriend and I thought Mardi Gras would be the perfect time to try them out. Before I mention anything else, I want to be clear that the food here is very good. It would be hard to find better New Orleans style food in the area. But there are some definite corrections that can be made, which I'll detail here.\n\nWe ordered the wings as an appetizer, the catfish and jambalaya as entrees, and king cake for dessert. We've been to Louisiana multiple times and love the cuisine in that region. They do a good job here. The wings stood out as excellent- they cook them with a southern fried chicken batter, so they're like...mini fried chickens. The bar stocks Abita and makes Hurricanes, which is a great touch as well.\n\nThe service during our meal had issues. Our server, while maintaining a positive demeanor, was totally overwhelmed with duties. Which is understandable, since he was the only person serving the entire restaurant. This includes bussing. There wasn't a busboy to remove dirty dishes, so there were just empty tables filled with dirty plates. There was no way he could serve the guests and bus as well. With that being said, service was very slow.\n  \nThe décor and vibe seem a little unpolished. Like the aesthetic concept was half baked. I'm not sure if this is the owner's first restaurant, but it needs to come together a bit. It kind of feels like eating inside the shell of a former restaurant.\n\nThese criticisms are all easily fixable. They are new, so they have time to get it all resolved. I'll be back for a follow up review, mainly to try some of the sandwiches as they looked delicious. If they can work it all out and maintain the food quality, I predict good things in the future."
    },
    {
        "id": 74,
        "text": "I dined here on Sunday Dec 16. Chef Sean, Maryanne( his wife)  and Alissa our server were very nice! I appreciated the time both Chef Sean and Maryanne took to stop by our table. That means a lot in my book. \n\nWe had the charbroiled oysters and they were amazing!!!  Really good flavor that stayed on my palate long after I swallowed! Niiiiice!!!  Can you say a Foodgasm!! I am in love!!!! Their wings are the best seasoned fried wings EVER tasted! fried just right and came out hot and crispy!!!! They even let me get all flats!!!! woo hoo!!! The hurricane was not strong, it tasted like juice but hey, the food was good!!! The seafood boil was a miss. The crab leg was very small and was overcooked and the sauce had too much crab boil and lime. I will go back for a second try to make sure it just wasn't a bad batch that day. \n\nThey are located in South Philly in a residential area, so you knowwwwwwwww what that means!!!! You will be driving around for a timed spot. I suggest parking some place with parking and catch Uber or Lyft over."
    },
    {
        "id": 75,
        "text": "This place is delicious! Their chargrilled oysters are amazing, their happy hour has so much to offer ($5 food items/ drinks from 5-8), and their homemade beignets are super yummy! If you love New Orleans food you will love this place!"
    },
    {
        "id": 76,
        "text": "Three strikes, you're out. I am honestly so disappointed to be writing this bad review... I had hoped that after one bad experience when they first opened that the next would be a little better... It certainly was not. I then hoped that by waiting six months to try again, it'd be better... it was the worst, and on Mother's Day to boot! The real shame is that the it was not solely the service staff to blame - the owner/manager/chef situation must be the root cause.  Each time we've been, they ran out of ridiculous items... Once it was champagne AFTER we had ordered their bottomless mimosas... Another time it was tomato juice when I asked for a bloody Mary, and every time they had run out of kat least two things from the menu - and instead of letting you know upfront, the server went back-and-forth from either the bar or the kitchen to tell you that they were out of it and try something else. On two of the three occasions, food wasn't brought out for over 45 minutes... and that was just for one of us... everyone else had to wait 10-20 minutes for their meals, thereafter. So much for \"wait until everyone\" is served etiquette. We had only been offered an apology one of those three times, and it from a bystanding hostess. The sad thing is that I pride myself on not being overreactive when it comes to poor restaurant experiences... I've vowed never to leave a bad online review before attempting first to speak with the owners about any problems. I tried THREE TIMES via three different methods... in person at the restaurant (she was busy in the kitchen and unavailable), an email, and through instagram inbox - all three resulted in zero response. There aren't many restaurants like this one in the area so we were so excited when they opened, but it seems useless now. They have stolen my time and money and ruined a part of my day for the last time. Customer beware! \"Catahoula's\" is a few blocks away and they do great New Orleans style food too!"
    },
    {
        "id": 77,
        "text": "This place is a rip off. I paid $16 and all I got was this half sandwich. This isn't lobster or seabass or swordfish we're talking about. It's a basic catfish po'boy."
    },
    {
        "id": 78,
        "text": "Wow wow wow! How did I Not know this place existed? Located on 8th and Christian, right next to the Italian market is a super legit Cajun restaurant! The owner is from New Orleans do everything is authentic! We had a chance to attend the soft launch of their Viet Cajun crab boil and were totally brown away. Super fresh seafood cooked to absolute PERFECTION! The boil had a blue crab, a bushel of snow crab, giant clams, tons of huge mussels, corn, potato  and andouille in a Vietnamese/Cajun broth. we also tossed in an order of the boudin balls for good measure. They have a great $5 happy hour and a rocking brunch menu to which I'm already planning on going back for tomorrow haha full bar to include absinthe, bunch of Louisiana beers and cocktails. If you're looking for authentic cajun food in Philly, this is it!"
    },
    {
        "id": 79,
        "text": "This hasn't been the first time I've closed out an establishment and it for sure won't be the last but the experience I had here is one of a kind. One of those opportunities left up to the cosmic workings of the universe. What a way to end an evening. \n\nThere were two people sitting at the bar as we walked in and Sean said take a seat. We knew (or figured) they were closing but he just welcomed us with open arms. Originally the plan was to just get drinks. The possibility of grabbing a bit to eat was intriguing and honestly needed after the long night of drinking but the surprise we were in for was quite a treat. \n\nWe grab drinks. Nothing serious considering we were trying to be considerate of the hospitality, just a few beers. Sean said he had Abita and I hopped (no pun intended) right on it. That sparked the beginning of our convo. They have quite a few styles of beer from Abita that you might not be able to find in the city and for me Abita is a staple. Great flavors, not too strong but full bodied. Whenever I can grab my hands on some, I will. Shortly after ordering the other patrons left and we had Sean to ourselves. \n\nWe talked about his history in the food industry, Canada, him attending the Wharton School of Business, New York, New Orleans, Food, you name it. Long story short Sean is not only the Chef but the owner of Acadia. Being the man of many hats his passion truly shined through last night. He didn't care that we were the last customers after the restaurant had technically closed. He wanted to show us his love for food and we allowed him to do just that. \n\nHe went into the kitchen and whipped us up some dishes to eat. The first of which being an appetizer of Oysters, followed by dessert (Banana Pudding). This man didn't have to do any of this yet he did and my heart, stomach and consciousness will forever be indebted to Sean Nevins. If we had more time we would have had him cook anything he wanted but we didn't hold him hostage for much longer after dessert. \n\nI don't care what you think you know about food or perhaps your liking of certain dishes and cuisines, get your butts over to Acadia."
    },
    {
        "id": 80,
        "text": "Listen, I have been DYING to try some really good NOLA food since I don't have to space to travel, so when Acadia opened, I almost lost it out of excitement. I had pretty high hopes when I finally got the chance to go, but I left only half as excited as when I arrived.\n\nMy boyfriend and I started off with the free cornbread, sliders, and fries. The cornbread was pretty good, being a little on the drier side which I appreciate, plus the butter was oddly really good. The sliders kind of stole the show in my opinion, even though it's just ground beef. The fries were really well seasoned too!\n\nFor entrees, he got the Chicken and Andouille Gumbo and I got the Creole Jambalaya. I was a little thrown off since the shrimp in the jambalaya was more of a garnish than anything. The rice itself was pretty dry and needed salt, but I revived it as much as I could. His gumbo definitely won in terms of flavor, but neither of us were wildly impressed.\n\nThe beignets, which were -pretty much- the only reason I really wanted to come, fell a little short for me. They're definitely smaller than other ones I've had before, but at least they tasted nice.\n\nI would definitely come back to see if it was just an off day since I really want this place to be good!"
    }
]