[
    {
        "id": 1,
        "text": "Delicious bagels. It's a bagel shop so I'm not looking for pancakes, bacon, sausage or eggs. If you want a breakfast platter, go elsewhere. If you want good bagels with butter, cream cheese or plain...this is your spot. Cinnamon raisin and everything bagels are really good!"
    },
    {
        "id": 2,
        "text": "Breakfast food is hard to mess up, but somehow everything was pretty blasé. Oh except the ice coffee!... That was terrible \nWe got Waffles and French Toast and other breakfast sides.\nHash browns tasted frozen, eggs were just OK, waffles were flavorless."
    },
    {
        "id": 3,
        "text": "Love coming here to get a fully stuffed bagel.....lox is fresh and cream cheese is full of flavor. Ordered an everything bagel with lox & scallion bacon cream cheese and an iced coffee. Everyone is nice that works here and It is truly the perfect Sunday brunch food!"
    },
    {
        "id": 4,
        "text": "Well this place just lost their awesome review. We have been ordering through grub hub and our food was always right and here quickly. \n\nAfter receiving an email from this company letting us know that it's cheaper to order from them directly, I took that route. \n\nAn hour after I ordered, I called to see where my food was. The owner answered and told me that they hadn't started my food yet. Oops. \n\nI told them if they didn't think it would be here within the next 30 minutes to cancel my order. They assured us it would be here shortly. \n\nMy food arrived about 20 minutes later and we began to pass it out. I ordered three total bagels and a egg, chorizo  and cheese sandwich. One bagel was charred burnt and the sandwich was just regular sausage patties. \n\nMy husband called back to let them know how disappointed we were for ordering food from their site instead of grub hub as they suggested. The owner told us that because they were busy inside, their website ordering was pushed back. \n\nHe then explained that our food was incorrect and she told him he was lying. Why would a grown person call an establishment that they tend to frequent to lie about their service? She kept talking over my husband and telling him that we were incorrect for ordering our food the way it was ordered. Are you kidding me? She used the statement \"I'm not saying you're lying, but your food was made correctly\". That's literally saying we are lying. This drama is not worth it for bagels."
    },
    {
        "id": 5,
        "text": "Great breakfast place! I go weekly the menu has a lot od options. The staff is always friendly. I would definitely recommend."
    },
    {
        "id": 6,
        "text": "I get breakfast and bagels from here just about every weekend. I love their everything bagels, best j e had in philly. Their pancakes are good, both special but hit the spot. Corn muffins are quite tasty and their blueberry muffins are good too, just a bit sweet for me. Service is always very good."
    },
    {
        "id": 7,
        "text": "Please do not waste your money.\nYou get exactly less than what you pay for.\nHorrible service.\nRude employee\nMessed up order without an apology or refund.\nNasty unscrambled eggs on top of one slice of cheese, hard bagel without butter and wrong meat.\nNever again!"
    },
    {
        "id": 8,
        "text": "In short, the parts of my experience was better than the whole. I ordered the fishermen's special which isn't on the menu. It's supposed to come with avocado, which they were out of. Asked for lightly toasted bagel, it was burnt around the edges. It didn't taste like it had scallion spread on it and for $10.74, it seems overpriced for what I  received. The nova was okay as was the whitefish salad which I picked off because my bagel was burnt.  Back to REAL Jewish delis. Trying to diversify?"
    },
    {
        "id": 9,
        "text": "Have eaten inside a couple of time and food is prepped quick.  There wasn't much of a line.  The place itself to get to is inopportune and previous eateries near this location have not succeeded.  \n\nI will say the bagels are good and probably one of the few good non main line establishments.  The salad is a descent size but simple, filling though.  \n\nThe bagel chips I will give a 10 for originality as that is the side that comes with the sandwiches."
    },
    {
        "id": 10,
        "text": "I ordered an everything bagel with plain cream cheese. It was good, but I was hoping for more flavor than what was there. The real problem is finding this place. For those of you who also got lost like me, ignore the Apple maps directions because they are totally wrong. This place is on the second floor of the building next to the Starbucks drive thru. Hope that helps!"
    },
    {
        "id": 11,
        "text": "3 failed attempts at delivery so I'm not sure how the service is going in person.  Last 2 times I ordered they messed up everything on my order.  This time they forgot an item.  I brought it to the delivery drivers attention and he said take it or leave it, he isn't dealing with adjusting the price.  Done with this place."
    },
    {
        "id": 12,
        "text": "I literally have no words. I feel robbed lettuce was yellow old and warm salad was missing ingredients I ended up having to turn it into a real salad by cooking food and taking the eggs and avocado and tossing the rest of it out. My danish was DRY with no filling and I am not exaggerating. I spent 22 bucks on nothing. They are however friendly people."
    },
    {
        "id": 13,
        "text": "Great breakfast/lunch spot. Very friendly staff. Prices are solid. The place is on the upper level, so look out for that. Milkshakes here are also quite tasty"
    },
    {
        "id": 14,
        "text": "I have been here many times for breakfast and lunch.  Consistently very good for what it is.  Bagels are excellent for Philadelphia.  Staff and friendly and accommodating.  Very eager to please.  I think many of the negative comments had more to do with their adjusting as a new business and I would give it a second chance."
    },
    {
        "id": 15,
        "text": "By far the best bagels I have had in Philadelphia! The location is a little hard to get to right on City Ave but what a gem. They have a whole variety of bagels, including the standard onion, everything and plain options as well as some more original ones like Sun Dried Tomato. I tend to get the Everything with Sausage, Egg and Cheese but I don't think you can go wrong with any option here. The prices are reasonable as well so you aren't spending an arm and a leg."
    },
    {
        "id": 16,
        "text": "Great place to grab a breakfast bagel and coffee in the morning or a sandwich in the afternoon. Prices are reasonable enough to make this an \"every morning\" kind of place. Owners are friendly and cheerful."
    },
    {
        "id": 17,
        "text": "Tried ordering again through UberEATS and this time the food eventually arrived though it was over a half an hour later than the initial estimate, still better than my order getting canceled and not finding out about it for over an hour that happened last time.  \n\nIn terms of food, I got french toast (decent but nothing great), a platter with an onion bagel (which was pretty good), fried eggs/veggies/home fries and bacon (all were decent though the bacon was a little salty), and a brownie which wasn't that good (have had much better).  Overall seems like a decent place for bagels but not reliable with delivery orders."
    },
    {
        "id": 18,
        "text": "Good bagels. I enjoyed the lox and bagel on everything. The kids liked the pancakes and bacon. First time my wife ever said, \"too much cream cheese.\" Better than not enough!"
    },
    {
        "id": 19,
        "text": "We've had them deliver to our office now on a few occasions and I have to say, these breakfast sandwich issues are some of the best I've ever had. The others I order with all agree, the cheese is so good! Super reasonably priced as well."
    },
    {
        "id": 20,
        "text": "Tried ordering delivery from them on UberEATS and got a call about 40 minutes later (after the initial delivery expected time) that the order was canceled."
    },
    {
        "id": 21,
        "text": "First time ordering after receiving grand opening flyer. Ordered one breakfast sandwich: two eggs with cheese. Added hashbrowns. Also ordered: three egg omelette with egg-white veggie and three cheese toppings, it was supposed to come with toast or bagel, I asked for toast. Delivery was about 50 minutes, not terrible but could have been sooner. Food was room temperature at best. Both orders incorrect. My omelette did not have the egg white veggie, it did not have the toast, it was as thin as two napkins on top of each other. Worse, I was charged more than the cost on the menu. The bagel did not come with the hashbrowns. They are not on Grubhub, we ordered by phone. Female had a heavy accent and asked us to repeat several times. This was their grand opening, so I suppose mistakes will happen but they are not off to a good start."
    },
    {
        "id": 22,
        "text": "Friendly staff and delicious bagels. Some past reviews complain about not being enough meat on sandwiches- I think it's just about what you get anywhere. I like to make my bagel especially unhealthy and had a hash brown on it. Favorite bagels in the area"
    },
    {
        "id": 23,
        "text": "Pancakes weren't that bad but wanted to charge me .50$ for a small extra side of packaged butter"
    },
    {
        "id": 24,
        "text": "First visit to this very clean new business with a friendly staff and delicious food. We had lox and cream cheese on a sun-dried tomato bagel, with a large (24oz) cappuccino; and egg and cheese on an everything bagel, with a large latte. The bagels were great; just the right crisp to the outside and nice and chewy inside. The lox and cream cheese was delicious, and the egg and cheese was too, made fresh. The price seemed reasonable for as good as the food tasted and as large as the drinks were, about $21 total. Obviously, you can be out the door for much less if you're just coming for the great bagels. We'll be getting our home bagel stockage here from now on. To pick up my coveted fifth star, I'd like to see more coffee drink options and maybe slightly bigger portions for the sandwiches. Oh, supposedly this place delivers too! We'll certainly be trying that feature out in the coming days. Overall, great place. We'll be back."
    },
    {
        "id": 25,
        "text": "I made an order at 10:02 and got a confirmation email at 10:05 am...  for a delivery through grubhub.    I understand places can be busy and they get multiple orders during the day.    I also understand being late and calling the customer.   It is now 12:15 pm and my food has not been delivered.   Don't pull the oh well I suggest you come into the store because the whole reason for delivery is because you can't.   I had a baby who was sleeping and woke up to no lunch.   No big I can whip her something up real fast but was banking on the food being here.   This is ridiculous and I will not be reordering from this place again!!!!!"
    },
    {
        "id": 26,
        "text": "This restaurant is NOT KOSHER even though they state they are if you ask them!  There is a Kosher Bagel Store called NY Bagels on Haverford Ave. in Phila.  I recommend you not do business with any store that is dishonest.  I wouldn't even give such dishonesty one star!"
    },
    {
        "id": 27,
        "text": "I used to love this place but it has gone downhill, delivery times are over 2 hours and stuff is rude and dismissive. Too bad."
    },
    {
        "id": 28,
        "text": "If I could rate lower than 1 star I would. First, order took over an hour to get, food arrived cold and missing the turkey bacon I ordered. Let's just say this is the first and last time I will be ordering anything from here."
    },
    {
        "id": 29,
        "text": "Over charged, poor customer service they did not complete my order i had to go back and wait and was not satisfied and they refused a refund i feel disrespected because i work hard for my money and i will never ever go there again"
    },
    {
        "id": 30,
        "text": "Bought a dozen bagels. ONE would have been too many.\nDoughy, uneven baking..just lousy. The \"everything\" appeared to have oats\nmixed in with the seeds. If you like east coast bagels, don't go near this place. They reminded me of \"California\" bagels...the kind that don't get boiled."
    },
    {
        "id": 31,
        "text": "I have been to my home town bagel shop many times and thought it was good. My son and I took a trip to Philadelphia on Sunday and stopped in for a quick bite. These were the best bagels I have ever tasted. I had the veggie cream cheese which was out of this world. The person who waited on me was the owner and she was very friendly.\nAs I read other reviews I only saw 2 negative and it seems as they were from people that has delivery. Get out of bed and go to the store, it is well worth the trip...\nThanks for a pleasant experience and a friendly greeting..."
    },
    {
        "id": 32,
        "text": "I don't know how this place wasn't packed on a Sunday morning at 8 am, was greeted immediately upon entering. Ordered two breakfast sandwiches, both good- fresh. The everything bagel could have been more \"everything-y\". Restaurant had extensive menu. Also very clean."
    },
    {
        "id": 33,
        "text": "Love these guys- i work nearby and always get a wonderfully made breakfast bagel... Super friendly owners. Much love."
    },
    {
        "id": 34,
        "text": "Yes! Finally a good breakfast delivery place. Now I can fully enjoy my hungover breakfast from the comfort of my bed. PS - bagel chips instead of potato chips. Amazing!\n\nEdit: just drank my \"latte\"...I'm pretty sure it's just coffee with mocha syrup :) -1 star"
    },
    {
        "id": 35,
        "text": "After an hour's wait with being unable to reach them via phone, I received my extremely pungent and brown mango and pineapple smoothie. I nearly vomited whole dumping it because it was so foul. Then I opened up my bagel sandwich, with avocado and tomato, to find brown avocado and very mushy tomatoes. So whatever they were spending that hour doing, it clearly wasn't paying attention to the quality of their food. Grubhub has been trying now for almost 2 hours to get a hold of them for a refund, but they're refusing to answer the phone. I've ordered from them nearing a dozen times, and this experience has completely ruined all the rest. Late, rotten food, then ghosting on customers... I'll never order from them again.\n\nUpdate: After two days, Grubhub finally got a hold of them but they're refusing to do anything. So I called myself and the manager was so unbelievably rude and started yelling at me, not letting me speak. I was told that my brown smoothie ended up that way because the driver took too long to get there. Sorry, but fruit doesn't brown quite that quickly. I've waited an hour for their food before and all that happened was the smoothie separated. This was brown... But instead of trying to help, I was yelled at. They had a chance to redeem themselves and passed on it."
    },
    {
        "id": 36,
        "text": "Iced coffee was definitely regular coffee, poured over ice, thus very watered down. Bagels were definitely not like NY bagels, they were very tough, and brick-like. The cream cheese was almost liquid, likely because they didn't wait long enough for the bagel to cool down. Likely will not give this shop another chance."
    },
    {
        "id": 37,
        "text": "I'm from New Jersey, so I'm a big fan of pork roll. This is one of the best places I have found near my school in Philly that knows how to make a good pork roll, egg, & cheese! The owners are super friendly and so sweet. Fast service and great food! Amazing for a quick late breakfast on the weekend. Highly recommend!"
    },
    {
        "id": 38,
        "text": "For $6 I got a bagel with barely any everything seasoning. I also got egg whites and bacon. For the amount I was paying I was hoping to get more than 2 slices of bacon. I also got a side of bacon for my roommate, and was charged $2 and given only 2 slices of bacon. $1 a slice. We will be going elsewhere from now on"
    },
    {
        "id": 39,
        "text": "In my 40+ years of eating bagels all over the world, I can confidently say these are the worst ever.  Also, they have an electric ordering kiosk so you don't even get to order with a human being. Btw, this place is located on the 2nd floor of the building, up a rusty metal staircase."
    },
    {
        "id": 40,
        "text": "Definitely not a cafe. There's a fast food feel to the place but I got take out and the food wasn't bad at all. The smoothies are just mix and ice."
    },
    {
        "id": 41,
        "text": "Prompt service. Reasonably priced. Good portion sizes. I got the whole wheat everything with scallion cream cheese. The ratio of bread to spread was nice. Food was flavorful. Also has decent coffee. Seems to be family owned and the staff was friendly."
    },
    {
        "id": 42,
        "text": "Go here for the worlds thinnest piece of bacon. I mean I really can't get pass how thin the bacon is. They gave me 4 strips of this pathetic meat. I would have preferred they gave me 2 slices of average thickness. But I digress and I won't be back."
    },
    {
        "id": 43,
        "text": "Loved their authentic blueberry bagel with almond honey cream cheese. Completely delicious bagel; worth a visit. Thank you for rocking my day with a perfectly prepared bagel. Everyday you'll be happier with wonderful fare from a gem like NY Bagel Cafe and Deli! Thank you."
    },
    {
        "id": 44,
        "text": "Ordered delivery from here two days in a row via grubhub.\n\nThe smoothies taste fresh and yummy. The sandwiches are good and filling, just enough meat but not overflowing. The bagel chips are really good ! I wish they sold them separately.\n\nTheir \"Create Your Own\" (sandwich) doesn't have nearly as many spreads as they actually do. The only choices available were mayo, ketchup and mustard, but their sandwiches say otherwise."
    },
    {
        "id": 45,
        "text": "Our family loves NY Bagels! My dad has been going here for years, and it makes our Sunday morning breakfast so much better. Their bagels truly taste like something you would fine in NY, and their homemade spreads are equally as good. So happy to have this within driving distance!"
    },
    {
        "id": 46,
        "text": "Took 15 minutes to get a ham, egg & cheese this morning.  They must have been waiting for the chicken to drop the eggs.  I've gotten my food faster at a sit down restaurant."
    },
    {
        "id": 47,
        "text": "I paid over $8 for a lox and cream cheese bagel sandwich this morning and am so upset sitting at work, looking at the one piece of salmon. This is absolutely insane and should be a crime. Just look at the pictures! I want my money back..."
    },
    {
        "id": 48,
        "text": "I absolutely love this place! The owners, Cantik and Ian, are some of the nicest people we know. And their bagel breakfast sandwiches are delicious - I could literally eat one every day. There may have been a week in 2018 where my husband and I actually did eat there every day. Our go-to order is the 2 egg and cheese sandwich with sausage on an everything bagel. I love my eggs over-easy and Ian makes the yolky goodness perfectly every time. We might be moving away in the next few months and I honestly don't know how we're going to survive without NY Bagel (and Cantik and Ian) in our lives."
    },
    {
        "id": 49,
        "text": "This is one of my favorite breakfast places for a nice bagel or breakfast sandwich ! The lunch sandwiches are very good too! The employees are always sweet. And you get a lot of food for a good price."
    },
    {
        "id": 50,
        "text": "Came across the little place for a quick breakfast. Basically a variety of meals including bagels, burritos and smoothie. You order at a kiosk and it's sort of like the ones at Wawa's where you can add or modify your order. \nWe ordered 2 bagel sandwiches: \n1. Egg whites, turkey bacon, jelly, cheese, onions, mushrooms\n2. Avocado, tomato and cream cheese\n\nBagels were toasted and generously filled! Good way to start the morning. Price was decent too."
    },
    {
        "id": 51,
        "text": "I first learned of NY Bagel and Cafe from a coupon insert in the mail, and decided to give it a try since it's in close proximity to my office. I admit I didn't have the highest of expectations beforehand, but was very impressed with the hoagie that I ordered (roast beef & cheddar with spicy mayo). I love that the meal comes with house-made bagel chips (so so much better than ordinary potato chips). The prices here are also super reasonable compared to some of the other lunch options on City Ave. And my order has always been ready by the time I stopped in. Highly recommend!"
    },
    {
        "id": 52,
        "text": "Let's start with the parking lot.  Many people go down the wrong way of the one way street. Bad drivers and owners issue, not the cafe itself.  But being that it's inconvenient to get there, is a factor. \n\nWhen we get in, I can tell people are confused about the self ordering kiosks (they have 2). Once you try to use the kiosk, it is very confusing when you have to look at every single box to see what you want to order. From different types of bagels to ingredients to add, it may take you awhile to order. \n\nThen, being the first from the bunch to finish ordering, I was the last to receive my order (took 30 mins) for two sandwiches. Then she tried to be cheap and squish both huge sandwiches into a small brown bag. Like, really? They aren't sardines, you know?\n\nEven tho the food was pretty decent, I could have gotten the same from anywhere else. Nothing special. Just bad service coming here."
    },
    {
        "id": 53,
        "text": "The best bagel in town!\nIf you want to taste famous chewy boiled New york style not typical philly bagel\nHere is the place.\n\nLots of cream cheese choices \n\nThey do breakfast-lunch all day.\nFrom pork roll,beef bacon,beef sausage,turkey sausages you name it.\n\nIt's not only bagel but cheesesteak,panini,smoothies \nSalad"
    },
    {
        "id": 54,
        "text": "The owners got the worst attitude ever . \nUnbelievably rude and very disrespectful . I go to a lot of locations of NY bagel cafe & Deli never seen anybody with a negative attitude like that lady . I am sure that she chases a lot of people from this location !"
    }
]