[
    {
        "id": 1,
        "text": "This might be my favorite coffee shop in the city. The food is unbelievable. Anything I have ordered has been fresh, delicious and so enjoyable. The place has a cool edgy vibe and lots of comfy seating and some great seats outside when the weather is nice. Definitely worth checking out especially if you want a some food as well."
    },
    {
        "id": 2,
        "text": "New to the area and was looking for a good brunch/breakfast place that has a lot of gluten free options.  GF bread is available for all the sandwiches and they made sure to note that they put GF bread on my Lil Goat egg sandwich (which was amazing!) when they delivered the food. Portion was very large too."
    },
    {
        "id": 3,
        "text": "Red Hook is my jam!  This place focuses on their drinks and their extensive food options. I appreciate this a lot. They aren't pretentious, at all, and have a chill funky homey vibe about then. The people there are pretty friendly and welcoming. I had solid drinks from Red Hook. But if you are looking for a coffee shop that can serve good drinks and good food, then Red Hook blows away the competition.  I've been to cafes that serve good drinks, but not good food. This place serves both!"
    },
    {
        "id": 4,
        "text": "Had a maple, cayenne latte- spicy and delicious. Went back another time for lunch and had a chicken, mozz and peach jam with basil sandwhich- YUM. I'm sold. Will definitely go back again :)"
    },
    {
        "id": 5,
        "text": "I love this place!! They have really creative and affordable vegan/ vegetarian options, including vegan pastries. And their coffee so amazing."
    },
    {
        "id": 6,
        "text": "Great neighborhood coffee shop.  Decent prices, good food, nice environments inside and out.  I like the huevos banditos.  Nice people who work there"
    },
    {
        "id": 7,
        "text": "This place has great coffee, beautiful mugs, great atmosphere, delightful staff, and (most surprisingly for a coffee shop) amazing food! Seriously, come here for lunch. Or better yet, for a tasty brunch with no lines to wait in. Their eggs seem most popular, but my favorite is their Red Hook sandwich. Each sandwich comes with a small bowl of salad which is like a painting of flavor. \n\nI come here a lot to work. (It's near my home). The only reason I don't come here every time I need to work is I don't want to get tired of it! It's cozy but never seems crowded. \n\nAlso, they put on fun events after hours once a month to serve food and drinks and showcase local artists. \n\n A true community oriented business. There's definitely close-knit regulars, but always room for new faces."
    },
    {
        "id": 8,
        "text": "Love the ambience here as well as the menu. I've been stopping by for iced coffees or the mango avocado smoothie (awesome with soy milk) and a bagel with tofutti, and love all of these. Today I tried their vegan chicken salad with the potato salad on the side and it was INCREDIBLE. Loved the flavor and the texture of each, will definitely be adding this to the list of regular items."
    },
    {
        "id": 9,
        "text": "I go here to grab a bagel with cream cheese on the way to work occasionally. You walk in, there's some pretty solid art everywhere you look, and when I finally get my toasted bagel it's like, woah, they put a hell of a lot of cream cheese on this bagel (which is to my preference because I need to eat more). It's also reasonably priced. Very hip."
    },
    {
        "id": 10,
        "text": "Awesome place - too bad some awful woman complained about the dogs - our little dog loved visiting!"
    },
    {
        "id": 11,
        "text": "Amazing Coffee/Food, always cute local dogs hanging out, support local artists, great queens village jem!"
    },
    {
        "id": 12,
        "text": "First a little disclaimer, this review is for the drinks only, I've never eaten here, also the reason for the four stars.  I walk dogs in Red Hook's neighborhood so I often find myself nearing the end of the day in need of a pick me up or warm up within blocks of this gem.  \n\nThe decor is amazing and welcoming.  Really cute and comfortable furniture lines one wall while a bar with chairs lines the windowed wall.  The employees are NICE, something oddly lacking in a lot of Philly coffee shops.  They are also talented baristas and my drinks are consistent and damn tasty.  My favorite drink is their seasonal Ancho Chile Hot Chocolate- my god! It's pricey but you can taste why.  The drink is pure bliss, chocolatey and sweet, milky and smooth but with a spice and little bits of ancho chile to chew on between sips.  \n\nI've also had plain coffee, of which you have a choice of roasts, and a few other fancy coffees.  Someday I'l try one of their paninis or vegan sweets and see if they are worthy of a fifth star.  \n\nOne time I stupidly spilled a large portion of my drink while trying to add cream and sugar  with the same hand I was using to hold a dog leash(did I mention you can take your doggie here).  The dog pulled and coffee went everywhere.  Fail.  The baristas were so nice, they didn't get mad at me, helped me clean up and refilled my coffee.  Yet another reason why I go here more than any of my local coffee places and tip every time."
    },
    {
        "id": 13,
        "text": "Delicious. Good vibe. A bit expensive. A bit too small. But I just had a really good breakfast so I'm happy."
    },
    {
        "id": 14,
        "text": "Love this place!  Been coming here for years and it has only gotten better over the years.  They have delicious gluten free bread for their fresh sandwiches and quite often their soup of the day is gluten free.  The coffee is delicious, so are the shakes.  The decor is warm and local art is always hanging on the walls.  Staff is friendly and helpful and dogs are welcome, so that's always a plus!"
    },
    {
        "id": 15,
        "text": "We loved the cozy, welcoming atmosphere of this place. Brick wall filled with artwork, tables, couch, and a bar wrapped around the window with a bunch of art magazines lying around. The coffee was great as well. I can't believe I didn't realize this place was here. We'll be coming back often whenever we're in town.\n\n\nI must say, they really do often have some of the most interesting artwork I've seen at coffee shops. Each time we've gone, it's been a new artist. We just purchased a few pieces from the current artist on display. I believe her name is Stevie something?"
    },
    {
        "id": 16,
        "text": "They have the very BEST curry chicken salad wrap EVER!  I get it on a fairly regular basis and it is alway good.  Today it was incredible!  Thank you!  I also like their soy latte a lot too!"
    },
    {
        "id": 17,
        "text": "So I must first admit: I don't drink coffee.  Never had a drop in my life.  Finding a coffee shop that caters as much to the non-coffee drinkers can be a challenge.  I was expecting to go elsewhere on this hot Sunday afternoon, but it was closed for the holiday weekend.  Yelp helped me find Red Hook.  Like another reviewer, I noticed that the staff was sitting chatting with friends when I walked in, but she stood right up to assist me.  She offered her recommendation for an Earl Grey with Caramel Latte.  It was a great choice.  Good flavor... and something I never would've considered on my own.\n\nMy one (maybe two) issues with Red Hook is that the place feels a bit like visiting a college kid's shared house.  The mismatched furniture is cute, but worn and dirty.  There was dust and dirt everywhere.  And, probably due to the heat outside and frequent door openings, lots of bugs.  They also didn't have air conditioning.  My fault for ordering a hot drink, but still... a coffee shop should feel cozy: warm in the winter and cool in the summer.\n\nI may come back for additional drinks, but probably not for sitting for any length of time."
    },
    {
        "id": 18,
        "text": "Wow so glad we stopped on our way through philly... not toddler friendly by any means but we got the food to go and it was Incredible... the coffee was some of the best i have had"
    },
    {
        "id": 19,
        "text": "This is my favorite breakfast place in nice weather!! They'll make you anything you want ...food is fresh and healthy!  As a bonus, I often run into some of my favorite people here.  So happy it's just a few blocks from my house!"
    },
    {
        "id": 20,
        "text": "Was in the neighborhood and needed a space to grab a quick breakfast and to get some work/reading done. Red Hook was a great space for both. The small space was quiet with one 1-2 other tables of customers but tons of foot traffic of folks stopping in to grab a coffee. I was indecisive and asked for a recommendation on a breakfast sandwich. Ordered the Preacher Man which was a good blend of sweet and savory. Bonus points for the tempeh bacon and veggie sausage options. I think all sandwiches come with a side of potato salad which was also tasty. Would definitely stop back if I'm this neck of the woods again."
    },
    {
        "id": 21,
        "text": "Two words: Coco Chanel.  Hot Chocolate with a hefty dollop of Nutella in there.  Topped with FRESH whipped cream and chocolate sauce.  OMG.  This was the perfect, non-caffeine beverage for a chilly morning.  \n\nBeing literally right around the corner from my aunts place in the city we walked here to grab a cup in the morning before jetting off to over activities.  This is a beverage that dreams are made of.  I literally dream about it off and on since having it.  While I'd attempt to make this at home, the next time I am in Philadelphia you can be your last dollar that, cold or not, I'll be here grabbing a cup."
    },
    {
        "id": 22,
        "text": "This place smelled like a gym and was incredibly dirty.  Layers of fuzz on the counter where you fix up your coffee.  The floors looked like they had not been washed in a year.  I wanted to bolt the second I walked in the door.  But, my husband wanted some iced tea so we waited in line for a while and I got to observe the surroundings, which only reconfirmed why I will never be back.\n\nThe pluses are the people who work there were incredibly friendly and they have extensive vegan and gluten free options if you lean that way."
    },
    {
        "id": 23,
        "text": "Love the service, ambience, food (inexpensive and delicious and creative), and they offer almond milk with your coffee. Plus the bathroom is awesome."
    },
    {
        "id": 24,
        "text": "Red Hook's coffee shop sandwiches and breakfasts have all been 5 star delicious, everything I've had that they make is outstanding.\n\nThe pastries are not made in house and I give 3 stars at most. \n\nStaff training manual seems to require an aloof and laissez Faire approach, but don't let that stop you or you'll miss out on their awesome food. I just tip on my way out rather than when I order!"
    },
    {
        "id": 25,
        "text": "This place is awesome! It's cool, without being annoyingly hipster-ish. The drink prices are awesome- much cheaper than Starbucks or places of the like. The food is delicious! They have vegan stuff, vegetarian stuff, and meat-eater stuff. All very well-priced and very delicious! The music is very eclectic, the staff is very friendly. The decor is interesting. It's a small place, which is just fine by me. Very good. I definitely recommend this place!!!"
    },
    {
        "id": 26,
        "text": "Coffee is ok , nothing special. Small venue but very comfy and cute! I love the decor and the music.\n\nI didn't get food her but plan to next time. They have a great selection of soups and sandwiches. The best part is that they have GF baked items and Vegan options avail!"
    },
    {
        "id": 27,
        "text": "I really like Red Hook. Whenever I'm in the area to get fabric, I always stop by. The inside is really cute, and has a bay window that would be perfect for reading in, if someone wasn't always sitting there first. The coffee is really good, and they always ask whether you'd like medium or dark roast. I've never had any of their baked stuff, but it looks really good. They could definitely benefit from more seating - there are only a few chairs and a couch. Prices are good, and staff is always friendly."
    },
    {
        "id": 28,
        "text": "Since I've moved out of Philly, there are few things I miss as much as Red Hook's breakfast sandwiches. So. Damn. Good."
    },
    {
        "id": 29,
        "text": "I love the Red Hook.  I come by often when I am in the area.  It's a great place to relax in a comfy armchair or do work on a laptop.  They have a cool decor and really friendly, youngish staff.  It's kind of expensive, but the coffee is fair trade and delicious.  Plus, you can't beat the location on 4th and Catherine."
    },
    {
        "id": 30,
        "text": "great service and free almond milk to add to tea. yummy matte and good selection of tasty vegan treats!!! a+ awesome. my partner and i recently went to this place and the atmosphere is inviting and friendly. besides...its right near Vinyl Altar \n\ni recommend getting the large matte with a splash of almond milk with 3 Splenda. splurge away here, one of the best cafes ive been to"
    },
    {
        "id": 31,
        "text": "i love their sandwiches and food selection in general.  a comfortable place to read or hang out.  the ladies behind the counter can be a bit sassy, and i don't generally ask for a side of sass. prices are typical. who doesn't want to walk down fabric row?"
    },
    {
        "id": 32,
        "text": "here is the story,the best coffee house,wait a second gang the best place to eat breakfast and lunch,end of story the best tea selections too,all food is unreal they will make what you want,on or off of there menu,there eggs are great i could go on and on,the owners are great too."
    },
    {
        "id": 33,
        "text": "I moved to QV 3 years ago.  I visit Red Hook at least once a week.  I have found the staff to be welcoming and lovely.  Lattes are the best; food is delicious.  I am a baby boomer/grandma  (albeit with a nose pierce from Infinite circa 2009); I find no prejudice that I am not a cool 'hipster'...although I am cool!   Have brought my visiting out-of-town family members here...everyone loved it.  This is my go to coffee shop.  So very happy it is in my neighborhood!!"
    },
    {
        "id": 34,
        "text": "The BLT&A was fantastic. Great atmosphere and huge portions.  Love the breakfast all day."
    },
    {
        "id": 35,
        "text": "Yummy!  Worth the wait!  They will cater to your special needs as long as you ask...make sure you ask questions! (ex: potato salad has a kick!)"
    },
    {
        "id": 36,
        "text": "Great spot. Upset I didn't find it sooner. Just stopped in for a quick cappuccino, but'll sure be back for sandwiches."
    },
    {
        "id": 37,
        "text": "I just went here today and bumped into it by accident. I am vegan and can't say there are too many options for me everywhere. There was a wide selection of food for me to select from. Everything is priced so cheap and the food was amazing. The vegan BLT was awesome but the potato salad that came with it was the best potato salad I have ever had! Definitely will be coming back soon."
    },
    {
        "id": 38,
        "text": "I go to red hook primarily for the \"4th on 4th\" openings, but I have been there a few times just for coffee/sammies, and it's been delicious every time."
    },
    {
        "id": 39,
        "text": "Food is always great. They are very generous with their bacon so that basically makes them perfect. I usually get the California wrap and have never been disappointed. Price is just about right and the I love the look of the place."
    },
    {
        "id": 40,
        "text": "This is my first trip and I'm already a regular.  Cozy and charming, this place has a great vibe as well as an eclectic soundtrack everyone can appreciate.  Food is delish and well priced.  Its a fresh take on regular coffee shop eats. Excited to try their sandwiches!  Coffee was a little light on flavor for me, but then again I like my coffee very strong.  Its my new spot for sure!"
    },
    {
        "id": 41,
        "text": "Red Hook is everything a coffee shop should be: quaint, corner shop with good, affordable coffee, and good food.\n\nTry the Red Hook Panini!  It's tasty as is the homemade pesto pasta salad that comes with it.\n\nI'd consider moving to Queens Village just to be closer to this perfect coffee shop."
    },
    {
        "id": 42,
        "text": "What a great find!\n\nRecently, I was taking on a walk on a beautiful day and figured that I would stop in and give it a try, boy am I glad that I did!  The decorating automatically struck me as very unique and at the same time very comfortable    The menu is not too complicated, but has a lot of great choices.  I personally went with the hummus and vegetable sandwich, which was fresh, delicious, and perhaps best of all, under 5 dollars,  It was so full of fresh veggies, I almost had problems taking bites.  I also had an iced coffee, which was the perfect compliment to the 90 degree heat outside. \n\nThis seems like a perfect place to sit and spend an hour or two on a lazy weekend day.  I will definitely be coming back soon!"
    },
    {
        "id": 43,
        "text": "My boyfriend got the scrambles eggs with bacon on a blueberry bagel. But I'm almost positive it was sausage instead of bacon. Actually tasted like chopped hotdog. He wasn't a fan, neither was I. However, I got the tempeh bacon wrap (I forgot what it was called exactly) it was good. We also split The Elvis which was the PB bacon and banana sandwich. Sounded crazy amazing but it was anything special. We only took two bits. I would definitely add Jelly to it for a sweet component. It was just toooo much PB with bacon banana gooeyness. A nice little cafe however, nice staff. Great coffees and smoothies as well."
    },
    {
        "id": 44,
        "text": "Red Hook is great! The staff is always extremely friendly and speedy! It's a great spot to hang out for a few hours. The tea and coffee is great and the sandwiches are always delicious!"
    },
    {
        "id": 45,
        "text": "I don't know maybe it's the area but visiting from New York it was alright. I ordered a yerba mate which technically is supposed  to be brew under boiling temperature. It took fifteen minutes to drink to cool temperature. My wife ordered a dirty chai latte it was really foamy.\n    The decor and ambiance in the area is cool and didn't try the food so that's  probably where the five stars are from. I do appreciate a barista that knows their craft but I can't say it's this place from my visit"
    },
    {
        "id": 46,
        "text": "I started coming to this place recently to get a change of scenery from the usual coffee shops I frequent. The space is very comfortable and though it is small, I've never had a problem finding a seat. I think the food is what really sets this place apart from the other coffee shops in the area. They have a very large selection of sandwiches and so far the ones I've tried have been really tasty. Today I had the philly wrap which is chicken, avocado, roasted red peppers and tomato along with homemade potato salad. It may seem simple, but it was just done really well and everything was fresh. Price might be a buck or so above average, but totally worth it for quality food. Oh and the complimentary free refill on coffee is almost unheard of in this town, so major points for that."
    },
    {
        "id": 47,
        "text": "THE BEST BREAKFAST SANDWICH YOU WILL EVER TASTE!!\nI love Red Hook... everything about it.  But seriously, once in your life you need to try the bacon egg and cheese. It will change your life."
    },
    {
        "id": 48,
        "text": ":(  Not sure what happened here. LOVED Redhook from the day it opened until I left for boston about a year ago. They always had great music, eclectic art, yum hot drinks (esp their spicy ginger chai!), fresh vegan, veggie and meat eater food options...and usually friendly solid service.  The pets add a nice warm component to the whole vibe as well.  I would see neighbors stopping in for a cup of coffee on their morning walks.  Nice.  Really nice.  \n\nWhen I was in school I came here around 3+ times a wk and would eat half a dozen meals in their sunny window seat.  I wrote a book in this place...  \n\nBUT SOMETHING WENT WRONG!  I came back from boston (not exactly the warmest of cities) and now the staff's too cool for school.  I'm used to the hipster attitude but really...no \"hello\", no eye contact, not one smile or acknowledgment that I'm talking to you and trying to order a 4$ chai latte?  I really tried last time.  I ended up laughing at myself outloud as the girl behind the counter completely ignored what I said and turned around.  I was literally embarrassed.  To top it off now my favorite ginger chai is watered down, mostly milk and served luke warm... Where's the spice and ginger?  No more fun spicy lentil pasta side dishes and the attitude...god the attitude!  I can't believe other reviewers say they're friendly.  They must be part of some special club or I keep missing the nice baristas.  I've tried 3x in the past 2 weeks to get back to loving Redhook but I think that last episode did me in.\n\nThe food.  The ambience, the ginger chai - This place was created to be amazing.  I bragged about Redhook in the neighborhood.  Baristas wake up...coffee shops are not just about a good cup of coffee (which you DO well).  Its a service industry.  You were handed a gem and did no work for it.  I think you actually like your job so why pretend to be so cold.   The old owner went to pretty decent lengths to create the warm cozy vibe and you're ruining it for the old regulars.  Im uncomfortable sitting there and the music is far too loud to be enjoyable.  Prices are over the top and the foods not nearly as awesome.  To the new Redhook fans, I really wish you tried it a couple years ago.  Everything was better then.  Wish the old owner would come back. Its such a great spot! Darn."
    },
    {
        "id": 49,
        "text": "Fast service. Great food, and an edgy environment. There's something for everyone. Try the mango smoothie it's refreshing"
    },
    {
        "id": 50,
        "text": "Amazing sandwiches big enough for two meals. Very cozy inside if you want to stay or just relax over a cup of coffee/tea."
    },
    {
        "id": 51,
        "text": "Flavor was amazing! I am so\nExcited to have a place that has wonderfully unique sandwiches that offer gluten free bread. This made my day. Thank you! \n\nI do wish they still allowed dogs :(."
    },
    {
        "id": 52,
        "text": "I love coming to this cafe. It's a nice place to get work done and eat a quick snack. \n\nI first came here after an interview to get some tea. Their selections are great. I opted for the Earl Grey and added some honey to it. Their pastries and sandwiches are really good. They have a lot of cool and funky sandwiches. Also very healthy too!\n\nThe seating area was different. They different seating cushions and tables. Very cool. They can get very crowded at times but I think the wait and lack of seating is worth it. Would definitely recommend."
    },
    {
        "id": 53,
        "text": "Went with my friend and they made me a delicious egg and cheese bagel with red peppers it was filled to the rim and delicious. The atmosphere is really cool and relaxing. I would strongly recommend this place to anyone I want to have a place to grab a bite to eat or some coffee"
    },
    {
        "id": 54,
        "text": "Love the food. Amazing americano. Could do without the woman always camped out on the couch and who  can't seem to stop laughing. It seriously starts to become obnoxious."
    },
    {
        "id": 55,
        "text": "Queen Village welcomes me again to the niche cafe nestled on Fabric Row. I took some shots so I'll upload them soon.  It looks like they've added a few tables inside and cleared a spot outside for more seating.  They feature Equal Exchange coffee, which is pretty good.  They have tons of order goodies and lunch items.  Also, you can get a bagel with nutella here, YES, I will be back to get one next weekend.  \n\nStrangely, all the art hanging now must be from a swineophiliac because every single picture has pigs... doing all sorts of strange crap.  One is devouring bodies, another is a gang of pigs \"stooping\", looks like a Oinksama Pig Laden, Perhaps Joeseph Swine'in the Russian dictator, Rush Piggbaugh... and a bunch of others that I don't feel like putting a pig-pun with in this article.  Over all, creepy.  Also, I love the random nuclear explosion painting amidst it all\n\nSo beware of a potential inbound 1 star for this joint.  A lady and her friend came in just after I got my coffee.  She went to the ATM inside, which made a bunch of \"ATM sounds\" but didn't give her any money.  She started complaining and the girls said they don't manage it.  \n\nShe said \"Welcome to Red Hook,\" (which I was expecting as her next comment).  The girls came around, checked the power and offered to call the company for her.  I thought I heard them say if they can get the money back from the company that they would give her the cash.  So as the girl went to call the ATM company, the lady said, \"All I wanted was to be taken care of.  See, it said it withrdrew money, see!\"  \n\nThe girl read the receipt she was holding that the machine spit out Fortunately, the girl read all the words and told her, \"It says you put in an invalid pin.\"  \n\nThe lady responded, \"Well that isn't right.\" (Yeah, the ATM screwed up, not you, right?)  She tried again and got her money, then left!!!  What nerve.  So if you see a 1 star in reference to this, ignore it, the girls totally tried to take care of her."
    },
    {
        "id": 56,
        "text": "Fast internet & power for the laptop warriors. Sunny and not too crowded if you want to hang out. Coffee is decent, peach green iced tea is very refreshing. Punk rock and pop on the stereo and quirky local art for sale on the walls. Nice joint!"
    },
    {
        "id": 57,
        "text": "The Bestest eatery ever. Healthy to boot. I meet my crew there every week for lunch. It's our coffee clubhouse.  The ambiance is eclectic rustic and I Iove the zombie Bathroom. The rotating artwork is available for purchase, which is exactly what I did.  The staff is wonderful too. Come eat, enjoy and support your local artists."
    },
    {
        "id": 58,
        "text": "I'm so happy that Red Hook is in my neighborhood. I love this place!! All of the smoothies, lattes as well as food (really, you can't go wrong with anything you order) are fantastic. Favorite coffee shop ever!"
    },
    {
        "id": 59,
        "text": "Having stopped in for lunch, I want to update my previous review and offer the highest praise to their egg salad sandwich. With L/T on a rugged multigrain bread, it's hands down the best egg salad I've ever had. They have a nice style with every food item, nothing is taken for granted, just as they didn't do a routine egg salad. Yes, comes with the horse radishy potato salad, yum. Excellent coffee, semi-friendly baristas - what more could you want? As mentioned, I particularly like their potato salad, check it out, it comes with sandwiches but I believe you can also order it as a separate side order. Outdoor seating is a plus. Wifi and warm, quiet atmosphere (despite the many young kids that are brought in) make it not a bad place to get a little work done as well."
    },
    {
        "id": 60,
        "text": "The Red Hook is \"common ground\" for the neighborhood - bringing together friends, family, neighbors, people visiting and those that have been here for years. It's a place where two hard working women (Chloe and Kelsey) have created a space for artists to provide exposure for their work, for people who are Celiac like me, for vegans, and animal lovers.  It is an atmosphere where the baristas are self-expressive and friendly people themselves. My family when they visit from Pittsburgh make sure they go there - the food is great, creative and more than what one would get at an expensive brunch place. \n\nSo for those of you who have been there once - don't complain and write bad reviews. Ask us that go there daily, and are committed to these two hard working women and to this place that is \"common ground\" for many."
    },
    {
        "id": 61,
        "text": "My new business partner lives around the corner so we have been popping in here quite a bit lately. The dark brew is excellent. The cranberry muffin is tasty, if a bit light on the berries part. Definite neighborhood vibe, we ran into several people we know from the area (I don't live in the neighborhood, but spend enough time there I guess!)"
    },
    {
        "id": 62,
        "text": "Cute and quaint restaurant with great prices, delicious food, and reasonable portion sizes. This was our go-to breakfast stop for the majority of our trip."
    },
    {
        "id": 63,
        "text": "Very creative sandwiches, however after my first visit, the thing that I'm most impressed with is the potato salad!!!! It is hands down some of the best I've ever had, and I can not wait to get back for more!"
    },
    {
        "id": 64,
        "text": "I like to go to Red Hook because they're very close and convenient for me to buy quality coffee by the pound.  The decor is nice and they feature different artists selling their work monthly.  The owner is very nice as well, and they're dog friendly.\n\nOther times, the coffee made by the snubbish barista's has been good, but just good at a price that's a little above average.  I appreciate they serve organic items and try to be enviromentally friendly, but at a price.  The smoothies are good but I don't think they're made with fresh fruit, and for $5, I'd like fresh fruit.  I'd never order food there again.  I had a chicken basil pesto sandwich once and had food poisoning for 2 days, and then I later learn 3 of my friends have gotten food poisoning as well from their sandwiches!  Yikes!\n\nOrder your coffee, and go across the street to Wiccaco for your sandwich, bagel, yogurt etc..  for something fresher and cheaper."
    },
    {
        "id": 65,
        "text": "by far, the best tasting decaf coffee in philly!!! AND it's fair trade and organic! they make it fresh every time. they also offer a gluten free bread for all of their sandwiches (get the hoagie roll - its the tastiest!) and have some vegan options. \n\ncomfy couches, fish pillow, new art to check out each month, dog friendly, potted plants all around the outside of the building, friendly staff, exposed brick wall, a few out door seats.\n\nyum!"
    },
    {
        "id": 66,
        "text": "Reading this review is really just time spent not eating at Red Hook, so my suggestion is head there now and read the review on the way (as long as you're not driving :P )\n\nI was visiting from California and this place saved me from the constant nasty food I found around the city.  The ingredients are fresh and delicious, they have plenty of gluten free / vegan / vegetarian options, which my wife always goes for, but not having any of those restrictions myself, I still had tons of great choices as well.\n\nI would highly recommend the Happy Hooker, it's a grilled three cheese sandwich with thick bacon and tomatoes.  I asked them to add some fig jam on there for me and it was amazing.  The chocolate peanut butter smoothie was also a great take away on a hot spring day.\n\nI can't say enough good things about this place, and I will definitely hit it up next time I'm in Philly!"
    },
    {
        "id": 67,
        "text": "Red hook may be my new cafe of choice. It pains me to say this because I still love Gleaners and The Last Drop (the latter not so much. Its full of posers these days), but Red Hook has something these other places dont- a conscientious mentality. They focus on organic, fair trade products, with a huge selection of vegan and vegetarian meals and treats (all of which are ridiculously delicious). They play good music, the design is comfortable and the crowd is eclectic. But I must admit; the best part is the really cute staff. Everytime I go there there's some cute, friendly girl serving me coffee. It's a nice plus."
    },
    {
        "id": 68,
        "text": "Is that a dog park or a coffee shop? I love going here just so I can play with the dogs. Other great things include the décor, the clientele,and the coffee. The real reason I'm giving this 4 stars is because I love the Huevos Banditos. Cash only though which is frustrating when a sandwich and coffee comes to over 11 dollars. Also not too many outlets to plug in a phone."
    },
    {
        "id": 69,
        "text": "I just tried out Red Hook for the first time yesterday.  It was pretty empty, and I got a nice spot by the window to set up with my laptop and do some work.  The barista was very pleasant and friendly.\n\nThe coffee was excellent.  The soy milk is out in its own pitcher with the other milks so you don't have to ask for it specially, and there is sugar water available for cold drinks.  \n\nThere are lots of vegan food options available!  They have soy cream cheese for the bagels, and you can substitute \"fakin' bacon\" for the real stuff in any of the sandwiches and wraps.  You can also get fresh avocado on just about anything, which is always a winner in my book.  I got the curiously named \"Jackie O\" wrap, which is an ingenious combination of banana, honey, peanut butter, and granola.  Mmmmmmm.  \n\nLooks like I've finally found \"my\" coffee shop in my new neighborhood!"
    },
    {
        "id": 70,
        "text": "Love this place.   The coffee is great, and their bagels are fantastic.    The staff was friendly from the beginning, but after a few times coming they are like old friends.    The seating is really comfortable.   Red Hook is dog friendly and draws neighbors in all day long.  It is a rare visit that doesn't involve a good conversation with friends and neighbors.   If you want a relaxed meal (especially breakfast) and awesome coffee, stop in."
    },
    {
        "id": 71,
        "text": "The Best Coffee and Tea in Queen Village. Go there and meet your neighbors. Owners are very nice and the shop is lovely."
    },
    {
        "id": 72,
        "text": "Love Red Hook!\n\nI work down the street so I'm always in for coffee (bonus: they have almond milk). The food is great, too. Cant go wrong with the Easy Rider or Red Hook sandwich."
    },
    {
        "id": 73,
        "text": "While walking down 4th Street, I decided to go into Red Hook to see what they had to offer, seeing as the shop is in my neighborhood, yet I hadn't given it a try yet.  The shop is small, but the decor is super eclectic and comfortable, and the staff is very friendly.  They have an extensive menu of coffee drinks and smoothies as well as sandwiches, salads, melts, wraps, and eggs.  I settled on a small coffee and egg and cheese on a toasted sesame bagel.  Both DEFINITELY hit the spot!  It is cash only, however, but there is an ATM there for your convenience.  Always nice to have a new go-to coffee shop in the neighborhood, and I can't wait to go back and try more of their edible selections!"
    },
    {
        "id": 74,
        "text": "Just moved into the neighborhood and so far this is my favorite cafe and coffee shop. The food is delicious and well made with clean ingredients. The coffee is incredible too. Highly recommend this place."
    },
    {
        "id": 75,
        "text": "Shades of Egg just rocked my world. The way they had the sunny side up egg cooked on a layer of salty, satisfying cheese really made this sandwich for me.  The sprouts, greens and avocado made this beast a little healthier, too.  I love that you can choose what bread you want it on.  The coffee was great, and I even found a cool magazine to read while I ate."
    },
    {
        "id": 76,
        "text": "I have found my favorite coffee house in Philly.  It is Red Hook.  \n\nRed Hook is on Fabric Row, below the noise of South Street.  A member of the Independents Coffee Cooperative, you'll get great fair trade coffee here.  The sandwiches are fresh, prepared with high quality ingredients.  There are veggie and vegan options.  There are also sweets, which I'm told come from Homemade Goodies by Roz (a favorite bakery of mine).  \n\nAside from fair trade coffee, I read that they are socially responsible in many ways, including recycling coffee grounds for local farmers (that's so AWESOME) and recycling everything else they can.\n\nTry the ancho chile hot chocolate, which is sweet and spicy and rich. that alone will keep me coming back for more!\n\nThe cafe itself is comfortable, with good music that's not too loud.  There is a counter with tall chairs, as well as tables and a sofa.  Local art shows on the walls.  There is free wireless, if that's your thing.  \n\nI love this place.  I almost hate to review it--I want it to be my secret."
    },
    {
        "id": 77,
        "text": "You could say I'm hooked... thank you for indulging me with that terrible pun. \n\nCash only!! But they do have an ATM inside - not a big deal just be aware. \n\nAmbiance: \n+ Exposed brick, art on the wall\n+ Nice music playlist to fit the chill relaxed vibe - also not very loud so found it ideal for work\n\nFood:\n+ Vegan friendly - ordered the vegan curried chicken\n+ Huge portions of food - almost wish I did sandwich soup combo because half the sandwich was plenty"
    },
    {
        "id": 78,
        "text": "I spent a long time looking for a coffee house in Queen Village and finally settled on Red Hook even though I had read about and experienced the dismissive attitude from the staff.  Even though I always said \"please\" and \"thank you\" w/ a genuine smile, even though I always tip, they treated me like I was emanating a slightly unpleasant odor.  I decided to keep going b/c the food is quite good (except for the egg sandwich but I suspect that may have been another form of aggression from the staff) and I like the room and the seats outside.  I understand that since I am not emaciated and tattooed that it is silly of me to expect good service in most coffee houses.  \n\nAnyway, the last time I went I gave my order to the arch guy behind the counter upon which he said \"Not gonna happen\".  I looked at him in surprise and said \"I'm sorry?\" and he said again \"Not gonna happen\".  Finally I recovered enough to say \"Why not?\" and he said \"We're out of plain bagels\".  Now look, would it have been so hard for him just to say that the first time?  I looked at him and said \"Well never mind\" walked out and wound up at Milk and Honey on 4th street right above South St.  Guess what?  At Milk and Honey I FINALLY found a coffee house that doesn't act as if there is a velvet rope which I am not cool enough to get past!!!!  The staff says hello and smiles at me.  Go to Milk and Honey!  Let's not let bitter hipsters win!!"
    },
    {
        "id": 79,
        "text": "I give this place 5 stars for quality and 3 stars for accuracy.  Their coffee and food is great.  On a few occasions I have grabbed lunch here and was not disappointed.  The seating and atmosphere is very welcoming and comfortable.  One thing I have to comment on is their prices... they don't seem to add up.  The prices they have on their paper menu do not correspond with those on their chalk board menu.  I am one of those people who never carries cash, this makes it difficult to make sure I have enough money to pay for my items."
    },
    {
        "id": 80,
        "text": "I live just next door, and the coffee and food are excellent. The owners are cool and very welcoming. Great pit stop for lunch and breakfast. This has become our new local coffee shop. Cash only though, and the wait can be a little longer if you order food. Everything, is freshly made so worth it."
    },
    {
        "id": 81,
        "text": "Red Hook is a perfect little place to enjoy various dishes at any time of the day. We went for breakfast and the selection was excellent, the menu innovative and coffee excellent! It's also the perfect location to enjoy the many other up and coming locations of the neighborhood."
    },
    {
        "id": 82,
        "text": "Love the people that staff the cafe and always enjoy the ambiance and food!!"
    },
    {
        "id": 83,
        "text": "So this place is made of pure Queen Village win.  I like the outdoor seating spot, the inside is a blend without trend - a non-hipster, non-hippy, non-crappy; just a wierd cool blend of what I'd expect out of Queen Village.  \n\nI've only been here twice, but I loved the coffee, service and feel of the place.  It was quiet, comfy, and I think I'll go today to get some pictures.  Great spot if you're down on Fabric Row!.\n\nAs a cool side note, I heard the original owner sold the shop to the baristas, that is just awesome."
    },
    {
        "id": 84,
        "text": "Delicious, fresh amazing food in a cute neighborhood cafe serving vegan and vegetarian dishes as well as pastries and baked goods!! My favorite breakfast wrap in the city--the Huevos Banditos!!"
    },
    {
        "id": 85,
        "text": "Egg salad to die for! Super gluten friendly and veg friendly!"
    },
    {
        "id": 86,
        "text": "Tons of gluten free options here. :) My fiancé who can eat whatever- LOVED the bacon, egg and cheese on a bagel. It was huge and it didn't last very long on his plate. We have found our new easy going breakfast spot! :)"
    },
    {
        "id": 87,
        "text": "Around the corner from my sister and definitely really good coffee. Philadelphia is definitely a coffee town. Cash only but worth it.  A community gem."
    },
    {
        "id": 88,
        "text": "Holy balls!  This coffee shop is my best memory from my visit to Philly.  And the greatest thing is that our visit was just thrown in as we were driving somewhere.\n\nI gotta thank my buddy, Nick, for taking us here.  He's a brilliant at suggesting restaurants, and his recommendation of Red Hook was probably his opus.\n\nIt's hard to put my finger on what I loved so much.  I would have to say that the total package is what sold me.  It's like seeing the perfect woman.  Pretty, intelligent, good storyteller, swears a bit...ahhh.\n\nSo that's it.  Red Hook Coffee & Tea is my perfect woman of coffee shops.\n\nThe interior is great.  It's not overbearingly beatnik, nor is it too corporate and cold.  The balance of art and comfort sat well with me.\n\nThe coffee was good.  I don't know coffee well enough to critique it.  If it's good, then I'm a fan.  However, what put a spring in my cowlick was the simple, but delicious bagel sandwich with hummus, red onion, and tomato.\n\nWow!  I've been eating the wrong bagels!  The bagel was soft and fresh, and the simple toppings complimented each other so well that you would think they met at an orgy.  Light, but hearty.  Rich, but not thick. (The sandwich, not the orgy)\n\nAlthough I'm in St. Louis, the Red Hook is my long distance coffee house crush.  Well done, Red Hook!"
    },
    {
        "id": 89,
        "text": "Had their vegan (with real mayo) BLT-A and one of their salads. Both were very tasty. Much bigger portions than we had expected, though not overwhelming."
    },
    {
        "id": 90,
        "text": "So I REALLY like this place, they have great coffee, soy and almond milk, and good food. (I have an allergy that prevents me from eating most of their food - but what I have eaten is great and everyone knows loves it), BUT it is a coffee shop and they take WAY too long to make a drink.  I have had to leave here more often than stay and get coffee elsewhere to prevent being late.  On more than one occasion I have been in here and waited for more than 10 minutes without my order for a black coffee even being taken!  I may be a bit impatient, as the only thing I ever order is just coffee, but they need a much better system at waiting on individuals and serving drinks.  If you have time - its worth stopping in, if you want a coffee within 15 minutes, you may need to go elsewhere."
    },
    {
        "id": 91,
        "text": "NOONE and i mean N O O N E makes breakfast sandwiches better then this place! Makes me forget about NYC!!!!  knowing that i can get my fix right here in Philly from a place as cool as this! Perfection with a smile."
    },
    {
        "id": 92,
        "text": "It was just ok.  I had ordered a medium blackberry latte, which was pretty good and far too much for me to handle.  Far too much in fact that the barista decided to hand it over the machinery to me without a warning of how full and hot it was.  It's nice that they fill it to the tippy top, say if there's a lid but not so nice when there is no lid and lots of reaching involved.  That said, I spilled my overfilled cup of coffee on my hand, the counter, and other close objects.  I ordered a mozzarella and tomato sandwich with olive tapenade, I think there was just a smear of tapenade, for a dollar extra I wanted more.  They did provide me with roasted peppers that I didn't order, which I think was supposed to throw me off about the tapenade.  Man...I love olive tapenade.  My friend who came with me, liked her tea and her sandwich, nutella and banana.  The ambiance was nice, very neighborly.  This coffee shop had more character than some others in the area.  The baked goods looked delicious, it was very veggie friendly, and their menu had some good offerings.  I couldn't tell you anything about the free wi-fi, but the bathroom is nice and clean."
    },
    {
        "id": 93,
        "text": "Super friendly service and great coffee and food! I stopped in for a smoothie and a chickpea salad both were fantastic!"
    },
    {
        "id": 94,
        "text": "Seriously, I don't know what I'd do without this place! Even though there are about six independently owned coffee shops within a 2 block radius of my apt, I have become a dedicated RH customer thanks to their exceptional service and commitment to the community (oh, and their always delicious food and coffee). The owners (Kelsey and Chloe) as well as the other baristas are always super friendly and will even remember what u usually order! They have a ton of great and tasty vegetarian/vegan options as well as non-veggie and regularly add new seasonal items. They are also totally dog friendly and host local artist shows about once a month. Red Hook-you guys are the best!!"
    },
    {
        "id": 95,
        "text": "Love this gem! Chicken salad is amazing and you can not go wrong with the elvis! Always a great treat with the potato salad. Don't forget to get the Iced coffee. Lots of options for all diets!! Staff is always friendly and walking in you instantly smell the goodness"
    },
    {
        "id": 96,
        "text": "I had a chai and a bagel. I thought the tea was really light on \"the chai\" (especially for the price). The bagel was fine. I mean, how do you mess up a bagel? I wasn't wowed by the food or drink, but I really liked the neighborhood family ambiance of the place. The liquid syrup was great too (this was the first place I had actually tried it). I was in this area for a very specific reason. I don't see myself frequenting Red Hook, but it's not bad at all."
    },
    {
        "id": 97,
        "text": "Excellent food!  Excellent tea!! (Tranquility of my favorite - cures anything)\nYou used to be able to bring dogs in, but now you can't because some crappy person complained.  That was just an added bonus - loved hanging out with the dogs while waiting for my food to be ready!"
    },
    {
        "id": 98,
        "text": "Best BLT I've had all organic Coffee is on point and prices are so anti Green Eggs come here the people are friendly too love the side snacks of rice and peas"
    },
    {
        "id": 99,
        "text": "Quiet little Cafe with lots of character and charm! We had breakfast here while visiting Old Town Philadelphia and were pleasantly surprised!! I eat a Gluten Free, Vegan diet and avoid Oats as well. \n\nThe staff were knowledgeable and very accommodating to my dietary needs and the breakfast was delicious!! I ordered Breakfast Tacos with a couple adjustments, no egg add tofu sauce, with no toasting to prevent cross contamination (their suggestion). This was a great start to our day and affordable! Oh by the way, they are a Cash Only establishment with an ATM on site."
    },
    {
        "id": 100,
        "text": "Great food--everything there is awesome. Without a doubt the best bagel sandwich I have ever had. Ask them for some bagel chips too. They're also great.\n\nThe atmosphere is also nice and is fueled by owners that clearly love what they do. The customer services matches the food in quality."
    },
    {
        "id": 101,
        "text": "This is my neighborhood coffee shop. It's adorable, dog friendly, and the food is delicious! The coffee is fair trade and you can really taste the difference. Everything there is made fresh and there's a great attention to detail. It's a bit on the pricey side, but it's a great, homey place to chill out for a bit on Fabric Row!"
    },
    {
        "id": 102,
        "text": "the most delicious staff and menu! rotating monthly menu is yummy too! really awesome people work here and they make such tasty treats! cozy atmosphere, local art on the walls, a nice little retreat in south philly. cash only! tip well! and don't forget to as for a punch card ;)"
    },
    {
        "id": 103,
        "text": "I recently moved to the area, and Red Hook is one of my favorite finds.  Their coffee is excellent.  Super flavorful without that bitter taste that's so trendy right now (read: Starbucks).  I usually make my coffee at home to save money, although the $2.00 16 oz medium roast is a treat I grant myself several times a week.  \n\nAnd then there are the bagels.  Cream cheese, tomato, and avocado on toasted whole wheat - seriously, why didn't I think of that?!  The yogurt parfait is made fresh-to-order with hand cut fruit and light, crunchy granola.  It's a perfect breakfast when I have to grab something on the run. \n\nRed Hook is like the cozy, neighborhood spot that you've been dying to find.  Weird arty decor and a variety of seating options, including outside.  It's a great place to run into familiar neighbors, or meet new ones (including the four-legged variety, because Red Hook is pet-friendly)!  I can't wait to try more of what this cozy hideaway has to offer."
    },
    {
        "id": 104,
        "text": "I want to love this place because it has excellent food and a great location, but the staff attitude is really what kills the experience. I always feel like they wish I hadn't come, or I'm asking stupid questions. Not friendly at all."
    },
    {
        "id": 105,
        "text": "Small coffee shop off of 4th. Parking is typically painless. The staff is very friendly and quick.  They make a great almond milk latte and have GF bagels and tofutti. They also have a ton of breakfast sandwiches/wraps. The space has a great ambience and is always featuring local artists. It is small and can't accommodate many people- not so good for groups. But if you're solo it's great. I've been staying at Penn's Landing for work, and have come in for a coffee and GF bagel every morning."
    },
    {
        "id": 106,
        "text": "As I was drinking my coffee, I happened to glance over at something on the wall. It was a thumbtacked note, apparently left by a customer, and it read, \"I love this place. I feel like I'm at home.\" \n\nI feel the same. It's super homey and cozy (read: tiny, with room for maybe less than 20 people) with exposed brick, art on the walls and lots of natural light. They allow dogs, and it doesn't have the lame hipster vibe of coffee places on Passyunk or Grindcore House farther south on 4th. \n\nElizabeth B. and I both had a small medium roast coffee, which was served in a paper cup. Maybe they thought we were taking it to go? Either way, it was perfect. We didn't have anything to eat, but some of the stuff looked interesting if a bit pricey. ($7.50 for a hummus and avacado sandwich, for example. Maybe it was amazing?) Lots of vegetarian and vegan options, yay.\n\nAlso, there was a cute older-ish guy there on his laptop wearing Doc Martens who caught my eye. So yeah, I like this place."
    },
    {
        "id": 107,
        "text": "Quaint little coffee-breakfast-lunch-hangout spot in Queen's Village. Bullseye. \n\nSolid coffee, tasty chai lattes, along with a pretty extensive menu (much more than other typical corner cafes around town). Food is a little pricey, but everything is prepared fresh, and most dishes are paired with a salad-du-jour, such as pasta, potato, macaroni, etc. However, these aren't some cold, soggy pasta dredged in a ludicrous amount of mayo - think fresher, lighter and perhaps healthier. \n\nThe menu has everything from breakfasty, egg-centric offerings to BLT sandwiches, freshly made parfaits and the like. I typically go for the avocado BLT on multigrain, because, well - it's freaking delicious.\n\nProtips - Most of the menu can be adjusted for vegetarian, vegan and gluten-free needs, cash only, avocado BLT FTW."
    },
    {
        "id": 108,
        "text": "I'm trying really hard to not let one bad apple ruin the bunch, but let me tell you about that apple:\n\nI came in one Saturday morning, having strolled around the neighborhood and saw this place. Grabbed a menu and brought it home. It looked like they had a lot of vegan and gluten free options and even encourages you to customize the menu, so my roommate and I decided to order dinner from here! We called 1 hour to close (we live a few blocks away) and while I can't remember what she ordered, I know that I got the BLT + A. Everything was fine and dandy until we got there and realized it's cash only (I know, I'm one of those people but it's 2017! Come on!) So my roommate goes to take out cash and I noticed the bill was incredibly high. I asked to look at the receipt and see we were charged an EXTRA $2 for EACH sandwich for the avocado. I asked the woman at the front what that was for, and she pointed to a sign on the counter that said that avocado would be a $2 upcharge because of demand or something like that. So, let me tell you that both sandwiches are ALREADY made with avocado, with mine having \"avocado\" in the name. How are you going to charge $2 for a few slices of avocado on a $6 sandwich? That makes no sense. I would understand if I added avocado to an existing sandwich that didn't already have one, but the $6 price already reflects the cost of the avocado. My second qualm here is that when we called, WE WERE NEVER TOLD OF THE UPCHARGE! I would have gotten something else with no issue. \n\nWhen both of these points were raised to the extremely rude worker at the front, she scowled and gave myself and my roommate and attitude. I asked for the manager and she said that they were not there and \"even if they were here, they would say the same thing.\" Words cannot describe how incredibly rude this woman/girl...I'll call her a girl...was to us. No \"I'm sorry for the misunderstanding. Unfortunately this is our current policy. I'd be happy to remove the avocado for you if you wouldn't like to pay\" or anything pleasant of the sort! We left without the food. \n\nSo that was the one bad apple. However, I decided to give it another try yesterday morning because I really do love gluten free and vegan foods. This experience was significantly better. I essentially took like 5 things off of the menu in other items and created my own \"concoction\" and they were very accommodating and helpful! They even made the thing look pretty, too! \n\nOverall, I think I will be back...just not at night when that awful person is there. Remember it's CASH ONLY, though!"
    },
    {
        "id": 109,
        "text": "Great neighborhood coffee shop. New owners, new hours, comfortable atmosphere, free wifi, hip aesthetic.  Yay RedHook!"
    },
    {
        "id": 110,
        "text": "I had been disappointed by a couple of local bakeries- this place was a welcome life saver - lovely fresh pastries and friendly staff"
    },
    {
        "id": 111,
        "text": "Red Hook is the best cafe I have been to in the city.\n\nThe atmosphere is really cozy. Exposed brick, wood floors, warm red walls, little tchotchkes all over. Sort of vintage store-like with any type of seating you could ask for- barstool seating in front of the window, couches, huge ornate comfy chairs, and tables/wooden chairs for when you actually have work to do. The environment is more social than a lot of other places in the area. It's rare that I go in and another customer doesn't strike up a conversation at some point before I drag out my laptop to work. The customer base and baristas seem  unpretentious and aren't snotty if you ask to tweak your food order and have offered to run out and get ingredients/whip up a new batch of something if they just ran out and the place isn't too crazy. I've actually seen a barista run to the store to get yogurt to make a parfait (it was at the end of the day...it's not like she didn't have it stocked at 9am) rather than just say \"sorry, we're out.\" And without asking \"do you want me to make some?\" and therefore guilting me into saying no, the barista just took it upon herself to make a whole new batch of herb cream cheese when it ran out the last time I was there. Such great customer service.\n\nThey have awesome food. The tuna melt is insanely delicious in particular. And The Preacher Man-  a sandwich with chicken, pesto, and apricot preserves - is such a weird combination, but it works. The sandwiches all come with a surprise homemade side. They rotate it, but in the past I've had \"cornslaw\" and purple potato salad. They err on the spicy side, but are always a hit with anyone I've ever brought there. In addition to all the muffins/cookies (a lot of which are vegan), wraps, and the bagels (whose toppings are never skimped on), they're also able to make a lot of the hot stuff in store- Paninis, HUGE egg sandwiches, and homemade soups. I don't tend to get a lot of coffee things, but the iced coffee has never seemed watered down and they're always trying new things out (the chocolate ginger chai awaits me).\n\nYou should seriously go here. Queen's Villiage is cute to walk around in general and Red Hook is right near a few thrift stores, a book store, and a ton of fabric places to browse through if you take your coffee to go."
    },
    {
        "id": 112,
        "text": "I love the Red Hook.... First, it's so close and it's gluten-free friendly. More importantly, I know Chloe and Kelsey - two great women who know how to create an atmosphere of comfort that is dog-friendly, art-supportive and people-friendly.  Dan the man is the one of the great baristas they have in addition to the others - he's a great musician and artist in his barista craft.  The Red Hook has amazing menu items and understands the importance of having diversity and variety of food items for those with celiac or other allergies. My pumpkin spice chai with almond milk, a shot of espresso and a touch of Siracha ...makes it that much more... thanks Red Hook..."
    },
    {
        "id": 113,
        "text": "Creative, healthy yet decadent tasting, sandwiches, beverages.  Gluten free breads and baked goods options.  Curried Chicken salad wrap was huge and very sharable.  Dark, cozy, odd seating on menagerie of furnishings -- some tables, some coffee tables, some side tables.  Two large vintage/antique couches.  Close at 6pm, but will serve right up to that moment.  Been there twice in one week since discovering them, plan to bring someone new each time to help keep them thriving (but not too much so I might not get a seat!).  Cash only, but ATM on site.  Prices reasonable for high quality ingredients."
    },
    {
        "id": 114,
        "text": "nice writing vibe? check.\ngood eats? check.\ngood drinks? check. \ncomfy spots to read and write? check.\nlow key owners and staff? check. \n\ncheck out this fabulous neighborhood cafe and be prepared to fall in love with a home away from home!"
    },
    {
        "id": 115,
        "text": "Awesome atmosphere, dank food and good coffee. And good people too! \nGet the vegan BLT-A, even if you aren't vegan. For like $7 it's a hearty (and heart healthy) breakfast or lunch, and comes with a side of some really good potato salad (also vegan!). 10/10 wish this place was in my neighborhood"
    },
    {
        "id": 116,
        "text": "Recently moved to this area... the reviews are spot on. I biked over on a nice day, and sat outside. The place has a great vibe, cool little touches with the decor. The staff are nice and attentive. Will be coming back here for sure."
    },
    {
        "id": 117,
        "text": "I love this place!!!  I work nearby and come in frequently for coffee & sometimes for lunch.  The staff is friendly, funny and attentive.  chill, relaxed vibe with great music....I thoroughly enjoyed listening to a Cramps album while I ate my lunch - how cool is that?!  \n\nA few seats outside, even a \"garden\" area....I love it!\n\nThey have gluten free bread for their sandwiches....awesome"
    },
    {
        "id": 118,
        "text": "-Food was ok, not the greatest. \n-A little pricey\n-Decor is nice, feels kind of homey \n-Employees attitude, TERRIBLE\n\nI ordered something simple and waited 21 minutes before my order came out. I almost received a parking ticket for waiting so long. I thought to myself, I could make that back at home in less than 5 minutes! The place was empty so why did my order take so long? I noticed a couple came in after me and received their food before me. I asked the woman behind the counter after trying to get her attention for a while, she walked passed me several times and never acknowledged me, I was wearing camouflage shorts(did they make me invisible?) When I asked for my food she gave me an attitude like the nerve of me, well the nerve of her. I won't be back again, places like this should realize they chose to be in the service industry so they should provide \"service\""
    },
    {
        "id": 119,
        "text": "When my boyfriend lived in the area, I used to go here all the time. Great food and drinks, nice people, and just far away enough from South Street to avoid the tourists."
    },
    {
        "id": 120,
        "text": "good coffee, good breakfast sandwiches, owners make you feel like a friend, best in the neighborhood"
    },
    {
        "id": 121,
        "text": "Second time here at Red Hook , very nice place Chill coffee is great food out standing \nVery clean, a nice place for any time of day!"
    },
    {
        "id": 122,
        "text": "I really dig this place for breakfast. Comfortable with quality food. Great coffee as well. One of the better spots around. I definitely recommend."
    },
    {
        "id": 123,
        "text": "Can I just start with the lil side of potato salad that comes with your sandwich? Oh Em Geee, I've never had a potato salad quite as tasty - potato's, garbanzos, cranberries, mustard and just enough mayo to make it stick together. Now, if you told me those ingredients before I tasted it I'd probably say \"eww, yuck\" but luckily I was hungry this morning and was adventurous enough to try it and let me tell you \"mmm, yum!\". I mean even after I had my massive behemoth Shades of Egg sandwich (seriously, I HAD to share half with my husband, there was no way I could finish it). The cafe is cute, very homey, service could use a little more friendliness but overall, amazing food!!"
    },
    {
        "id": 124,
        "text": "Very cute and accessible. Like an oasis in the desert, especially on a hot day!  There are few places along S. 4th (fabric row) to rest your feet and get something cool to drink. They have all the italian soda flavors. Try it!"
    },
    {
        "id": 125,
        "text": "Great atmosphere (very cozy and full of knicks-knacks), good coffee. If you're looking for breakfast, I highly recommend any variety of bagel with wasabi cream cheese. YUUMMM!"
    },
    {
        "id": 126,
        "text": "My partner and I stumbled upon Red Hook in need of lunch.\nAtmosphere: cozy with variety [couch with coffee table, cushioned chairs in window nook, bar stools, small tables with chairs], lots of natural light.\nService: warm and efficient. \nFood: BLTA on the multigrain, OMG. This is one of the best, if not THE best, BLT I have ever had. The bacon application is generous and different (trimmed of fat, then crumbled, and then cooked so each individual crumble is perfectly crisp and chewy), tomatoes were plentiful and juicy, greens were flavorful and perfect, avocados were ripe and spread onto every millimeter of toast... when they forgot the sprouts we were given a huge plateful. The complementary side of potato salad with cucumbers was an unexpected treat and extremely delicious (I don't normally even like potato salad).\nDrink: Chai (not sure which flavor) with skim milk. This was \"okay,\" will probably just get a coffee next time.\n\nOverall: I wish this place was closer, although I then might be broke and/or become extremely overweight in a short period of time. My partner and I cannot wait to come back.\n\nThank you Red Hook Coffee & Tea for existing and being you."
    },
    {
        "id": 127,
        "text": "Excellent coffee, semi-friendly baristas - what more could you want? Yes, the food is outstanding. I particularly like their potato salad, check it out, it comes with sandwiches but I believe you can also order it as a separate side order. Outdoor seating is a plus."
    },
    {
        "id": 128,
        "text": "Good coffee, great food, friendly staff. Simple and effective.\n\nI don't know how they could do a better job aside from hiring Mr. T to hang out and tell you jokes while you wait for your food."
    },
    {
        "id": 129,
        "text": "Yall their sandwiches are AMAZING! The vegan BLTA and the vegan chicken salad are on point. The potato salad is amazing too. The multigrain bread is so good too like idk how. All the food I've had here is great. I always get good service as well. HOWEVER I dock one star because the coffee could definitely be stronger. I always need to add an extra shot to everything here (but an extra shot is only .50 extra so it's not a huge deal at least)"
    },
    {
        "id": 130,
        "text": "Literally my favorite place to go for coffee/breakfast. The breakfast burrito is killer, as well as all of the different sandwiches they make. Chloe and Kelsey (sp?) are especially great and +1 for the steady stream of good puns when naming the specials. On par with Bob's Burgers in that respect. Good coffee, reasonable prices, awesome location, friendly staff. Can't ask for much more. Wish they accepted cards but hey it is what it is and they aren't the only place that is cash only."
    },
    {
        "id": 131,
        "text": "Really a nice spot for caf in this part of the city... easy to carpark usually during the day as well (try the side streets - free!!)\n\ncoffee is yum and not burnt, almond croissants are among best in city (flavorful, nice vanilla taste with ample marzipan)\n\nseating can be tough, as local families love having their childs with them for hours of droning home repair horror conversations...\n\nOwner has  nice brooklyn edge to him - had foresight of making \"clients\"use password to connect to WIFI - better step would be one hour timer per purchase - and as PW never changes, it doesnt really do much...\n \nslightly pricey compared to others in Philly, but about worth it"
    },
    {
        "id": 132,
        "text": "Nice quaint coffee shop that can get really really crowded. \n\nif you're planning to sit inside try to not go during peak hours. They can fit at the most 20 people inside plus a few outdoor tables.\n\nThe drink selection is fairly standard but the food is bit higher end than most coffee shops. \n\nOnly watch out I have is they do not take credit card. So bring cash or be prepared to use a higher priced ATM inside the store."
    },
    {
        "id": 133,
        "text": "I have been here multiple times. I try something new each visit and they never disappoint. The atmosphere is amazing to have a quick bite and read the paper. Don't forget they are cash only but if you do, they have an atm on premise"
    },
    {
        "id": 134,
        "text": "Stumbled upon this place and so glad we stopped in. A cute cafe that meets all of your healthy sandwich/coffee/salad needs.\n\nI had a hummus wrap that was filling, tasty and super fresh. We sat in the high, comfy sofa chairs at the window cove and loved lounging for a few before resuming our walk around the neighborhood."
    },
    {
        "id": 135,
        "text": "I wish I lived nearby, because I'd be here all the time, writing the good stuff from the comfort of Red Hook's plush furniture, with a full belly of delicious food. This place is delightful. Friendly regulars and lots of dogs streaming in and out. The food is fresh and creative and colorful and wholesome. The tea is robust and refills are free. I feel like I could write a novel here. Or a chapter of a novel. Or a scene. Or a couple of really inspired paragraphs. Anyway, I ate healthy and didn't steal that person's golden retriever puppy."
    },
    {
        "id": 136,
        "text": "My favorite cafe in the city! I'm sad it took me so long to get here to try it, but now that I have, I go there AT LEAST once a week--honestly, usually closer to two to three times.\n\nThey have DELICIOUS food and an extremely creative menu. There's a wide selection of both vegan and regular meat options available. I love the lunch sandwiches, all of which come with a special side, which changes frequently (the potato salad is the best!). The fact that they put a hefty amount of sprouts on nearly every lunch sandwich means a lot to me as well. \n\nBEST vegan BLTA(vocado)\nBEST facon egg and cheese\nBEST vegan chicken salad\n\nGet here ASAP! Everything here is made to perfection!"
    },
    {
        "id": 137,
        "text": "This is my favorite weekend spot. I make a point of coming here specifically for the bagel sandwiches. Best around by far. SO delicious. And they have Taffett's gluten free bagels to boot. Win! They are usually playing some great punk and the service is pretty good too! Coffee is tasty, plus they have almond milk if you don't do dairy or soy. Check it out if you're in Queen Village."
    },
    {
        "id": 138,
        "text": "Delicious whole wheat cream cheese bagels! The cappuccino is very foamy, which I love."
    },
    {
        "id": 139,
        "text": "Just walked out of there. The girl made pesto pasta salad. Amazing. Always friendly staff."
    },
    {
        "id": 140,
        "text": "I really like this place. I've been by several times for coffee, but things to note:\n\n1. They have almond milk\n2. They have really tasty food. I've had potato salad, an omelet thing with spinach, goat cheese, avocado, and roasted red peppers served with toast. My sister got a special which were sweet corn cakes with a huevos rancheros type of topping.  \n3. Prices are pretty standard - the above meals were like $12 each including the iced coffees. \n4. Staff is super friendly!"
    },
    {
        "id": 141,
        "text": "My girlfriend, who has Celiac's Disease, and I came in from Cleveland and loved this place. She had the Valley with a gluten free everything bagel, and I had the Breakfast Bomb wrap. Both were PERFECT!\n\nOur coffees were fine, but we had iced and black coffees, so it's hard to screw that up."
    },
    {
        "id": 142,
        "text": "This place is everything I want out of a local coffee/tea shop. The regular coffee is delicious (a great sign), the tea lattes are made w/ tea leaves (not the powder like chain shops use which I hate), and the food is great! This morning I had a green tea latte which was perfectly foamy and not sweet which gave me the ability to add my own agave. I also had the yogurt parfait which was served in a cereal bowl (not pre made) w/ a ton of fresh fruit and man o man...it was the best parfait I've ever had! Also noteworthy are the gluten free options. Last time I was here I had cream cheese, avocado, and tomato on gf bread. It was amazing! Healthy portions and so fresh!!  Definitely stop by if you've never been ;)"
    },
    {
        "id": 143,
        "text": "Excellent food, friendly people, awesome relaxed atmosphere. Our breakfast sandwiches were both phenomenal and their side of the day was yummy too. The cafe pairs fruit spreads with savory items to create really unique sandwiches. It was filling and perfectly priced. We are planning on returning on a weekly basis (if not more)."
    },
    {
        "id": 144,
        "text": "They now take credit cards and offer online order ahead!  Easy pick up through a window on the street.  Their sandwiches are so healthy and hearty, it just gives you a warm fuzzy feeling.  It's like homey comfort food that doesn't fill you with regret afterward.  There's a ton of add-ons that are either free or cheap (50c), so it's easy to customize.  The multi grain bread is perfect, and the Veggie Hook sandwich is amazing, especially with a little something tangy (vinaigrette, lemon juice, etc.) and cheese.  Love this place."
    },
    {
        "id": 145,
        "text": "I would just like to apologize to the barista working today. I could tell I was inconveniencing her as soon as I walked in, and then proceeded to really be a pain when I ordered a breakfast sandwich and a latte. \n\nI'd also like her to know how much she inconvenienced me. Because, the latte didn't taste quite right and I was worried maybe she misheard me and used soy milk by accident, which I can't have. But, I took a look at the face she had on and instead poured the whole thing in the gutter when I walked out. Was it soy? Was it not? I'll never know, because that's how much I didn't want to talk to you again. \n\nI don't need ear to ear smiles or lots of friendliness. But just a general LACK of attitude would be nice. \n\nThis is what I get for not walking the extra 3 blocks to the cleaner, better place close by.\n\n--------------------------\nKelsey & Chloe - \n\nI am just seeing your reply now. I initially wanted to write to you saying that you're right; speaking to a manager would have been the best way to have handled this situation, and to thank you for your reply. But, the more I read it, the stronger I stand by my review. \n\nYour reply offered no acknowledgment of the unacceptable way I was spoken to while in your cafe. Instead, you offered the patronizing comment about 150 non-bacon items on your menu. FYI - It's possible to have a bacon sandwich not dripping in grease. \n\nYou have many great reviews, so I'm sure you're doing something right. Writing a snooty reply to a paying customer who left unsatisfied doesn't seem necessary and doesn't reflect well on the management of your business."
    },
    {
        "id": 146,
        "text": "This a small and intimate coffee shop away from the craziness of South Street. The barista was friendly and told me about their specials today. I decided to be basic and order a bagel with Nutella along with an iced mocha. The mocha wasn't mixed well and you get a big gulp of syrup. It was a cool place I may go back to and hopefully try their sandwiches."
    },
    {
        "id": 147,
        "text": "This place is amazing. Cash only and takes a bit for your food but totally worth it. Even my meat-and-potatoes husband enjoyed his meal. A+!"
    },
    {
        "id": 148,
        "text": "Masterfully crafted food. Honestly, exactly what I was looking for. Sandwiches are made from wholesome arrangements of typical breakfast faire without the fluff. Fair pricing based on what you get. Bring cash and tip."
    },
    {
        "id": 149,
        "text": "How could I possibly have any complaints?\n\nThis place is phenomenal.  It's kitschy and cozy and feels like home the first time you walk through the doors, with charming decor - mismatched furniture and worn carpets.  They allow dogs, which is super because my dachshund mix comes with me most everywhere I go.  There's even a jar of biscuits on the side of the bar.  They regularly feature the work of local artists and there's a bulletin board across from the counter that has flyers for upcoming area events, business cards, etc.  The atmosphere is welcoming, comfortable, and friendly.  I can sit here and read for hours, with my doggie relaxing at my feet, occasionally chatting with other patrons.\n\nNow.  The food and the drinks.  They're awesome.  I don't drink coffee, but the selection of tea and smoothies is great.  Their mango smoothie is my go-to drink on a hot day.  It's perfection.  I highly recommend the chicken panini with sun-dried tomatoes, mozzarella, and basil.  However, the bagel with cream cheese and the banana and nutella sandwich are very nearly as amazing.  I'm a pretty strict meatatarian, but there are tons of vegan/vegetarian options as well.\n\nBe aware.  Since they only accept cash, there is an ATM on site (with a small accompanying fee to withdraw)."
    },
    {
        "id": 150,
        "text": "We were searching vegan breakfast options that were near Dottie's Donuts (vegan donuts) and came across this place. The boyfriend ordered a Vegan Elvis (peanut butter, banana, agave and vegan bacon then pan fried) and fell in love! It came with a side of vegan potato salad. Would definitely recommend to a vegan and/or non-vegan. It looked and tasted delicious (picture included for drooling purposes). \n\nI went with a toasted sesame bagel with cream cheese and bacon. Simple but delicious--I promise you. I was expecting bacon strips but it was covered in bacon bits so every bite was perfect!\n\nWe were both happy with the choice and agreed it's definitely a spot we'd come back to when in Philly. Don't hesitate, just go! You won't regret it."
    },
    {
        "id": 151,
        "text": "I'm a big fan. Sandwiches are top notch, muffins are delish, coffees and teas are tasty. A tad pricy - as in $11 for an iced coffee and a sandwich. They're cash only and have an ATM in the shop and are dog friendly, which is awesome."
    },
    {
        "id": 152,
        "text": "This was my first time eating at this establishment and I loved the CAT bagel sandwich. The tempeh was yummy but was not crunchy. I'd love to return to try other options. They do serve eggs and chicken for people who prefer those options. They have coffee, teas, and hot chocolate as  a few of their drink options."
    },
    {
        "id": 153,
        "text": "One of my favorite brunch spots in the city. It's v cozy and the food is great. They have a nice vegan selection and their coffees/teas are generally unique and delicious. \n\nThe service is always quick and the food is always good."
    },
    {
        "id": 154,
        "text": "I come here almost everyday, and it is incredible. The staff is so nice and the food is delicious. The BLT is simply amazing. I also eat the chicken salad very frequently, and it is such a unique and tasty recipe. My friend visits from a couple hours away to have the sweet baby bleu. Way more than just a coffee shop. Really interesting art as well. You're in for a treat if you get the chance to stop by."
    },
    {
        "id": 155,
        "text": "I Recently moved to Queen Village and i love all of the coffee shops in the neighborhood!!! Red Hook Stands out to me for a couple reasons: \n1: Fun/ Spunky Staff\n2: Great coffee\n3: Comfortable indoor environment and cozy outdoor seating\n4: The best constructed Bacon, Egg and Cheese Sandwich I've ever had!!!!!!!!!"
    },
    {
        "id": 156,
        "text": "Favorite coffee shop in the city! Cool bad ass barista girls, great prices, unpretentious atmosphere. I recommend the chicken salad sandwich and the iced red eye. Cash only, but there's an ATM inside with a low fee."
    },
    {
        "id": 157,
        "text": "This is my go-to place for breakfast in Queen Village. Consistently delicious sandwiches and some of the best cold brew I've ever tasted at very reasonable prices. The Peacher Man is a consistent favorite but the Lil' Goat and breakfast burrito are also yummy. I'm writing this as I stuff my face with yet another SEC."
    },
    {
        "id": 158,
        "text": "I feel silly reviewing this place since I haven't actually had the coffee here yet, but the food is my idea of heaven!!  Simple but perfectly executed, fresh, healthy, tons of veggie options, very reasonably priced.  The sandwich was so big I had to take half of it home!  It even came with a little side of potato salad, which was divine.  This place has cozy, down to earth cafe vibes, but is still hip enough to have good music.  The staff was kind and helpful.  I'll definitely come back to try the coffee, and the rest of the menu!!  The only drawback is it's cash only, so come prepared."
    },
    {
        "id": 159,
        "text": "This has been a favorite spot of mine for the last 10+ years and I'm happy to have this a few blocks from my house now. It used to be my go-to lunch date with my dog when I was in school or on the job hunt , and both of us needed a change of scenery. Now, no more dogs hanging out inside but that's ok. I get it, we're not in Europe. :(\nThe BLTA is just A-mazing. It is all about the perfectly cooked and huge heap of crumbled bacon  so as not to pull out the entire strip in one bite. The whole grain bread, addition of avocado and yes the funny look when I ask for vegannaise but not Fakin-bacon is A-ok !  I love the lil side bowl of interesting grain or potato salad. \nMy husband once got a breakfast wrap which to him was uninteresting and a bit dry, but since then he's snuck back without me for sandwiches--his favorite was something with peach jam and grilled chicken? I dunno. I keep going back to my fave BLT here. I love their iced coffee too."
    },
    {
        "id": 160,
        "text": "We were searching vegan breakfast options that were near Dottie's Donuts (vegan donuts) and came across this place. The boyfriend ordered a Vegan Elvis (peanut butter, banana, agave and vegan bacon then pan fried) and fell in love! It came with a side of vegan potato salad. Would definitely recommend to both a vegan and/or non-vegan. It looked and tasted delicious (picture included for drooling purposes). \n\nI went with a toasted sesame bagel with cream cheese and bacon. Simple but delicious--I promise you. I was expecting bacon strips but it was covered in bacon bits so every bite was perfect!\n\nWe were both happy with the choice and agreed it's definitely a spot we'd come back to when in Philly. Don't hesitate, just go! You won't regret it."
    },
    {
        "id": 161,
        "text": "I got the Sweet Baby Bleu egg sandwich (but requested goat cheese instead of bleu) and it's was one of the best things I've eaten in philly. I cannot recommend this sandwich enough. I'm absolutely going back to this place again!"
    },
    {
        "id": 162,
        "text": "I really like this place. The menu is a good size and lots of different options than most coffee places. I have always enjoyed my lattes. I love that they have peppermint during holiday season. I usually get the juevos banditos wrap and it is delicious. I recently tried the celestial bagel and while it is delicious and loaded with lettuce, tomatoes, tempeh and a creamy sauce it does fall apart a little as you eat it. Their service has always been fine and they have a few tables with chairs outside to sit as you wait or enjoy your food there. Will continue to go here and explore their menu."
    },
    {
        "id": 163,
        "text": "A friend recommended this spot to me, and it did not disappoint! It was fairly easy to find a street parking spot on a weekday morning, and I walked up to order a coffee and breakfast sandwich. Highly, highly recommend the peacher man - it's a sandwich with egg, veggie sausage, and peach jam, and it was delicious! The coffee was great too. I'd definitely come back here again for coffee or takeout breakfast."
    },
    {
        "id": 164,
        "text": "I happen to really, really like this place.  GREAT sandwiches - healthy options abound with some really, really unhealthy-sounding ones thrown in for good measure.  Always filling, satisfying without weighing you down.  This screams quality ingredients.  Everyone is really nice here too.\n\nThe place also has a definite edge to it, but not so much where you feel uncomfortable like another coffee shop further down 4th St. that rhymes with Schmindcore Mouse.  I always feel like they think I'm a cop when I walk in there.  I'm not a cop."
    },
    {
        "id": 165,
        "text": "Red Hook has what is easily the BEST bacon, egg and cheese I've ever had! I don't know what they do to it, but it is simply amazing and at $7 is a steal considering the $11 you'd pay a few doors down for a lesser quality bacon, egg and cheese."
    },
    {
        "id": 166,
        "text": "Got my hair done around the corner and have never really been out in this area before so I figured I stop by Redhook for a quick caffeine fix and a bite. I got Shade of Egg which was amazing. Everything was fresh and the sandwich was huge ! They give you a side rice/chickpea salad was which was bomb. This is definitely a \"don't judge a book by its cover\" place because the atmosphere makes it look a little grunge, but it's a cool vibe if that's what you're into."
    },
    {
        "id": 167,
        "text": "I've always said  metal and coffee go together, and red hook finally proved me right.  Funky and cool vibe, with good food options, too.  Hang out or get coffee on the go if you're in queen village.  I was a bit surprised that they charged me extra because I didn't have a face tattoo.  But, I understand."
    },
    {
        "id": 168,
        "text": "I absolutely love coming to this place on the weekends, and it looks like this place is maybe becoming a regular haunt. The furniture is comfortable and cute. The latte is strong and the food is quite good. I still want to try out some of the other sandwiches, but the chicken salad sandwich was insanely good. I was not expecting that. Sides that come with the sandwiches are also tasty."
    },
    {
        "id": 169,
        "text": "I'm not a huge fan of Yelp mostly because people tend to be a little harsh an type out of angry... But I get food from this place a few times a week and its always great same for the service. If you're ever in the area and looking for really good homemade food I would go here."
    },
    {
        "id": 170,
        "text": "Red Hook has a charm that Fabic Row has needed for quite some time now. Ever since there really wasn't much to offer on the beautiful 4th Street shopping of the finest fabrics and materials. Besides The Famous Tea House, which really isn't a cafe, just a place to pick up really good DIY tea for home. Then Red Hook hooks in and sinks right into the heart of this taken for granted area of Queens Village. They even have nifty red cups with their logo of the hook to help promote this slowly but surely, increasingly popular underdog. Some people complain why sell fair-trade coffee when the cups aren't environmentally sound, so what? Take your 'Whole Foods' lifestyle to someone who cares. Everyone's doing their fair share of killing the planet and people like you are only making it worse. Besides don't even get me started on what soy is costing us. Back to Red Hook, they just revised the place, making it more spacious, cozy, and friendly for any new-comer or patron-saint since day one. What I love most is that it doesn't just attract one kind of crowd. Everyone is welcome and they eagerly anticipate that from the moment a hipster to an elderly couple stumble in. Their variety in scones and cakes are sublime and it goes great with something from their hand-crafting espresso bar. They have wi-fi too but what I like to see is people conversing and that does happen here. A great place to stop in before you begin your morning or afternoon hunt for inexpensive fabrics to make your dress for an upcoming show or party."
    },
    {
        "id": 171,
        "text": "No hyperbole- some of the yummiest sandwiches I've ever eaten!! We also got the iced turmeric, honey latte which was delicious as well! Counting down the days until I go back"
    },
    {
        "id": 172,
        "text": "Just moved close to this place and have been looking for my new favorite coffee spot. I got a caramel iced latte with oat milk, and it was pretty good. I know they have caramel syrup and real caramel, and I think they put real caramel in mine which made it a little harder to incorporate into my drink. It was still good though. My boyfriend also got a really good hot chai latte that he likes more than the other chai he's tried around the neighborhood."
    },
    {
        "id": 173,
        "text": "I come here almost everyday, and it is incredible. The staff is so nice and the food is delicious!"
    },
    {
        "id": 174,
        "text": "I love this place. So do all my coworkers. Good funky sandwiches, lots of vegan stuff, amazing potato salad. \nWe often call ahead and come in to pick up.\nThe staff is all really nice and helpful. \n\nI haven't had their coffee as I usually go for lunch, but their iced teas are great as are the smoothies. \n\nThe BLTA and Vegan curried chicken salad wrap are my fav if you're looking for a recommendation."
    },
    {
        "id": 175,
        "text": "Adorable cafe with excellent food.  Exposed brick walls with a gritty feel yet the cuisine is clean, crisp, fresh, and delicious.   Super vegan friendly with extraordinary cafe fare!   \n\nI got the Vegan Curried Chicken Salad Wrap.  Contrra with lettuce, tomatoes, cranberries, carrots, onions, avocados on a wheat wrap.  ABSOLUTELY DELICIOUS!!!   Paired with a side of Vegan/Gluten Free Potato Salad this was an excellent lunch.  They offer melts, soups, sandwiches, sales, breakfast, and wraps.  Awesome.   GO HERE!"
    },
    {
        "id": 176,
        "text": "Yelp hooks it up yet again! I decided to continue my quest for good Hot Chocolate and was really liking the reviews for here. So I decided to come in and spice it up ancho style..\n\nwith an ample helping of sweet chocolate, ancho hot pepper, and whipped cream, their spicy hot chocolate REALLY gave my taste buds a good kick. and I really dug the vibe that the house had overall. it had a punk rock feel, but it wasn't too in your face punk. the art was some of the best that I've seen out of a coffee house, and they even had an old school hip hop poster for a rap shop that happened at The Spectrum! It was the perfect spot to stop in and read my Dali book. but I'll definitely be back to take advantage of the Wi-Fi.\n\nI didn't have any of the food but it smelled delightful. I definitely made note of the multiple biscotti, fresh sandwiches, and the fact that they had three kinds of fresh soup."
    },
    {
        "id": 177,
        "text": "Red Hook is awesome for what it is -- it's a little local cafe, the kind of place where they know you and people bring their dogs around (dogs!), and they win my love for being so close to my apt and having vegan cream cheese and being so darn vegan friendly.\n\nI am not a coffee snob, but I have had some of their froo froo drinks (ex. Thai Peanut Latte) and I've been a fan. They're pretty strong, coming from someone who drinks coffee every 3 months, and quite tasty.\n\nIt's a lovely place to come chill and have breakfast, or chill and have lunch or chill and ... chill. They also have art on the walls and have openings with lots of people (I haven't been to one yet) so I assume some free booze is involved. I usually really enjoy their shows. It's probably not the best coffeeshop in QV, but it's my favorite coffeeshop (now tea shop ... that's another matter ;)"
    },
    {
        "id": 178,
        "text": "I love red hook. I order very frequently and always purchase a side order of extra sauce for .50. I ordered two this time and got a teaspoon of each sauce, I'm not sure why it's never consistent. I feel ripped off paying for this sauce."
    },
    {
        "id": 179,
        "text": "my boyfriend and visited red hook coffee and tea this weekend and oh my goodness that breakfast of champion sandwich is SOOOO GOOD. it had soo many flavors that complement each other. It has a nice kick to it but not too much. Customer service was great as well. Great portion size. \n\nI will most definitely be returning. Highly recommend."
    },
    {
        "id": 180,
        "text": "Red Hook is my go-to coffee shop in the neighborhood. Their cold brew is intense and delicious; even if I get food from another place, I'll stop in Red Hook just to get the cold brew.\nToday I got the seasonal maple rosemary latte, which was perfectly made: not too sweet or heavy on the rosemary. I also ordered lunch for the first time. I got the Peacher Man sandwich, which was SO delicious and even better than I was expecting. They served it with a side of delicious, tangy potato salad.\nThe prices are all very reasonable, especially given the great quality of the food and beverages."
    },
    {
        "id": 181,
        "text": "Food is super yummy here, and I was glad to find that it's vegan friendly but not strictly vegan. (Bacon). Service is friendly and prompt. There's limited seating but it hasn't been a problem when I've gone. Good for getting work done because there is wifi and outlets. Definitely a new neighborhood favorite for me!"
    },
    {
        "id": 182,
        "text": "Great spot. Awesome coffees. Good breakfast eats. \nChill vibe. Friendly attentive laid back staff. \n3 brands of fizzy water \nNo OJ. Just bottled drinks. Add juice options and it gets a solid 5 stars. \nCash only. Very reasonably priced."
    },
    {
        "id": 183,
        "text": "Too hip for me.\n\nHonestly, the coffee was pretty damn good - but I have a big problem with places that make you feel less-than because you don't have an undercut, thigh tats, or haven't been to a crusty basement show in like a year. \n\nMan I feel like a bitter old wench writing this, but ugh. So over the hip thing."
    },
    {
        "id": 184,
        "text": "BEST SANDWICHES EVER.\n\nThe gluten free bread options alone would keep me coming back but the sandwiches themselves are incredible. Love the sides of potato salad and plan to try a salad soon. The online order and window pickup makes it the perfect lunchtime order spot.\n\nKnocked off 1 star because I'm not a huge fan of their latte flavors and wouldn't come here for only a drink, but the quality of food makes up for it."
    },
    {
        "id": 185,
        "text": "We order from here at least 3 times a week and every time they get the order wrong. Ordered iced and given hot. The lattes are great when it's done right, but lately it's all milk. $5 for milk, basically. Always confusion when picking up. Frustrating to not get what you paid for."
    },
    {
        "id": 186,
        "text": "Cozy little spot.  Good coffee and food.  Hipster descent upon Philly, with the vibe a bit... It was inevitable but I don't mind since it's a nice place to get through paperwork."
    },
    {
        "id": 187,
        "text": "I got the egg and cheese sandwich. I never leave reviews but it was genuinely inedible. Not saying this place as a whole is bad but DO NOT order the egg and cheese sandwich. It was the worst one I've ever had. Literally took 3 bites and threw the rest out."
    },
    {
        "id": 188,
        "text": "The coffee here is good and everything I've ordered to eat I've enjoyed as well. The unfortunate part that has ruined my experience here has been the staff. Some days I go in and depending on who's working it's a great place to hang out. Other days I can't get out of there fast enough. Self-important critics complaining loudly and shamelessly about everything from celebrities they think are 'too fat' to costumers that annoy them. I used to work in a restaurant so I get that BUT I shouldn't hear you complain about it while I'm eating a sandwich. I wish the positivity and professionalism of the owners would rub off on the rest of their overly opinionated staff."
    },
    {
        "id": 189,
        "text": "HOly Crap!  How have I not known about this place?!?!?!?  Very delicious.  Cash only,  Super nice staff.  I felt like I could have fallen asleep on their couch while waiting for my sandwich, it was so warm and inviting.  New favorite place.  SO wish I'd known about it sooner.\nOh, and I had the first wrap on the board, I think it's called the Harvest wrap, and a Chocolate chai latte.  Both were really good."
    },
    {
        "id": 190,
        "text": "Totally adorable!! Love coming here and love the vegetarian options. This may be my new fav place to have lunch when I'm local. My ONLY issue is that there isn't much seating."
    }
]