[
    {
        "id": 1,
        "text": "This is a great late brunch option during the weekends when the big morning rush dies down after 1 pm. Usually there is no wait or 5 minute wait at this time. One big complaint is that they don't have an organized system for seating guests. The servers don't always greet incoming patrons (which should be required Waffle House-style) and they sometimes tell you to seat yourself (which can lead to one or two people taking up tables for 4) or they'll seat you (whenever they get around to talking to you). \n\nI've ordered a several different dishes at this point and they have varies from ok to awesome. The chicken wings and onion rings are just ok. The wings are either lightly dredged in flour or not at and then fried whole. They aren't really seasoned so the wings are pretty bland. The \"onion rings\" made of formed, chopped onions that are breaded. The chicken fingers were a bit over battered and dry. The smashwich (or whatever it's called) was pretty good: your choice of breakfast meat with hash browns and eggs in a hoagie roll, but unspectacular. The club sandwich is classic diner fare that is very well executed. The egg and omelette platters are a very good deal and dang tasty. The best thing on the menu is definitely the waffle. It's gently sweet, very crispy and covered in butter. So good!\n\nThe service is generally pretty attentive (once you're seated), the restaurant and bathrooms are very clean, the food is a good, tasty value"
    },
    {
        "id": 2,
        "text": "Best breakfast in West!!!! The chicken & waffles never disappoint and neither does the service. I only wish they were open  at 2am so I can get pancakes after dancing at Dahlak."
    },
    {
        "id": 3,
        "text": "They do not skimp on their sandwiches here. Solid 5 inches in diameter with tons of bacon and cheese. Not especially clean but definitely tasty."
    },
    {
        "id": 4,
        "text": "I love the prices ! The chicken and waffles were good but not the best I've ever had. The service was nice and quick also."
    },
    {
        "id": 5,
        "text": "This is one of the best affordable and yummy brunch places in University City. If you want a very traditional American brunch, this is the place to go! It has a warm and comfortable atmosphere that reminds you of home or of the family diners you might find back in your suburban hometown. Number 10 or 9 is my go to for this place."
    },
    {
        "id": 6,
        "text": "My daughter and I ate here for the first time yesterday... She didn't want to wait the 5 to 15 minutes to be seated and was like mom can you take me to IHOP.. Uugh no.. When I tell you the food and service was THEE BEST!!! We will be back...Your review helps others learn about great local businesses.\n\nPlease don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees."
    },
    {
        "id": 7,
        "text": "Good portions; good prices; yummy food. That's all.\n\nWish they had more menu items with avocado though!"
    },
    {
        "id": 8,
        "text": "I recently returned to this restaurant, as promised, after hearing some good things.  I like that the booth style seats have been replaced by tables and chairs, this is much easier to navigate.\n\nThe food is as good as my last visit.  I had to ask for silverware, but that was rectified right away."
    },
    {
        "id": 9,
        "text": "Best neighborhood breakfast spot in West Philly if you ask me.\n\nFood is consistently delicious. No matter what I get: omelet, cheese grits, pancake, waffle. I have never been disappointed.\n\nDiverse crowd. Sometimes a little wait but things move fast."
    },
    {
        "id": 10,
        "text": "I was charged with getting lunch for 50 of my closest coworkers.  I didn't want to go the normal route of greasy pizza, so I searched for \"chicken & waffles.\"  Cedar Park Cafe was the top hit.\n\nThey are the sweetest people, and even went as far as saving me a parking spot out front so I could load the food into my car easily.  I can't say enough good things about the service and people.\n\nAs for the food - That's another (good) story.  Ever since our office had their first taste of Cedar Park Cafe's chicken and waffles... I've been hounded by numerous coworkers asking for another order.  This happens on a weekly basis.\n\nAll the waffles were homemade and unbelievably delicious.  The chicken consisted of boneless breast meat with a panko coating and was equally delicious.  They threw in powdered sugar, syrup, and a sweet and spicy sauce for the chicken.  All of it was amazing.  \n\nEverything went.  Quickly.  Collectively, its our office's favorite meal by far.\n\nPlease check this place out.  In a city quickly becoming known for good food - Cedar Park Cafe is killing it."
    },
    {
        "id": 11,
        "text": "Tried the chicken and waffle and found it to be excellent.  First time in CPC.  Nice place, nice ambience, diverse group of people.  What is not to like?  Will visit again.  Better come early or expect the place to be packed to the rafters."
    },
    {
        "id": 12,
        "text": "The food is amazing, but the wait is terrible. We had to wait for an hour before getting seated. After being seated, we had to wait for another hour before getting our food. Tables who had ordered after us got their food before we did, which was annoying. The portions are huge, and the food is very good. But, a two hour wait is not worth it when you are hungry and just want to eat breakfast!"
    },
    {
        "id": 13,
        "text": "These worlds greatest food!! Obviously Hillary Clinton has good taste! Always a wait but so worth it. I bring all my friends here and no one has ever complained. People will remember you there and are always friendly!!! I live for it every morning :)"
    },
    {
        "id": 14,
        "text": "AMAZING chicken and waffles and French toast! Went here with my kids and husband and we all left full and with awesome food! Probably the best chicken and waffles I have had...and the spicy Asian sauce with them made it even tastier! Would definitely recommend!"
    },
    {
        "id": 15,
        "text": "Came here for brunch with some friends on Sunday because all of the other brunch places in Baltimore were booked or had a long waiting time. \n\nWalking in, it gives off a homey feels get local. It's also a bit cramped, not enough where you and your party are on top of each other, but you'd have to be mindful of moving around (or turning and making awkward eye contact). Our server was nice. She didn't check back on us that much until we got our food, at which point she'd come ever 7 min (not complaining). \n\nWe were a little put off by the amount if flies that just seemed to be hovering in the vicinity, not sure if thats just common there or someone left the back door open... but again off putting.\n\nFood wise, I got the chicken and waffles. It was suggested to me by a friend. It's pretty fricken great. The chicken is tender, really well seasoned, generous portion size and boneless (hate looking messy in public places). The waffle was underwhelming in that it was soggy 5 min into the meal, but really the chicken makes up for it. My other friends got the chicken and waffles, and the eggs benedict (it looked like that at least). They were all pretty satisfied (especially the friend who got the chicken and waffles). Curious to see how other breakfast/brunch places on Baltimore ave compare."
    },
    {
        "id": 16,
        "text": "Awesome!!!! Their pancakes light and fluffy. The chicken was fried perfect. One of the best foods spots we went to in Philadelphia"
    },
    {
        "id": 17,
        "text": "Chicken was tasty. Waffles were standard waffle batter from a standard waffle iron. Bacon was not the highest quality. However everything was very reasonably priced, and the dining room was clean. Service above average. Bathrooms were soso."
    },
    {
        "id": 18,
        "text": "Can't ask for a better cheap breakfast. I go here all the time when I want good and cheap food. Its filling, it taste great, and the service is quick. Definitely worth a shot. (Standard diner food - do not go in expecting any frills)"
    },
    {
        "id": 19,
        "text": "I love Cedar Park Cafe! I usually come by here after church, and it's a friendly restaurant with great brunch foods.  Last time I went, I got chicken and waffles and it was delicious and filling. Over the last few years, I have been able to taste everything on the menu, and I have not come across any dishes that were disappointing. \n\nThe waitresses are extremely kind, and it is a welcoming environment. \n\nThe only inconvenient part of eating at Cedar Park is that there is always a long line."
    },
    {
        "id": 20,
        "text": "We had great experience at this place today. We arrived around 1:30 pm. The place was quite full. We had about 4 people (two groups) ahead of us. We just waited at the entrance for 10 minutes or so. We were seated and served quite promptly. All the dishes were really large and good. My waffle and chicken was superb.  Veggie home fries was awesome. All in all great experience!"
    },
    {
        "id": 21,
        "text": "A diner in West Philly?  This place does a fine job of it too.  Great service.  Decent coffee.  Excellent eggs, sausage, pancakes.  I highly recommend the chicken with waffles."
    },
    {
        "id": 22,
        "text": "Food was very good. We had the omlets and they were good. Plenty of food. You won't go away hungry. A few small issues make it a 4 out of 5. Slow to get the check. Slow on the refills of coffee and water."
    },
    {
        "id": 23,
        "text": "I have eaten here multiple times and really enjoyed it but my last visit was my worst experience. We got seated at around 11 when it wasn't super busy and after our waitress took our order it took 50 min to get our food. We actually hadn't seen our waitress at all and had to ask a different waitress where our food was. People that were seated after us got their food before us. When my pancakes arrived they were extremely cold and when I told the waitress she took them to the kitchen then came back to say : \"what do you want us to do with them like microwave them or remake them im not sure what they can do\" I was honestly so confused because if you as an employee don't know what the kitchen can do then why and how are you working here?? Once my eggs Benedict came they were alright, the bread was extremely hard and it took me awhile to cut through it. My boyfriend had the chicken and waffles which were good. At the end when we asked for our check we waited another 20 minutes for her to come tell us to stand in line and tell her what table we are in order to get the check. Truly an awful experience. I honestly think it was all because of our awful waitress who if I ever come back I will request to not have her."
    },
    {
        "id": 24,
        "text": "A great assortment of breakfast options at good prices with good service. Their side orders of bacon are generous and it's my favorite place to unwind the morning after a long night. \n\nI will certainly return. I don't mind the wait one bit."
    },
    {
        "id": 25,
        "text": "Not very interesting or good. Everything we had ranged from disappointing to just okay."
    },
    {
        "id": 26,
        "text": "Food was great. Staff friendly. Parking is a lil difficult due to the high traffic area but overall great experience and i will be back!"
    },
    {
        "id": 27,
        "text": "I went here for breakfast and I was pleasantly surprise. The food was good I had the chicken and waffles. At first t thought the chicken were pieces like wings, legs or thighs but it actually was tenders. They were well seasoned and had a great crunch. I replaced the waffles with French toast, and a side of cheese grits."
    },
    {
        "id": 28,
        "text": "Food is great and inexpensive!! The service is slow and minimal, so when you need something ask all at once because you will wait forever!!"
    },
    {
        "id": 29,
        "text": "The service was lousy and the food made me violently  ill for the remainder of the day.  My experience was nothing like everyone else's, I wouldn't recommend this place to anyone."
    },
    {
        "id": 30,
        "text": "Omgosh! Very friendly, very clean! Food is . I will be a regular! My wife loved the grilled Tilapia! I am very.....VERY picky when it comes to diners. The bright atmosphere, and friendly staff makes the food taste even better. Treat Yourself!"
    },
    {
        "id": 31,
        "text": "Review base on customer service only. \nWe arrived about 30 mins before closing. There was a few workers towards kitchen area that look at us when we arrived. Stood there for about 10 mins with no greeting. Finally a young lady said we close at 3, you can come have a seat but have to be out by 3. We looked at the time.. 20 mins til close. Why not just tell us from the beginning that they closing soon and we would of left. I understand that it was a nice Friday afternoon and you want to go home ontime but why the attitude? We didn't know. Would of love to try their chicken and waffles but we will never know now."
    },
    {
        "id": 32,
        "text": "Came in today because I found it on yelp and boy were the reviews accurate! This place is a hidden gem! I will start by saying that I don't like home fries or hash browns at all and these home fries were BOMB like amazing!!!! I had already agreed to give them to my sister and I was sad I couldn't eat more but now I know for next time. The eggs and French toast and bacon were also very good. Their homemade lemonade is delicious and perfect for a warm day. Our server was Kim and she made great recommendations and was very kind and polite. We will absolutely ask for her next time we are in the area. Definitely try this place you will not be disappointed. The wait wasn't too long either about 15 minutes and well worth it."
    },
    {
        "id": 33,
        "text": "Never disappointed!! I love the service! My favorite dish from them is the chicken & waffles!"
    },
    {
        "id": 34,
        "text": "Inexpensive food. Pretty good. Line is usually out the door. I really don't have anything negative to say about the place except it should be a tad bigger to accommodate its audience but other than that it's cool."
    },
    {
        "id": 35,
        "text": "Pleasantly surprised with this place. I went based on the good reviews and it was worth it. I had the veggie home fries and turkey bacon. Those home fries are the truth! The place was clean,the staff was friendly and this will now be my new breakfast spot."
    },
    {
        "id": 36,
        "text": "Closest thing to good, solid diner food in philly. Usually a long wait on the weekends though for brunch. Big portions as well."
    },
    {
        "id": 37,
        "text": "I wish I could give this establishment 0 stars but I gave 1 because the food is pretty good but the service sucks..we waited for an hour to be seated as we stared at 4 empty tables that needed to be cleaned ..as I approached the one I assume is the owner who doubles as a cashier to ask can someone clear the tables she scoffed \"we only have 3 waitresses\" (befuddled look) I said no I mean the busboy .. she then again scoffs \"we don't have a busboy\" so as I shake my head and retreat back to my position in line a couple that was waiting for their takeout order approached me and said \"if I were you I would leave because as soon as you walked away the Owner and the waitress with the shaved head said \"if he don't want to wait he can go somewhere else and eat\" so the couple cancelled their order and walked out..apparently they want to save money by not having a busboy and rather compromise providing quality service by having you wait for the waitress to take orders..retrieve food..and buss tables..needless to say I will not be returning!....P.S I was going to refrain from grossing people out by sharing that I immediately had diarrhea after eating (figured it could've came from anything) until I read a review of another dissatisfied customer who had the same issue.. so you better not complain or you may have something done to your food too"
    },
    {
        "id": 38,
        "text": "Chicken and waffles!\n\nI've been to Cedar Park Cafe twice for breakfast and have had a great experience both times. Their prices are right and the food is amazing. There is free parking around the park and service is good and quick. 100% recommended"
    },
    {
        "id": 39,
        "text": "This place has become one of my favorite breakfast spots. The food comes out quickly-as fast a you could expect from a breakfast joint."
    },
    {
        "id": 40,
        "text": "Dont come too hungry there is a crazyy wait. Literally just beat the breakfast crowd. The waitress and staff was kind but the wait for food was upwards to 30+ minutes. Nonetheless the food was really good considering how inexpensive it was. I had the chicken and waffles, a ton of food. The chicken breast im not sure how was incredibly moist. Would definitely go back but as early as possible."
    },
    {
        "id": 41,
        "text": "It is a solid, cheap breakfast joint that has the best assortment of diners I have ever seen. I love the #8 with beef bacon, homefries, and eggs over medium and my boyfriend loves the chicken and waffles. Sometimes we go other places for a fancier brunch experience but most of the time we regret it and wish we had been there."
    },
    {
        "id": 42,
        "text": "First off- they have turkey scrapple...I didn't know that even existed and it was awesome. \n\nThe place is really clean and the staff are very nice. I had a chicken sandwich and it was really juicy and flavorful. I had hashbrowns instead of fries and that was a great decision. They were crispy with onions and peppers, the way they should be at a good diner. My boyfriend had the Western omelet and based on the clean plate, I'm thinking he liked it. \n\nI wish this was a little closer to walk to from work, but I'll take a ride over here whenever I have my car."
    },
    {
        "id": 43,
        "text": "Great simple breakfast place - really good value and friendly service!  I'm really happy to find a place like this in the neighborhood - no overpriced hipster food here!"
    },
    {
        "id": 44,
        "text": "A friend and I tried the Diner based on Yelp reviews.  I can say, coffee-holic that he is, his cup of coffee was never empty!  I was impressed with my Tilapia platter (with scrambled eggs and their veggie homefries - didn't know what veggie homefries were but now I'm a fan!).  The servers were all great and very attentive.  The customers that came and went ranged from college students, to families, to buddies getting together to Philly's finest.  A great dining experience and very reasonably priced."
    },
    {
        "id": 45,
        "text": "I love this place! It has perfect diner food. I had bacon, egg and cheese on an everything bagel and it was exactly what I wanted. The prices are super affordable and the service is fast, exactly what you would want from a diner. I'll definitely be back here again for breakfast."
    },
    {
        "id": 46,
        "text": "I can't get enough of this place. Veggie home fries are a great option for those of us who do not eat meat. Don't skip the grits or Belgian waffle which are hid in the side items menu. \n\nPlan on a longer wait time for peak brunch hours on Sunday. Worth the wait of course. Take out is also a great option."
    },
    {
        "id": 47,
        "text": "this was amazing, i recommend the veggie potatoes!! the wait was a little tedious but definitely worth it!"
    },
    {
        "id": 48,
        "text": "Food was fast, hot pretty good. Need to stop having people standing outside the door pan handling and hassling customers on their way in. Other than that pretty good experience."
    },
    {
        "id": 49,
        "text": "For such a popular eatery they really don't value their customers. While long lines may be great publicity for the newest club, not so much with a diner. Especially,  as you watch tables emptying and not being cleaned off, as you are outside freezing. Why are there only two waitresses on President's Day? Why are they bussing tables and taking orders? I'd be willing to give them a pass but this also happened last Sunday.  Yes, there were more wait staff, but no bus person cleaning- clearing tables and getting folks seated. Perhaps competition is the answer or how about just getting a bus person and showing your customers the respect they deserve! !!\nYou only get three stars because I've been sitting here for ten minutes and I don't have any coffee."
    },
    {
        "id": 50,
        "text": "Loved it!! Last minute search on yelp that immediately became my Togo breakfast spot. Me, my bf and another couple ordered different dishes. I got the homefries, eggs, bacon n french toast. It was soooo good! Bacon wasn't dripping in oil n french toast was far from soggy. My bf ordered something that included sausage and pancakes n it was absolutely delicious. The other couple ordered chicken and waffles and a breakfast platter with grits. I don't even eat grits but the way she demolished them it was something I'm willing to try but only from cedar park. \n\nThe waitress was so lovely. I don't know if this place was truly byob....but they were very :) accommodating.\n\nMy one reason for not handing them 5 stars...the wait.  Instead of seating by party size..they seat first come first serve so.. 2 people at 4 person table while a party of 4 waits...yea not so cool."
    },
    {
        "id": 51,
        "text": "Portions are large. To go platters are arranged well. They have a variety of hash browns. Limited street parking availability."
    },
    {
        "id": 52,
        "text": "This restaurant is really fun. It's new in the neighborhood and was very busy when I went in-- mostly young families and police officers. Seems like people were lacking delicious and affordable breakfast options. (people from BOTH parts of West Philly, if you catch my drift!) \n\nThe breakfast basics are definitely there. The owners are nice. and the best part was that their waitstaff was hired from the neighborhood!\n\nGo West Philly small business!"
    },
    {
        "id": 53,
        "text": "This is a cool and casual brunch spot! The food was delicious, inexpensive, and came out quickly. The servers were friendly and the eating area is clean. There is a bit of a wait to be seated because this cafe is popular in the area, but it's worth it! I wouldn't recommend bringing a party larger than 4-6 people though. It's a great spot to grab brunch with friends and/or family."
    },
    {
        "id": 54,
        "text": "When we eat at Cedar Park I know that yes, it's the best breakfast in West Philly and yes, the hash browns are better than in Chicago and yes, I'm right here, but I miss you already."
    },
    {
        "id": 55,
        "text": "Very nice breakfast and Lunch spot. Get there early, cuz they have an emense neighborhood following. Small Menu but everything is qaulity.  Chicken and Waffles and the veggie homie fries are exceptionally delicious.  There is also a very nice little Garden right next door. Definitely my goto spot for a nice quick sit down meal for breakfast."
    },
    {
        "id": 56,
        "text": "Finally, someone opened a new place that folks can afford: a real diner that has veg options! Food isn't that great or anything, but it's food."
    },
    {
        "id": 57,
        "text": "I'm not sure how this place would stack up in another neighborhood w/ more competition, but for the location--long lacking for a decent breakfast place-- it rocks. Plus, it's pretty new--while there may be kinks to work out, my experience left me confident that  the owners are on top of it and that it will just get better over time.\n\nThe breakfast is quality, esp. for the price.. My husband, who worked his way through college working at a Denny's, was a bit bothered by the waitress offering cheese for his scrambled eggs  and peppers+onions for our home fries without mentioning it would cost more (apparently a time-honored way to jack up the bill and thus tip?). I didn't get that vibe--I think she was just trying to be helpful--just noting and logging it.\n\nService was quick and gracious. Food was great. I only skimmed the lunch menu, but it looked enticing.\n\nSo glad to finally have a breakfast option nearby...as a previous Yelper said, welcome to our neighborhood!"
    },
    {
        "id": 58,
        "text": "If you're looking for classic breakfast food that is soul lifting, this is the place. Super busy during the weekends so go early or calla head."
    },
    {
        "id": 59,
        "text": "Very, very good vegetarian food for a diner. Home fries with veggies are entirely  worth the $1.50 upcharge - broccoli, mushrooms, onions, pepper, and tomatoes in very large quantities. Yum! I also had a top-notch omelet, and great rye toast. Large but not stupidly huge quantities, which is always a plus for a diner IMO.\n\nGreat food, great price, really friendly staff, and I even liked the interior. We'll be back."
    },
    {
        "id": 60,
        "text": "Perfect family breakfast spot. Just good solid diner food without pretense or frivolity. One thing we weren't aware of was the line-wait for seating.  I think most people are accustomed to putting their name on a list and getting an estimated wait time. Here, you literally just stand in line until a table opens up. Not a big deal at all since the line moves quickly and it was nice outside today but I can see how it might be a turn off in bad weather. Hubby was a little underwhelmed by the preformed breaded chicken patties served with Chinese duck sauce and a waffle but we got a ton of food and coffee for about 20 bucks. Can't argue with that."
    },
    {
        "id": 61,
        "text": "Food: Timeless meal. They have everything from simple food (my personal favorites #1 or #9 -- if you really want food coma) to chicken and waffles to their signature sandwiches at the bottom of the menu; all their food is unfathomable. \n\nEnvironment: Usually I'm particular but because of the \"old-school West Philadelphia environment\" they steal the stage away with its appropriate location and \"local West Philly\" vibe.\n\nService: We happened to come with 6 people initially, then 2 more 15 min later, then 2 more another 10 min later. What happened? Despite us being a difficult group of people, they were very accommodating and still showed unconditional love towards us. Sundays are outrageously busy so don't expect to be served like a princess on these days.\n\nPrice: Unbeatable. Seriously for a number 1, a standard 2 eggs over medium, 4 slices of crispy bacon, 2 slices of rye bread, with a heaping side of home fries or grits with butter for $7 before tax/tip, is absolutely unheard of in the city."
    },
    {
        "id": 62,
        "text": "Food was really good for quick breakfast. The wait was rediculous for no reason! There were about five open tables that only needed to be bussed, yet everyone waited around. Finally I just said something because there were older people standing for too long. Good thing I said something  because who knows how long I would have stood there for! Food came out really fast too. Good prices. Give it a shot!"
    },
    {
        "id": 63,
        "text": "We decided to try Cedar park again and no surprise here: the food is still great."
    },
    {
        "id": 64,
        "text": "A great friend and I came by here earlier today(Saturday, January 27th) around 8 a.m. for breakfast. The place was quiet and not busy at all then. I was quickly seated and as soon as my friend arrived(I arrived about 10 mins before she did), we were greeted by our waitress with menus. She quickly took our drink orders and was able to answer any question we had about the drinks(I had a couple juice questions). Our coffees came out hot, fresh tasting and quickly(within 5-10 minutes). \n\nSomehow we were so enamored by our conversation that we didn't even think about ordering our food yet. Our waitress was very patient and pleasant even though we hadn't even looked at the food options yet.  We ordered our food the third time she came around and she was very helpful to us while we were putting together our orders and trying to figure out substitutions(we wanted some of everything so it was hard deciding what we wanted to settle for). Our food came out REALLY quickly. I would say in less than 15 minutes. The food was fresh tasting, hot and definitely off the grill/stove(versus microwaved as I've experienced at other places). This was my first time stopping by here and I'm happy to say the staff here and their food definitely left a great first impression on me. I look forward to visiting again soon."
    },
    {
        "id": 65,
        "text": "Luv the food.. Gives you alot of food...literally two people can eat off of one platter."
    },
    {
        "id": 66,
        "text": "Amazing food and impeccable service.   My boyfriend and I just finished having brunch there.  The waitress was attentive and courteous.  The food was prepared quickly and tasted great.   My boyfriend ordered waffles, steak omelet,\ngrits, and scrapple.   I ate eggs, corned beef hash, home fries, and rye toast.  The prices are affordable.  The cafe is clean and the location is great.   I would definitely recommend cedar park cafe to anyone who wants to eat delicious breakfast food."
    },
    {
        "id": 67,
        "text": "Love this place for breakfast. Me and my girlfriend come here often. The only knock on the place is that we wish it was bigger. There's always a line. The food is always good and they make almost any substitution to meals. The staff is always so nice. If you're in the area you should really stop by here for breakfast."
    },
    {
        "id": 68,
        "text": "Quick service, friendly wait staff, bright cheery and clean. Food was reasonably good. Real plates and flatware. Nice addition to the Baltimore Ave. corridor. My only complaint was the seating is more suited to fast food type restaurant. Will go again!"
    },
    {
        "id": 69,
        "text": "Very good coffee shop ... a real asset to the neighborhood!\n\nFood is prepared expertly and delivered hot to your table by friendly staff. Omelets are terrific, I had a \"California\" vegetarian omelet and it reminded me of something you would get in an overpriced chic bistro in Center City. My favorite is their Nova Lox platter on a fresh bagel - as good as any you would get in a NYC deli - with red onion, capers, lettuce, tomato, etc. \n\nThe place is spotlessly clean, attractive, and not overly decorated.\n\nBreakfast and lunch only."
    },
    {
        "id": 70,
        "text": "Best Chicken and Waffles to date and you can't beat the prices. The service and seating speed is the only reason this isn't 5 stars. The Staff are friendly, the food is excellent, but can we get a host/hostess?"
    },
    {
        "id": 71,
        "text": "My very favorite place to go for brunch. Affordable and delicious with yummy portions. I always get the veggie homefries (sometimes with avocado added) and a side of French toast. The French toast is buttery and amazing. The waitresses have always been friendly to me. Love getting carry out from here, too!"
    },
    {
        "id": 72,
        "text": "Recently moved to West Philly and looking to explore places in my neighborhood. This spot was the first place that popped up when I was looking for a brunch spot. The place was packed but we were seated quickly. Ordered scrambled eggs, sausage, home fries and French toast. The food was nicely portioned , definitely will fill you up! Good food. Fast service. No complaints! Would go here again."
    },
    {
        "id": 73,
        "text": "Great breakfast/brunch spot in West Philly. It's a no frills, no nonsense diner that offers your typical diner options for both breakfast and lunch. I opted for the fried chicken and waffles and was pleasantly surprised. The chicken has a little heat, and the waffles and syrup provide some sweetness and body to balance it all out. Also, the chicken was very moist and tender and the portion was okay even for a large appetite like mine. \n\nBe prepared to wait, and if you come with a large party, you may need to break up into a few tables unless you're fortunate enough to nab some neighboring tables in the center of the room. \n\nFamily friendly environment that ensures we will be coming back for a while looking forward (as long as there are no more fire mishaps)!!!"
    },
    {
        "id": 74,
        "text": "In terms of service, our waitress was very friendly and helpful. Although we waited for 10 minutes just to get a menu and another 15 to get some water, our food comes out really quickly once the orders went in. So I rate service as average.\n\nThe food was not bad. I had the fried chicken and waffle, which everyone assured me was the best I could order from Cedar Park Cafe. I also got a side of home fries. The fried chicken was well seasoned, breaded white meat (breast, I think). The crunch was good, but overall I prefer Federal Donuts' chicken. The waffle was good, but again, it's hard to mess up waffle, especially when you drown it in butter. The home fries also adequate, but I've had much better at brunch places of the same reputation.\n\nI'm vaguely disappointed in general but perhaps my expectations were too high. Ultimately, I've had better brunch at places with less hype."
    },
    {
        "id": 75,
        "text": "We came here for lunch and the food was delicious!  I had a grilled chicken salad.  Most restaurants don't give you enough chicken.  This restaurant not only gives you a lot of chicken but it's marinated with curry spices.  The veggies are also fresh.  My daughter had the cheeseburger.  She ate the whole burger.  It was really good!"
    },
    {
        "id": 76,
        "text": "Solid neighborhood diner in West Philly.  Chicken and waffles is very good, other dishes are good but not spectacular, this is a diner after all.  For a diner though the portions are large, prices are good and there are no sticky booths.  Thus the 4 stars.  \n\nBe warned though that since it is a neighborhood diner, if you go at the wrong time you may end up waiting almost 30 minutes to get seated.\n\nIf you are in the area and want diner food I would not hesitate to recommend coming here to grab a bite."
    },
    {
        "id": 77,
        "text": "This is all you need to know about this place: whenever we visit a city we like to find a new local restaurant to eat at for breakfast.  We went back twice for breakfast. It's. That. Good.\n\nThe Chicken and Waffles are life-changing.\n\nThey open early, so get there before the rest of West Philly wakes up!"
    },
    {
        "id": 78,
        "text": "This is a great place to grab breakfast! I've been pretty hooked on the western 3 egg omelette and hashbrowns! \n\nIf you plan to pay with a card there is a $10 minimum."
    },
    {
        "id": 79,
        "text": "My son and his wife took us to Cedar Park on Saturday for brunch.  Our waitress, \"J\" was extremely warm and friendly.  Her menu suggestions were spot-on and everyone at our table enjoyed their meal.  We will be sure to come back here again when visiting."
    },
    {
        "id": 80,
        "text": "It's not Honey's, but I'm ok with that. My wife housed her yummy pancakes. I had the two eggs with french toast, and home fries with green peppers and onions. Nothing fancy. \n\nYou won't find the artisan, craft, fusion dining here --- or whatever trendy/hipster moniker you can dig up. Sometimes a simple place to eat with good, friendly, prompt service, is all one needs. \n\nSince it's in our neighborhood, we'll be coming here more often."
    },
    {
        "id": 81,
        "text": "This is a great cafe in a good location. Limited hours makes it busy for breakfast and lunch especially during weekend and holidays. Menu is good as they also offer vegan options and we've never had a bad meal.  The Downside is the everything else.  You wait in line and get seated in the order you arrive so keep in mind that you'll be outside on hot or cold days. Unfortunately, the service is not organized properly and if you want coffee, ask for pot, water ask for the jug because the last three times I had to get up and practically get it myself. Its a wait for service to take your order, and to bring your drinks, then other than typical wait for food to come out they are like ghosts. People will sit before you do, order after you do and in some occassions get their food before you. I always get up to pay at the register (and sometimes to find my check) to save time and hope another person doesn't wait too long for the table to get cleaned, which yes you will watch dirty tables and get the urge to just clear it off yourself just so you can sit down."
    },
    {
        "id": 82,
        "text": "I'm going to just repeat the other reviews by saying the chicken and waffles here are BOMB. But it's necessary because you need to see this and go get it! \n\nWe went on a busy weekend and the line was out the door, but we saw the reviews and wanted to pull through. Nothing in the area sounded as promising. So after finally being seated, we were greeted by a friendly waitress who was quick yet attentive. \n\nThe fried chicken comes out hot and crispy. You can tell it was freshly fried, the meat is tender and well seasoned, and the crust on it is unparalleled. It's paired perfectly with a sweet chili sauce. And of course you have the waffle which is not too soft, the right amount of bite and a side of syrup. Together, with the chicken and the waffle and the syrup or the chili sauce, it's just a pair meant to be. \n\nNow go get you some!"
    },
    {
        "id": 83,
        "text": "The food was simply delicious and service was out of this world. The owners were Korean and were so welcoming to me and my parents - she even gave us a complimentary bowl of fruit at the end of our meal! They are also very accommodating to your food preferences. My mom and I can't eat foods with too much fat/oil so they offered to leave out the salt and seasoning on my mom's home fries and then let me replace my home fries with a side of pancake instead! I ordered the salmon steak, my parents both got omelets and everyone was VERY happy with our meal :) this is definitely one of those places I will be going back to, and next time I'm bringing everyone I know!!!"
    },
    {
        "id": 84,
        "text": "Very nice brunch at a reasonable price! I was visiting Philly for the weekend and we decided to stop be for brunch! I had the very popular, chicken and waffles, which was a wonderful choice! Fried boneless chicken served with sweet chili sauce! Waffle was also fluffy and served with syrup! I also recommend ordering their coffee! Would visit again!"
    },
    {
        "id": 85,
        "text": "Great spot for breakfast in West Philly.  Eggs ordered \"over easy\" came \"over easy\".  That doesn't happen very often anywhere I've ever been to.  Four pieces of bacon with \"home-fries\".  They even ask if you want the bell peppers and onions when you order.  Good tasting coffee.  Good service.  \n\nReasonably priced, I didn't look closely at the menu, so when the bill came, I think the toast and coffee are added to the dish as extras.  I'll double check next time and there will be a next time, maybe even tomorrow, it was that good."
    },
    {
        "id": 86,
        "text": "The service was impeccable!  We did not have to wait long for our food to arrive. It was hot and flavorful. When you go, order the chicken and waffles. Be sure to use the pepper jelly that comes with the meal. The home-fries are also tasty. Especially when you order it with peppers and onions. I will definitely come back again."
    },
    {
        "id": 87,
        "text": "This is my suggestion for anyone who finds themselves in west philly and is looking for a delicious, inexpensive brunch. Located on the very wester edge of University City, Cedar Park Cafe, offers a variety of breakfast and lunch foods at very affordable prices. The veggie home fries are a must try! if you're more interested in a lunch-style dish, I highly recommend the BLT with the house made fries. The fries are seasoned perfectly! If you're planning on going on the weekend, be prepared to wait in line. The wait time varies, as it's mostly based on the weather. If it's a really nice morning, it isn't uncommon to see a line out the door and looping around the front of the building. The food is definitely worth the wait. Be advised, this is a breakfast/brunch restaurant, so they close each day at 3pm."
    },
    {
        "id": 88,
        "text": "The food is ok the service is good . However my recent visit was a bit disappointing and disturbing due to a bug problem (roaches) in which when the owner was informed had a bit of a passive attitude. When the owner was informed she sent employee out to where we were seated to kill the bug discreetly , almost immediately after that bug was disposed of, another bug was spotted. I would not recommend to anyone to eat here"
    },
    {
        "id": 89,
        "text": "Came again for brunch - this time with a huge group of friends, about 16 of us. They were really friendly and accommodating, didn't make us wait too long, and gave us all individual numbers so that we could pay separately at the end! Such efficient service AND the food was delicious with overwhelming portions...\n\nI got a salmon steak that comes with scrambled eggs and replaced the homefries/grits with a hotcake. My total came out to be $10.75 - very reasonable especially considering I'm so full to the point of contemplating skipping dinner."
    },
    {
        "id": 90,
        "text": "This place is simple and to the point. The service is fast and friendly. The food is delicious and inexpensive. I love eating here. It is a staple of the neighborhood."
    },
    {
        "id": 91,
        "text": "This review is not for the food (which really wasn't all that great anyway), this is for our server. My girlfriend and I tried this place for the first time today. We went because it always seemed to have a line out the door. When we arrived, we sat down immediately and received menus from a hostess. No one else came to the table for at least another 20 minutes. Our server arrived (finally), and took our drink orders. She didn't return with our drinks (just two cups of coffee and a glass of water) for about ten minutes. She didn't ask if we were ready to order, which was really strange. We waited another ten minutes for her to come back and ask for our order, and she didn't even know the menu. Okay, she may be new, but having my menu taken away so she could read it herself was unpleasant and, frankly, rude. After she took our order, we waited and waited for what felt like forever. We watched other patrons enter and leave with full before we received our food. I even had to chase her down for coffee refills! She was lazy, inattentive, slow, and unpleasant. I really hate leaving lousy tips, but this server didn't get a dime from me. If you get lucky enough to end up with the right server, you'll have a MUCH better experience than we did, guaranteed."
    },
    {
        "id": 92,
        "text": "The food was good...period.\n\nI had a veggie omelette and homefries.  It was crowded, so we sat at the bar.  Waitress (short, hispanic...I wish I remembered her name) was nice and attentive.  My sister had sausage eggs and pancakes.  She couldn't finish everything, but it was good."
    },
    {
        "id": 93,
        "text": "Well, first things first, they have no system for seating people when you enter. We had a larger group and the only place to sit was the \"middle\" row. I had to proactively ask what to do because nobody helped us until I walked to the register. We even called ahead to see if there'd be a wait time and the woman said no, yet we probably waited at least 20-30 minutes. \n\nMy husband ordered an iced tea, it said \"homemade\" but we were seated next to the drinks fountain. They had what looked like iced tea, lemonade, and something red in old plastic bottles of Log Cabin syrup. Yes, you heard that correctly. Who knows how old those bottles are, and the tea was undrinkable. It was diabetes in a cup with how sweet it was, even when we tried to dilute it with water it was a lost cause. \n\nThe food was eh, we finished it mostly because we were so hungry. The service was sub-par, my glass of water was never refilled. I also thought it was funny that their syrup bottles were IHOP. \n\nThere must be better breakfast joints in Philly... I probably wouldn't go back here."
    },
    {
        "id": 94,
        "text": "This is the best breakfast spot in the neighborhood (West Philly)! The quantity is great and the quality of food is excellent. The restaurant itself is very very clean. And to top it off, the servers there are attentive and super nice."
    },
    {
        "id": 95,
        "text": "I wish I could remember the name of our server. Before I get to anything related, I have to say how positively she impacted our stop at Cedar Park. She was friendly, fun, helpful, and patient. Any customer service provider who can put up with my friends and I at our hungriest gets an out the gate 5 stars. \n\nThe space is limited so the chance of a line is pretty high. We were seated surprisingly quickly. Once we got to the menu, everyone was shocked and amazed by the variety of options. Looking at this small, familial establishment, you would expect a \"get what we give you\" attitude but that is far from the case here. Once you decide what you want, there might be other options that you didn't know about. Cedar Park clearly thinks about its customers on a regular basis. It's definitely a 'Have it your way ' establishment. \n\nOur food came out quickly. Along with it was the most addictive sweet tea ever. It. Was. Gooood! To say that the food was plentiful would be doing it a disservice. The price was right and the portions were plentiful. I can't wait to get back!!!"
    },
    {
        "id": 96,
        "text": "The chicken and waffles were really good. Not a fan of the veggie fries. We had to wait in line for a bit but I think it was because we went after church on a Sunday. Staff was very pleasant and attentive to our needs. We definitely recommend if ever in the Philly area."
    },
    {
        "id": 97,
        "text": "I feel like this place never disappoints. No matter what I order, the service is great,  food is hearty and price is cheap. How can you beat that combo?"
    },
    {
        "id": 98,
        "text": "It's been a few years since my last review and I have not been back since this place burnt to the crisp and re-built in 2013 and re-opened. Nothing has changed. Still good food, friendly staff, speedy and good prices. Glad to be back in this neighborhood near one of my fave breakfast, and now I can say lunch, spots. The day I visited last week, I came for lunch. I had the Seitan Cheese steak. Also Diet Coke. You get free refills which is nice. The restaurant is very clean, like before. Glad they were able to re-build and that they still have a good business going...."
    },
    {
        "id": 99,
        "text": "3.5 stars\n\nI think of this place as the neighborhood IHOP, but with cleaner interior and friendlier staff, as well as more affordable prices.\n\nMy bf and I ordered two orders of #1 which is two eggs any style, 2 slices of toast, home fries and choice of meat (BACON of course) + I ordered a cup of coffee all for $15.17 before tip.\n\nThe food was very standard. Easy, breakfast food. My eggs were cooked as they should be, I ordered them over easy and they were perfectly done so. The bacon was crispy, good. Coffee was good. But the hash browns, I have a suggestion of seasoning them a bit better. I didn't say anything, but my boyfriend brought up the same point. But it's alright, since there's salt and pepper at the table for us to season to our liking.\n\nOverall, a good neighborhood breakfast stop with extremely affordable prices and good portions. You can't compare this to Sabrinas, Green Eggs or anything like that. That's not what this is, or what they try to claim to be. They're just a simple diner, but they do it alright :)"
    },
    {
        "id": 100,
        "text": "Honestly, I'm kind of obsessed with any place that serves chicken and waffles because it's one of my favorite brunch foods, but this place seriously knew how to do it right. So, I know that the Yelp page for Cedar Park Cafe is way oversaturated with the same picture of their standard chicken and waffles, but I still felt compelled to add the image of my personal plate, simply because it was absolutely scrumptious!\n\nI actually feel really late to the game in visiting this place, because apparently it's a well-known West Philly gem that I hadn't known about before. Anyways, I'm glad to have finally tried it out because it really was as good as everyone had said. \n\nI came with a group of 7 on Sunday afternoon, so we were a bit nervous about getting seated (apparently the lines go out the door on weekends), but fortunately we must have timed it right because there weren't any lines. We still had to wait a while because we had a larger group, but we weren't in a rush so it didn't hamper the experience. In general, the service was excellent and friendly, the ambiance was a simple no-frills type of pleasant, and everything on the menu was very reasonably priced and looked great. Even though I've only had the chicken and waffles so far, one of the guys from our group who was a true veteran to this place affirmed that everything on the menu was, in fact, delicious. \n\nIt's also located just a few blocks away from my church (one of my most favorite places in the world), so I hope to frequent it more often! My only dilemma will be whether I will try out some of the other tasty looking items on their menu or continue to treat myself to their tried-and-true excellent chicken and waffles."
    },
    {
        "id": 101,
        "text": "I'm glad this place exist. Good food, good prices fast service. I don't really need to pay 20 dollars for a good breakfast. You won't regret it. Benedictine eggs are really great, a bit more expensive (8.95), but quite cheaper that any \"fancy\" brunch place."
    },
    {
        "id": 102,
        "text": "Inexpensive, fast, and delicious. Grits, home fries, pancakes, eggs Benedict, all worth trying . Gets really busy on the weekends, but the line usually moves quickly."
    },
    {
        "id": 103,
        "text": "Favorite brunch place ever. Very inexpensive, great quality, fast service. I almost always have to wait in line to get in, but it's so worth the wait! I've never had a bad meal here. I have nothing but good things to say about it. My favorite meal is the Eggs Benedict. The coffee is also good. My boyfriend loves the chicken and waffle or the breakfast wraps. 10/10!"
    },
    {
        "id": 104,
        "text": "Who doesn't love brunch?? I'm pretty disappointed in myself for not visiting this place any sooner since it's so close to home. My sister and I decided to try the chicken and waffles, and the #6 (I believe) breakfast platter that had came with eggs, pancakes, home fries and a choice of protein. The chicken from my dish was a bit on the dry side and the breading fell right off the chicken, but the waffle itself was yummy. My sister on the other hand, enjoyed everything except the soggy home fries. The potatoes weren't crispy at all and seemed a bit wet. Even with the slight problems with our meals, we would definitely visit again to try other dishes at Cedar Park Cafe."
    },
    {
        "id": 105,
        "text": "I've been to this breakfast spot a couple of times now and I've been dying to come back!  We arrived during the Saturday brunch rush, but didn't have to wait too long to be seated (10 minutes).  Once seated, I ordered an orange juice and #8 (2 hotcakes, eggs, turkey bacon, and home fries with the green peppers and onions).  EVERYTHING was delicious but my absolute favorite was the home fries.  They have a nice outer crisp with a softer filling combined with grilled onions and green peppers.  It's by choice to get the green peppers and onions so make sure to mention it when ordering if your waiter doesn't.  \n\nThe atmosphere is super chill and simple as is the service which is provided with good dose of friendly.  From past experiences, there have been moments that I've waited a while for the food to be served but it wasn't the case today.  Highly recommend this gem in West Philly for honest and homey breakfast food."
    },
    {
        "id": 106,
        "text": "This brunch place is close to my house so I visit here on Sundays. I tried several dishes on their menu so far and all of them are pretty good. Waiting could be long during weekend. Service is kind of slow. Normally need to wait 15 to 20 mins to get have your food served. All the omelets in the middle of their menu are pretty big in size, served with hash browns and stuffed with generous cheese and vegetables. The waffle and fried chicken is also classic and delicious. The fried chicken tastes sort of Asian-ish flavored with some secret MSG salt I guess ;)The meat is juicy inside and crunchy. Strongly Recommend it!"
    },
    {
        "id": 107,
        "text": "The service has declined a lot...it used to be okay....not anymore..."
    },
    {
        "id": 108,
        "text": "Service was ok. I probably stood in line for a good 5 minutes before they even acknowledged I was there. I would recommend their chicken and waffles. It was good and tasty and their dipping sauce for the chicken was on point."
    },
    {
        "id": 109,
        "text": "Delicious food, friendly service!  I had a cheesesteak that rocked, and my hubby had a HUGE omelette.  Next visit, chicken and waffles."
    },
    {
        "id": 110,
        "text": "This is in my neighbourhood and I've come here handful of times. Some times I get cravings for home fries and typical diner breakfast food. It's owned by Koreans so at first I wasn't too sure if they knew how to make good American style breakfasts (my doubts are from me being a Korean-American and mostly seeing Koreans owning dry cleaners, fruit stands, Stop and Go marts, and corner groceries). Rest assured, their breakfast selections are good and tastes delicious. I love their home fries, esp with peppers and onions. Their eggs are always done right too (fried, scrambled, or omelette). I also appreciate them having vegetarian and vegan options because it makes it easier coming here with vegetarian or vegan friends. Service is always great! Prompt, efficient, and friendly. The place is spacious, but they always have customers and I have not seen the place slow. Price is pretty good too, usually for breakfast food about $9 and they give you a lot! I don't feel like I need to go to S. Philly, NE Philly, or Germantown to go to some good diners. So glad Cedar Park Cafe is nearby. Parking can be a challenge (I usually walk there), but you will be able to find a parking within few blocks from the cafe."
    },
    {
        "id": 111,
        "text": "This place is a nice neighborhood diner. It's usually packed whenever we go so the atmosphere is always lively. I usually come with a small group of people on Sunday mornings and we usually get seated with 15 minutes or less. They are efficient while not being pushy despite having a full hous.\n\nThe food is good for the price. And they have a good variety with verrry generous portions. The chicken and waffle is decent which is one of my favorite breakfast items ever. I also like the corned beef hash and grits. The staff are also pretty accommodating and friendly. For the price I definitely give this place 5 stars."
    },
    {
        "id": 112,
        "text": "Food was average. Nothing special. The servers were all very friendly and nice. But the food service took forever. We came on a Saturday around 10am, so it was quite a crowd, but for the average food we got, we waited much too long. Bacon was cooked nicely. I ordered over easy eggs and got sunny side up. The French toast and pancakes were nothing to talk about."
    },
    {
        "id": 113,
        "text": "I was hoping for the experience that many Yelpers enjoyed but was sadly disappointed.\n\nOur waitress was miserable. She clearly didn't want us to be there. When our food arrived, we had to wait a few minutes for utensils. When we asked for asked for water the first time, we thought that once would be enough. Would I have liked a second cup of coffee? Our waitress will never know. \n\nThe food was \"meh\". I had the the grits, eggs and salmon platter. The salmon was fried until the flavor was gone leaving only a dry brick in its place. The grits were blessed with a giant glob of butter.\n\nThe Mrs ordered an omelet but made the mistake of assuming all of the ingredients she requested - crazy stuff like cheese - would be included. I guess the chef gets to pick the ones he/she feels like including.\n\nNo plans to return."
    },
    {
        "id": 114,
        "text": "Yes. Yes. Yes. Yesssssss\n\nWhat can I say? When I walked in I immediately was like \"meh, I'm not going to like this as a breakfast/brunch place.\" Boy was I so wrong. \n\nFirst the food is literally 5 stars. I'd sworn off chicken and waffles after being disappointed by lack of flavor in the chicken but this place restored my belief! The chicken was perfectly seasoned n very crispy- to perfection. The waffles were fluffy n the butter was the icing on the cake. \n\nThe BLT- usually I abstain from buying BLTs in public bc I mean, come on u can make that ish at home. But this one was worth it- idk what it was but It was crazy good- I'm sure there was a special sauce or mayo on it. Whatever it was, I'll def get it again. \n\nEven the basic breakfast platters are exceptional. It comes with two eggs (obviously I got over easy) and hash browns but the hash browns are HUGE, filled with onions and bell peppers, and perfectly crispy.  Honestly, aside from the eggs, the hashbrowns stole the show. I got my platter with the salmon steak- which was admittedly \"just ok\" at best but dipped in the egg yolk it worked just fine. \n\nFinally atmosphere - yes today is a cold dreary day but this place is perfectly quaint and calm. The staff are friendly, and the service is respectful and not overbearing. Perfect for anytime of day."
    },
    {
        "id": 115,
        "text": "Clean, delicious and affordable. I do work in the area so its always feels like you have the best news in town when you find a restuarant that exceeds your expectations. While the decor is very minimal the staff is colorful, friendly and timely.  I have visited at least three times since my first visit and coworkers have followed. The one dish that I seem to gravitate to is the Veggie Home Fries. Who would of thought of adding veggies to home fries? So glad that Cedar Park Cafe thinks outside the box. I am not afraid to putt ketchup on my broccoli with this mixture. Anyway maybe one day I will move on to something else on the menu. For now though I recomment the Veggie Home Fries and to check out this lil diamond. There is plenty of seating and kid friendly. Bon Apetite.."
    },
    {
        "id": 116,
        "text": "We have been customer at Cedar Park Cafe 3 years now and most of the times we had good experience, but the last two times were not pleasant. The first one two weeks ago when we got inside we sat at a table which was almost clean. They told us the table was dirty and we need to move to different table. The waitres did not even look in our eyes and did not try to finish cleaning up the table. The second time was yesterday April 20th. After we ordered the food, we saw tons of ants moving around the wall and on our table, later on the ants came to our food."
    },
    {
        "id": 117,
        "text": "Get there early!!! Everybody wants some. Vegetarian options are pretty good. The chicken cheesesteak is yummy. The price is pretty reasonable too. It's nice to have a decent diner in the neighborhood."
    },
    {
        "id": 118,
        "text": "You come here for cheapness and simple cravings.  The food here comes in big portions, cheap prices, and a family friendly environment.  It's like diner food, but the taste isn't as good as Grandma's special recipe good.  Yet, it's definitely something that'll please you knowing you had a good meal at the expense of less than $10."
    },
    {
        "id": 119,
        "text": "Dankwiches are so amazing! Great spot in West Philly with great service. Can't wait to come back."
    },
    {
        "id": 120,
        "text": "Excellent service from the staff as usual. As concerning the food, it's still great and the price is right for our budget."
    },
    {
        "id": 121,
        "text": "This is a wonderful place to grab brunch. They have a great number of options of both sweet and savory dishes. All the omelets are huge. Ask them to add avocado if you're a fan to your omelets! The hotcakes topped with walnuts were excellent and generous in size. Other good dishes here are the chicken and waffles as well as the French toast."
    },
    {
        "id": 122,
        "text": "This place is absolutely amazing. The turkey bacon has an amazing smokey flavor. \n\nWe also had the chicken and waffles. The waffles are flavorful and light and the chicken has a nice sweet and spicy characteristic. \n\nOur table also took on a veggie omelet with homefries. Everything we had was a hit."
    },
    {
        "id": 123,
        "text": "every time i've walked past cedar park cafe there's always been a wait, and let me tell you, it is worth every minute! good old fashioned breakfast/brunch food with no frills and an affordable price tag. i would suggest an omelette or the chicken and waffles, but you really cant go wrong here. classic, reliable and always delicious!"
    },
    {
        "id": 124,
        "text": "Delicious food. Fast and friendly service. Blueberry pancakes people. That is all. I would absolutely go here again. It was just a little walk from where I was staying. Just excellent breakfast food. Nothing fancy but definitely delicious"
    },
    {
        "id": 125,
        "text": "Had waffles, eggs, and bacon May2015. Large portions, small taste. Good if you're very hungry, but not as satisfying for those who want big flavor. Prices are very reasonable. I'd say better than average because the restaurant was clean and service was reasonable."
    },
    {
        "id": 126,
        "text": "Friendly service. Good waffles. Chicken has cornflake breading my husband didn't care for it but I liked it, different."
    },
    {
        "id": 127,
        "text": "First time here today, food was excellent. I had the #8 with scrambled eggs, bacon, home fries, and French toast. All was excellent. Boyfriend had the chicken and waffles which was amazing. Service was a little slow but they were busy, but our server was friendly. Only reason for not giving a full five stars is that there's not much room to wait. It's first come, first serve... Just wait in line."
    },
    {
        "id": 128,
        "text": "I love this place!  I love that the staff are so ridiculously friendly that even if they screw something up it's impossible to be annoyed.   I love the subtle upsell when you order homefries and they say \"would you like peppers and onions in those too?\"  or \"want cheese on your eggs\"...these girls are good.  I love how Baltimore Ave is lined with police cars b/c they're all inside eating.  I love how cheap it is for two people to eat breakfast.  I love how they warn you that the sausage is pork (AND you can get links or patties).   I love how ALL of West Philly eats here as neighbors and friends.  \n\nI'm giving 5-stars for what this place is -- a VERY decent neighborhood diner that serves up a filling cheap breakfast and in relation to other breakfast/lunch serving cafes (including others right up the street) it's great !  It's not 5-star in comparison to someplace like Lacroix, that would be an apples/oranges sort've thing..."
    },
    {
        "id": 129,
        "text": "Cedar Park cafe is my \"go to\" spot.   I've tried almost everything on the menu,  it's all amazing.  The food is delicious and really affordable.    Whether you are in the mood for breakfast or lunch... this is the place to come to.   The service is always on point and the staff is friendly."
    },
    {
        "id": 130,
        "text": "My friend and I chose this place because we were scoping out the town before we checked into our AirBnB in Kingssessing (which never happened). \n\nAnyway, this breakfast spot is great for families, but it is very crowded and closes early. Their eggs Benedict and Homefries were delicious! \n\nThe price of my meal was so inexpensive for such a delicious breakfast option! \n\nI would recommend coming here if you're passing through :). \n\nAnd there's a vintage record shop right next door if you're into that :)."
    },
    {
        "id": 131,
        "text": "I was craving breakfast food and this place hit the spot! The food was AMAZING. I left stuffed, after having everything I wanted and then some. The service was great! Will definitely come again the next time I'm in Philly. Thank you!"
    },
    {
        "id": 132,
        "text": "Please don't come here if you hate places that serve the whole community.  Places that serve food cooked with love.  A place to catch up with an old friend and not feel rushed.  Please go somewhere else."
    },
    {
        "id": 133,
        "text": "This is a good breakfast spot, which is hard to find in this neighborhood.\n\nIt's heavy on the egg dishes. They do have pancakes, french toast, and waffles, but they are all listed as sides and require you to build your own plate when wanting one of them to be your main item. This is one of a few knocks, and the reason why I am not giving this 4 or 5 stars. \n\nAnother knock was with the waffle the only fruit they had was bananas. In fact, that's the only fruit they had if you wanted fruit. \n\nThe last knock is the servers seemed a bit harried and not the most attentive, some more so than others.\n\nKnocks aside, the food was real good and the price was good. I had cheese eggs, pancakes, sausage and potatoes. It all tasted great, but the potatoes with the add on of peppers and onions was truly awesome.\n\nMy wife got a waffle, bacon and potatoes. The waffle was great, and thankfully we had fresh strawberries and whipped cream at home.\n\nIf the servers lighten up and the menu expands to be more than an egg focused place, this spot can be great.\n\nAll that said, if you live in this area, you probably won't find much better for your breakfast needs."
    },
    {
        "id": 134,
        "text": "What  nice place to have just a couple blocks from home! This was definitely something the neighborhood was lacking, a breakfast/lunch joint. And what a relief this place delivers good food at great prices!\n\nThe service was friendly and the food is buttery goodness that gets your day started right. My go-to are the breakfast sandwiches with a side of home fries recently, but I'm sure I'll be trying out other menu selections. \n\nMy only gripe is the coffee, which sometimes has a sour taste which isn't so awesome.\n\nI'm sure I'll be a regular here, which may make my regular \"up-scale\" brunch choices a little upset. Sorry!"
    },
    {
        "id": 135,
        "text": "Oh how I wished I ordered the chicken and waffles, but my son did, so I got to try some.  Went with the family for breakfast on a Sunday morning.  This is a great spot to take kids, as there is a small park directly across the street for pre or post meal fun.  \n\nI ordered the eggs Benedict, tasty, but could have been hotter.  The rest of my crew ordered pancakes.  They were light and fluffy, and pretty tasty.  Let's get back to the chicken and waffles for a minute, Great dish.  Boneless, well seasoned, and fired perfectly, the chicken was accompanied with a tangy dippy sauce on the side.  Really good stuff.  \n\nChicken and Waffle eating instructions: Take a piece of this delicious crispy chicken, a piece of the buttery waffle, dip into sauce, stuff your face, smile.\n\nFast service, great prices, good for kids, and delicious food - everything I look for.  Should I be back in this part of Philly, I will definitely go again."
    },
    {
        "id": 136,
        "text": "This place is so awesome and as others have noted, exactly what our gentrifying neighborhood needed - cheap, fast, all american fare.  Also, super friendly and good for kids."
    },
    {
        "id": 137,
        "text": "Visited here today, a rainy Wednesday morning before thanksgiving. There were about 3 tables seated when I walked in. I was greeted and told I could sit wherever I'd like. The waitress was at my table shortly after. She was very kind and polite. I ordered a cup of coffee, a water, and the chicken and waffles. The waitress brewed a fresh pot of coffee which was nice.  I really enjoyed the chicken and waffles. It had a great outer coating of what seemed like corn flakes and spices, making it crispy on the outside and nice and juicy on the inside. The spices were very tasty in my opinion, however, if you are a person that cannot handle any spice, I would suggest you order something else (or perhaps they can leave the spices out). The waitress was kind and I never felt rushed. I was checked on throughout my meal, received a coffee refill when it was low, and my check was delivered in a timely manner. I enjoyed my visit here and will definitely be back."
    },
    {
        "id": 138,
        "text": "This completely unpretentious breakfast-all-day joint is clean and the service is friendly. We sat at a table (3 of us) but the counter looked perfect for another time if I come in there by myself. The non-breakfast fare seemed pretty unremarkable and actually unappetizing (just judging from the menu) so we went for breakfast (eggs, all three of us, in various forms) and that was the right decision. I had an egg-white omelette with provolone, grits, whole wheat toast. Excellent. The bill for the three of us came to $20. What a deal. I hope this place survives."
    },
    {
        "id": 139,
        "text": "What a gem. My girlfriend and I wish we would have found this place sooner than a few weeks before we move to New York. Anyhow, this place impressed us both. As soon as we walked through the door we were warmly greeted and picked a booth. Our waitress was Sanaya and she was very friendly and made sure we were happy. The food definitely hit the \"full breakfast\" spot we were craving. We both got eggs, bacon, orange juice, toast, home fries, and I got a side of sausage and a coffee. It came to roughly $18. That's it. The food came to us fresh, hot, and very quick and in both our opinions was better tasting than Midtown. Actually, we agreed everything was batter. The food, service, atmosphere, cleanliness, portions, and price. We'll definitely go back before we move."
    },
    {
        "id": 140,
        "text": "This place is the best. I'm so glad it reopened after renovations- when I saw it shuttered, I thought it might be gone for good. Thankfully, it's back and the place looks great. \n\nThe food is solid, cheap breakfast stuff. They serve lunch, but I always stick to the breakfast/brunch side of the menu, and it doesn't disappoint. The French toast is the definite standout. \n\nThe waitresses are nice, very attentive and pleasant. The whole place has a real neighborhood feel, everyone seems to know, or at least like, each other. It's my go to place for breakfast in West Philly/Cedar Park."
    },
    {
        "id": 141,
        "text": "Decent place for a bite with the kids. I wouldn't order the over cooked, over battered chicken & waffles again. Everything else was acceptable."
    },
    {
        "id": 142,
        "text": "Service was good! food was great! my mom and I came at the perfect time. We dodged a bullet and were seated right away. Right as we sat down, a long line started forming and had people waiting at least 10 mins before being seated. With that being said, this place gets busy quick! I got the California omelette and it was okay, but I wouldn't get it again. I loved the potato bread though. My mom got the cheesesteak and it was good !"
    },
    {
        "id": 143,
        "text": "I had heard pretty rave reviews about this place from friends and was excited to hear that they were back in business after the building next door fell on their roof.\n\nOn the down side...\nI got a burger and onion rings and it was just about the most standard burger and fries you could get.  It wasn't bad but there was absolutely nothing special about it.  I wish that the burger was cooked a little more.  Seemed like both the burger and the onion rings were probably frozen.  Really I would have enjoyed a McDonalds burger more and paid a fraction of the price.\n\nOn the plus side...\nMy girlfriend got one of the breakfast combos and absolutely loved it.  The home fries were very tasty.  She is very excited to go back again.  Also on the plus side, I really liked the ambiance and service.  I like that this restaurant had a more representative sample of West Philly demographics, unlike neighboring restaurants that only seem to attract the middle white class hipsters of this area.  I enjoyed seeing people of all ages, styles, races, and economic backgrounds enjoying a nice meal together."
    },
    {
        "id": 144,
        "text": "Fast service, good quality food. I've been here a handful of times and each time the food and service have been awesome. \n\nMaybe my only issue is that parking is kind of a hassle but it's on Baltimore, what do you expect ya know?"
    },
    {
        "id": 145,
        "text": "I went around 11am on a Sunday and had to wait about 30 minutes to be seated. When I did get a table, the server came and took my order right away and my food only took about 10 minutes. The food was just ok. The pancakes were thicker than I'm used to and didn't really taste like pancakes, just bread with syrup. The homefries were good but the peppers and onions are cut kind of big. I asked for egg whites with cheese and I thought they would scramble the cheese in but they just put it on top, which is very weird - first time I've ever seen that done. The bacon was amazing though! Fried perfectly!! I got a fountain soda which came in a styrofoam cup with a lid and straw which I appreciate because I was able to get a refill before I left and took it with me. The best thing was the prices!! My entire meal, including the drink, was only $12!! $12!!!!! I'll be back here!"
    },
    {
        "id": 146,
        "text": "So I live in the area and was looking for a good breakfast spot . I came across this place and decided to give it a try due to all the excellent ratings I have to start by saying the atmosphere was pleasant . My family ordered eggs, sausages and pancakes with hash browns . Our waitress was pretty nice but nothing to brag about . I was looking forward to the pancakes bc it's my favorite breakfast of choice. The pancakes were awful so awful id choose the pancakes box any day . I could literally taste baking soda or powder whatever it was it was strong . The eggs were absolutely tasteless and I ordered sunny side up , they were\nBarely cooked . The hash browns again not seasoned and tasteless and very greasy May I say the food was overall a grease ball ( yuck ) Sadly the\nSausage was the only good thing to eat . Pricing wasn't bad but mostly I was disappointed in the menu it was little to choose from  . I am surprised at how many positive ratings this place has either we came at a bad day or people don't know what decent good food is . I wouldn't ever recommended this place to anyone unless there going for coffee and I sure wouldn't come back ."
    },
    {
        "id": 147,
        "text": "I'm in love with their breakfast food so much so that some of the waitresses know my \"special\" orders by heart LOL"
    },
    {
        "id": 148,
        "text": "Yummy chicken and waffles! Simple, no fuss breakfast diner. It's standard fare so don't expect the fancied-up food (and prices) that you get in center city. \nI went on a Thursday morning so there was no line or wait. \nWill definitely go back to try their other bfast foods!"
    },
    {
        "id": 149,
        "text": "Dankwhich?!? Are you joking?  Steak, egg, cheese, and home fries smashed into a long roll. Get it. Servers are down to earth, nice people. Place is on point."
    },
    {
        "id": 150,
        "text": "This place is pretty regular. It's reasonably priced and in my neighborhood, which is why I come here occasionally. The food is mostly standard diner fare. My one complaint is that the menu doesn't have an option for eggs, toast, and home fries, which is my usual go-to order at a diner. All the eggs/toast/home fries options come with some type of meat, which I'd rather not pay for as a vegetarian. Instead, I usually get an egg sandwich on a bagel, which is good."
    },
    {
        "id": 151,
        "text": "This was my first time here and it was great! I ordered the Salmon steak with eggs and home fries with peppers and onions. The food came out fast and it was hot and it tasted even better. We were quickly seated and we didn't have to wait too long for out food to come out. I'll definitely be back the next time I'm in Philly"
    },
    {
        "id": 152,
        "text": "If you need some good, quick brunch food, here's the place! I usually get a egg, hash brown and sausage or bacon combo but sometimes I venture to having a pancake, egg and sausage or bacon combo. I like the pork bacon more than the sausage  because it is cooked \"crunchy\" if you understand lol. No matter what, the food is always good. Service is pretty efficient too. The servers are on point with their customers. Seats are self assigned unless it's crowded. I remember coming on a Saturday and waiting at the door/vestibule for a table, which seemed a little weird hovering over people eating. When that happens, the workers point us to the tables. Overall, good place for a filling breakfast or lunch. :-)"
    },
    {
        "id": 153,
        "text": "Horrible service!!! Especially on Sunday's!!! It's a shame because the food is good. Not sure why, but people don't seem to understand their jobs...waitresses working at the register and not helping customers. Come on man!!!!"
    },
    {
        "id": 154,
        "text": "So lucky to have this neighborhood cafe nearby! I've come here on a few occasions with a friend who initially recommended it and have been pleased every time--with the food, the service, and the ease of getting a table immediately upon arrival. Yes, it does get packed especially on weekends, but for what you pay for the portions and service you get, it is all worth it! The bottomless coffee, pancakes and french toast are wonderful, as are the eggs and hash browns; though next time I am hoping to try the chicken and waffles! I've also never come here for lunch, so there is more on the menu I've yet to try; though more often than not I find myself eating breakfast food at any time of day...because why not?"
    },
    {
        "id": 155,
        "text": "I just attempted to eat here. I stood near the please wait to be seated sign for 5 minutes, made eye contact with staff multiple times and never was seated, so I left."
    },
    {
        "id": 156,
        "text": "I would mark this down so far as the best place I've been since I've been to Philly food is great Service great"
    },
    {
        "id": 157,
        "text": "Probably the best fried chicken and waffles I've ever had. And for about $8, it's a definite must go next time I'm in Philly. \n\nI don't know how they get their fried chicken to be so moist and tasty and perfectly fried but all I care about is that I can eat to my heart's content. \n\nThe space looks vaguely like a Chinese lunch place back home in SF. Maybe that's just what I grew up with when I go to a local, humble and authentic restaurant?\n\nCedar Park Cafe has that homey feel with plenty of seating. What's not to like?"
    },
    {
        "id": 158,
        "text": "I am happy with Cedar Park Cafe and have nothing bad to say.  It is my default restaurant when I am working nearby.  They have the usual breakfast food and sandwiches.  I usually get corned beef hash and fried eggs.  The food arrives promptly and the potatoes are unusually brown and crisp.  The coffee is good.  Hash and coffee costs around $10.\n\nThey open early, but close after lunch, at 3:00."
    },
    {
        "id": 159,
        "text": "This simple, no-frills diner has recently reopened in its original location at 4912 Baltimore, in addition to its other Overbrook location, which was established after the Cedar Park location was damaged in the Christmas Eve 2012 fire and its aftermath. This is the perfect little breakfast & lunch joint, basic diner food done right and served with a smile. I am so glad it's back!!!"
    },
    {
        "id": 160,
        "text": "I never knew about this place until my aunt mentioned their amazing chicken and waffles. The wait for a seat line was hanging out the door however luckily I called in for take out. My food was really delicious and the chicken had a lil spice to it."
    },
    {
        "id": 161,
        "text": "This place is AMAZING. The French toast is so good along with everything else on the menu. I pretty much sat down ordered and got my food minutes later. I also love the staff they are so sweet and accommodating."
    },
    {
        "id": 162,
        "text": "Deeply confused on the buzz of great reviews here. The food is beyond mediocre, the service is awful, wait time is ridiculously long because the service is so awful and slows the time people are seated. \n\nI actually liked this place better when it first opened. It had more space with that diner feel because of the counter seats for individuals. But I figured I would give it a 2nd try since it's become such a popular spot. \n\nWe waited 30min for a seat, 10min for the waitress to \"greet\" us- it took us standing up to walk out for her to come over. Then she forgot to bring several different elements of our order out- from coffee and tea to a waffle. \n\nSure it's super cheap, but that's about it's got going for it, and that's if cheap is worth the wait, rudeness and diarrhea you'll have later."
    },
    {
        "id": 163,
        "text": "This was my 2nd visit to Cedar Park Cafe and first since they reopened.  I came with a fairly large grp of 8 and we got seated pretty quickly. Separate tables but right next to each other.  I ordered the chicken and waffles which I thought was quite good.  They other breakfast options ordered by my friends looked really good too.  The service was really nice.    I definitely would like to go back"
    },
    {
        "id": 164,
        "text": "This place is exactly what a diner should be. The food isn't the best I've ever had, but the vegetarian options are great for a diner! The service is great and the food came out quickly. I would say that in  the neighborhood the veg options aren't the best possible but if you are looking for a quick and diner experience go here."
    },
    {
        "id": 165,
        "text": "I wish I lived in Southwest Philadelphia so I can come here all of the time!  It is delicious, fresh, has great service, and very well priced.  Great pancakes!  The condiments aren't the best (ketchup and syrup), but you get what you pay for.  I love brunch food and this place is definitely one of the best in Philadelphia for the price.  No frills!"
    },
    {
        "id": 166,
        "text": "Great local spot for decent, reliable food. Had an egg burrito that passed with flying colours. For reliable decent breakfast brunch food and a sense of a West Philly neighbourhood vibe, come here. I've yet to try their famous chicken and waffles. Good experience overall. Worth coming to again."
    },
    {
        "id": 167,
        "text": "Cedar Park Cafe is one of those spots you stumble upon while casually walking back to your apartment in West Philly. Along with the very homey vibes it gives off, the smell of freshly baked hot cakes is what got us to pay a visit. \n\nThe menu had many options for different brunch items, but what caught our eye was the super affordable prices! A lot of cafes seem super overpriced for their pancakes and egg benedict, but this spot had some really good deals.\n\nThe reason I gave 3 stars was because of how unsatisfied I was about the egg benedict. As much as I love my eggs, this one was just not cutting it. It was way too watery and also felt a little cold. \n\nAside from my displeasure, I really enjoyed the hot cakes and waffles! We got chocolate chip\nwith fruit and whip cream on the side. They actually gave us the whip cream bottle which was both unique but also a little worrisome. We stayed just until it was closing time. \n\nAnother great aspect about this spot is that it gave off the type of vibes I would expect from a Philly spot. I would definitely come again for the hot cakes and homemade fries!"
    },
    {
        "id": 168,
        "text": "Your neighborhood diner! I actually have a hard time finding good yet simple cafes/diners, but this is it! I always order chicken and waffles, and the chicken never fails to be crispy! I've had almost everything here now on the menu, from the wraps to the grits, and although it is not the most amazing food you'll ever have, you will leave happy, even with the bill :) \n\nPS. Apparently even Clinton has been here now?"
    },
    {
        "id": 169,
        "text": "The food is diner food, and it's under $10 for an entree, which is GREAT!\nThe service, is horrible.  I go in regularly, because of the location and the fact there's nothing else in the area like this.  If I wait to be seated, I'm told I don't have to wait... when I just sit, I'm told (not in a nice way) to wait until we're told to sit.  Every.  Time.\nAfter you get your food, they're DONE with you.  Forget about a coffee refill, I've never once been offered one, and when I ask for more, it's always been met with annoyance.  Rarely get my check, and have to go up to ask for my check when I pay... which is met with annoyance, \"you don't have your bill?!\"  Umm... no... I didn't even get a coffee refill.  \nAgain, I've been in here a dozen plus times, and whether there's 1 or 50, the service is the same.  Horrible.  \nAnd... I will continue to come back, because it's all there is in the area. \nHey West Philly, how about opening a coffee shop and affordable, friendly diner?"
    },
    {
        "id": 170,
        "text": "Cedar Park rocks. Decent diner food, breakfast & lunch only. Servers & cooks alike are all great people. So glad they came back in this location after the unfortunate 2012 fire next door at Elana's. The other location in Overbrook is great too.\n\nNice to be in a restaurant that looks a little bit more like the diversity of the neighborhood, by the way! I miss the counter, and weekends are sometimes crowded, but that's always the way with that \"brunch\" crowd."
    },
    {
        "id": 171,
        "text": "Good place for breakfast. The food was good. I ordered the #10 breakfast with chocolate chip pancakes based on another review that I read. Sooooo chocolatey and delicious. My boyfriend ordered the same but with banana pancakes. Just an FYI, the chocolate chips and blueberries are cooked into the pancakes, all other options are just toppings, $1.75 extra charge. \n\nThe waitress was friendly, and made sure that we satisfied with our meals. \n\nThe downside of the cafe is the door. For traffic purposes, it would be great if they add another door, just for the flow of traffic. Also, the clearing of tables could be a little more efficient if they hired someone to do that to help the waitresses, bc it is quite busy.\n\nOverall, I would go back. The food is fresh, reasonably priced, and the meals were great and made to order."
    },
    {
        "id": 172,
        "text": "hi owner. It will be a good idea to get together with uber that way people can get their food delivered and there will not be so much of a crowd inside the restaurant.That makes it easier for everybody the customer and your staff"
    },
    {
        "id": 173,
        "text": "the food was excellent and affordable. I will definitely be going back if I'm in the area. our waitress was very nice and helped us on suggestions where to go walk around."
    },
    {
        "id": 174,
        "text": "I was so very disappointed with this place I sat there 45 mins before I was greeted and once I was greeted the server was so rude. I'm a server myself so I was trying to be patient put it was ridiculous. The food was good and came out quick but everything else sucked"
    },
    {
        "id": 175,
        "text": "It's was busy but service was great/prompt. I got their chicken and waffle special. It was really good. Good spot for brunch or nursing a hangover! The home fries were ok."
    },
    {
        "id": 176,
        "text": "Local favorite for giant portions of classic breakfast fare with upscale twists like Salmon. \n\nSeriously best breakfast bang for the buck, nicely executed, great service, coffee always full, during very busy weekend brunch!"
    },
    {
        "id": 177,
        "text": "Let me start off with this....the food here is bananas! \n\nCame here for the first time this past Saturday with the fam. Now my wife had ordered from here once before, and kept raving about this spot to me for weeks. Finally broke it down, gave in, and took the short 5 min. drive over. Parking wasn't bad for a busy & beautiful Sat. morning on Baltimore Ave...I know how hectic it can get. We strolled in and waited about 15-20 min. to be seated. It was packed as expected but we came at a good time, so getting a table was no issue.\n\nThe waitress and staff here are very gracious and courteous. Very clean space. I ordered the chicken and waffles. That was the first time I've ever had that for breakfast, anywhere. The chicken is very fresh, with the right amount of crispiness on the outside, and tender on the inside. The portions are very generous for the price (I believe it was around $8.00 or so). The waffles were thick and hearty, with just the right amount of butter, just the way Dee likes 'em!\n\nWhat I really enjoyed the most (aside from the food of course), was the diversity of the customers seated around me, kids, teens, and adults....smiling, laughing and enjoying their meals. I was soaking up that moment, and made me realize how important it is for us as a community to continue going out and supporting our local businesses. Especially the establishments that put out great food and service such as Cedar Park Cafe.\n\nSo yeah, I'm a fan, and will most def be back at some point...for lunch!\n\nLater..."
    },
    {
        "id": 178,
        "text": "Simply place with great customer service and food...you cannot go wrong! I had the chicken and waffles...great!"
    },
    {
        "id": 179,
        "text": "The food here is to die for and I really enjoyed my Reuben the only reason I gave 4 stars is the fruit flies that were flying around my food while I was eating."
    },
    {
        "id": 180,
        "text": "My husband and I picked up cedar park on the way home from a long weekend. It was sooo good. The portions were huge,  everything is homemade. I give it 4 stars only because I've had better breakfast/brunch in the city at places like north 3rd and hawthornes. I reserve 5 stars for meals I don't think I could make myself. But!  Delicious and worth stopping in."
    },
    {
        "id": 181,
        "text": "Don't bother going because the service is absolute trash. Not sure what we did to upset the staff, I can only guess it was because we sat at a dirty table (the host told us to seat ourselves), but we sat and waited for over 15 minutes watching people who came in well after us getting menus and service. Another table had to ask their server to help us because we looked so confused and she literally looked at us and shook her head saying it wasn't her table, it was clear she wasn't interested in helping us in the slightest. When I saw the servers audibly arguing about who would get our table, we walked out. I am a server too and I understand if the restaurant is busy, but we were clearly being punished and pushed out of the restaurant by the staff. I'm not going to stick around if the servers have to argue over who gets us and cause a scene making everyone extremely uncomfortable. If you're looking at these reviews to help you decide where to eat, I would recommend Gold Standard down the street or even the food truck in the park."
    },
    {
        "id": 182,
        "text": "I love it here. The line gets pretty long on weekends but they have their process figured out and are really efficient about getting people seated, having people pay at the counter so tables clear up faster, etc. The quality is consistent -- I usually get an omelette with homefries and they're always delicious. It's hard to find good diner-type food that isn't trying to be fancy and Cedar Park has just that."
    },
    {
        "id": 183,
        "text": "I came around noon on a weekday, so there wasn't a wait. This cafe is in a pleasant location. Beautiful trees are waving outside. Unfortunately my sis and I couldn't get the window seats, but it was still nice to watch nonetheless.\n\nIn terms of the food and service, I would say they were just OK. The server we had was good, adequate enough. She was standing off to the side not really paying attention when we asked for her to take our check, but this is nothing against her character. Could she have been more alert-- yeah. Could she have been bubblier, yes probably. But she was good.\n\nThe food I had was nothing incredible really. I used to live in Southwest Philly, and Woodland Village makes similar food, for cheaper. I think their platters are $4, in fact. The venue isn't as nice or as clean, but the food is comparable to here.  So of course it was a little disappointing to have eggs, sausage links and a waffle that tasted like something I could make myself at home or get at Woodland Village for around $8. For all that, I may as well have paid an extra few dollars and gone to Sabrina's and had one of their breakfast concoctions.\n\nI finished all my food. I enjoyed the time of day and the atmosphere. I just wasn't amazed by what I had for breakfast. Maybe I'll go back for the Chicken and Waffles?"
    },
    {
        "id": 184,
        "text": "Tried this spot out on Sunday for breakfast an the place was packed.. Standby room only had to wait a few mins to be seated. Our waitress came an sat us down and took our order.. I wish she would have told us her name so I cld put it in my review cause she was awesome. I can describe her as dark skin and fairly slim.. Anyways she made my coffee perfectly both times. I ordered the fish and grits an boyfriend ordered eggs, hash browns, turkey sausage. I thought the fish could have been alittle bigger but it actually was just enough to fill me up an not make me uncomfortable. When we left the line was out the door.. This place is well liked, and frequented by all which I loved.. The prices were fair! Will go back"
    },
    {
        "id": 185,
        "text": "This place has live roaches! Do not eat there!  I stopped in to dine with my boyfriend for lunch and noticed live roaches at the entrance next to the ATM machine.  Roaches were also crawling on the ATM machine which is located next to the garbage.  We left immediately.  I will not eat here.  I hope that Food Safety Sanitation will inspect this place to ensure that it is up to code."
    },
    {
        "id": 186,
        "text": "I haven't order anything bad here yet. The wait service is not bad it's the kitchen that's slow waited a good amount of time before my food came out the place wasn't busy like it usually is oh well the food good just gotta pack your patient."
    },
    {
        "id": 187,
        "text": "My go-to weekend breakfast spot. Great menu all around. Their omelettes, fried chicken, and hotcakes are great!"
    },
    {
        "id": 188,
        "text": "Everyone is wearing their coats in here. I asked the cashier about turning up the heat and he said the heat is on but it takes a while to turn up. The place has already been open for a few hours!"
    },
    {
        "id": 189,
        "text": "What a treat. Great food at the right price. One time was given Ham instead of Pork Roll but I think it was my fault because I asked for \"Taylor Ham\" which is a North Jersey translation of \"Taylor Pork Roll\" as it's more commonly referred to in South Jersey/Philly (as I understand). Once I dropped my eggs on the floor and they offered to bring me new ones. French toast is a bit too buttery. Flapjacks are 10/10. Very post-church vibe on Sundays in a good way. Great location, sometimes the kitchen is slow but the servers are very communicative about it and they're all doing their best ! Definitely recommend for a low-key morning bite."
    },
    {
        "id": 190,
        "text": "Probably the best french toast I've had in a very long time! Definitely worth the try."
    },
    {
        "id": 191,
        "text": "They seated us next to the kitchen, because the front half of the restaurant (with the only windows) is \"closed\" after about 1:30 pm. We were surrounded by dirty dishes at other tables throughout the meal. They didn't drain the bacon. I had to beg for a second cup of coffee. The waffles and chicken were still good. They need to think about the experience from the customers' point of view."
    },
    {
        "id": 192,
        "text": "Heard so much about Cedar Park's chicken and waffles, so of course, I had to try it out.  I came with a friend and both decided to go with their famous plate (instead of getting two different items and sharing like I would normally do). Reading the raving reviews, I really thought that this dish would be spectacular, but unfortunately, was very disappointed.  \n\nIn terms of service, we came here on a Sunday around noon. It was quite busy and we probably didn't get seated until after 25 minutes waiting in line.  Even after seating, the service was slow.  We waited for 15 minutes just to pay our bill because our server just never came back (this was after the brunch crowd slowed down significantly).  \n\nAs for food? Well, either my expectations were too high or they just experienced a very bad day. The waffle was dry and too cakey.  And the two pieces of breaded chicken (albeit crispy and had some decent flavors) was not tender nor moist. I understand that eateries have good and bad days, but based on both food and service, it'd probably be a while before I would give Cedar Park Cafe another try."
    },
    {
        "id": 193,
        "text": "This was my first time in Cedar Park, and naturally my friend and I were looking for a brunch place. This place caught our eye because it was so close. We were immediately seated but we quickly realized this was a super popular joint. And soon we realized why.\n\n The portions are enormous and delicious. I got #8 with Turkey Bacon and sausage patty. It also came with savory grits, toast, amazing home fries (seriously, the place is worth it just for the home fries), and 2 eggs. Needless to say, I was stuffed. Everything was great and reasonably priced. \n\nHighly recommended."
    },
    {
        "id": 194,
        "text": "Good food but can be a little slow. Must repeat order because sometimes there have forgot what was wanted on order, but the food is good."
    },
    {
        "id": 195,
        "text": "I love their breakfast: Pork Sausage patties, Homefries, Cheese Eggs, Wheat Toast w/ butter .. Off the hook!!"
    },
    {
        "id": 196,
        "text": "I love this place but I feel like it's gone downhill. I routinely have to ask servers twice or three times for things. Their butter is stale and tastes like it's absorbed the odors from The interiors of their walk-in fridge, their coffee is hit or miss, their bathrooms are gendered and dirty and dingy looking, the menu prices are awesome but you have to know how to order everything, for instants I find myself having to order waffles, home fries, corn beef hash, everything except for french fries well done. The cooks rush and don't even cook their pancakes and waffles until they're just done, they are never crispy."
    },
    {
        "id": 197,
        "text": "This place is right down the block from where I get my haircut and I try to stop in when I can for one of my favorite meals...Chicken and Waffles!!   It's so good here, and at a very fair price!   The chicken is a little spicy, but paired with the sweet waffle and maple syrup, it's pure perfection.   I stopped in this morning with my daughters, since they were off from school.   I knew the portions were on the large size, so we ordered two plates, to share between the 3 of us and we even had leftovers!\n\nWe ordered the Chicken and Waffles, and a plate of creamed chipped beef.   The chipped beef on toast comes with 2 eggs, any style and grits or hash browns.   One of my girls wanted a side of bacon, too, so we had that, as well.  The service was friendly and efficient and the food came out quite quickly.   Both of my girls liked the chicken and waffles and they devoured the chipped beef plate.    \n\nI'll definitely return when I'm in the area.  Credit Cards only over $10 bill."
    },
    {
        "id": 198,
        "text": "My family have been coming here for many years. The last two have been spotty. The prior waitress was good, these waitress, cooks and manager is HORRIBLE. We decided to put this place in the don't patronize list.  Slow service and cold food don't add up."
    },
    {
        "id": 199,
        "text": "Every time I eat here, there's a line out the door. But the food is worth the wait. Specifically, the chicken and waffles are worth the wait. I love the panko-breading on the chicken, unique but tasty, and not too greasy. I keep meaning to try their other fare, but the pull of the chicken and waffles are too much :)\n\nClean. Family friendly. Generous portions at a good price. And good coffee too!"
    },
    {
        "id": 200,
        "text": "Busy diner like restaurant that has by far the best chicken and waffles ever.  The rest of there breakfast menu is pretty basic and could be had anywhere but I would certainly trek out to West Philly again for the chicken and waffle dish.  A warning about their staff though is that the younger ones seem to really not care.  The young woman we had needed to be reminded of drinks we had ordered and begged for coffee refills. I even had to wait for a check with piled up dirty dishes in front me for 15 minutes.  Thank goodness their food was good because the service I received certainly wouldn't bring me back."
    },
    {
        "id": 201,
        "text": "Worth the wait on a Sunday! The staff is very accommodating and extra nice! I had the fish and grits it was seasoned well and the portions were good. I couldn't finish it! Seating is first come first serve. It's worth it."
    },
    {
        "id": 202,
        "text": "Came here for late brunch and was seated promptly. I got the chicken and waffles while my boyfriend got French toast with French fries. French toast was pretty good but a little soggy for my tastes. Chicken was pretty good although it wasn't quite what I was expecting. They are more like fried chicken cutlets with a bit of a kick (some red pepper seasoning probably). The sweet and sour sauce was different even though my boyfriend was not a fan. The waffle was okay; a bit too cakey and dense for me. But for this price it was a good deal and I'd go back and try other things!"
    },
    {
        "id": 203,
        "text": "Their home fries are  absolutely delicious.\nThey got a good vibe here and feels real welcoming on a cold Sunday morning.\nGet the healthy egg white omelette with a side of homefries."
    },
    {
        "id": 204,
        "text": "Oh my gawd! The food was amazeball! I had the chicken and waffle and it was heavenly! The chicken had a sweetheat kick to it with a sweet dipping sauce on the side. the waffle was freshly prepared! It came out quickly, the cost was awesome and the service was good! I'm def visiting every time I come to philly! Nice!!!!!!"
    },
    {
        "id": 205,
        "text": "Nova lox omelette with home fries is a deal and a half and sooo delicious. Perfectly cooked eggs. Creamy potatoes, crispy in the outside. Chicken and waffles an even better deal. Perfectly seasoned and cooked chicken and fluffy waffle served with pepper jelly. Came from out of town but best believe this would be a regular spot. Waitstaff very kind. Would recommends to anyone. Thank you!!"
    },
    {
        "id": 206,
        "text": "Last Sunday my roommate asked if I wanted to go get brunch.  Why not said I.  Where should we go?  Que my cousin, the semi-retired chef's, Facebook status:  \"Corned been hash with poached eggs!\"  I asked where? and she told me Cedar Park Cafe.\n\nMan, were we ever glad we went!  The place is not much to look at but who cares?  It is a true \"greasy spoon\" as far as looks go. And you might have a wee bit of a wait, but it is well worth it.\n\nI ordered corned beef hash, crisp with poached eggs, grits (!), and rye toast.  The hash was perfect, and the grits were the best I have had outside of the Dirty South. I was Soooo delighted and then I got to the eggs.  Uh oh!  The yolks were solid!  That's not gonna work with corned beef hash!\n\nWe got the server's attention, but she was busy with other customers.  So another server who saw that something seemed off, sent a line cook (!) over. I assured him that everything else was great and that I did not want a new plate of food, just some new eggs.  All he asked was how I wanted the eggs (I just need soft yolks and cooked whites at this stage, was my answer) and off he went.  In about 5 minutes or so I had my eggs perfectly done, served by the line cook himself. Our server came over to make sure it all worked out well and I thanked her for the great service. Heck,I have had worse service in an allegedly 5 star restaurant in NYC!  \n\nYou may wonder why 5 stars if my eggs were done wrong.  Well, they earned the full 5 because they handled it so efficiently and without fuss or excuses.  Poached eggs can get overcooked very easily; I won't hold that against them.\n\nNow, here is the best part of all.  Guess how much bruch for two was *with* a 20+% tip?  Go on, guess!  \n\n$21.00\n\nI will definitely eat here again!!  In fact, I would eat here with a hangover!!"
    },
    {
        "id": 207,
        "text": "Clean, well furnished in modern style place. Service is wonderful provided by well-mannered waitresses. I had a uncommon battered chicken and waffle for my breakfast. The chicken was fried after order was made so it was hot and juicy. Waffle was ok tough. Nothing fancy about it. I am definitely going there again to explore more menu."
    },
    {
        "id": 208,
        "text": "This place is one of the best finds in West Philly. I walked in for an early breakfast (they open at 7) and saw that they had a fair amount of people in there eating at the tables and also at the diner counter. I was told that I could sit anywhere and someone would assist me. I chose a nice seat by the window and was promptly presented with a menu from which I ordered the platter consisting of french toast or pancakes, sausage or bacon, eggs and home fries (all for 8.00!). I added sliced wheat toast for an extra .75. The food came within the next 10 minutes! They are fast at this place. I even went today and same thing! \n\nNow on to the food:\n\nFrench toast:Phenomenal. Three huge, fluffy and buttery slices. Add syrup and it was a golden river of pure deliciousness flowing down my plate.\n\nVegetable home fries: Hearty portion that had plenty of vegetables (mushrooms, peppers, onions, tomatoes and spinach). My favorite part of my breakfast (though I struggled choosing since the French toast was also the best I've ever had).\n\nBacon: 4 Long and meaty strips, not those short thin strips you get everywhere else. \n\nEggs: Fluffy and tasty! \n\nThe service in this place is also wonderful. Everyone seems to be in good spirits and are so polite and attentive. It is such a comfortable environment to dine in and with the prices, you get more than you pay for here!"
    },
    {
        "id": 209,
        "text": "I can see very easily why people in the neighborhood really like Cedar Park Cafe. Their menu of diner-style comfort food is just exactly what you need on a chilly weekend or an early weekday morning. I got the California omelette with home fries, which was a darn big plate of food, even without the toast (which I passed on.) The ingredients seemed fresh, although the food definitely under-seasoned. We had a wait a while for coffee, and all of the juices are bottled. Service was extremely friendly & fast otherwise. I definitely would vote that you give this place a try if you're in the neighborhood."
    },
    {
        "id": 210,
        "text": "This place is amazing. Ive been here almost ten times within three weeks. They have great food at an inexpensive price. You have got to try their hot beef sausage and french toast its my favorite. They do get very packed very fast though and they don't take reservations."
    },
    {
        "id": 211,
        "text": "Came here with the family when visiting he annoying little sister at UPenn. Food was delicious!!!  I had the lox omelet (nova lox, capers, spinach, & red onions) and I added provolone cheese. It came with home fries (potatoes with red and green peppers and red onions) and my choice of toast (I chose potato bread). I also had a side of beef bacon......yup! Beef bacon!!  And a side of sliced avocado. My kids, who are extremely picky about eating in \"urban\" restaurants, totally enjoyed their meals (child 1: steak, eggs, french fries. Child 2: pancakes, eggs, beef bacon, and french fries). The mister, who is close to impossible to please, had grits, corned beef hash, eggs, and potato bread and even he was satisfied!  All in all, we really enjoyed ourselves and I would def recommend it to anyone willing to take the 5min drive, in the other direction."
    },
    {
        "id": 212,
        "text": "When my friends and I arrived, there was a little bit of a wait to be seated but it was good we got there when we did because after being seated, the line was longer. The decor of the place is no frills and very casual/chill. \n\nI decided on the classic chicken and waffles. The meal came with 2 thickly crusted fried chicken tenders which I loved and was happy I didn't have to deal with bones. The chicken was incredibly well seasoned, tender, crispy and yummy! The waffle was covered in butter and powdered sugar. I wasn't a huge fan of the waffle- It was kind of bland. I ate the waffle with the chicken but couldn't really discern the waffle taste. It was also not as crispy as I would have liked. Also on the plate, there was sweet chili sauce on the side which actually went really well with the chicken. \n\nMy friend ordered some chocolate chip hotcakes (pancakes), which I got to try and MAN, they were delicious! There were tons of chocolate chips and powdered sugar sprinkled on top of the pancakes as well as a dab of butter. It was very chocolate-y, the way I like my chocolate chip pancakes to be and the chocolate just melted in my mouth. The hotcakes themselves were also great- Fluffy, warm and full of buttery goodness. \n\nI also got to try some of my friend's hashbrowns which were so good! They were perfectly crunchy and the potatoes were flavorful. \n\nService was decent and the pricing was very reasonable. I believe every meal on the menu was under $10."
    },
    {
        "id": 213,
        "text": "we came here based on a recommendation.  we arrived and got seated pretty fast.  it took about 10 minutes before anyone even took our order. and she was rushing us through the order taking process so fast that my gf didn't even get to finish talking before she started to ask me what i wanted.  once the order got put in, it took about 30 minutes before the food came out.  i got the eggs Benedict, which was trash.  it was missing one full egg and was only egg white on muffin and the other egg was way over cooked.  and then had the most amount sauce that any Benedict should have.  no one ever came to check on us and see how the food is/was, no one came to ask if we needed refills, which we did.\n\nonce we were done eating we stacked our plates neatly and waited and waited and waited a little more for our check.  nothing.  got looked over and walked past multiple times. finally our server came back after what was probably her break sipping her drink and asked if we were ready for our check.  hrmm what ever gave you that idea?  that service was hands down the worst I've ever had in a very long time."
    },
    {
        "id": 214,
        "text": "This place was a yelp suggestion and boy was it a great one!!!  First of all, the place is RIGHT around the corner from my house and secondly the food is amazing!!! \n\nI got the chicken and waffles and although it was a fried split chicken breast and not the traditional southern fried wings didn't make any difference at all. The chicken was seasoned to perfection, the perfect amount of spicy and tangy. And who can really mess up on a waffle!  All in all the food was absolutely amazing and I will be returning again and again and again!"
    },
    {
        "id": 215,
        "text": "Pretty good spot! We followed the Yelp reviews on our brief trip to Philly and it was well served. I had the chicken and waffles...tasty and I loved how crispy the chicken was. Only downside is they don't have a kids menu...but the waiter did accommodate us!"
    },
    {
        "id": 216,
        "text": "The only good dish here is chicken and waffles. DO NOT ADD CHEESE to your omelette or grits. Their cheese is so nasty and plastic. It completely ruined the grits and omelette. The vibe of the place is food kitchen with a touch of local breakfast spot. It's very informal place, after you are done eating don't wait for the bill just pay at the cashier. It's more pricey than I thought. I assumed it was a black owned business bc the servers are black but I'm pretty sure it's Asian owned, a side note. the chicken for the waffle is good and seasoned."
    },
    {
        "id": 217,
        "text": "I eat here all the time! I grew up eating this kind of food. I've never ordered anything and been disappointed. It's so easy to customize your food because they don't require you to stick to a certain platter. It has a clean environment, a well mannered staff, and an affordable price. Overall, I would suggest giving Cedar Park Café a visit if you're in the area and looking for a great breakfast and/or lunch."
    },
    {
        "id": 218,
        "text": "Price:\nDecent for what you get! Spent about $10 dollars getting a good sized brunch (2 meats, 2 eggs, toast, home fries, and grits) or eggs Benedict with home fries.\n\nFood quality/quantity:\nHome style cooking with home style taste. Portion sizes are generous. Giving this place a four star because quality is above average but lacking some flavor IMO overall but with all the condiments they give you can potentially make up for it.\n\nService:\nWaiters are generally friendly and attentive. Place to go if you're looking to satisfy that brunch craving!"
    },
    {
        "id": 219,
        "text": "Don't Judge a Book by its cover!\n\nHad breakfast here with my son and while the place looks a little rough when you walk in, the food and service were really good. \n\nSeat yourself type setup with a decent number of tables and room...you don't feel cramped here. \n\nWaitress was prompt, nice, and attentive but the menus were a bit beat up and messy. You have to read the menu carefully because some menu items have lots of included sides (yeah). I went with the Chicken & Waffles w/ blueberries and a side of Canadian bacon (I took a pic but somehow lost it) and my son had the Western Omelette. Big portions were large and the omelette came toast, home fries, and a drink. \n\nThe food was tasty, better than I expected when I first walked in. The waffle came with the blueberries on top, usually a BIG no-no for me (cook the waffle with the fruit inside to release the flavors..please) but the berries were tasty anyway. The also served it with some sweet chile sauce for the chicken, not bad but there is something good about fired chicken with maple syrup . The omelette and portion of home fries were HUGE, too much to finish in one sitting.\n\nOverall not a bad place to eat, and I would go back if I were in the area. More of a good \"greasy spoon\" than a cafe' or diner. If they cleaned up a little, I would give them 4 stars."
    },
    {
        "id": 220,
        "text": "This place is my favorite brunch place in all of Philadelphia. I think the only place that comes close is Green Eggs Cafe. The food is affordable (all platters are under $10), delicious, and giant in portions. I've come here a lot when I lived on Baltimore, but I'll take the walk to eat here. I love their corn beef hash, and regular \"choose your breakfast meat\" platter. The only issue is the line on Sundays. Their system is basically first-come-first-serve. It's always shooting out the door, just wish they had some chairs outside or something."
    },
    {
        "id": 221,
        "text": "Lovely place for breakfast. Got here around 9 am on Sunday and there was no wait!\nI ordered the veggie omelette with fries and potato bread on the side (which pretty much tastes like white bread) and a side of much needed hot chocolate which was delicious on that chilly morning.\nMy date had the pancakes with walnuts and topped them off w syrup which was to die for! I love that you can pick a meat, a sweet dish, and coffee on the side. Great food, great prices!"
    },
    {
        "id": 222,
        "text": "The food was awesome. I called to order and my food was ready within 15 minutes. We had chicken and waffles and home fries, scrambled eggs, scrapple and toast. Everything was good. My husband and I were so full and satisfied. We will definitely be ordering or dining in again."
    },
    {
        "id": 223,
        "text": "I'll just get this out of the way that I am a huuuuuuge fan of Cedar Park cafe. Located on 49 and Baltimore, this little diner is a gem. My friends and I came on a Saturday for brunch and there was a ~15 min wait to have the three of us seated.\n\nI ordered the #10 which came with 2 eggs, my choice of a sausage, and pancakes. While there is nothing special about the food here, I will say that it is the most reasonable brunch spot. I love being able to come out to ture West Philadelphia and be surrounded by the residents of the neighborhood compared to the university setting. There is a vibe at Cedar Park cafe that is unrivaled and oozes with a sense of community.\n\nWhile there are better quality brunch places in U-City, Cedar Park cafe has my heart as well as my stomach.\n\n10/10 nothin else."
    },
    {
        "id": 224,
        "text": "Cheap, tasty ,fast, not over crowded or loud, Has corn beef hash, nice location right by the parklet and bmore ave.  Pretty much everything you want in a breakfast place with plenty of seats.  Stop in!"
    },
    {
        "id": 225,
        "text": "The Veggie Hash 2as delicious.  Portion sizes are great and service is super friendly.  Will definitely be back!"
    },
    {
        "id": 226,
        "text": "I had the chicken and waffle and the waffle was nice and fluffy, but the chicken was gross. They should change their recipe. Highly disappointed"
    },
    {
        "id": 227,
        "text": "Love Cedar Park Cafe! The chicken and waffles are the best and I always leaving feeling pleasantly stuffed. (Also it's not too hard on your wallet either!)"
    },
    {
        "id": 228,
        "text": "Best breakfast in Philly. Superb waitresses and awesome food. I would recommend this place to anyone looking for a great meal at a reasonable price. It's a little out of the way but well worth the trip"
    },
    {
        "id": 229,
        "text": "Great place for breakfast! The food here is ridiculously amazing and cheap. My favorite is the chicken and waffles. I knocked a star off because of the cleanliness of the place. The tables are always sticky even though I've been here numerous times."
    },
    {
        "id": 230,
        "text": "Still a go-to spot 6 years later. Love that they have chicken cheese steaks since I don't eat beef. It can get a bit busy during peak hours but they're quick and easy to order from."
    },
    {
        "id": 231,
        "text": "Cedar Park Cafe is the epitome of West Philly - comfortable, friendly, and chill. This diner feels homey and welcoming, especially with its friendly staff. The service here is amazing - I'm not sure what her name is but one of the waitresses has amazing memory and can remember your order to the dot without jotting a thing.\n\nI got the chicken and waffles and it was so good! The portions are quite big and great for its price. As for the flavor, the chicken is nice and crisp and tastes even better with the complementary sweet chili sauce that is on the side. I also always enjoy the bottomless coffee here. Just another reminder that this place is no frills but just strictly amazing food. Would recommend for a brunch out at west Philly."
    },
    {
        "id": 232,
        "text": "First time I visited this morning and had turkey sausage, eggs, pancakes, homefries and grits. The food was pretty good. It was not fall out my chair delicious cause the grits were bland. \n\nIts was okayyyy...I wouldn't wait in line for the food though"
    },
    {
        "id": 233,
        "text": "I have been coming here for years!  I normally order some oatmeal and a coffee.  I wanted to make an order for pick up and I was 20 minutes away.  I spoke to the Asian female manager who was EXTREMELY rude and disrespectful.  She told me that she could not take my order because they had just opened and no one was there and that when I got there the food would not be done.  She didn't even know that I was coming from across town.  She simply assumed that I was around the corner.  I asked to speak to someone else and she said \"who you wanna speak to the cook!\"  I was sooo upset I went there anyway (that's how I found out that the person i spoke to was an Asian female)  I went to the counter and she was just as rude in person!  She pointed to a sign that said that she did not have to serve me!  I said I did not come to be served food.  Why would I order from someone who is rude and disrespectful!  I am an educator by profession and I am writing this in Hope's of getting the attention of the owner of the facility so that I can be addressed properly."
    },
    {
        "id": 234,
        "text": "I love this place for breakfast and lunch. The staff is great and Nina is the best. I usually order take out and the wait os is never long. The food is always delicious and the prices are a good value. It is a great neighborhood restaurant."
    },
    {
        "id": 235,
        "text": "I LOVE cedar park Cafe for casual breakfast! They even know how to make grits and I always get those (add lots of butter, salt, & pepper!) with the nova lox omelet!"
    },
    {
        "id": 236,
        "text": "I've been dying to eat here for months and when I finally got the opportunity to, I wasn't really pleased.\nTo begin with, the lines were out the door. Luckily we've only been waiting for 15minutes or so. They need a host by the door to seat people because things were getting hectic. Anyways, service was kind of slow. I understand the server was backed up but it took her a while to get us drinks/take our orders. \nThe food came out very fast. I asked for my eggs well done but instead it was cold and wasn't cooked well. Everything else was okay. This place reminds me of IHOP. I'm glad I gave this place a try, but there are definitely other places in the area that's better."
    },
    {
        "id": 237,
        "text": "I've been to this cafe a couple of times. It's definitely your typical neighborhood diner with all the standard breakfast dishes. The food is homey, good, and affordable. Also, the service is what I would consider decent. So on that note, if you live in or are visiting Cedar Park this place will and should be a place you frequent, regardless of what I I'm going to say next lol.\n\nThe wait is soooooooooo long on the weekends, but it's for those points I made above. Again, this is clearly the neighborhood spot so on the weekends everyone and their auntie, cousin, daddy, and nephew are here. My suggestion to you is to get up early on the weekend or just be prepared for a wait.\n\nOverall, this is a good diner type cafe. We always enjoy our breakfast here! The docked star is for the wait and because it's not the most delicious breakfast I've ever had, but definitely good and very filling.\n\nOh they also are cash only. There is an ATM by the door."
    },
    {
        "id": 238,
        "text": "One of the Best places in this west Philly area (we have many) this place has been around for a very long time and have always been on top of their game! Been around longer than the yelp app itself and I'm a yelper so decided to send out a review if u are new to the area and want to go to a nice good atmosphere sit down cafe with great prices this will be your go to ! Also they have a vegan friendly menu! As well"
    },
    {
        "id": 239,
        "text": "I have been here a couple times for breakfast and it is soooooo nice to have a real 'breakfast' restaurant in my neighborhood. The restaurant is open 7 days a week 7 am - 3pm. The service is speedy and everyone is really nice. Good prices! Vegetarian choices. They have breakfast sandwiches and several platters. Also, serves lunch. Lunch platters and Hoagies. \n\nBoth times I have gottena breakfast platter. They will add cheese for .30 extra and green peppers and onions to the home fries for .30. I brought a friend my second time and she agreed, it was really good. We will bring more people.\n\nGood deals, clean and friendly. welcome to our neighborhood."
    },
    {
        "id": 240,
        "text": "Love it! great food, service, and clientele.  One of the few places that is good Southern food and has a truly mixed race clientele ."
    },
    {
        "id": 241,
        "text": "I haven't been here for about a year and wow did this place exceed my expectations! I already knew the chicken and waffles were good but this time it was absolutely amazing. The chicken was crispy on the outside and juicy on the inside. It also might just be me but I think the chicken size is bigger! The price is still very much affordable and the service is decent. The place gets really crowded on a weekend so plan accordingly. I usually like going on a weekday to avoid the crowds."
    },
    {
        "id": 242,
        "text": "This could have been a 5 star rating however in the middle of enjoying my very delicious meal... a four legged friend decided to join me and my husband for breakfast  We called our waitress over and she quickly told who I'm assuming is one of the bosses? The boss kindly walked over and smashed our friend on the wall and walked away ‍ We immediately asked for the check, was charged and paid full price. I tipped and thanked the waitress and gave her my fair well because sadly...we will never return"
    },
    {
        "id": 243,
        "text": "Nothing spectacular about this place. The food is subpar and cheap. Customer service is okay. Good place to go if you want a full breakfast but don't want to pay big bucks"
    },
    {
        "id": 244,
        "text": "The most ridiculous service I've ever seen, after waiting for 20 minutes no one seated us, and when we went to the front desk, the lady sent us back to the door. After another 5 minutes we decided to leave. The funny thing was that there were no one waiting to be seated ahead of us. And when you tell them, they just ignore you, waiters walk by staring at you and ignoring that you are waiting for long."
    },
    {
        "id": 245,
        "text": "If you live in West Philly definitely go to Cedar Park you will not be disappointed. The weekends are crowded so be warn you may be standing in line for a table"
    },
    {
        "id": 246,
        "text": "Amazing food. Great service. I had the veggie sandwich with homefries. Friend had the salmon with cream cheese on a bagel. Other friend had veggie omelette. Everything was perfection and great priced! Very clean and tidy area. Will definitely come here again!"
    },
    {
        "id": 247,
        "text": "Really like it here - food is good, affordable, and both the food and service are solid and consistent. Love the veggie omelet and French fries!"
    },
    {
        "id": 248,
        "text": "Went here after reading reviews on Yelp. Went there as a party of 4 for breakfast. It was everything the reviews said it was. Ordered chicken and waffle - Great! We also ordered Eggs Benedict, omelet, and the hash browns. Huge portions, great taste, and worth every penny of the very reasonable prices that won't break your bank account. We will be back - soon!"
    },
    {
        "id": 249,
        "text": "Something has gone horribly wrong at the CPC. We used to be regulars, every week for breakfast, but a few months ago, something changed. The service, which had been brisk, efficient and friendly, became inattentive and lackadaisical. The food which had always been generous, well cooked and tasty, became skimpy and poorly presented. \nToday, we decided to try our old favorite again. When we came in there were many empty tables, but it took a minute for someone to acknowledge us and allow us to be seated. \nWe sat at our table, without menus for five minutes, while several wait staff walked in circles around the restaurant. A pair was seated to our right and one waiter, gave them menus, and came back to take their drink order and then brought them their drinks. \nWe still waited to even be given menus. My husband finally went to the front and got us menus. We still had not been addressed.\nAt 15 minutes of waiting for ANY kind of service we left. \nSo sad, we really used to love to see our regular super friendly and fast waiters and eat and inexpensive quick breakfast, but no more. \nCPC, get it together and hire a decent waitstaff again!"
    },
    {
        "id": 250,
        "text": "I went with some friends for breakfast this past Sunday. I liked the breakfast I ordered, scrambled eggs with sausage and home fries.  I had to call over the waitress to get a menu and take our order, but once that happened we were served promptly.\n\nIt is a small place and was busy on Sunday morning.  I'd go back again."
    },
    {
        "id": 251,
        "text": "Breakfast was great.  Nice quaint, clean spot, service was good and food was great.  They have a good menu and good location.  \n\nI wish I could give it 3.5 stars but I can't, only whole numbers here!\n\nI didn't give it four only because I specifically asked for spinach in my great tasting omelet and there was none and not once did the waitress/server come and ask how our meal was so I never really got a chance to tell her.  I was going to flag her down but hubby told me not to, so I obliged because the food was so good... besides who sends the food back.\n\nI would surely revisit again and this time get spinach in my omelet.  Hubby and daughter had french toast which was delish, and their homefries are banging!!!"
    },
    {
        "id": 252,
        "text": "I had a delicious breakfast on a busy weekday morning. The food was good, especially the waffle. Coffee was good. It was very busy for the time of the morning. I will definitely be back if I am in the neighborhood again."
    },
    {
        "id": 253,
        "text": "Too bomb! I've been looking for a breakfast spot in Philly for a minute and I think I've found the best one. Everything was good, the waffle was a little to thick for my liking and lacked taste but it could've been because it was to-go (I noticed pancakes and waffle are best when fresh off the pan). The veggies home fries is my new fav and the eggs were cooked exactly how I wanted. Will definitely be back!"
    },
    {
        "id": 254,
        "text": "Five. Star. Situation. Philadelphia is fortunate to have such a well-run, top-of-the-line service, and delicious food. \n\nService:\nThere was a short wait when we came early (8:45/9am). We needed seating for 7, and were informed we'd need to split up. To our surprise, she made space for us and was very attentive to everything we needed for a great meal experience."
    },
    {
        "id": 255,
        "text": "What an absolutely wonderful spot. If you're looking for a classic breakfast joint this is it. Service is consistently friendly and helpful, the food is reliably great, and it's incredibly reasonably priced. I've been here several times now (I recommend the waffles) and it's fantastic."
    },
    {
        "id": 256,
        "text": "Stopped in today to grab breakfast with the hubby, this is out second time having breakfast here but first time eating in. The service was very slow, I mean slooow. We were told to find a seat anywhere it was empty and once we did it took at least 15 min to get acknowledged. We asked for OJ and a Ice tea that took an additional 10min and we still didn't have menus. Once we got out menus we immediately placed our orders and began to wait..... it took almost 45 min to get our food and get this not everything came out on time!  Our server was not attentive at all, she forgot several things we asked for. She never asked were we okay, or how we was doing. The food is good, but the service is horrible. They should either hire a hostess, manager, or more servers. And the young man cleaning the tables was wiping each table with the same tag and not thoroughly cleaning them. I won't be returning in the future though."
    },
    {
        "id": 257,
        "text": "All I am going to say is: chicken and waffles. I am sure other food on the menu is amazing, but where else can you get a generous portion of chicken and waffles for $8.75? Dine in service is efficient! I have not done take out here."
    },
    {
        "id": 258,
        "text": "We've been here three times in the last week and couldn't be happier to have moved into a neighborhood with such a great, cheap breakfast place that opens early. The portions are large and the food comes out quickly. The inside is clean and the wait staff is always nice. Coffee refills come frequently as well. We will be eating here a ton!"
    },
    {
        "id": 259,
        "text": "Mrs Hillary Clinton literally came to Cedar Park Cafe and took a picture with me and my dining friends!!! What an amazing experience!! I never been soo excited to share this moment with my fellow Yelpers and write a review!\n\nSo we knew nothing about this moment, this was just a typical Brunch Chronicles day where me and my co workers select a place to have brunch. So I randomly choose the Cedar Park Cafe and obviously Mrs Clinton did too lol!!\n\nCedar Park Cafe is a community gem! It offers friendly staff, fast seating, delicious brunch and a opportunity to dine in a diverse setting! \n\nI ordered the meat lovers omelette, grits, and whole wheat toast which was all delicious!! Towards the end of our dining we saw these men in suits looking serious scooping out the restaurant we was then told not to leave until the guest arrived, however we had no idea who it was then low and behold Mrs Clinton walks in she was friendly and shook everyone hands!!\n\nCedar Park Cafe not only do you offer delicious food but you will now go in history as being apart of the 2016 election!!"
    },
    {
        "id": 260,
        "text": "Super solid breakfast/brunch at an incredible value! I dined here a few years ago and recently ordered breakfast for 2 adults and 2 teen boys. Everything was delicious and plentiful. I LOVE the veggie home fries, they're full of veg & perfectly cooked potatoes. You do have to season them because I taste almost none but man salt, pepper and a dash of sazon wakes it all up. There was enough food for 4 and we were stuffed at $35 it was a steal. Everyone was satisfied, place is solid! Give it a try."
    },
    {
        "id": 261,
        "text": "This place is great for what it is -- a no-frills diner with good, cheap food.  From the clientele it looks like everyone in the neighborhood feels welcome.   Waitstaff has been a little ditzy every time we've been, but always very friendly and helpful.  This place fills a need we have and it does it well.  I hope they're in business a long, long time."
    },
    {
        "id": 262,
        "text": "This place is a fantastic little breakfast place. I would not call it a \"brunch\" spot since the menu options, outside the chicken and waffles, are pretty basic. BUT the chicken and waffles at this place are insanely delicious!!\n\nI've have my fair share of fried chicken in the south, and this chicken was something special - not exactly better - but a different flavor, and a very tasty flavor at that. And for $7.99 what an extraordinary deal. My one gripe is that this place loads the butter directly onto the waffles and its a LOT of butter - so I guess my advice would be to ask for less when ordering or ask for it on the side.\n\nI also think there is a $10 credit card minimum, helpful to know."
    },
    {
        "id": 263,
        "text": "This cafe is local favorite and offers basic comfort food. The chicken and waffles is definitely the most popular dish here and you get a decent amount of food for the price. I ordered the French toast, sausage, and egg and it tasted great as well. \n\nThe restaurant gets packed especially during brunch hours and the service can be really slow. The waitress I had was very kind and courteous, but I saw other customers wait a very long time for the tables to be cleaned and for them to be seated. The restaurant has great food, but the service could be improved."
    },
    {
        "id": 264,
        "text": "I was there yesterday . It was very cold inside! The food was not that good ! I hate that they put the butter on ur food for you instead of you do in ur self! This is cost saving but customer losing! How do u know how much I want??? Why do u charge for refills on coffee?? Do you give the customers any reason to come back?"
    },
    {
        "id": 265,
        "text": "Generous portions\nFair prices\nTasty food\n\nCedar Park is casual, comfortable, and convivial. I've been on two separate occasions for breakfast - once with a friend, and once with my kids. Each time, everyone left stuffed, satisfied, and happy. \n\nThe menu runs a good gamut from basic eggs, hot cakes, and bacon to creamed chipped beef on toast points (a personal favorite). There are even pork, beef, OR turkey scrapple offerings. For a tidy little breakfast, expect to pay ~$7, and maybe $12 per person for more sides and fixin's.  (Note that credit/debit cards can only be used on checks of $10+.)  Juices are the bottled kind, and the coffee's fine. Service has been friendly and courteous, timely and arm's length. \n\nThis is a recommended breakfast haunt if in the vicinity (or looking for some good scrapple variety!). \n\nRecommended."
    },
    {
        "id": 266,
        "text": "Went here for breakfast and the food was not great. I was served a cold Belgium waffle, lukewarm sausages and home fries. Informed my waitress the waffle was cold, she took it, and returned with the same waffle that was heated mostly likely in the microwave. The only good part of my breakfast was the iced tea. I will definitely not be returning."
    },
    {
        "id": 267,
        "text": "Great food, friendly service!\n\nI went there this week with my girlfriend to grab some brunch.  We wanted to try something different from our usual eyehop (sic).  \n\nWe walked in and were told to sit wherever we wanted, a server came to us immediately, she was friendly; she got our drinks and took our orders.  The food came out quick and tasted DELICIOUS.\n\nI like that they had many options for people who do not eat pork (many restaurants under-estimate just how many of us non-pork eaters there are out there).\n\nIt sounds weird, but I am impressed with the fact that we got our food right away.  In 90% of restaurants I've been to, there is an inexplicably large gap in time between our order ticket being submitted and my food getting to me.\n\n My one issue (which is very minor) is I wish the server asked how we found the meal during the half-way point, which is standard practice. But other than that, this place is great.\n\nI would definitely recommend it!"
    },
    {
        "id": 268,
        "text": "This is hands down the best cafe in town. They have great servers, easy menu, delicious choices & the best chicken and waffles for $8! Love it!"
    },
    {
        "id": 269,
        "text": "loved the chicken and waffles here! the chicken is perfectly seasoned with a little bit of spice in the breading and the waffle comes with several pats of butter and a dusting of powdered sugar - such a treat! douse that baby with maple syrup and enjoy."
    },
    {
        "id": 270,
        "text": "I'm a classy woman and sometimes classy women want to have Eggs Benedict for lunch with Veggie Homefries. Cedar Park Diner appeals to the classic grubber in all of us. When I meet friends here for brunch I feel like things are going well in life. I'm eating good food in a beautifully renovated Cedar Park space. The food is perfect. The waitress is nice. The water has lemons. The patrons are happy. Life is going well. The special thing is the diner makes the whole neighborhood look like life is going well."
    },
    {
        "id": 271,
        "text": "Best chicken and waffles ever! Also try their dankwich!  Great service and consistently delicious food! Highly recommended!"
    },
    {
        "id": 272,
        "text": "This place was simply delicious! There was a wait when we arrived but it didn't take very long to get a table. People willing to wait outside to eat is usually a good sign and it definitely was here! I got the Benedict with veggie hash browns. It's like $1.75 to add veggies to your hash browns  but it is so worth it! The service was great, everyone was efficient. It was so good that I had to compliment the servers to the owner. I would definitely come back, in fact- if I lived here, this would be my regular spot!"
    },
    {
        "id": 273,
        "text": "We walked in around 1pm on a Saturday and we were immediately seated. The waitress was friendly and the food came fast."
    },
    {
        "id": 274,
        "text": "This is my go to spot for a quick and warm meal. I love getting their pancakes and their turkey bacon."
    },
    {
        "id": 275,
        "text": "Been in philly for three days with my wife and best friend for made in America and have been raging super hard so we came to this place to recharge. After long but well worth the wait dilemma of which foods to eat it was decided I was getting a #9 with onions and mushrooms bc you know shoot your shot. Anyways this place is great they should be looking for investors to expand and remodel don't be scared of growth. Great service very polite"
    },
    {
        "id": 276,
        "text": "One of my favorite brunch places out this way. Large portions at a very reasonable price."
    },
    {
        "id": 277,
        "text": "I've walked past Cedar Park Cafe a million times and had never made my way inside - until a few weeks ago on a snow Saturday morning.\n\nWhat a wonderful, neighborhood spot. Extremely affordable with huge portions - it's reminiscent of a family diner, but plucked down across from Cedar Park in west philly.\n\nUpon my first visit, I went for a classic - just 2 eggs (over easy), some crispy scrapple, 2 pancakes, and grits. Everything was as it should be - messy, delicious, and greasy (in the best way.)\n\nMy partner got the Chicken & Waffles and I was super jealous - the chicken was extremely crispy, and the waffle was perfect.\n\nReally can't wait to come back... :)"
    },
    {
        "id": 278,
        "text": "For the price, it's the best breakfast option in the neighborhood. There's usually a wait but the line moves quickly. I've never had anything besides breakfast food but it's awesome. My girlfriend and I usually split the corned beef hash and the fried chicken/waffle. I believe the fried chicken is around $8 and it's incredible for that price. I've had fried chicken at other restaurants in the area for double the price and it hasn't been as good as Cedar Park. Go get this chicken."
    },
    {
        "id": 279,
        "text": "Ordered a take out burger. They said it would take 10 minutes. It ended up taking 45 minutes. The burger was over done and there were literally 5 fries. There was no apology or effort to make up for there shit service. Never going back."
    },
    {
        "id": 280,
        "text": "I've never been to a place with worse customer service. Waited in line for an hour for a table meanwhile there was at least 6 open tables that just needed to be cleared off. After asking about it, I was told they were closing off the back even though there was about 3 groups waiting to be sat. Decided to just leave and eat somewhere else.The first time I went there the food was okay but we got there at 2:00 and waited 30 minutes for our food. They started flipping chairs and cleaning up around us even though they don't close until 3:30. Most likely will never return."
    },
    {
        "id": 281,
        "text": "BEST breakfast place in west philly.\n\nFood.....good home cooking meal, taste great, great portion size and.....best price.\n\nA must order......Chicken and Waffles.  I've also been able to swap the waffles out for pancakes also.  Love that they are flexible like that.  \n\nTheir omelette are great also.  They come with a side of hash browns, which they also give a lot.\n\nPancakes are popular also.\n\nLove that this is a mom and pop place.\n\nI've been here many times and have had many meetings here."
    },
    {
        "id": 282,
        "text": "Best place in West Philly, hands down. It's got everything you want a diner type place to have. Never had a bad meal here. They really care. Only place I regularly tip when I'm just getting takeout. And not for nothing but it's one of the only places I've ever seen in the city that has a truly diverse staff. Everybody kind of gets along. It's reflected in the food. Their chicken and waffle dish is a straight up Black and Asian fusion. Obviously 'Chicken & Waffles' is a southern Black thing but the chicken they serve here with the waffles is a spicy, crispy Chinese chicken. It's incredible and it definitely sets it apart, been going here for 7 years don't plan on stopping."
    },
    {
        "id": 283,
        "text": "I've been here three times in the past month. That alone should say a lot about my feelings for Cedar Park Cafe. My 1st visit here, I went for breakfast with my sister and two nieces, at one of my nieces' recommendation. I loved how bright, airy, and clean the inside was. We had a happy bubbly server, and the food was hot and delicious. My 2nd visit was a to-go. Got a quick breakfast sandwich. Tasted great. No problems.\n\nPrior to my most recent visit, I remembered my niece mentioning that their chicken and waffles were great. I made a mental note to return soon. Last week, I was in the area (well, sort of) for a coat drive that I volunteered at.  I went in around 1:45, and dined alone. Again, my server was friendly and I was seated near the window. I don't know if that window seat was good or bad, because I'm sure passers-by saw me making faces and dancing while I was eating. I'm sure some of you have smiled and danced in your seat while eating good food! That was some of the best chicken and waffles I've ever had!! \n\nCedar Park Cafe has officially been added to the list of favorite neighborhood inexpensive breakfast spots."
    },
    {
        "id": 284,
        "text": "As a contractor I eat out a lot for lunch. I saw the reviews and decided to try it out. As I sat down at the table I noticed how clean and fresh the dining looked. Then came the waitress Tawnya. All business and very efficient. She answered all the questions took our order and brought the food back so fast I thought she had roller skates on. The third time I went there I actually got her to laugh. I the food is excellent and the service was superb. A friend that was with me said she would being her grandchildren back for Sunday breakfast. Great find. Check it out."
    },
    {
        "id": 285,
        "text": "Sunday morning in University City/West Philadelphia.  I was hungry and happy I ended up in front of Cedar Park Cafe.  I was really happy I kept reading the menu until I found the Danwich section.   A breakfast cheesesteak with eggs and hash browns. Everybody's on the good traditional roll together. I do wish everybody got mixed together on the grill but little bite discipline takes care of that.  $7.50, you know I love that."
    },
    {
        "id": 286,
        "text": "Love this place so much and I'm so glad they were able to open back up. There are few things I appreciate more than a good, down-to-earth diner, and Cedar Park fits that perfectly. I have had their chicken and waffles, and agree with other reviewers that it's excellent. But my favorite thing to get is the #1 breakfast combo with eggs, home fries, sausage, and toast. It's definitely a lot of food and it's nothing fancy, but it doesn't need to be fancy because it's so freaking delicious. CP is also very reasonably priced which suits me just fine, and the folks who work there are friendly. Overall one of my favorite places to go out to eat in the city."
    },
    {
        "id": 287,
        "text": "Pancakesssss! Their pancakes are the best I've ever had. They are fluffy, not too sweet, and the texture is just right. Their portions overall is decently sized and shareable. We usually do takeout, and call ahead, so I can't speak on the wait time to dine-in but it does get pretty crowded. This was a spot I had bookmarked for the longest, and randomly tried to one day, and I have been hooked ever since. \n\nOverall I would recommend!"
    },
    {
        "id": 288,
        "text": "The University City area has numerous food spots. This place gets pretty packed during brunch hours, especially on the weekends. As soon as you walk in, you feel a comforting, home-y vibe. There's an eclectic blend of people from hipsters to university students to families who are all coming together for a hearty and delicious meal at a great price. \n\nMy girlfriend and I love brunch, and Cedar Park Cafe has become one of our favorites spots. Our normal order is Chicken and Waffles and the Dankwich, which we split and share. The chicken is fried to a nice crunch with a well-seasoned breading. The Dankwich has several options you can choose from, and it is basically a breakfast platter in a hoagie roll. It sounds questionable, but you won't regret ordering this. My girlfriend also really enjoys the Corn Beef Hash. \n\nCedar Park Cafe is a staple of West Philadelphia as well as in our hearts."
    },
    {
        "id": 289,
        "text": "We got there around 11am on a Saturday and only had to wait about 20 minutes. In terms of service, it's a solid 2 stars. Although they are friendly, they don't seem very attentive. They don't really talk to you or acknowledge your presence until they have a table ready for you. Once we were seated, we waited another 5 minutes to get the menu and then another 10 for someone to take our order. If you don't actively try to get a server's attention, they'll just walk by your table multiple times. That being said.. the food is delicious! The portion size leaves you full and it's very cheap! My breakfast platter (2 eggs, 4 pieces of bacon, 3 french toast) was only $8. I believe the owner was at the cash register and she was very friendly."
    },
    {
        "id": 290,
        "text": "Found this \"hole in the wall\" cafe after arriving in Philadelphia. This was a local joint, there was no big line, everyone seemed to know everyone. It was great.\n\nWe were seated, and looking at the menu they did not have anything outrageous or crazy like larger breakfast places, which I liked. The coffee was hot and the servers were very friendly. I got the corned beef has. While it seemed like the kind you get out of a can, the amount that they gave you was amazing. Basically half of a large plate with two eggs on top, toast, and equal amount of hashbrowns for only 7.99. I usually eat all my breakfast (favorite meal) but couldn't this time. The person I was with had an omelette that was large and looked just as good. If I am ever in town again I will definitely be back."
    },
    {
        "id": 291,
        "text": "Stumble upon this spot while hanging out in Philly, great little hole in the wall place to grab a hearty breakfast with great customer service too. Highly recommend it if you're in the area."
    },
    {
        "id": 292,
        "text": "I visited this place for a Sunday brunch. The place is a bit small and busy on Sunday so you will probably be standing waiting by the door or outside. We were seated probably in 10mins. Our server Sapoea was pretty busy but she was still attentive. I order the platter with French toast. I enjoyed everything! There wasn't any wow factor, it tasted like straight  cookbook. This is basic affordable comfort food for days when you don't feel like cooking."
    },
    {
        "id": 293,
        "text": "Woke up on a Sunday craving pancakes, turkey bacon, and scrambled eggs and didn't want to cook it....so I yelped, found this place and 30 minutes I was there waiting in line to get a seat aaaaand it was worth the wait! YUMMY food, great service, and reasonable prices...this is one of my new favorite places!!!!"
    },
    {
        "id": 294,
        "text": "Love this place. No frills breakfast spot that has all your classics and has great lunch options too. Friendly staff and great prices."
    },
    {
        "id": 295,
        "text": "On any given Sunday morning, Cedar Park will have the most perfect mix of West Philadelphia that I can think of. Hipsters, families, old folks, students.... it's an interesting cross-section of the neighborhood.\n\nFood-wise: probably my favorite no-frills breakfast in Philly! Heaping, throw-down portions, and perfect crispy home fries. Good stuff."
    },
    {
        "id": 296,
        "text": "HOLY MOLY!! This is a must stop if you're visiting. The food was amazing, I'm not the biggest fan of pancakes, but these are a must. The atmosphere was great, the service was even better. I'd had never heard of scrapple so immediately I was enticed. So glad I chose it. The omelette smelled, tasted , and looked so amazing. And my dankwhich was on point!!! Super happy I'm going to be able to come more often now that I've moved to Philadelphia!"
    },
    {
        "id": 297,
        "text": "This is good, basic, inexpensive breakfast. The food and service has always been consistent. It is definitely no frills, but it's clean with a bright atmosphere and the food is more than solid. I've never had a bad meal or experience here. I love their home fries and pancakes especially. My one gripe is the use of the fake butter/country crock spread. Real butter please!"
    },
    {
        "id": 298,
        "text": "Love the food and the fact that this is a sit down eatery in the community. The service is always great from the wait staff to check out. For those who don't eat meat they have delicious salmon cakes. I normally over do it with pancakes eggs salmon cakes and veggie home fries (Sleep please)  Must go!"
    },
    {
        "id": 299,
        "text": "So my kids and I decided on trying this place out. My daughter and I ordered the #9, which is a two meat combo with grits, home fries, eggs and toast.  Food came out fast and everything tasted fresh.  Service was great too.  My son ordered the chicken Caesar wrap for breakfast!  He loved it!  Definitely a return visit."
    },
    {
        "id": 300,
        "text": "Ate here with my family in 2017 and can't wait to be able to eat here again! The chick and waffles are the best I have ever eaten!"
    },
    {
        "id": 301,
        "text": "Cedar Park Cafe is a solid neighbourhood brunch spot.  It's simple food at a good price.\n\nWe've gone for brunch a few times & my fave dish is the veggie home fries, which are nicely fried up potatoes with fried onions and green pepper.   I've also tasted the corned beef hash and creamed chipped beef, both of which are good.  Things I did not enjoy were the fish (dry, overcooked, flavourless) and poached eggs (rubbery).\n\nService is good.  I like how our waitress will call us things like \"sweetie\" and \"darling\" -- it adds to the charm of brunch.\n\n3.5 stars"
    },
    {
        "id": 302,
        "text": "Cedar Park Cafe is still my favourite neighbourhood brunch spot.  I always order the veggie home fries, well done, so that the potatoes are crispy. The potatoes are fried with vegetables like onions, green pepper, spinach, broccoli, and tomato.\n\nThe tofu vegetable scramble is another solid choice if you like veggies, but want some extra protein in there.\n\nI've previously tried the corned beef hash (solid), creamed chipped beef (fine), fish (dry, overcooked, flavourless) and poached eggs (rubbery).\n\nService is good."
    },
    {
        "id": 303,
        "text": "I meant to update this review before the pandemic. My last visit (pre-pandemic) was not as good as some of my earlier experiences.\n\nOne thing I didn't like is that it seemed like the staff was upselling and upcharging without making clear that certain items cost more. For example, I ordered home fries & they asked \"onions and peppers?\" like they're a regular part of the dish. However, there's an extra charge for at least one of those (peppers I think?). It's not a ton of $$, but I'd like it if it were more clearly communicated what was included and what was not. Same thing happened with a particular cheese that was offered and chosen for a sandwich; apparently it cost extra but I didn't know that until I saw it on the bill.\n\nHere's the food report card, I use ^ to indicate a half-star and * for a full star. So, ***^ means 3.5 stars:\n\n****^ Bacon grilled cheese sandwich is very good\n\n**** Veggie home fries are great, especially when they're well done with crispy potatoes\n\n*** Tofu vegetable scramble is solid if you like veggies, but want some extra protein in there\n\n*** Corned beef hash is solid\n\n** Dankwich was not good, it had home fries in it & was all carbs, with pretty much no flavour\n\nPreviously, I've also tried the creamed chipped beef (fine), fish (dry,  overcooked, flavourless) and poached eggs (rubbery)."
    },
    {
        "id": 304,
        "text": "Although this place gets packed, they are quick to seat and serve you. If you don't like lines, try and come as early as possible for breakfast. It's such a great neighborhood spot with great selections, service, and food. Although the menu looks typical, the food is delicious and the portion sizes are large."
    },
    {
        "id": 305,
        "text": "went here wit the hubs from breakfast one day bc of the yelp reviews. very good good. friendly staff. typical breakfast/lunch dinner. its in an \"up and comming\" area of west philly. will return next time we are down there."
    },
    {
        "id": 306,
        "text": "Extremely fast service.  Cleanest diner I've ever seen.  Friendly staff.  Waittress saved me a buck by better explaining the breakfast special menu.  Not too expensive.   Great little breakfast place."
    },
    {
        "id": 307,
        "text": "Just visited because I was in the area and Yelp had it ranked. I was not disappointed. The young lady who waited on us was very polite and attentive (although extremely busy).... I ordered the California Omelette and my lady had the fried whiting and grits.... We were both very pleased and will now go out of our way to return. One caveat.... No off street parking so you may have to walk a bit.... Worth it!"
    },
    {
        "id": 308,
        "text": "So my family and I walked in for lunch and realized that they closed in 30 minutes! We started to think about going somewhere else and the kind waitress told us to sit down and she's serve us. The people here are so nice and I hope other people have the same experience as us!"
    },
    {
        "id": 309,
        "text": "We were visiting the Philadelphia area and looking for breakfast but having no luck. I found Cedar Park Cafe here on Yelp. The neighborhood looked iffy and it was hard to find a parking spot. However we were glad we persevered. The food was well priced, service excellent, really yummy. Our waitress, Janaya, couldn't have been nicer or more efficient."
    },
    {
        "id": 310,
        "text": "While visiting friends in Philly, they insisted we go here for Saturday brunch and raved about it the whole previous day. I'm happy to say that they did not exaggerate! \n\nWe went around noon on Sat, so it was pretty busy and there wasn't much room for our group of six. However, a lovely couple saw our dilemma and offered to move so we could sit at the more accommodating center tables. That basically sums up the demographic here; everyone is so neighborly! We had a great conversation with the family sitting next to us while we waited for our food.\n\nSpeaking of the food, it was awesome! I got the #10, which came with beef bacon, two eggs, and three french toast. I couldn't even finish it all! I was curious about the beef bacon, which ended up tasting pretty similar to pork bacon (aka delicious). It was cooked nice and crispy. While I don't normally put butter on my french toast, it came with butter already on it and was so nice and melty that I may have to change my ways. Perfectly golden and fluffy. It was a great deal for about $8. \n\nOur server Faye was sweet and attentive, and I speak for everyone when I say this visit MADE our Saturday morning. Everyone enjoyed their meal to the max. Looking forward to stopping by by next time I'm in town!"
    },
    {
        "id": 311,
        "text": "Okay so since my last visit I have fell in love with this place. I've only been here about 7 times since the first review and I'm a regular. Great service, great food and on busy days it's worth the wait to be seated."
    }
]