[
    {
        "id": 1,
        "text": "Pleasant place. Great service. Parking can get difficult but roadside parking with a few parking lots are available. Came here for restaurant week. Loved the salads , fresh buttery foccacio bread sticks(we asked for extras), and pizzas. Cauliflower pizza was our favourite wood fire taste to it..delicious. loved the deserts, devoured them. Antipasto platter was good first course but they mentioned roasted veggies as part of the dish but only thing roasted was cauliflower there was olives and roasted red pepper seemed out of the can. Nevertheless very tasty and finished the plate . Pasta was decent not outstanding."
    },
    {
        "id": 2,
        "text": "I wanted to love this place.  I love the location.  I love Garces' stuff.  I went with another couple and none of our food was very good.  The cauliflower and burrata were decent appetizers.  The tuna pasta was sent back.  I got a salad which was ok and my date got the rabbit dish which was pretty small.  Nobody was excited about their food.  Will try again but disappointed to say the least...."
    },
    {
        "id": 3,
        "text": "The waitresses and waiters are perfect the food is great the music is great I love it. Its better than dominos pizza. Very polite people if their were 50 stars i would rate it 50."
    },
    {
        "id": 4,
        "text": "Ok pizza-Margarita pie was burnt! I mean charred. They brought a new one a bit late . Never got bread. Not sure I'll go back..."
    },
    {
        "id": 5,
        "text": "Delicious! 24 is a hot new restaurant in Philly, and they didn't disappoint. We sat on their outdoor balcony seating, which has lovely views of the Schuylkill and University City. The service was very prompt, with great options for cappuccinos and lattes for brunch as well as creative brunch drinks. I ordered the 24 Bloody Mary and it was light and spicy, perfect. \n\nThe brunch menu looked so good that it was hard to decide! I ended up with the wood oven frittata (so much flavor!) and fiancé chose the fig and bacon waffles, such an amazing combination. We are definitely planning on going back for dinner!"
    },
    {
        "id": 6,
        "text": "Good, laid back brunch spot, more casual than Garces' more famous spots (Amada, Tinto) but still with nice, unique touches (menus on wooden slabs, artsy plates, creative cocktails).  The neighborhood is quiet on the weekends during the day, so it's never terribly busy for brunch and there's cheap parking in a lot right next to the building, which also houses Garces' corporate headquarters.  I always get a kick of the large painting in the lobby, done in a traditional Spanish style, of a cat sitting atop a horse.  As far as the food, can't go wrong with any of the waffle plates (this most recent time my wife had the fresh berries, and I had the fried chicken).  The waffles are cooked perfectly and not too dense / heavy.  Great syrup and home made butter.  Service is very friendly.  \n\nThere s a huge bar, too, so I imagine this would be a great spot to grab a drink or fancy pizza after work during the week."
    },
    {
        "id": 7,
        "text": "I work at one of the office nearby and I feel like I see a lot of business people here. I have come for lunch and happy hour and when the weather warms up, am dying to have dinner on the patio. It is weirdly laidback and upscale at the same time. \n\nThe menu is limited to some apps, salads, pizza, cheese/meats. To my surprise, one of favorite things on the menu is the verde salad with grilled salmon ($15). You get a very large salad filled with fava beans, avocado, cheese, lemon vinaigrette. So yummy. I NEVER get entrée salads, just at 24. I have had the Brussels Caesar which my husband loved. It was just okay to me. The pizzas are yummy as well as the polpette and burrata. Oh and their grilled calamari is delicious. Recently, the kitchen toasted it too much but fixed it quickly. \n\nI like that the happy hour has a mix of drinks and food. Bonus that they bring out a complimentary trio of small snacks (fried chickpeas, stuffed pepper, olives). Really cool spot."
    },
    {
        "id": 8,
        "text": "Delicious! We got the roasted cauliflower (amazing) and the calamari to start, followed by the equally excellent Brussel sprouts Caesar, the black pepper spaghetti and the tuna bolognese. Everything was so fantastic and fresh, and our waitress was beyond helpful and friendly. A new place, and a great one. Cannot recommend more."
    },
    {
        "id": 9,
        "text": "Extraordinarily average. Food is just \"OK\" and portions are small and pricey. Service is meh. Restaurant itself is beautiful, and it's not a bad place to grab a happy hour drink, but I wouldn't eat there again. Definitely not one of Jose Garces' better spots."
    },
    {
        "id": 10,
        "text": "We had an early dinner rez at 24 and were seated promptly after a friendly greeting! The menu is great with various apps, a great selection of pizza and pastas, and various mains. We loved the scallops entree and pesto pasta! The pizzas were good but nothing exceptional. we greatly appreciated the service and overall had a great dining experience!\nThe drinks selections were great as the wine list wasn't vast, but we loved every drink we ordered!\nWill be back!"
    },
    {
        "id": 11,
        "text": "This was my second restaurant week stop this go-around and tbh I was v disappointed. It was a true bummer!\n\nSo, my qualms were mainly the food - for starters it was four courses. The first course was an antipasto board and let me tell you, it was a sad excuse for an antipasto board. I was looking forward to it most, but it turned out to be dry and bland. There were little cheese balls and olives and I don't even know what else. I can't remember because it was so forgettable. \n\nSecond, I got the verde salad and it was eh. It didn't have enough avocado and it was also way too bitter. I was so excited for the pasta I ordered, but was again...sorely disappointed. The servings were small and it was extremely garlicky. For dessert I got the \"chocolate cake.\" It came out and my friend said, \"is this cake for ants.\" It was a tiny little circle brownie that you can get pre-packaged at Costco. \n\nI would totally understand if this spot had small portions cus the food was decadent and luxurious, but it wasn't at all.  It was nothing special or tasty. \n\nI did like the aesthetic, although casual, it was also modern and chic. It was located, however, in a weird spot attached to a We Work on 24th and Walnut. \n\nIn all, I probs won't be back and 24 has gotta step up their restaurant week game!"
    },
    {
        "id": 12,
        "text": "A few friends and I came on a Saturday morning for brunch. I was surprised by how empty the restaurant was, given that it was prime brunch time. The inside of the restaurant is modern looking, but with exposed pipes and a hipster twist. We were seated by the large windows in a booth overlooking the street. With the warm September light streaming in, it was the perfect brunch atmosphere. \n\nI ordered the 24 Brunch, which consisted of two eggs (any style), potato hash, focaccia bread, and bacon. Though the individual components of the meal was typical diner-brunch fare, the quality of the ingredients was high and relatively affordable ($10.00). The focaccia bread, shaped into sticks, was thick and pillowy with nice herb flavoring and a toasted shell. The eggs were cooked medium-hard, like I'd requested, and the potato hash was solid, but not anything special. In hindsight, I wish that I had ordered my eggs sunny side-up like my friend, so that I could dip the focaccia in the egg. Relative to the rest of the meal, there was a lot of focaccia bread. The portion sizes were substantial, but not generous. What surprised me the most about the meal was the bacon. The bacon wasn't cooked in any special way that I was aware of, but it was delicious. Bacon has a leg up in being delicious, given that its bacon, but this bacon was melt-in-your-mouth delicious. My other friend ordered the mixed berry waffle, which he reported as \"fruit on top of a waffle.\" He enjoyed it, but wouldn't necessarily pay $11.00 to eat it again.\n\nOverall, we had a nice time. The service was very attentive while we were there and the atmosphere was relaxed. I would come back again for the atmosphere and try some of their other brunch foods, such as the pizza, or their regular entrees."
    },
    {
        "id": 13,
        "text": "I was recommended to try this restaurant while in town for a work trip. For a Monday night, it was pretty slow but I still opted to sit and have dinner at the bar because the two girls working were so friendly.\n\nI started with the Wild Flower and Above the Clouds cocktails and both were tasty. They are the kind of drinks that go down really quick (especially the Wild Flower with the big ice cubes ) but will sneak up on you after a few.\n\nMy starter was the Brussel Sprout Caesar salad. That dish was just ehhhh - I'd recommend trying a different salad as the dressing was bland. My colleague got the calamari and said it was tasty.\n\nMy main course was the Gnudi ricotta pasta... freaking AMAZING. The portion isn't super big but it's a dense pasta and will fill you up just perfectly. I also tried my friends EGG pizza with truffle oil, mushrooms and onions.  The wood fire taste in the crust with the savory truffle flavor was really interesting. \n\nAll in all, it was a great low key, casual spot with a good vibes only!"
    },
    {
        "id": 14,
        "text": "Eggplant pizza was delicious, but service left something to be desired! A group of my friends and I went to 24 one night for dinner! I ordered the eggplant pizza and was able to split it with a friend! They offered us a complementary wine spritzer, which was just okay. I enjoyed the ambiance, but found our server rude. He actually took the menu out of my hand while I was reading the drink menu. I would go back for the pizza!"
    },
    {
        "id": 15,
        "text": "If there was a .5 option I would give this 2.5 but I rounded up because hey, it's the holidays. I went last night with 3 friends. Once we were seated it did take quite a while for our server to come over and she poured us water and then walked away for 5 more minutes (meanwhile, we were definitely ready for drinks from the bar and to order our food). So then she comes back and has a really hard time understanding our order. We were sharing two pizzas (one of the pizzas was the cauliflower and pancetta which we asked for half without pancetta since two people are vegetarian) and we all good our own salads as well. \n\nA few minutes later she came back and asked if we wanted the cauliflower to come out first and then realized she must think we ordered the appetizer which has cauliflower so we corrected her and told the orders again. The salads were good. Two of us had the chopped salad and verde salad.\n\nThe pizzas came and the cauliflower had the pancetta on every slice so it had to be sent back. Once it did come back correct, it was good. Both were decent, nothing great and definitely expensive for a small pizza. Btw, there was no apology at all about the mixup, which bothers me from a customer service perspective. Overall it was an okay experience but I have no plans on returning anytime in the foreseeable future."
    },
    {
        "id": 16,
        "text": "Delicious! We went last night at 7:30pm. I got the Egg Pizza and he got the Pepperoni and we split them. I LOVE that they have KOMBUCHA on tap!!! That already gives 24 a few stars in my book. Service was great; two staff members asked us how we were enjoying the food. The tomato sauce on the pepperoni tasted homemade and fresh. The egg pizza was just so flavorful. I love the crust here, so crunchy but not too crunchy. I will be returning and get a cocktail since I saw that they had all KOMBUCHA cocktails."
    },
    {
        "id": 17,
        "text": "Brand new Garces causal restaurant offering Italian and wood fired dishes. Modern, wood and stone interior. Just opened this week and service was efficient, friendly and no hiccups at all. Drinks well made and delicious. Happy hour specials. We had the buratta which was delicious, the wood oven roasted cauliflower with dukkah, the cacio Pepe and rabbit agnolotti. All small plates, tasty, well prepared and presented. Thrilled to have this new Garces spot in our neighborhood and look forward to coming back again soon!"
    },
    {
        "id": 18,
        "text": "Garces is at it again.  Ordered delivery tonight and only received half of the order.  Claimed they were out of meatballs for one of only four sandwiches on the menu.  No call to ask for substitution, they just assumed the person who ordered the sandwich did not need to eat!  Had same experience with Garces' Rosa Blanca before it went under.  No wonder he is crashing.  But I guess it's my fault.  Fool me once...."
    },
    {
        "id": 19,
        "text": "Really disappointed by 24. Way below the standard I expect from Jose Garces. We had the roasted beets, the taleggio polenta, the wood roasted cauliflower, and the eggplant pizza. The cauliflower was the star in an otherwise lackluster meal. The polenta had no taste. The pizza was the biggest disappointment with undercooked, soggy crust. The restaurant has a similar menu as Barbuzzo and Wm. Mulherin's Sons, but does it much much worse. The pizza is much worse than what you can get at Pizzeria Vetri. I would not go back as for the same price, there are many restaurants with much better food. The ambiance of being in an office building is also very odd."
    },
    {
        "id": 20,
        "text": "The restaurant is nice and the food was not bad however the service was extremely poor. It was a date night and they even had a valentine's special going on. The waiter rushed us throughout.The main course was served immediately with appetizers.  The waiter even offered to take our plates while we were eating and we had to tell him we were not done. We were out of the restaurant in 30 mins. Not a great experience for a date night. Might be good for an everyday lunch/dinner when you want to finish your meals and get back to work/home quickly."
    },
    {
        "id": 21,
        "text": "24 is just OK. The pizza is nothing to shout about and definitely not up to the level of the competition in the fancy pizza realm (Pizzeria Vetri or Stella, or Zavino). \n\nThe server was friendly but did not seem to be at the experience level that you would expect from a Garces restaurant. The check ins with the table were ill timed and frequent. \n\nI'll give them the benefit of the doubt since they opened relatively recently. The decor is awesome and I'm a huge fan of any establishment that has happy hour 7 days a week. \n\nHopefully it improves over time."
    },
    {
        "id": 22,
        "text": "Tried the 4-cheese pizza just to get a sense of how they'd do .. they passed that test with ease - a very thin-crusted pizza (see my photo attempting to show the thin crust). They do a really nice roasted cauliflower, with a very good dressing. Brussels Caesar is excellent, and you can order it without the pancetta. One complaint from my crowd was that the polenta was watery. That might simply have been the one-off for the meal.\n\nSome very good beers on tap - I had the Troegs IPA, can't go wrong with that, served in a very attractive tall glass.\n\nOne down side is that this place has the potential to be unreasonably loud. The evening I was here, we sat toward the front (entrance) of the restaurant, and it was fine, noise-wise. Quieter there, I think, so you might want to request a table toward the door if you want to have a conversation during hours when the restaurant is packed and very loud. Avoid sitting directly under or close to the speakers.\n\nOutdoor seating is a plus, but it's first come, first served. \n\nAnother thing that's great about this place is that you can look out the window at the Sweat fitness place across the street and think about all the working out you'll need to take off the calories!\n\nWill be back."
    },
    {
        "id": 23,
        "text": "Like many other reviews, the service was slow, so by the time we got the plates for the pizza, it was warm at best. I'm sure it tasted better hot, but I don't think I'll ever find out. The hostesses had an attitude problem!  Drinks are expensive relative to pour and other restaurants. We live nearby and hoped it'll be a favorite new place, but no more. The food wasn't bad, but the experience was a turn off. Avoid."
    },
    {
        "id": 24,
        "text": "Excellent lunch on the patio. South Philly salad the roasted peppers and meatballs were all outstanding."
    },
    {
        "id": 25,
        "text": "Went to meet up with old friends for restaurant week at this new place.  The food was pretty good with the 4 course meal, appetizers were the meatballs very tasty and great sauce.  Then I had the pepperoni pizza and the chocolate mouse for dessert.  Weird ambiance for classic Italian menu the music was really weird from hip hop to country really made no sense.  Took forever to get a beer and was not even busy.  Felt like a mix between a food hall as there was a takeout counter next to our table and a pizza place trying to be upscale.  Although the food was good did not like the service or the whole feel of it, kind of a big miss ..there are much better options for just as good if not better food and much better atmosphere."
    },
    {
        "id": 26,
        "text": "I ordered the Verde salad, described as \"arugula, fava beans, bianco sardo, avocado, grilled lemon vinaigrette\". There were, literally, two tiny leaves of arugula and the rest romaine! Not to mention NO avocado  When I mentioned this to the server, he spoke with the kitchen and came back and said \"that is arugula\". WHAT???!!! I know my leaves! Now I never do this but I asked for the manager...I really just wanted to make them aware of what they were serving and what was happening. It got worse. She told me it was supposed to be a mix and it must be \"confusing\" for me. Again WHATTTT??!!! Then I showed her the two tiny arugula leaves I found. She told me the cooks must have grabbed a smaller handful of arugula throwing off the arugula to shitty romaine ratio (I'm paraphrasing). I couldn't even bring up the avocado (or lack there of) situation. Needless to say I will never go back. And probably never go back to any Garces establishment."
    },
    {
        "id": 27,
        "text": "Had a great experience here. Our server, Rodney, was fantastic!!!! He was working 7 tables (that I counted) one was a party of 10 and never once did we feel neglected. The food was great, his suggestions were spot on! I would definitely recommend this place purely on the strength of his service! Don't hesitate to make a reservation!"
    },
    {
        "id": 28,
        "text": "Despite the reviews, we decided to give 24 a try and we are sure glad we did!  It was actually our favorite of the Garces restaurants so far and we've tried several. We ordered many appetizers including a few from the $5 happy hour menu. Meatballs and cauliflower were standouts on the appetizers although all were delicious. We also ordered a few pizzas to share (some of the pizzas are also reduced during happy hour).  Egg and mushroom pizza was terrific and the kids pizza was also very good. The four cheese was not to my taste - too heavy on the blue cheese - but others enjoyed it. We topped it off with gelato - hazelnut was the favorite. Service was prompt and courteous as well. All in all - a nice night out and looking forward to going back again."
    },
    {
        "id": 29,
        "text": "We went to watch the Super Bowl, because based on their website, they had some specials going on for the game. Well, they only have 2 Tv's, so not exactly a good place to watch a game.\nLucky for us the place was empty and we got seats at the bar, right in front of one TV. Bartenders had no idea there were Super Bowl specials, and I had to pull up the website to prove it to him. We had to ask for menus, and flag them down every time we needed a refill. Just awful service.\nWe also had an incident when paying the bill, where the guy seemed confused about multiple payment methods. So he left a pile of $80 cash on the counter, and put the balance on the credit card. So when we asked about it, he pretended he didn't know what to do with cash...So he was just going to leave it by the register?\nI could see if this type of service happened when they were slammed, but there were not many people there. \nNever again."
    },
    {
        "id": 30,
        "text": "Great experience.  Have been here twice now and have had great meals both times.  Service has also been spectacular. Tonight, I called at 5:45 and asked for a reservation at around 6:30 for 6 people.  Open table indicated nothing available until 7:45.  Hostess put me on a brief hold and was able to move a few things around to accommodate.  Server, Rodney, was the best. He was attentive, knowledgeable and accommodating but not intrusive.  We ordered the margarita, pepperoni and cauliflower pizzas; 2 salads; and the calamari. All were great. Highly recommend."
    },
    {
        "id": 31,
        "text": "Had a really nice dinner at 24 last weekend. I was pleasantly surprised to see the restaurant totally full on a Saturday night. I was actually worried it might be kinda dead bc its on a more off the beaten path block of Walnut.\n\nPizza is the specialty here so we tried a couple of pies. I ordered the white clam, which didn't measure up to Pepe's in New Haven CT, but was still tasty. The pepperoni pie with red sauce had great flavor, and was my favorite of the two. The pizza would be perfect if the crust was a little crunchier but it errs toward floppy.\n\nOverall, the vibe here is right. I'd definitely return for the atmosphere alone. Once the weather warms up their outdoor tables with views of the Schuykill and West Philly will be perfect for sipping some wine."
    },
    {
        "id": 32,
        "text": "We had appetizers, salads and pizzas. \n\nThe meat plate was a disappointment, mostly low-end capacolla, with pepperoncini (and its juice) scattered liberally on top. The cheese plate had good cheese but not much variety and served very cold (seemed like it was pre-made and sitting in a cooler). Calamari was very good. It's always refreshing when the calamari is not deep fried. Definitely try the beets. \n\nPizza was very, very good. I mean ... really very good. All the flavors I tried were fantastic. \n\nThe salads were fine. I would have the Verde again. \n\nI was having soft drinks and ordered a Coke (a rare indulgence for me). I was served a cloyingly syrupy brown drink that tasted more like cola than Coke.  I left it on the bar when we were seated and had water with my meal. There is no reason for an establishment of this caliber to serve such shitty soft drinks. \n\nAll in all, it was a perfectly acceptable pizza party, and I would go back for pizza."
    },
    {
        "id": 33,
        "text": "Food is very very good. Our party of 6 shared 2 salads, 2 apps, 1 pasta and 2 pizzas. Loved all of them. Salads were really great: South Philly Chopped and Brussels Sprout Caesar. Cacio e Pepe was terrific. Clam Pizza and Egg Pizza were fabulous. Perfect flavors and texture. The Burrata was not a showstopper (lacking the gooey cheese as I prefer, but it was fine).\n\nService was spotty. The wine and cocktails took longer than expected, and the server who brought our coffee, was rushed and spilled a few hot drops on my friend's pants."
    },
    {
        "id": 34,
        "text": "Sat at the bar with my wife for a quick dinner after she got home from the train.  Food was ok service at the bar was worse.  Waters weren't refilled, drinks weren't either, bartenders seemed too interested in talking to their friends and just generally did not care.  We weren't asked how our food was, nobody came by to clear our plates long after we were done.  This is the second time we had been here and both times I gathered this kind of attitude from the bar.  It's a shame because I really like the concept and am always up for pizza on a Friday night!  But I will never be going back."
    },
    {
        "id": 35,
        "text": "Waited for 42 minutes when we made a 9 o'clock reservation. Not impressed, so we didn't stay.  Menu looks good so there is a possibility of giving this place a second chance. But not a big possibility."
    },
    {
        "id": 36,
        "text": "Great place for a family dinner. Pizza for the kids. Pizza and cocktails for Mommy and Daddy. Our family definitely enjoyed coming here. Great atmosphere. Our waitress kinda disappeared towards the end of the meal and someone else took over after we tried to find her. She had some training to do. Other then that everything was pretty good."
    },
    {
        "id": 37,
        "text": "I order a pizza from there, it wasn't going to be ready for almost an hour later but I live close by so no biggie. I arrived a little over 10 mins before my ready time and was told it would be ready in just a few mins. I sat and waited and waited and waited. Finally over fifteen minutes after the time I was told it would be ready I approached the counter because another pick up person came in and was immediately handed his meal. I asked if my order was ready and was told not yet they got a little backed up, but then the server sees the pizza box that had obviously been sitting there awhile and says oh here it is! Then hands me a cold congealed pizza that was very small for the price and looked pretty bad. (Note, place was not busy AT ALL).\n\nIt wasn't so much the fact that the pizza was forgotten until I said something, it was that no attempt was made it fix the obvious screw up. Things happen and I am a reasonable person.  They could have said sorry we messed up, let us make you a fresh one, or give me my money back or even just apologize. They wasted my time and my money and seemed perfectly ok with sending me away with a subpar product and a subpar experience. Too bad too because I live really close and was hoping it could be a regular spot. Whomp whomp"
    },
    {
        "id": 38,
        "text": "Food is great, service is beyond slow. I've gone twice in a short period of time. One was sitting outside and one was takeout. First time, they served us food before they gave us silverware and napkins (had to ask several times for each). They also served an entree 20 minutes after the other two were served (again, we had to check in a couple times for the last entree). The second time I was only picking up a pizza. I wanted to give them a second chance because the food was so good. I showed up a little late knowing the slowness and still had to wait an extra 10 minutes (total of 30 minutes late). I love garces and the staff is super friendly but not sure what's going on with the efficiency."
    },
    {
        "id": 39,
        "text": "Visited 24 for Restaurant week. Not the usual area that we would go in the city but we were last minute on making reservations and we are picky eaters. It was a more casual menu compared to some for restaurant week but the portion sizes were big. We had a Carbonara pasta and a margherita pizza. Both good sizes to share and very tasty. Cozy environment and the bar looked like it would be fun to hang for a couple drinks. Will definitely be back for the bar and the full menu."
    },
    {
        "id": 40,
        "text": "There was a lot of hype leading up to my meal at the new Jose Garces hotspot, and man-oh-man, it did not disappoint! Great location next to the river, and although I didn't sit outside, there appeared to be a fantastic outdoor seating section with a modern and stylish atmosphere. We tried everything from pizza to eggs. Each entree was more delicious than the last! Definitely worth checking out if you're in the neighborhood. Another menu and restaurant that the Garces Group knocked out of the park!"
    },
    {
        "id": 41,
        "text": "Updated review: I've been here several times now since my initial review and the service kinks seem to be ironed out, for the most part. The food and cocktails remain interesting and delicious. I recommend 24 for lunches and happy hours, or for a laid back dinner out."
    },
    {
        "id": 42,
        "text": "After recognizing earlier in the day all the reservations for 24 were taken for the rest of the night, I passed by the restaurant later on the evening after going to World Cafe Life and was amazed to see some open seats.  My friend and I shared tasty food: Margarita pizza , which had San Marzano tomatoes ,extremely fresh basil and excellent mozzarella cheese) and Pesto Pasta(fettuccine must have just come out of  pasta maker machine ..it was that fresh).  I will return and be adventurous with clam pizza next time."
    },
    {
        "id": 43,
        "text": "Tried 24 for the first time last night. We happened to be in the area (otherwise it's a bit out of the way) and decided to try it. Our first impression was set by the hostess who pretentiously told us there was a 30 minute wait without checking the tables. Since we had walked past some empty ones outside, we asked about them. We were promptly seated after that  But our waitress was really friendly and made up for the hostess. \n\nWe tried the cacio e pepe and pepperoni pizza. Both were good but a little too spicy IMO - and I love spicy food! The service was really quick and we had a great view of the river on the patio. Not sure I'll be back but happy we tried it."
    },
    {
        "id": 44,
        "text": "Went here for restaurant week. The appetizers (cauliflower, cheese, peppers) were served cold. The 4 cheese pizza was really good except for the blue cheese! The cauliflower pizza was just okay. Ended with chocolate mousse topped with a pistachios whipped cream. Also got lovely warm bread on the side! Paid $25, including gratuity."
    },
    {
        "id": 45,
        "text": "Wasn't a fan. Normally love Jose Garces restaurants but this one was a miss. They clearly just opened and I felt like we were test dummies. I ordered a Bellini off of the happy hour menu which was awful and requested a different drink. The waiter took my Bellini and gave me the wine I requested but still charged me for the Bellini! Why did he take it away? I didn't ask him to... the pizza was charred and nothing special. Zavino and Pizza Vetri do a better job. Also ordered the meat board and asked which items had beef as I don't eat beef. The waiter said two items had beef and two did not when the board came out 2/3 items had beef in it. Will definitely NOT return and will reconsider before going to other Garces restaurants again"
    },
    {
        "id": 46,
        "text": "I had really high hopes for 24. Being attached to Jose Garces one shouldn't expect less. However, brunch today was definitely lacking. First  one of the more popular dishes was not available, poor planning on management's behalf. 6ABC featured a special meal deal for brunch this weekend. One would think that management should have ensured all items for the very limited brunch menu was available, but it was not!!! Our server was not the best either. Lacking in the professional appearance category and when my husband asked for salt and pepper he recieved 2 salt grinders. Our server never returned to inquire how the meal was going after our first few bites. \nAll of this and my husband and I were the only ones in the restaurant, so it can not be chalked up to being busy. WE WILL NOT BE RETURNING! \n\nWhy 2 stars you ask... because at least what we were actually able to order did taste good."
    },
    {
        "id": 47,
        "text": "They describe this place as on the river, but your outside view is of a parking lot, and your view from the booth is of the gym across the street...not quite what I was expecting. \n\nThe service was good but the menu leaves a lot to be desired. The wine list was pretty unexciting. I was excited to order the caccio e pepe, but it was almost inedible because it was so incredibly salty. I felt like I was chewing on whole salt granules. Overall I was unimpressed."
    },
    {
        "id": 48,
        "text": "Mediocre food, overpriced for its quality. The pasta we had was too salty probably because the cook didn't know guanciale is already salty and then added too much extra salt. Won't come back."
    },
    {
        "id": 49,
        "text": "I went back to 24 last night and got the Egg Pizza that had Taleggio, Black Truffle,Wild Mushrooms, and Oregano. Service was great again, and I like the casual vibe inside. The egg pizza was very flavorful , and I loved the hint of pepper that I tasted. I will definitely be returning for more casual bites here."
    },
    {
        "id": 50,
        "text": "Food was not horrible but the service was. We went with some friends who live down the street and had the kids in tow. \nEveryone order and the apps come except mine.  I wait. I wait some more until I ask our waiter if he has forgotten my appetizer to which he replied, \"no\". \nI tried one of sons meatballs and had half the meatball on my plate. The waiter comes to remove everyone's appetizer plates and takes my fork and begins to take my plate. I politely said I was finished and he says I wasn't eating it ( not fast enough for him obviously probably bc I am attending to my 2 yr old)\nWell, the entrees come and he brings my appetizer (with my entree) but says nothing. Just drops it off with no explanation or apology. \nI taste my blah appetizer and am trying to feed my son when our so-called waiter comes back (we're ten minutes in to the entrees) and asks if he can box up my entree, which I haven't touched. I inform him that I am trying to feed my son and have not yet had a chance to even eat it. WTF? Get a clue! I'm attending to my son. The restaurant is packed with kids so this shouldn't be new to him. \nWait staff are the face of a restaurant and this one failed."
    },
    {
        "id": 51,
        "text": "Just got back from dinner. Service was friendly but it felt like the server had no prior experience . We had a hostess seat us, a woman pour us water and then a waiter come over and apologize about the mixup without us even knowing there was a mixup. \n\nHe proceeded to write our order on small pad of paper and then completely forget to order our appetizers when our meal came out. The food was really good. I ordered the rabbit pasta which as you can see is four raviolis for $16. I would come back again. Good addition to the area."
    },
    {
        "id": 52,
        "text": "Another great spot by Garces.  Good to see that he hasn't turned into another celebrity chef, opening restaurant relying on his name.  \n\nI came here for lunch and happy hour. \nThe staff was friendly and price was reasonable.  The open kitchen and brick oven and decor was very welcoming.  They  also have a cute patio seating outside.  \n\nThe drinks are good, typical Center city price.  We had a bunch but they were all decent. They have mad in house infused drinks that's not on the menu so also ask because you don't know what you might be missing. We had a jalapeño and mango infused tequila \"something\" and that was Delish. \n\nWe had pizza because our friend raved about it,  Margherita and pepperoni.  They were both great.  If you go during Happy hour it's only $9 which is a great deal.  They also have a great hh selection of other things as well.  Food and drinks- can't get better than that.  \nDuring happy hour they give you a snack w chick peas, olives and kind of a fried ball (I say they crack balls) because omg they are so good.) they're filled w pepperoni, cheese and wrapped in what looks like a cherry pepper then fried.  Holy smokes, they're good. I could order a platter and eat it as a meal.  \nWho ever thought of that, great job. I would go again just for those fried cheese balls and your pizza; but since everything was so good I would order other things to try off the menu on my next visit. \n\nBonus: The parking is great around that are"
    },
    {
        "id": 53,
        "text": "I've never experienced such rude waitstaff in my entire life. We were sat by a hostess after a few minutes but both waiters continued to ignore us even though we tried to order. They did not give us water or plates or menus, and even though they said excuse me and tried to get their attention, they blatantly ignored us. No one in my party has ever seen anything like this before. I do like 24 for the food but this service will make sure we're not coming back."
    },
    {
        "id": 54,
        "text": "Dined here for the first time tonight, enjoyed it very much.\n\nWe were greeted & seated quickly.  Then there was a long pause, bit of a service glitch.  But after that our server Kara was attentive, professional & friendly.\n\nVibe:\nLively place, great mix of folks, families w/ kids and some birthday parties too.  Open kitchen with a busy pizza oven.  Stylish and a nice deck overlooking the river (we stayed inside for the AC).\n\nFood:\nWe got appetizers, salad & pizza.  The roasted cauliflower, Philly chopped salad & cheese plate were great.  Could have stopped there, but wanted a pizza, and their version of a pepperoni is excellent.\n\nDrink:\nGreat selection, my wife enjoyed her cocktail, and my Yards Pale (local) and a tap wine barbera  were nice with the food.\n\nService:\nVery good after a slow start."
    },
    {
        "id": 55,
        "text": "I came for a work event with a preset menu. Everything was good, and we tried a lot. I ate the cauliflower even though I don't normally like cauliflower. The pizza was pretty good. The burrata filled with pesto was very nice. The salad was OK although the dressing was a bit weird. We had a little putting cup for dessert, nothing to write home about but pretty good. Basically the food was all good, tasty, but not particularly earth shattering or groundbreaking. So the food gets a solid 3 to 4 stars. But the wait staff was excellent bumping this up to a four for sure. They were staff of a couple of people serving our large group, and once they got their rhythm down they were really fantastic and kept everyone happy and topped up on drinks or whatever additional things everyone needed. They were extremely friendly and obliging, and made for a pleasant dining experience that stood out."
    },
    {
        "id": 56,
        "text": "Do not waste your money there on resturant week. The food is on average and there is no service there. We have spent $37 per person(include tax and tips) on resturant week lunch. We only have ordered two glass of wine and a beverage in addition to the fixed lunch menu. The glass wine is so little! It should only be half glass at other places! \n \nVery diappointed! We will never go there again."
    },
    {
        "id": 57,
        "text": "Went here for a company Christmas party and loved it!  While our menu was limited to what the company selected, I can vouch for the following:\n\n-Roast red peppers w/ goat cheese and pine nuts were amazing, served with garlic bread strips.\n-Toastinis with crab meat and avocado could have been given to me all night and I would have never complained.  Wow, amazing dish (I had 4!).  I believe they are appetizers (?) or they may simply have been for this specific event.  In either way, try them out if you have the opportunity!\n-Pizza I tried: pepperoni (classic, not too much sauce, slightly singed pepperoni which is the proper way to eat it!), Egg pizza with truffle oil sprinkled over top was AMAZING, Margherita pizza was also pretty good, but not my first choice, Four Cheese which was a great lighter option.  The pizzas served at our party were smaller and I'm not sure if that's the size they are normally - but if so, they are good either as an appetizer or a personal dinner pizza.  They aren't too heavy or overloaded with toppings so you won't leave feeling too full.\n\nAs for the bar - so much room with a few televisions to catch your favorite sports event.  Their beer and wine selection is alright at best, I would like to see some more craft specialties since craft beer and artisan pizzas seem to jive so well.  This is a full-service bar so there are also cocktails available, a little of something for everybody.  \n\nOverall, I'm really excited to head back to this place for a casual dinner.  It's an interesting idea because there is a quick order counter but it's also a full-service restaurant.  I would imagine in the morning you could run in and grab some breakfast and a coffee and be on your way to work, then come in for happy hour at the spacious bar then transition to a table for a sit down meal.  I love the versatility of the space and Garces is usually an great experience. Try this place out!"
    },
    {
        "id": 58,
        "text": "Absolutely, a great place for drinks & delicious food. We had the pizza, pasta, roasted peppers, and the best cheese board ever!!!! This is a must try place and there is plenty of parking..."
    },
    {
        "id": 59,
        "text": "This is the best pizza that I have eaten in Philly!! In addition to the pizza we ordered the brussel sprouts salad with salmon, calamari, and pesto pasta. All dishes were delicious and served in a timely manner!! We will definitely return!"
    },
    {
        "id": 60,
        "text": "I wanted to like this place so much but it really did not live up to any of the hype I created for it in my own mind. \n\nThe good: The waitstaff was welcoming, kind, and efficient. We didn't go long waits in between courses. The decor was pretty nice too. It felt like a cozy chic cabin. It had TVs and the kitchen area was open and you can see. \n\nThe bad: the food was underwhelming. I got the calamari (which is not fried), the four cheese pizza, and the pistachio dessert. I really didn't feel like I loved any of it. The calamari was nicely cooked but just really bland. The sauce it was with was good and probably the best part but as soon as my waiter saw I ate the calamari he took the plate with all the delicious sauce. That was bummer. \n\nThe pizza was good except there is absolutely no need to put blue cheese on it. It really made it bitter and frankly inedible. I'm surprised so many people liked it. I can think of ten different cheeses that would have been better than blue cheese for that fourth cheese. \n\nThe dessert and drinks were forgettable. \n\nThe ugly: you know this restaurant is positioned right over the river and that was a big draw for me. However over half the restaurant has little or no view at all. Our view in the booth was of people sweating in the gym next door and various construction cones. My table mate had a view of the offices that were located in the building. That was a hugeeeeee let down. \n\nAll in all: I probably won't be back but you should definitely give it a try at least once."
    },
    {
        "id": 61,
        "text": "Came here after a night out. The pizzas were just okay and actually a bit bland - really hard to compete with the massive range of better artisanal pizzas around the city. You're really just paying for the name brand. The staff was very friendly and prompt though, and they stayed open late for us."
    },
    {
        "id": 62,
        "text": "Traveling from out of town and thought I would give 24 a try.  Food was okay, I thought the crust of the pizza was really thin and flimsy.  Service wasn't the best and their wait times for food could be improved.  We spent almost an hour waiting for food."
    },
    {
        "id": 63,
        "text": "I came here for a Sunday brunch with 3 people so we made reservations. The food was great, we split two pies, the four cheese and pepperoni, these were awesome, thin crust. We got the berry appetizer that was supposed to come with a passion fruit syrup, but it was very clearly just a plate of berries from the fridge, for 8$? Total waste there. And pretty sub par service when it came to getting our drinks etc. But the pizza, waffle dishes and views were pretty great. I'd still recommend."
    },
    {
        "id": 64,
        "text": "Jose Garces's newest venture in Philly is a pizza emporium/Italian restaurant in the new 2401 Building on Walnut Street where his culinary empire is headquartered. The restaurant is appropriately named 24.  This is a restaurant literally overlooking the Schuylkill River and University City and I think undoubtedly in warmer weather the outside terrace will be its strongest feature.  For right now in winter, the action is focused inward.  It is a modern open-kitchen space with a large bar area.  I recently stopped in to try the Four Cheese pizza.  The cheeses are Manchego, Mozzarella, Royal Blue Cheese, and Parmesan. It was served on top of a La Valle Tomato Can pedestal.  The pizza was indeed good - especially with the addition of hot pepper.  The crust is a bit on the chewy side and I would def replace the current knives presented with sharper ones.  At times I felt like I was sawing to get through the crust.   Prices are slightly on the higher side (It is a Garces establishment) so Happy Hour is a good deal.   The bar service was very efficient and friendly.  But I'm not sure this place will truly shine until the outdoor deck can be utilized!"
    },
    {
        "id": 65,
        "text": "This pretty new restaurant is a great location for affordable food with a great atmosphere. Theres a bar in the center/back of the restaurant that has wines and beers on tap.There's a little deck in the back to sit outside too. It's always pretty crowded in here so make that reservation before coming. They have affordable appetizers, we got burrata(like a mozzarella cheese) that came with a generous portion of both cheese and bread. The salads are also really good though pretty heavily dressed. Pizzas are also generous portions and pretty good."
    },
    {
        "id": 66,
        "text": "I've been wanting to try this place out and especially for Happy Hour. \nI met my friends at the bar and we enjoyed some cocktails and all the pizza options. \nThe service was nice and attentive.\nI really enjoyed the pizza.  My favorite was the pepperoni. Loved the way the pepperoni pieces were a bit crispy on the edges.   My next fave was the four cheeses pizza.  Flavorful.  The Margherita was good too.  It just didn't stick out as much as the others."
    },
    {
        "id": 67,
        "text": "I love 24. Food is fabulous. Service is spot on. The meatballs are amazing and the pastas are among the best i've ever had. I had a very simple one last night - spaghetti with pecorino and pepper. Fantastic. My boyfriend gets the cauliflower every time - it is a giant head of cauliflower with some delicate sauce underneath it...not sure what it is, but it is good.  I have been here at least 10 times and always have a delicious meal served with grace."
    },
    {
        "id": 68,
        "text": "I tried 24 for the first time recently and enjoyed it. The four cheese pizza was good (although I couldn't detect any blue cheese) and I would have preferred a crispier crust. The trio of complimentary nibbles--fried peppadew peppers stuffed with cheese and pepperoni; olives; and fried chickpeas--are a welcome touch, although it would have been nice to get them with our first round of drinks rather than at the end of the meal. And this brings me to the 1.5 yelp deduction: timing and service. The staff we encountered were all friendly and helpful, but would drift to far corners of the large bar area to chat amongst themselves. When staff outnumber patrons yet you're cocktail-less for a decent amount of time, that's a problem. I'll give 24 another shot but given the price point I hope the service kinks get worked out soon. I'd like to make this place one of my regular haunts and try other pizzas on the menu."
    },
    {
        "id": 69,
        "text": "I'm a big fan of Garces so I'm sad to say I'm not a big fan of 24. The food was just...so, so. The only dish I would think to mention was the mozzarella grilled cheese with marinara sauce, unique and tasty, the rest was...eh. The prices were not bad, the decor was pleasing (summer on the deck, should be smashing!) and the service was excellent. In summery I would not choose to go back but if it was someone else's pick I wouldn't be mad at them."
    },
    {
        "id": 70,
        "text": "Super spot. Spacious, but cozy. Plus outdoor deck that overlooks the Schuylkill. Excellent service. I had steak and eggs. Tender, tasty steak cooked perfectly, interesting verde sauce that adds another flavor. Potatoes crisp and flavorful. Bloody Mary has the perfect kick. The menu has a variety of hot and cold choices including their pizza. Vegan options available."
    },
    {
        "id": 71,
        "text": "Jose Garces always does gift card promos around the holidays (spend $100, get a $20 bonus card) and we had a bonus card that was set to expire at the end of the month and didn't really want Spanish food. We looked on the Garces website and saw 24- Italian- and immediately decided to try this. My husband and I came here for my (30th- AH) birthday dinner on Friday and I'm still dreaming of the pizza. We started with the roasted red peppers and calamari. The peppers were delicious and the goat cheese topping added a level of richness and creaminess that was just right. The grilled calamari were perfectly cooked and the spicy red sauce underneath was flavorful and unfamiliar. We asked the server what encompassed this sauce and I believe he said there was ground salami in it. It was really delicious and a unique flavor combination. We decided to try the four cheese pizza with a side of broccoli rabe as well. I'm obsessed with broccoli rabe and this rendition was great, nice and garlic-y with a crunchy breadcrumb topping. The four cheese pizza though, that was the star. Blue cheese on pizza? TRY IT. Utterly decadent and I believe it's also featured on the happy hour menu for $9 so we are planning on coming back and getting it again sometime! The server was super accommodating with my mocktail requests while my husband opted for a beer.. can't wait until baby comes in June so I can come back for happy hour and try the great wine and beer specials with the $9 pizzas!"
    },
    {
        "id": 72,
        "text": "This place we great! We came here for a friends bday brunch! The Bloody Mary was wonderful! We had the fava salad and the cauliflower pizza. I loved both. Others had the pepperoni and lamb pizza and they love it! The service was great and they allowed us to take our time and not feel rushed. I cant wait to try again!"
    },
    {
        "id": 73,
        "text": "Went here for lunch one day. So good, love the decor.  Split a lamb pizza then had a Brussels sprout Caesar salad.  The portion sizes were so large I had lunch the next day!"
    },
    {
        "id": 74,
        "text": "This place was so cute, great view of the city.\n\nWe came in around 5:30pm and wanted a booth instead of a table. The hostess, instead of saying \"we have reservations all night\" was pretty rude about not giving us a table. We ended up sitting at the bar, service was great. They have some good specials for Happy Hour. it comes with a mini trio of snacks. Similar to Italy's Aprevito. My friend & I shared the pizza and the burrata, Both were delicious! We'll definitely be back."
    },
    {
        "id": 75,
        "text": "Solid food. Would be 4 stars but was disappointed by the service. Took 15 minutes to get our server's attention after she brought our food and forgot to bring out our side...and they were not busy. Was here for brunch and had the asparagus omelette which was good, and I got it with a side salad (instead of potatoes) that was very good. Will be back again to try dinner. Great spot if you are looking for something near 30th street station. Appreciate they take reservations!"
    },
    {
        "id": 76,
        "text": "The food was excellent and the service was bad\nThey were understaffed, so that made hard on the wait staff they comped two excellent appetizers a cheese platter and calamari. Check the price of before ordering bottle ."
    },
    {
        "id": 77,
        "text": "Had the margherita and pepperoni, both were so salty I couldn't eat more than a slice of each."
    },
    {
        "id": 78,
        "text": "(to the tune of Taylor Swift's \"End Game\")\n\nThis spot could be your end game.\nIt's not quite Garces' first string.\nBut the pizza's on my A-team.\nAnd you gotta love their whole team, whole team.\n\nBig reputation, big reputation\nOoh Iron Chef has got a big reputation, ah.\nAnd you heard about him, ooh\nSo you've decided on din.\nBig reputation, big reputation\nOoh you should save yourself  a big conversation, ah\nCuz if you kinda like cheese \nThis place is just the bee's knees.\n\nDon't love the spot, but the view is quite hot\nSo if you can get there, al fresco a lot\nBurrata like WHOAH\nDon't sleep on that, yo, and the artichokes GO \nJose's got a reputation here, yeah it precedes him\nThe wood-fired pizza coming hot right from the oven.\n3 pizzas for table of 5, girl\nDrinks on the strong side, girl\nAnd a happy hour everyone seems to like\n(You'll love it)\nI love it too 'cause that's my type\nSo c'mon over and dig in, just get a bite!\n\nIs it my favorite Garces spot ever? Nope. Is it a weird location? Yup. BUT if you're craving melty cheese and brick oven goodies, you're in for a treat. I've been for lunch and happy hour, and enjoyed both visits. From the four cheese pizza which is just TO DIE FOR to the artichoke dish which the table was fighting over, there wasn't a \"miss\" in the bunch. The view on the SRT is pretty fantastic on a nice day, so wait for some warm weather, go for a brunch or happy hour, and soak up the sun. And then use the bread to soak up any leftover artichoke oil."
    },
    {
        "id": 79,
        "text": "We had a great brunch here last Sunday. The weather was perfect for Schuylkill side seating - and despite the fact that the patio was nearly full- we were seated there quickly on request. Our coffee was great and kept full- and the service from Jordan was really spot on- this despite the fact I think he also was doing bar coverage. \n\nSmiles and great people were everywhere.\n\nMy waffle was amazing- some almond magic in there adding a a fantastic crunchy crust. Her egg dish was perfect-\n\nWell done, 24 team- So glad you added the brunch."
    },
    {
        "id": 80,
        "text": "I avoid writing reviews but felt obligated to when I noticed there were several haters. Been there several times and have enjoyed each visit. The service is fantastic and the pepperoni pizza with wild mushrooms is one of my favorite things to eat in Philly. My wife and I enjoy the wine and beer menu and the appetizers as well. Not sure what negative things there are to say about the pizza. I'm from new york city and tend to find that most philly pizza is terrible. I really enjoy 24's however."
    },
    {
        "id": 81,
        "text": "I went here once. The restaurant is good. We tried the eggplant pizza and crispy potato. I would not say it's great but it did not disappoint us. It has got some great views."
    },
    {
        "id": 82,
        "text": "This place is still relatively new. The location is kind of strange, it's like the last business before the walnut street bridge.  \n\nI took my dad here for his birthday, and he thoroughly enjoyed himself here. Italian spots are always where I go when I have a huge carb craving... which is rarely. The pizza and pasta we ordered here were both substantial and delicious, but not mindblowingly so. The ambiance was nice, relatively loud on a Saturday afternoon, but that is typical at Italian places.\n\nWould come back again, but only because I live half a block away."
    },
    {
        "id": 83,
        "text": "Well, that was delicious.  Just a short walk from my house now sits this little gem of a joint. Much more than a joint actually, A casual elegant great place to eat and hang out. I can hardly wait until the outside bar opens and the weather warms up. I liked everything about this place from the moment I walked in. I like the funky out-of-the-way location, the casual baseball style T-shirts on the waitstaff, and the way the tables were close together but not overly crowded like some places. I didn't feel like I was sitting on someone else's lap in the next table. \n\nI like the dim lighting and the funky wood work. The beautiful white and blue China plates are a nice surprise pop of color . The wait staff was very attentive and professional. Good beer selection. I'm not a wine drinker so I can't comment on that but certainly look like plenty to choose from. \n\nNow -drumroll please- onto the food. We started with some appetizers, my hubs ordered the calamari and I ordered the wood roasted Cauliflower. We expected the traditional fried calamari but when the plate came it looks like beautiful white flowers rolled up. He was skeptical but he tried them and absolutely love them. Spicy. He cleaned the plate. \n\nThe Cauliflower, man I've never seen anything like this in my life. You've got a look at the picture. An entire half a head of cauliflower roasted with just the most delicious yogurt and seasoning tasting sauce around the edge with toasted seeds just cooked to perfection. I had a quarter of it and took the rest home. It was huge. Very unique and tasty. \n\nAs if that wasn't enough we ordered a pepperoni pizza to split. The pepperoni was just perfectly seasoned and really delicious. The pizza was so incredibly light we ate the entire thing between the two of us and didn't feel overly stuffed. Really nicely done with that delicious light char. \n\nThe waiter really twisted our arm (kidding) and got us to split a dessert. It was a really nice chocolate mousse with the marscapone on the top powdered sugar crusted pistachios and raspberries. A tiny size but perfect for a few bites to share at the end of the meal. \n\nThe prices were reasonable and they had a nice full coffee bar should you want that at the end. I really liked the look of this place. There's a huge bar in the back in the shape of a large square that will eventually open out into the fresh air patio once the weather is nice. Super job and kudos to the Garces group for this new addition. It's going to do well."
    },
    {
        "id": 84,
        "text": "We had a lovely group dinner at 24 to start off our holiday weekend. Service was pleasant and quick. Atmosphere was nice, though next time we hope to go when it's warmer so we can take advantage of their \"waterfront\" balcony overlooking the Schuylkill River.\n\nIn order from the top of the menu to the bottom, we group-ordered and shared: the South Philly Chopped salad (Romaine, Wood Grilled Peppers, Feta, Soppressata, Chickpeas, Oregano Vinaigrette)--love chickpeas, especially in salads!; the Verde salad (Arugula, Fava Beans, Bianco Sardo, Avocado, Grilled Lemon Vinaigrette); the Calamari ('Nduja, Celery, Lemon); the Polpette (Pork & Beef Meatballs, Gravy, Parmesan)--especially enjoyed the toasted baguette that was served with the meatballs, which was terrific to sop up the gravy with!; Tuna Bolognese (Rigatoni, Tuna & Pancetta Ragu, Whipped Ricotta)--not overpoweringly tuna-y, which I thought was nice, though some diners wished for more tuna; Carbonara (Bucatini, Guanciale, Egg, English Peas)--delicious and very rich, not for the dieters!; Margherita pizza (San Marzano Tomato, Fior di Latte, Basil); Pepperoni pizza (Manchego, Fresh Mozzarella, San Marzano Tomato)--little is better than a good pepperoni pizza, and this was chock full of pepperoni!; Egg pizza (Taleggio, Black Truffle, Wild Mushrooms, Oregano). All the pizzas were perfectly fired, crispy and not burned. All the pastas tasted homemade and were nicely al dente. Overall, it was a lovely meal and we would definitely return for a repeat!"
    },
    {
        "id": 85,
        "text": "I came really late for brunch. Pregnant and was craving for a good chicken. Supposed to stop at 3pm. But had to wait 10mins before someone finally come to tell us sorry we finished at 2:30pm. Apparently brunch stops at 2:30pm now but even their website is not aware. Walked 30mins to try their chicken and waffles for nothing. Great welcome guys, thanks !"
    },
    {
        "id": 86,
        "text": "Had an enjoyable meal here last night. Maybe they've taken the service issues others complained about here to heart because our waiter was extremely attentive and friendly. All of the food was delicious and the atmosphere is great - would definitely like to go back in summer to sit outside. Highly recommend the roasted cauliflower, rabbit agnolotti, and egg pizza."
    },
    {
        "id": 87,
        "text": "I went to 24 with some coworkers for happy hour/dinner and I'd definitely go back! I saw other reviews saying the service wasn't great, but there were seven of us and we had no issues. We ordered three pizzas- pepperoni, truffle egg and four cheese- and they were all great. The truffle wasn't too overpowering which I appreciated. We also ordered some smaller plates to split- polenta and Brussels sprouts salad. Both were delicious- I'm on a polenta kick right now and I loved that. The drinks were good, the decor was cool- I would certainly return!"
    },
    {
        "id": 88,
        "text": "The four of us had a 9:15 reservation and had to wait 25 minutes for a table.  Waiter tried his best but bar and kitchen slowed our service.  Cauliflower was fab so was salad and meatballs.  Margarita and pepperoni/mushroom pizzas we 2000% to salty.  Could not eat either.  \nWill go back for a pasta try.  Hope this place makes it."
    },
    {
        "id": 89,
        "text": "I should premise this with three statements: \n1. We spontaneously came to this restaurant. \n2. The restaurant is still relatively new. \n3. This review is for the entire experience \n\nI would rate the food here a 4.5/5- the reason is the food here is really good, but that's where it ends. It's not like Vetri or Barbuzzo, where you have \"must tries.\" However, this is a menu where I feel like you can't go wrong. \n\nWe ordered: \n- Verde with Steak (absolutely delicious - the avocados with the fava bean combination really works well) \n- Roasted Cauliflower (this is literally a head of cauliflower - they're not lying) \n- Egg Pizza (This was good, but I just had Barbuzzo's a week ago and it just can't compete. Also, the pizza is very heavy with eggs, mushrooms, and truffles. Ideally having some greens on top or on the side would probably make this dish a lot more enjoyable - I ended up adding the arugula from the salad on top.) \n- Bacio Gelato (SO GOOD, especially with the added caramelized hazelnuts) \n\nThe staff here is definitely more new and inexperienced, but friendly. I give it four stars because it really does have potential. I think it just needs more time. The prices are also extremely reasonable for the quantity."
    },
    {
        "id": 90,
        "text": "Services was slow if you could find the waiter....\nPizza was was cold and soggy...\nBTW.. this is not remotely Italian food, it was more like, what spice do I have in the kitchen... great ! Put it in.  \n\nGood wine selection."
    },
    {
        "id": 91,
        "text": "You walk into a very industrial space. You get the feeling of an abandoned construction site, or a manufacturing space that has been adorned with modern and sometimes elaborate art work and interesting light fixtures. The whole thing works and although it's not a unique concept, this is one of the few local restaurants to embrace the idea and really make it work well. The service was friendly and the cocktails delicious. I tried the pepperoni pizza, the burrata, and the rabbit agnolotti. The pizza is an oven brick style pizza that's making a comeback to more refined pizza joints. It was pretty tasty. The burrata was fresh but lack excitement in presentation.  The rabbit in the agnolotti was perfect but the sweet and slightly nutty sauce it was paired with was just ok. Overall an alright experience."
    },
    {
        "id": 92,
        "text": "Really great spot right on the river.  Huge bar with plenty of tables.  Jose Garces does it again.  Located in the same building as his corporate offices, 24 is a nice and simple place for a bite or a drink.  There is a private room off of the bar and outside tables on the balcony.  Simple pizza dishes and pasta are the mainstay on the menu.  Good wine bar, beer selection, and a full cocktail menu as well.  While this is an informal spot it also has a nice seductive vibe too.  Good spot for an informal date and it is so large, families with little ones don't spoil your dining experience.  It is about a 5 minute walk from Fitler Square, 30th Street Station, and maybe 10 from Rittenhouse Square.  They also have a very generous happy hour priced menu so go early!"
    },
    {
        "id": 93,
        "text": "I went to 24 with a larger group when it first opened in the fall of 2016. \n\nEverything I had was tasty. The cocktails were quite yummy, the salads were well-prepared, the calamari was fantastic, and the pizzas were good. I especially enjoyed the squash blossom, cauliflower, and lamb sausage pizzas. \n\nThis is the first Garces restaurant I've been to, and some in my group indicated that some of his other restaurants are better, but I enjoyed 24 and would go back when I'm in Philly."
    },
    {
        "id": 94,
        "text": "I had an excellent laid back restaurant week lunch at 24. Actually, it may have been too laid back since the slow service had me late for work, but with such delicious food I can't be mad.\n\nI started out with the meatballs. They were served with sauce and toasted bread. These juicy meatballs were a very tasty start to my meal. Then for the entree I was able to share the lamb sausage pizza and the pepperoni pizza. Both were perfectly cooked thin crust masterpieces. Not the typical pepperoni and sausage pizza you get from a pizza shop. Unfortunately, dessert was so forgetable that I can't even remember what I ate. So don't go for the dessert, go for the meatballs and pizza!"
    },
    {
        "id": 95,
        "text": "I have always loved Garces's spots...and I have to say...I didn't know this one existed. I spotted it on a run the other day and what caught my attention was BEAUTY. The outside seating overlooks the river and a beautiful view of University City and the skyline. So I made a reservation, grabbed my kid and we landed there this evening.\n\nI really wanted a table on the beautiful outside deck overlooking the river but they were filled. The very kind host seated us inside and said he would keep an eye out for a table outside to open and it would be ours. He kept his promise and before we ordered inside we were escorted outside. I was struck with the beauty. Honestly, the view is incredible. That alone would have been enough...but the food was great too. \n\nI ordered the cherry range cocktail. (Old overholt rye, carpano antica, charred cherry) Very well done and the the charrred cherry (there were three!)...delicious.\n\nWe ordered calamari for the start, the pepperoni with mushroom pie and amatriciana. The calamari was delicious. It was grilled with 'nduja, parsley and lemon. The char from the grill was divine and the 'nduja gave it a kick. The pizza was great. Thin crust with perfect sauce and fresh pepporoni. The amatriciiana was delicious. The pasta was fresh and the sauce was spiced well with just the right flavors. I can't remember what our dessert was called but was pistachio with vanilla chocolate mousse. YUM!\n\nThe servers were great in that when they showed up they were knowledgable and kind...but when they disappeared (we didn't have just one server...there were many..which made ordering more drinks or asking questions difficult) it was hard to get the attention of someone when something was needed for the table. Our pizza was delivered to our table and I wanted to order a beer to drink with my meal. I was already into my third and last slice when I finally asked a random server if it were possible to get a beer with my meal. That is my only complaint. This place is gorgeous and delicious and I will back."
    },
    {
        "id": 96,
        "text": "I really wanted to like this restaurant but it really did not live up to expectations. The meatballs were very good as a appetizer, but everything else wasn't that great. The server Ray was very sweet and attentive to our table. But everything else was not really worth it. The bathroom situation was odd too."
    },
    {
        "id": 97,
        "text": "24 is a great addition to the neighborhood! It's easily comparable to Pizzeria vetri, Stella, and cinder (Although I would argue each have a unique quality)\n\nWeekend reservations are hard to come by for 4+ people so make sure you reserve early. We got a beautiful booth overlooking walnut street at night. Although we didn't intend to get starters, there were fantastic looking ones which we couldn't pass up. All 4 starter were easily wins:\n\n1. Roasted peppers/goat cheese - roasted red peppers with goat cheese and a vinaigrette\n2. Brussel Sprout Salad - Very tasty, texture is cool, dressing is delicious \n3. Roasted Beets with ricotta - Ricotta was shaved instead of soft\n4. Calamari - Heavy on the parsley/lemon - so good looking.\n\nThen pizza's - again, too many good choices so we each got one.\n\nEasily the Margherita and the Egg were our favorites. \nThe Lamb sausage was good but not very special. The 3 cheese was also good.\n\nOur server was fantastic, wine week was going on, and we had plenty of space to eat which made the whole experience very enjoyable."
    },
    {
        "id": 98,
        "text": "We love the food. We love the staff. But hate the music. Oh, well. Many restaurants seem to play music the staff likes, for their pleasure, more than the patrons."
    },
    {
        "id": 99,
        "text": "Visited last week for lunch during restaurant week with my friend!! Focaccia hot bread with pickles, cheese and veggies were served for the table as first course. The bread and cheese was really good. Veggies were good but I don't like them cold so didn't enjoy it as much. For second course ny friend ordered five cheese pizza and I ordered cauliflower pizza without pork. Cheese pizza was really good however cauliflower pizza had some flavor missing. It was good but needed some spice to it. For third course there were 2 options olive oil cake and panna cotta. I did not enjoy the dessert as much as the chocolate mousse in panna cotta was just too much. Overall I found the place average. Service was slow. Although I would say looking at the layout , this could be a good location for big groups!!"
    },
    {
        "id": 100,
        "text": "Went here this evening to have a drink outdoors and they have a nice patio overlooking the skuykill. The atmosphere indoors is nice just as the outdoors as well. The service was great. We got that chef's selection cheese board which came with 3 pieces of 3 different types of cheese served with stewed strawberries, honey soaked raisins and a hazelnut spread. It was very good. They also brought us complimentary olives, fried chickpeas and a peppadew pepper stuffed and fried. The drinks were good just as the food was. We wanted to stay to see what dinner was like but already had reservations elsewhere. Would definitely go back again, especially on a nice day as they have a nice deck."
    },
    {
        "id": 101,
        "text": "COME HERE FOR LUNCH!!! I am serious. I think 24 has one of the best lunches in the cc/west philly crossing area. Working right by the bridge on the West philly side can be tough with finding a quality lunch spot but 24 never fails to disappoint. It may be a little more than usual for lunch price wise, but chances are you will have leftovers because the portions are HUGE. Also, there is a nice variety of options - sandwiches, salads, pizza, etc., so hopefully there will be something for everyone in the group. There is also a cute little outdoor patio space which provides the opportunity to eat outside. Being honest, I have only been here for lunch, but hope to come here to try dinner soon too!"
    },
    {
        "id": 102,
        "text": "After talking to the manager, she graciously invited us back again and said she would make sure we got a fantastic dining experience. She lived up to her promise and I will be back"
    },
    {
        "id": 103,
        "text": "Came here on a Sunday night and absolutely LOVED it! The staff was great and the food was incredible! We ordered the goat's milk taleggio, roasted peppers, roasted beets, wood roasted cauliflower, the pesto pasta, and cauliflower pizza...all amazing!! I especially loved the pasta and cauliflower appetizer, I can't wait to come back for more! \nThey also have a great looking bar!"
    },
    {
        "id": 104,
        "text": "This spot is a hidden gem and perfect for meeting with people from different parts of the city. The bar stay is excellent. The food is consistently good. The view of the patio in warmer months is \nperfect."
    },
    {
        "id": 105,
        "text": "Came for lunch during RW. This place is pretty casual and staff was attentive but service was a little slow. Actually, not sure if service was slow, or if it was really that laid back.\n\nFirst I tried the meatballs for an appetizer.  The meatballs were tender, succulent,  and flavorful. The sauce they were in was quite robust. I had the pepperoni pizza for my entree. The crust was light & thin and bubbling with cheese. The pepperoni had the perfect kick to it, a little spicy,  with a little saltiness. Dessert was ok, but not very memorable.\n\nI enjoyed this restaurant and would definitely return. They served a great bread upon being seated.... and I love great bread served with rich flavorful dipping oils."
    },
    {
        "id": 106,
        "text": "Met two girlfriends here for dinner last week, mostly because it is relatively close to 30th Street Station and one in our party had to catch a train back to NYC later in the evening. I started with a Manhattan-like cocktail (\"cherry\" something or other?) at the bar that I thought was only mediocre, but once we moved to our table, I ordered a glass of house wine that I liked much better. \n\nWe ordered from the Restaurant Week menu, which provided us with tons of food for $35/each. The RW menu started with a tasty antipasti plate and grilled bread. For appetizers, I opted for the meatballs, which were my favorite part of the meal, while my friends both had generous servings of the burrata (accompanied by more grilled bread). Although all of that was pretty filling on its own, I had gone to dinner with an appetite and therefore managed to finish my cacio e pepe. It was some of the black-pepper-iest pasta I have ever had, which in my book is a good thing! My friends did not get through much of their pesto pasta, but that was less a reflection on the quality of the dish than on the amount of food we'd already consumed by that point. We ended up taking our desserts to go, and although I usually am not much of a cake person, I did later enjoy the two little chocolate cakes that came with my meal. \n\nThe vibe of the restaurant is exactly what you would expect from Garces; most of them feel somewhat similar to me and this was no exception. Our server was very friendly and helpful, so either the service kinks have now been worked out for we really lucked out. The location is a bit odd, however, and probably diminishes my probability of returning. \n\nIn summary, 24 met my expectations and provided a pleasant dining experience with above-average food and service, but I don't know that I would go out of my way to get there again. There are both better Italian restaurants and better Garces restaurants in the city, so the pull to 24 is not strong for me."
    },
    {
        "id": 107,
        "text": "I was pretty thrilled to dine at this restaurant - so much so that I was willing to take the pedestrian hike all the way up Walnut. \n\nMore importantly, my friend was visiting from Manhattan and I thought I could impress her with another anticipated gem from Garces Company. Unfortunately Philly stroke out.\n\nWe shared the polpette which wasn't bad. However then I ordered the pepperoni pizza and she ordered the lamb sausage. I personally never want to taste the taste that was in my mouth eating the pepperoni pizza - there was a strange almost bitter aftertaste following every bite. \n\nI can't speak for my friends lamb sausage as I didn't taste it, but both of us requested to box our meals because we were embarrassed for barely eating. \n\nThis said, if i lived within two blocks of the restaurant, I could see myself returning for just drinks. The bar area looked inviting and like a generally relaxed place to hang out with pals. \n\nAlso I do believe it's worth stating that our waitress was exceptionally welcoming."
    },
    {
        "id": 108,
        "text": "I had to try this place after moving into the city just a block away. While it's an odd location, the food, decor, and service are all excellent. Plus there's some nice outdoor seating that overlooks the Schuylkill. \n\nMy girlfriend and I went for lunch and tried a few dishes, including the polpette (pork & beef meatballs), margarita pizza, and cacio e pepe pasta. The meatballs were tender and the sauce was phenomenal. They make their pizzas in a wood fired oven which makes for a nice, slightly burnt crust, and the sauce, cheese, and basil are spot on. My personal favorite dish was the cacio e pepe. Pasta. Cheese. Pepper. Simple. Perfect. Eat it."
    },
    {
        "id": 109,
        "text": "Waited for several minutes at one of two hostess stands.  Several waiters walked by without acknowledging me.  Two bartenders saw and said nothing.  And neither hostess came over, though one was looking right at me.  So I left.  Garces' customer service, it appears, has taken a slide.  Too bad.  That used to be a strength."
    },
    {
        "id": 110,
        "text": "Really liked this place. Great happy hour specials. Cheese board was one of the better ones I've had. Loved that they had draft wine. Definitely would recommend."
    },
    {
        "id": 111,
        "text": "I would like congratulate 24 for having the most accommodating staff in Philadelphia.\n\nMy friends and I (party of 5, including two friends in their 70s) made a reservation early on Saturday. When we arrived the noise level was a little too high for my hard-of-hearing friends. We talked with the manager, and within minutes we were seated in a private room.\n\nThe food was great. We had two pizzas- a Margherita and the \"breakfast \" pizza- and a variety of small plates. The grilled calamari was a big hit, as was the baked cauliflower. \n\nAnd the bar dealt with some VERY specific drink requests.\n\nThanks for a great evening!"
    },
    {
        "id": 112,
        "text": "The pizza was pretty good, and service was very good. But the polenta was terrible. I've never had such a salty dish in my life. It's like they accidentally put in tablespoons instead of teaspoons or something. \n\nI interspersed bites of other food to dilute the saltiness, and I went through several glasses of water, but it was still too much. I ended up leaving 1/3 of it at the bottom, and left hungry. I'm marking this as 3 stars--even though this was just one dish--because no good restaurant should have such bad quality control that a dish can make it out of the kitchen this out-of-whack."
    },
    {
        "id": 113,
        "text": "Mouth watering authentic Italian, just the right size portions and beautifully thought out menu. Staff is not as attentive / polite as I would have preferred otherwise this would be a 5 star review. 100% recommend the pesto, olive oil cake, and 'over the moon' mixed cocktail. Will be making this a regular date night, can't wait to come back!"
    },
    {
        "id": 114,
        "text": "So 24 is only 3 numbers away from my favorite number (either 21 or 27, you'll never know) AND I've heard rave reviews from work biddies about this place. The schlep from 15th street did promote some reluctance but I finally sucked it up and made the trek this past Friday evening. \n\nI did make a rez earlier that day (like an hour before) bc I'm not keen on waiting but I don't think it was required. After some confusion regarding actually entering the building at the right place, we were seated. It was actually freezing cold but that might have been my fault for under-dressing (in my defense it was like 8000 degrees outside). I will confess that I have a temperature comfort range that spans approximately 1.5 degrees. \n\nI would also like to point out that I think the pre-meal table bread is a pretty critical component of the Italian restaurant meal but was however absent at this place. \n\nThere's a bunch of shit that looks tasty on the menu, including cocktails and food. We spent a significant amount of time deliberating about both what we were going to order and who was going to decide. Final decisions included verde salad bc I'm a brussels/fava bean bitch, pesto bc I'm a pesto bitch, and eggplant pizza bc it's what my GF wanted and who am I to say no to that gorgeous babe. \n\nThis restaurant as the option to make many of the dishes either vegetarian or even vegan, which is clutch. I asked for the verde salad vegetarian and when the waiter brought it over he said \"without the bacon\" or whatever meat comes on it but the dressing has anchovies.... Luckily the anchovy-y/oceany flavor that petrified me was not present but unfortunately neither was flavor in general really. This was a bit bland but I ate it bc I was hungry and it was in front of my face. \n\nPizza was really good but pizza is hard to fuck up. There was like maybe 4 little circles of eggplant which is fine bc I'm not like head over heels about eggplant in the first place. I'd definitely try more pizzas from here tho. The pesto was really delicious. I crammed every last noodle into my stomach 2/2 its tastiness. \n\nThis place was overall good as for 99.9% of restaurants there are both better and worse choices."
    }
]