[
    {
        "id": 1,
        "text": "I LOVE this place!  Every single thing I've had here is good and FRESH.  They do take a little longer than a grab and go, but thats what fresh requires.  Staff is very friendly and the decor is beautiful.\n\nThe owner's take pride in their place and it shows.  \n\nCAUTION: You will become addicted LOL."
    },
    {
        "id": 2,
        "text": "there is hope if only they would only have a dining room manager with overall oversite to keep things moving. the staff is too busy to see what is needed next leaving guests frustrated waiting for tables, beverage refills, meals, checks and change. glad to see them so busy but that can wain if service is not a top priority. food is incredible!"
    },
    {
        "id": 3,
        "text": "First off I'm a trained chef went to this hyped up breakfast spot strictly out of curiosity. After an extremely long wait to be seated as usual, your told 15minutes that could easily turn into an hour and that's just the appetizer. My girlfriend and I are finally  seated, and I notice the waitress is giving my girlfriend plenty of eye contact as we place our order and giving me very little to none  like I was  a freakin ghost very unprofessional and I'm thinking\" what's up with that\" this is the first course. Right now already not feeling this place. Anyway, I ordered the jerk wings with the waffles. HORRIBLE ass salty caked on jerk like paste they use for the wings the waffles were good but those wings could've found more of a home in the trash. That was the icing on the cake for me. Had to even ask for more napkins from the waitress as she proceeded to look as she was rationing them out. They give you one silly paper napkin and I guess that supposed to hold you. At the end of our luxurious meal I told the waitress the wings are way too salty, she looked disappointed as if she personally made them. She asked if I wanted something else \"right know I'm really disgusted \" I said no just bring the check. My girlfriend said she would take them and maybe scrape some of the brine off they should be okay.What ever.... The waitress still looking like she was very disappointed. Oh well.... I see why Gordon Ramsey stays so angry at some of these restaurants. Because they really don't know what they are doing.If people are so hyped about this place I want to know what they are ordering please post. Maybe the cook didn't feel like cooking today. Or I should've ordered water and lemon as the main course."
    },
    {
        "id": 4,
        "text": "Love this place! Cinnamon swirl pancakes are amazing. Great addition to CH. employees are super sweet and always nice to my toddler. The service is a little slow at times but I appreciate the care and thoughtfulness that goes into my order and into the service. I always come here when I want a real breakfast with a side of kindness."
    },
    {
        "id": 5,
        "text": "Just dined there for the first time this week.  Overall - GREAT menu options and it was really difficult to pick just one (good thing there was a group of us and we could sample each other's plates!).  Welcoming atmosphere, and even for a weekday morning, it was crowded!  The only hiccup would be to make sure you have time to sit and relax when dining here - it did take a little bit of time between ordering the food and it coming out to the table!  Overall though, our group enjoyed our yummy breakfasts and the overall vibe!  We plan on going back!"
    },
    {
        "id": 6,
        "text": "They serve breakfast all day with lunch options in the afternoon.  The staff is really friendly.  There is not very much space so best to get there early before it fills up."
    },
    {
        "id": 7,
        "text": "Had a delicious experience. My Shrimp and Grits were good with eggs. As savory as in Atlanta,  Georgia. Plenty of food. Our waitress was quite nice and accommodating. Called in for a reservation and we were able to be seated with less than a 5 minute wait because I could not stand long. Appreciated the accomindations."
    },
    {
        "id": 8,
        "text": "Absolutely the perfect breakfast place..\nFood is delicious, reasonable prices and cute atmosphere.."
    },
    {
        "id": 9,
        "text": "The food is delicious...no question. I arrived at 9:00 AM on a Sunday morning and the charming, intimate space was already filled. I was promptly greeted by a server and within 10 minutes was seated at a table for a party of three.  A patron recommended the whiting with cornbread and grits, which my cousin had, and she was not disappointed! I had the sampler, which was pure breakfast decadence. Imagine one red velvet waffle, a piece of stuffed French toast and a cinnamon pancake with a turkey scrapple side. It is a super busy place and reservations are accepted if you want to guarantee seating quickly. Do not plan on lingering over breakfast during the weekend! Be ready to eat and make way for the guests who arrive every five minutes. The husband and wife owners are phenom chefs and I will be back!"
    },
    {
        "id": 10,
        "text": "So nice to have a great (and yet reasonable) breakfast place in Chestnut Hill! Great gluten-free options (buckwheat pancakes and waffles) and exceptional eggs and bacon. My husband said his scrambled were cooked perfectly, as was the bacon. Loved my buckwheat pancakes (do wish they could put fruit in them) and turkey sausage! Our waiter (Gus) was Awesome, both pleasant and attentive. Be forewarned - there probably will be a wait. Always is when a place is good!"
    },
    {
        "id": 11,
        "text": "We had breakfast here on Sunday.  I'm giving 3 stars because of the wait time.  People waiting in line said \"it's worth the wait.\"  I agree with previous customer reviews, no food is worth a 90 minute wait.  They had no idea how long the wait was going to be but told everyone putting their name in 30 minutes. At 1:15 they told people who had been in line for a hour or more that they were not going to be served since the restaurant closes at 2P.  As you might suspect people were upset.  We were one of the lucky group who got seated. The wait staff were very nice it took sometime to get beverages after we were seated then a few more minutes before our waitress took our order. Our food was served relatively quick considering the wait time for a table. \nThe food was hot and enjoyable. One plate was served poorly, the shrimp & grits was on a plate that was too small. All in all I would not wait 90 minutes for a table at any restaurant despite the food being good.  I hope they get their wait time worked out or they will not have a location in CH. Good luck!"
    },
    {
        "id": 12,
        "text": "Very attractive please! Well decorated. They have a breakfast menu with some Southern items. Be sure to try the grits and shrimp! They also make salads - the Israeli  salad is awesome!"
    },
    {
        "id": 13,
        "text": "Went to the Breakfast Boutique yesterday and I was a bit leery because of a few negative reviews. My experience, however was outstanding. On a Saturday afternoon, there was a bit of a wait (about 25 minutes) but this was expected-Saturday afternoon is prime brunch time. When my party of 2 was seated, our drink orders were taken promptly. We both had the bottomless coffee which was refilled (and asked to be refilled) more times than I could count. The food was cooked to order and delicious! So good that we sat and ordered more food! The staff were courteous and a we tipped our server 50% of our bill because we had such a lovely time. I think the owners have been reading reviews. Kudos to them for responding. I can't wait to return"
    },
    {
        "id": 14,
        "text": "Had the opportunity to eat here on October 11th... seated immediately...service was great (Gustavo) \nThe food was just OK... I sent my eggs back due to no cheese that I ordered..2.50 for cheese smh... the pancakes to me were terrible..awful.. heavy..it appears as though they use oil & not butter & they were sprinkled with powdered sugar (no-no) another family ordered waffles & sent them back...\nThe fish & grits were tasty... I will not go back but I do wish them continued success..."
    },
    {
        "id": 15,
        "text": "There was a hair in our food (no big deal, it happens). Waitress was super apologetic and handled it well. I was willing to just pick it off but she insisted as she should to replace it. Turned out the hair was practically weaved into the topping so it certainly did not just fall off at the table. It must have come from the kitchen. Manager was the total opposite of the waitress. He came out and said is it possible that the hair is yours?\nA - this shouldn't be asked\nB - no it's not bc it wasn't just sitting on top\n\nManager actually RETURNED TO THE TABLE with a PIECE OF HAIR to show to us that it maybe could have been ours because it was a similar color.\n\nWaitress was great. Food was good. Manager is rude and has no people skills. Won't be returning"
    },
    {
        "id": 16,
        "text": "A fantastic addition to Chestnut Hill! We wanted to try even though some reviews were somewhat concerning. It seems since those reviews were written, management made some significant changes.\n\nFirst, the food is tasty and portions are large. In our party we had some basic eggs and bacon, home fries, etc. Then also a salmon cake, hominy grits, and jerk chicken and waffles.\n\nAll were delicious. If any suggestion, a little lighter on the salt in the jerk seasoning. Other than that, we were very pleased with all the flavors.\n\nRegarding service, we got in, got coffee quick, placed an order, and had a short wait until our food arrived. The place was packed, people waiting inside, and even out on the sidewalk. If you want a quick breakfast sandwich, maybe head elsewhere. If you have a couple minutes to wait for great food - you'll appreciate this place."
    },
    {
        "id": 17,
        "text": "I ordered scrambled eggs, bacon and quinoa potato hash (significantly more potato than quinoa). I tasted the hash first. It was cold and was crunchy due to the ice crystals. I sent the food back and a warm plate returned in which my bacon was smaller and more bacon fat was on my plate than before. Microwaved? I've dined in, as well as had take-out from the Ogontz location and have had food delivered from the Broad Street location and have always been extremely satisfied with the food. This meal completely missed the mark. Additionally, I obviously was not as attentive to reading the menu because the hash added $2.50 to my overall meal purchase of $8.50. Clearly not worth the price."
    },
    {
        "id": 18,
        "text": "The breakfast of French toast consisted of three large pieces of actual French sliced bread. It was very moist, very tasty. Really it was enough to share. My partner had fried whiting which he really enjoyed as well. \n\nThe servers are so sweet. The decor is cute and cozy. Sundays are very busy. Nice spot, great prices."
    },
    {
        "id": 19,
        "text": "Cute little breakfast place. If you don't get there early, you'll end up waiting (a while).  But we got there about a half hour after opening and there were plenty of open tables.  The staff was super friendly and attentive.  It was really nice being at a family run place where everyone shared the work load (whoever was walking by at any given time would help you with whatever you needed). \nFood was Excellent.  We got the eggs Florentine and the boutique skillet.  Both were delicious.  Overall just a nice environment and I love supporting locally/family owned and run businesses."
    },
    {
        "id": 20,
        "text": "This is a nicely decorated restaurant. The atmosphere is nice! I met my friend for a late breakfast ( 9:30). The place was hopping! We got a seat within 5 minutes. The menu is amazing-- everything from eggs to pancakes to French toast to pancakes plus so much more. Both my friend and I ordered the Boutique Frittata. I was a little worried that it was taking some time but when our frittatas arrived it was obvious that they were made from scratch. As a cook it took just about what I would have expected time wise. ( might suggest the waiter tells everyone that when ordering something that might take a while). On to the waiter--- he was one of the most pleasant and respectful people I have met in a while. Our coffee cups were never cold or empty. I would definitely return to try many more items on the menu. Also reasonably priced!"
    },
    {
        "id": 21,
        "text": "Great food! Love the atmosphere, a bit small but it fits the \"boutique\" theme. The host, waiter and waitresses are all nice and pleasant. Service was a bit slow but understandably so, they were very busy. Black owned , will be back soon."
    },
    {
        "id": 22,
        "text": "This little place is very pretty inside, and the staff were friendly. The food was not special even though the menu looked interesting. I got a waffle which had no decorations and just cut-up pieces of banana on it. No butter was served with the waffle. My friend got an interesting mound of eggs and some ham which looked skimpy in the middle of an otherwise empty plate. My iced tea was served without sugar or sweetener. When I asked for some, I was handed two Equals (no container of choices), and my friend had to make a separate request for sugar. He received a container with a spoon in it. He asked for cream and was handed three small separately wrapped cream containers. \n\nAt a breakfast restaurant where you pay 2 or 3 dollars for drinks, the restaurant shouldn't be so cheap as to hand out individual servings. Lots of us use more than three of those tiny cream containers.\n\nMy other major complaint was the background music. A few selections were fine (solos, soft etc) but music that involve large groups of singers or drummers and bands  disrupts the dining experience and makes it hard to hear conversations. This was extremely distracting.\n\nI won't be going back."
    },
    {
        "id": 23,
        "text": "Arrogant and misleading. We (2 people) arrived at 11 am on a Sunday morning for breakfast. We were placed on a wait list and told it would be 1/2 hour and we'd be called on our cell phone. We left our phone number, walked to shops and returned 35 minutes later to check because we had not been called. We were told there was one party of 2 before us and then we'd be called. We also noticed SEVERAL parties listed AFTER us  had already been seated. We said OK and went outside to wait (there is little room inside and it was crowded). Another 20 minutes went by with no call (now 55 minutes total). We decided to walk to another place on the Hill for brunch and were seated right away. I checked my phone a couple times during during our meal because we wanted to let them know our thoughts when they called. 2 hours pass. They never called. Guess they think they can afford to treat potential customers like crap, but that won't go far in Chestnut Hill with all the other choices."
    },
    {
        "id": 24,
        "text": "Heard good things about Breakfast Boutique and decided to check it out. I gave them a call shortly after they opened last Sunday and asked for a reservation. I'd heard wait times averaged around an hour. They gave me a table for 2 at 10. Arrived early and was seated by 10:05. The place was packed. Lots of people from other neighborhoods flocked to Chestnut Hill. \nLove the decor and the service. Best shrimp and grits I ever ate. The many options on the menu insures I'll be back to try them."
    },
    {
        "id": 25,
        "text": "Four of us ordered make your own omelets ~ yes, they warn you it takes time because all the food is made to order, and yes, it took a lot of time - not sure why though.  3 of us ordered \"with onions\"  which were not even cooked ~ cold onions; 2 of us asked for well done hash browns = they were not.  When the omelets arrived, they were dry and rather cool-warm, certainly not hot and moist. We all ordered multi-grain toast ~ it arrived about 10 minutes after our omelets and it was cold and a bad version of some kind of wheat toast - not even multigrain. Just a really horrible experience ~ we certainly will not go back"
    },
    {
        "id": 26,
        "text": "The food as well as the service was excellent. The staff was extremely  attentive  to the patrons. The food is very fresh."
    },
    {
        "id": 27,
        "text": "Great menu with a great variety of breakfast favorites. Their pancakes were light and fluffy. Service was friendly and prompt. Nice atmosphere!"
    },
    {
        "id": 28,
        "text": "Oh my goodness the food here is delicious. The service also exceptional. If you like shrimp and grits or chicken and waffles you will love it here. Visiting from out of town and plan to come back before we leave to sample other items on the menu."
    },
    {
        "id": 29,
        "text": "Never go to this restaurant.  First and last visit today.  Extremely poor and very rude service.  Had to ask 3 x for coffee that was ordered when we sat.  Waited 45 minutes for food expecting since everything was made fresh it was worth the wait.  Food served cold and had obviously been sitting before it ever got to us.  Honestly it's not hard to make an omelette.  Had to flag down our waitress to tell her the food was cold - she acted shocked and said ok one minute I have to do something.  Then sent a very uninterested person over to apologize who said he'd have our food remade quickly.  Waited another 15 minutes  and asked another waiter for the check for our coffee - he sent our original rude waiter over (who still hadn't removed the bad food from our table yet) over and she said I'm going to go check on your food.  We told her again - no thank you we need to leave it had been over an hour since we sat and still only had coffee.  She went downstairs got our food and put it in a Togo container. (REALLY).  I didn't want the disgusting cold eggs you served the first time why would I want a cold omelette in a to go container.  Told her again to please bring us a check for the coffee so we could pay.  She walked away and started helping other customers and would not come near us.  Finally told another waiter or said no need to pay for the coffee.  Absolutely terrible service - never been treated so rudely and the food that was served to me was cold and disgusting.  If you want to run a boutique restaurant then you need to invest in wait staff with manners.  Oh and think about serving the food hotnifnyour gonna make people wait forever there should be a good reason!  I'll stick to the Fairlane!"
    },
    {
        "id": 30,
        "text": "Greeted by a nice handsome man, server was super friendly, vegan options that are actually vegan. Def my new place to go to. A picture of the owners (I think) on the wall as you walk in, it's adorable. Everything about this place is adorable. 10/10 would recommend."
    },
    {
        "id": 31,
        "text": "I really enjoyed my breakfast at Breakfast Boutique.  The staff is friendly and the place is so cute.  My Eggs Benedict were cooked perfectly with the perfect tang of lemon.  The garnish was a nice addition to the plate.  Go early if you want to have some time to enjoy your meal.  The Boutique fills up quickly."
    },
    {
        "id": 32,
        "text": "Wanted to support this black owned establishment so after having a poor experience the first visit I decided to give it another try. During the first visit (a weekday so not extremely busy) I waited so long to be waited on even after others came in after me that I had to get the attention of the waitress. When she finally came over she was completely oblivious. When the food came out and was different than she described it to be she said \"oh the kitchen decided not to prepare it that way. I don't know why.\" The food was just ok. She forgot one of the items that it said the dish came with and when I asked her about it she said oh it doesn't come with that even though it says it on the menu then she comes back and said oh it does. Then she brought out two pieces of toast--one burnt with butter and one burnt without butter. Then omelet was greasy but not horrible. \n\nTried it a second time today and it was even worse of an experience. The food again was just ok for the price and I didn't get something that I ordered. When the bill came I told them that they needed to take it off because I never received it. The waitress said ok she brought back the check it was correct so gave her the card but when it was swiped it was for the original incorrect amount. I told her it was wrong then a man came over to us and asked \"what do you want me to do?\" I was so annoyed at this point that I just said forget it we just won't leave a tip. Either way terrible service and overall management of this boutique. Very sketchy that they would swipe the incorrect amount and then have that type of tone and response of \"what do you want me to do?\" Not sure about the other locations but this one isn't a good reflection of what I thought the experience would be. Won't be back to this one or risk trying the others. Can get better breakfast food at a chain restaurant like corner bakery or probably even ihop."
    },
    {
        "id": 33,
        "text": "My sister friend and I was there this morning.  This is my third time at the\nChestnut Hill location. Male folks I don't \nknow there positions too much conversation with folks who are dinning\nthat has nothing to do with the meal.\nWe were seated at a table for two near\nThe wall where the door is used for\nBringing food upstairs and downstairs \nEvery time someone went downstairs \nMy chair was knocked. Toast was\nBrought to the table Burt we had to\nask them to take it back. I had to pay $1:00\na slice for toast because I had whole \nGrain bread. Salmon cooked to hard\nBig chunks  of onion and green pepper in\nSide.  We asked for separate checks\nThe server put numbers in red on checks\nAnd told us who's was who instead of handing us our check.\nNot consistent don't know which way\nIt's going to be.  Spoke with the merchant \nAt Robertson's florist who has not dinned\nThere yet said she was told that they\nAre not consistent.  I hope they improve \nI would like to see them be successful \nIn Chestnut Hill."
    },
    {
        "id": 34,
        "text": "Simple menu, good selection.  Had the salmon patty and grits- delicious.  Tried the avocado toast but it was too loaded- made bread soggy- was not good."
    },
    {
        "id": 35,
        "text": "Had been wanting to try this place for awhile but was afraid of the lines I'd heard about. Don't want to wait in line for breakfast. First the positive, really good quality ingredients, very fresh and delicious eggs, yummy turkey bacon, many gluten free options. Biggest complaint besides slow service, their coffee is just bad. A place called Breakfast Boutique needs excellent coffee. They need to up their coffee game. I will go back but will get coffee somewhere else before I go back."
    },
    {
        "id": 36,
        "text": "The Breakfast Boutique in Chestnut Hill routinely offers good food and good experiences but the same cannot be said if their new place in Mount Airy. Tried it today and the experience was horrendous; the wait staff was disorganized, disinterested, and inept at best. Not a good experience at all, I definitely will not be going back and will gladly share the same advice with others."
    },
    {
        "id": 37,
        "text": "Good food, but a long wait for it, and we were the first ones there! It was almost comical.  They would bring coffee, but forget cream; they would bring food, but forget salt and pepper; they would bring food, but no water.  We had to ask for everything, and wait a long time for each thing.  The food itself was good, but it was chaotic in the place."
    },
    {
        "id": 38,
        "text": "The food was extraordinary- the service was beyond unacceptable. AGAIN, the food was extraordinary-the service was poor. \n\nWe are foodies and will travel for a great meal. On this particular Sunday, we traveled nearly an hour to dine at this establishment in Chestnut Hill. We waited a little over 30 minutes for a table, no big deal given the nice local shops in Chestnut Hill. We visited a few before getting our call regarding the table being ready. \n\nUpon being seated, it took over 15 minutes before we could place a beverage/coffee order. Another 30 minutes before we received a refill- while waiting for our meal...which took ONE hour. Really-an hour, probably a little longer if I consider when we were seated. Our total time at our table- nearly two hours...for casual breakfast. Given this is a small -casual place, turning tables quickly (with quality service and food) should be a top priority. \n\nThe servers appear to lack proper server skills, although pleasant. Our server forgot to put our order in...(she admitted after we were waiting over 45 minutes). She didn't return to provide coffee refills (we had to ask the host twice to send someone). I would recommend that an investment be made in managing the front of the house as customers were pouring in and happily waited for a table. Unfortunately once seated, we witnessed customers get up and leave or openly discuss their disappointment with the service. It was really simply unacceptable. \n\nAgain great food- service is yet to be desired. I hope that the service piece can be sorted out as this place is a gem."
    },
    {
        "id": 39,
        "text": "First time at this location and they did not disappoint. Definitely a step up from the Ogontz location. They are a little on the small size, quite cozy great for small dining groups. The tables are set up for party's of 2 or 4. Would most likely not appeal to large groups and Probably not somewhere to bring the kiddos. The decor is warm and inviting with light music playing in the background. \n\nThe food is very tasty you can never go wrong with the red velvet waffles. The chicken and waffles are also a great go to item. The staff is very friendly and attentive, you are greeted quickly upon arrival. Takeout orders are processed quickly and correctly. During my visit they were nearly full yet the still managed to take my order and get me on my way in under 30 minutes. While I waited for my takeout order no less than 3 staff members walked to the front of the restaurant to greet me and inquire if I needed seating.  \n\nI will definitely be back with friends"
    },
    {
        "id": 40,
        "text": "I wanted to love this. A black-owned breakfast place. We need more of both (black-owned and breakfast) around here. The service was fine, seems like they've worked out some of the kinks from earlier reviews. We are used to breakfast places having a wait on a Sunday morning. The hostess was courteous and competent. The place is clean and fresh-looking. But no one in our family of three loved their meal. We waited a long time and it was \"meh.\" Both my daughter and I got something on our plates that seemed suspiciously like store-bought-fake-cream-cheese-icing. You know, Betty Crocker. The home fries were salty and dry. We want natural, homemade breakfast. Also, my husband's meal and my side dish came out at least five minutes after the first two entrees. We will keep schlepping to Sabrina's and Honey's and Morning Glory. So disappointed."
    },
    {
        "id": 41,
        "text": "Been there 4 times. Eaten only twice.  Food was very good but service was slow. Also pricing was a bit off kilter. Certain potatoes were more but not clear on menu   The other two times I was there  once on a Sunday at 12 w grandson and told a 45 minute wait. Unbelievable for only 3 other people waiting.  Today went in and was told 10 minutes. Was third in line but after other two couples were seated the hostess game out table to people who came in after us. Btw. There were two tables in back that were empty the whole time.  Never ever again wil I waste my time."
    },
    {
        "id": 42,
        "text": "The atmosphere was calm and inviting.  My server, Gus, was polite and attentive.  The menu choices and prices are reasonable.  I will definitely suggest to my family and friends to check out this restaurant. I just have to figure out how to get to the parking lot in the back."
    },
    {
        "id": 43,
        "text": "I went early on the spur of the moment so I don't know what happens when they are booked. However, my meal was delicious and the service was friendly. We needed a place with flavor in Chestnut Hill."
    },
    {
        "id": 44,
        "text": "Went for brunch one Saturday. My husband and I were the only ones there but were left unattended and unimpressed. They BLASTED very inappropriate R&B music the whole time. I guess I should think \"bumping and grinding\" and making \"sweet sexual love\" is appropriate brunch music......."
    },
    {
        "id": 45,
        "text": "I was finally able to stop in and visit the new attraction on the hill. \nThe food was great. The three of us all had pancakes and they were great. I included a picture of mine, the cinnamon pancakes w/ buttercream and vanilla sauce. Amazing! I am a bacon snob and they nailed it (also in the pic). \n\nI enjoyed the atmosphere and felt that, while small it did not feel as though we were on top of the other tables. \n\nThe only reason I did not give Breakfast Boutique five stars whas (like over reviews) the service was slow.  Our waitress was nice but not nearly as available for questions (or to remind them that my friend did not get her side of fruit) as we would have like, given that it was a late Tuesday morning and it was not crazy busy.  The person who took our drink orders seemed out of his element and we all wondered if we would even get the right drinks. We did!  \n\nI am a local and will definitely be back.  I am looking forward to trying other things on the menu, because if today was any indication the other dishes will be great!"
    },
    {
        "id": 46,
        "text": "Waiter Gus was awesome, good food, great vibe and decor...will return for sure...I love the look, quaint, clean and nice music"
    },
    {
        "id": 47,
        "text": "The wait was 30 minutes not bad. Got seated took 20 minutes to for a random ass server to come by and take our order, then waited about an hour for our food, the people behind us were seated after us but received their food before us, then when we started to get our food, it didn't even come out together. Food was okay, definitely not worth the wait. when I ordered food from here on ubereats it came quicker and looked better. I won't be coming back here again until they get their shit together."
    },
    {
        "id": 48,
        "text": "We've been here a few times and very consistently half the food on our table is great and the other half is terrible. Oh, and their wallpaper is upside down."
    },
    {
        "id": 49,
        "text": "Sadly, this was an extremely poor experience. I take into consideration that they are new and were slammed on Memorial day but knowing that this is their second location I expect most of those kinks to be worked.\nWhen we arrived we were told 20 - 30 minutes. We waited for 45 monutes before they seated us and another 25 at our table before anyone acknowledged we were sitting there. The manager (owner?) was chatting with one table of customers and the hostess sat up front on her phone when she wasn't answering the business phone. No one was refilling coffee or water.  Finally, the waitress took our order, we received our drinks and continued to wait another 45 minutes for our food. We ordered eggs with hash, pancakes and traditional eggs, bacon and hash-browns. The pancakes and eggs with hash came first. Two fluffy pancakes topped with a strawberry and \"Iknowthatwasnt\" butter, served with maple flavored high fructose corn syrup. The eggs and hash were over hashed and under seasoned. Then the bacon and eggs appeared with typical cubed potatoes, nicely browned with little to no seasoning. The bacon was tasteless. The egg-white of the over easy eggs were clear and even cool on the inside. But no one returned to ask us how our meal was until we were finished. I mentioned the eggs and the waitress said \"that's over easy\". She did offer to have them cook me new ones but by that time we were DONE. I did eat a bit of the under cooked egg and was sick for about 24 hours. Sadly, we were really excited about a breakfast in our neighborhood but this won't be it."
    },
    {
        "id": 50,
        "text": "Waited 10 minutes even though tables were available - front desk person not very welcoming . We were 2 and she explain that the table (for 4) was for a bigger parties. We hesitate to drive all the way to Germán town because of the poor service related reviews - The reviews were right. We left and found CAKE - what an amazing place!"
    },
    {
        "id": 51,
        "text": "Wanted to switch up our brunch option today so came into Breakfast Boutique for the first time. Two of us waited about 15 minutes for a table around 1pm on a Saturday. The place was jam-packed! Tons of great menu options and an entire vegan section for those who have dietary restrictions. We shared the jerk chicken and waffles as well as the sampler platter which consisted of 1 cinnamon swirl pancake, 1 red velvet pancake, and 1 slice of stuffed French toast. The food was BOMB, seriously so good. We loved everything! The only downside was that service was sllloooww, so don't expect to be in and out quickly. However, the staff were all very friendly, so if you have time to chill definitely check out Breakfast Boutique. Reasonable prices and great food!"
    },
    {
        "id": 52,
        "text": "In town for a socially distanced wedding and found this gem of a breakfast takeout near our AirBnB. They make a fabulous breakfast sandwich on a buttery croissant, perfect turkey bacon (NOT some processed slab of who knows what), neatly filled with fluffy eggs (not stuffed beyond), and just the right amount of cheese. Super delicious. Plus staff had such a loving vibe, COVID conscientious service and all."
    },
    {
        "id": 53,
        "text": "Just what chestnut hill needed!\nPretty breakfast and lunch spot. Great menu, something for everyone !"
    },
    {
        "id": 54,
        "text": "Had an amazing Saturday morning breakfast! First time visiting Philly and was so happy I found this place after searching through several yelp suggestions! First I love that it is black owned!!! Second the serve and the food was amazing. The place is located in a beautiful area so although we had to wait 20 minutes the time flew by, and they gave us a call once table was ready. Started with OJ, very fresh! Ordered the home fries with peppers and onions, fried chicken and waffles, and the sampler plate which included red velvet pancake, stuffed French toast, and a cinnamon swirl pancake!! Definitely worth a try, all was amazing! The serve was great, had three lovely women all checking on us throughout our dining. Would definitely recommend and go back again!"
    },
    {
        "id": 55,
        "text": "Great service we had a party of 10 ! Everything was delicious and take even better. I will be back again."
    },
    {
        "id": 56,
        "text": "Took me awhile to get around to trying BB but glad I did!  Had a great breakfast and was so happy to have many gluten-free options.  The fish and grits were very tasty and looking forward to trying the Buckwheat Banana waffle or pancakes and the many (maybe too many) options.  Service was friendly and timely. Hope they do well in this location and happy to have a nearby brunch spot!"
    },
    {
        "id": 57,
        "text": "Food was fresh. Very tasty and flavorful good. Service was good. We had made reservations which is apparently not well known you can do so. I def will go back."
    },
    {
        "id": 58,
        "text": "Really good food!! So I was going to order the veggie omelet with potatoes and toast. The chef must have read my mind and brought out the veggie omelet for free. Delicious!! So I ordered potatoes and a waffle, both were good even though I needed the potatoes to be fried hard, they did and they were great. My SO ordered the bananas foster French toast and is still trying to duplicate the taste,  to no avail. Guess we have to go back!"
    },
    {
        "id": 59,
        "text": "If I could give 0 stars, I would. We were visiting from out of town and arrived at about 120 on a Sunday afternoon.  We did get seated in about 5 minutes, waited about 10 min for someone to take a drink order (coffee and OJ..we never did get the OJ). The waitress took our order and that was the last we saw of her.  We were completely ignored. No offer of more coffee or our missing juice.  We finally left at about 205 and just left cash for the coffee on the table."
    },
    {
        "id": 60,
        "text": "Give it another chance.\n\nI don't know if it's because it's a somewhat new restaurant or maybe they were going through staff changes?? Maybe these one star reviews are from  the boutiques early days??\n\nBut I can say EVERY time I've been here the food was amazing!! The first time the service sub par but has been decent every time since. \n\nSometimes they are packed but I've never waited extremely long.  \n\nMy only complaint currently is the flies which I'm telling myself are one of those unavoidable things in food service because I love the food so much \n\nAnd occasionally they get swamped because the food is so good. \n \nThe staff is always so attentive otherwise so I really believe they have good customer service and really check on every customer but sometimes get slammed. \n\nLiterally the only thing I didn't like about my most recent visit were swatting ya flies and waiting a little long for one of my water refills. \n\nGreat improvements over their early days. \n\nGIVE IT ANOTHER CHANCE even if you've been twice already."
    },
    {
        "id": 61,
        "text": "I go every Sunday after church. It is one of favorite places to go for breakfast. The Staff is great , the good is great .....just a GREAT place !"
    },
    {
        "id": 62,
        "text": "Went to the newest BB location on Germantown Ave near the Fire Station. First, I love supporting black owned businesses but today I was totally disappointed in the food. The service was good. The ambience was lovely. The place was very clean. The food arriving to the table is very slow so be prepared to wait. I ordered the red velvet waffle and chicken wings. First, the red velvet waffles were more pink then red then it arrived to the table with all this sweet sauce abs cherries. They do wayyyyyyy too much. Keep it simple. And the chicken wings were under done. Pulled the first 2 wings apart and they had a little blood in them. The BB overdo their food and really need to simplify their breakfast. This will not deter me from coming again. Will definitely visit again in a couple of months."
    },
    {
        "id": 63,
        "text": "We were so excited to try this place after all the good reviews, we tried to eat here twice but after not being served after 15min we left... AGAIN!!!!  Fool me twice shame on me"
    },
    {
        "id": 64,
        "text": "I really enjoy the food and great service I always receive at the Breakfast Boutique however one thing continues to bother me. There are always flowers on each table. Unfortunately the last several times that I have been in the flowers have been terribly wilted and in disgusting water.  Please, if it's too costly to replace the flowers simply eliminate them."
    },
    {
        "id": 65,
        "text": "I initially visited the BB since it was recommended by my dad and have frequented it for almost two years now. The food is delicious, the staff is friendly, the atmosphere is nice, the restaurant is clean and I will continue to be a consistent customer as well as recommend others."
    },
    {
        "id": 66,
        "text": "Very rude and unprofessional wait staff.  You can tell that there is no formal training for the waiters/waitresses.Memo to the owner  hiring your family and friends with no formal training to work in your  \" customer service \"business is a recipe for disaster.  This past Friday visited with my wife and daughter. Middle age black male server dictated to us the menu choices and kept interrupting us when giving our selections. Also he told me \" I must have not been paying attention\" when I questioned an upcharge on a menu item. I then went to seek out the manager and he confronted me as well disputing everything I said. I have been to this establishment numerous times to get takeout and my order over the phone is never correct when I get there. Don't let the the remodeling and atmosphere fool you. If your willing to sacrifice good food for poor customer service then your right at home.  I left and went to Ihop afterwards where they \"get it\" with regards to personal touch and people skills. I have given this place more than enough opportunities to change my opinion but I will never return here again. #Itrytosupportblackbusinesses but this one let me down"
    },
    {
        "id": 67,
        "text": "Service is terrible, breakfast was delivered cold, items ordered were never served even after 1 reminder to the wait staff. Food was undesirable."
    },
    {
        "id": 68,
        "text": "What an incredible disappointment. I really wanted to love this place but was horrified by the food and the service. First: the food. We had an array of orders at our table and they were all terrible. The breakfast sandwich on a croissant was inedible. The croissant was literally so stale it was rancid. The eggs were rubbery and over cooked. The bacon was all dried out. The eggs Benedict were undercooked and the English muffin so stale you couldn't cut through it.  The \"cheese\" on all orders was orange and clearly pre-shredded from a bag- zero flavor. The sweet sampler we got was smothered in a sickening pink sauce meant to resemble strawberries - not fresh - and the pancakes and French toast were totally dried out. I literally feel sick after eating the small bit that I did. Second: the service. SLOW. The only saving grace was our sweet and kind waiter who apologized profusely for the food and very quickly removed two of the items off our bill. What a shame- so much potential. I have no idea what these other reviews are about but as a total foodie, please trust me, ignore the hype... and don't waste your money... or time."
    },
    {
        "id": 69,
        "text": "I want better for this business which is why I must leave this poor review.  I haven't had this experience at the broad street location, but the location in chestnut hill needs serious improvement to its operations.  The phone is never answered for takeout and the deliveries are either incorrect or never delivered.  It's unfortunate because the food is mid so for the service to be even worse makes it difficult to continue giving them my time and money.  Please start doing better."
    },
    {
        "id": 70,
        "text": "Had a great time.  Went there with 7 of my family members, and even though this is a small establishment...they pulled out another table just so we can have plenty of space to use our elbows to eat that delicious food.  Thanks guys for the happy and wonderful experience.  Loved it and I recommend everyone go there. \nSigned,\nMost happy customer :)"
    },
    {
        "id": 71,
        "text": "I love Breakfast Boutique. The food is always yummy and the service has always friendly. Not somewhere to go when you're in a rush, but why would you rush chipotle sweet potato hash and red velvet pancakes? I mean, really?"
    },
    {
        "id": 72,
        "text": "Just called to order take out and from the initial call you could tell this is a professional business....."
    },
    {
        "id": 73,
        "text": "Stumbled upon this great spot for lunch. Absolutely fantastic! You cant go wrong with the jerk chicken and waffles. Staff is great! We will definitely be back."
    },
    {
        "id": 74,
        "text": "We came here with high hopes since we have had great experiences at ever other resturant in chestnut hill.....spoiler: we were let down! It took an hour maybe longer for our food to come and we had to wait for a waiter to take our order for 25-30mins?! Never a \"sorry food will be out soon\" or \"sorry for the wait\" came our way, it was plain rude and we were starving with our 2 year old growing grumpier by every passing minute. When our food came we enjoyed the food it was nothing crazy delicious but also not disappointing. The big problems came when we asked for the check, our food was surprisingly expensive and we found out it was because they charged us the wrong amount for our two-year-olds meal. We ordered off the kids menu for him to have ham and eggs that were supposed to come with pancakes but we totally forgot didnt come because we are ourselves were just starving and not thinking by the time the food came. We asked them why the price was not the one on the kids menu and they said that we didn't make it clear enough that we wanted a kids meal. This whole thing really confused us because our two-year-old was supposed to get pancakes eggs and ham but instead only got eggs and ham yet they were trying to charge us more insisting that it was not the meal on the kids menu because THEY forgot to give us pancakes?!? After arguing like a customer should never do they told us they would change the price and that their receipt machine wasn't working so they would email us the receipt. Well I just checked my email and guess what.....THEY DIDNT CHANGE THE PRICE!! These people are liars and rude ones at that 20 out of 10 would not recommend coming here! Save your self the hunger pains and stress lines!"
    },
    {
        "id": 75,
        "text": "Mediocre at best. Seating process slow for no apparent reason. Coffee was the worst I've ever had at any price, but this was 3 dollars. Other folks brought their Starbucks with them. More butter does not make something good. The grits had a large pool of grease on the top. The whiting was good. My partner asked for onions and peppers in his potatoes.  There was a tiny spoonful and they charged a buck or more for it. Avoid going."
    },
    {
        "id": 76,
        "text": "We decided to try the new Breakfast Boutique in Chestnut Hill yesterday. Food was wonderful and staff was attentive and lovely. Don't miss the quinoa hash - delish!!!! A perfectly enjoyable breakfast experience!"
    },
    {
        "id": 77,
        "text": "Excellent breakfast place at the top of the Chestnut Hill. Fresh ingredients, carefully prepared and served in a warm, welcoming dining room."
    },
    {
        "id": 78,
        "text": "We dined at Breakfast Boutique for the first time recently and I have to say, it was an extremely disappointing experience! There were no less than five things we requested only to be told they were out of them. And these were not special requests, these were items offered on their menu. No avocado toast, no wheat bread, no cornbread, no scallions and the list goes on! The order was incorrect when received, but being hungry, I agreed to keep it. A side order of sausage was browned on one side only and found to be inedible. \nAlthough our server was pleasant, she made no attempt to make up for the restaurant's shortcomings. \nI will not return to Breakfast Boutique nor will I recommend it to anyone!"
    },
    {
        "id": 79,
        "text": "Came in on a Sunday morning. They took my name said the wait is about 40 minutes. Long story short, they never called even though I gave the place my phone number.  You could tell just by way of a quick observation the place and the wait staff moves quite slowly.  You could say they are on their own time. Get the sense they would not move any more quickly if someone yelled fire. No, won't ever be back.  2 hours later they still haven't called."
    },
    {
        "id": 80,
        "text": "Ok - after you get past the looonnng wait time - you will be so happy you decided to wait! The servers are super friendly, the coffee refills are free, and the food is to die for! It took a little while for the food to come out, but oh man it looked and smelled amazing the moment it hit the table. \n\nWe ordered jerk chicken wings - full of seasoning, heat and so much flavor. The shrimp and grits come with cheese and oh man, it melts in your mouth! Lots of butter in the grits but it just kicks the silkiness and smoothness up a notch. For the grand finale we shared stuffed French toast with a sweet cream cheese filling and strawberry compote. Believe me - I would order this whole meal over again and not be tired of it!\n\nBreakfast is served all day and lunch is served at 11. Parking is limited in this area but the location is wonderful. There are so many cute shops and stores you will have plenty of things to do while you wait. Dont let the parking or wait time intimidate you - def try it out! You will be back for more!"
    },
    {
        "id": 81,
        "text": "So I've now been here twice and both times the food is absolutely amazing. I had no idea there was such a thing as perfect scrambled eggs and toast like wow. However when I arrived this morning at opening time they were not prepared and it took 20 minutes for them to get to me and ask for my order. I work at a place that is on a schedule so I understand the stress and with that, how important it is to be ready. So that was disappointing. The overall service was better than the first time but probably because I was one of 4 customers. The first time I was there it took at least half hour to get my food because they were overwhelmed which is good for their biz but bad for all those waiting."
    },
    {
        "id": 82,
        "text": "After reading the reviews I decided to give this place a try anyway. I do not regret my decision. The only difference is that I ordered from Uber eats. The food got here before expected and it was amazing! I ordered the fish and grits with cornbread. At a first look, I thought the fish wasn't done, but it turned out to be done and lightly fried with a good crisp. Everything was good."
    },
    {
        "id": 83,
        "text": "Today we went to this restaurant for breakfast and after an entire hour waiting for our food, we asked what happened to our breakfast. The server said she would check and let us know. A few minutes later she came back and said they ran out of eggs and waiting for the truck to deliver more.  Seriously, they kept us waiting an entire hour!!!!!  They should have told us they ran out of eggs before they even seated us.  The last time we ate here we waited for our breakfast about 45 minutes.  Eggs do not take that long to cook.\nAlso, when we went there today the music was entirely too loud and it sounded like they were playing Gospel music.  For someone like myself who is an atheist, that was really insulting. No one should be held hostage listening to religious music - shame on them!!!!  Do not waste your time eating here."
    },
    {
        "id": 84,
        "text": "The food was amazing! The reason I gave them 4 stars was because the wait was incredibly long! It is a very small restaurant on the top of the hill in Chestnut hill and the atmosphere was very intimate, which my friend and I enjoyed. Once we were seated, which did take over 20 mins, it took a while to get the food. The food made it worth the wait. It could have been a long wait because it was prime time brunch as well."
    },
    {
        "id": 85,
        "text": "After a short wait on a busy Saturday we were seated at 8:30 AM.  All the waitstaff were friendly and seemed to care about our experience. The concierge was helpful in recommending where these two out of towners could find a newspaper. \n\nWhile we waited for the waitress, another patron started watching a boxing match  without muting his phone.  My companion asked him to please stop. \n\nOur waitress showed after a minor delay. She was some some time later to say our order was in and should be up soon. It seemed that she was showing too much concern with what was a wait but not out of line yet. Meanwhile our interactions during numerous coffee refills were very positive.\n\nThen I started watching the clock because I was only in town to attend a funeral and the wait was extending beyond the time I needed to clean up and pack prior to check out. At 9:20 another waitress stopped (not the 1st one who did not have the courage to show after her many assurances) to say, \"OK, so somehow your order was lost and...\" I stopped this patter with a \"No\" and an explanation of the circumstance. I then stated, \"I assume the coffee is free\", was assured it was, and walked out with my companion.\n\nThe menu looked terrific but we never got to taste the food. We were left wondering if somehow we were tagged as rude out of towners who had the temerity to ask a regular to please conform to appropriate device protocol in a public venue."
    },
    {
        "id": 86,
        "text": "Although the space is small, I was pleasantly surprised with the excellent service and even more delighted with my food. I had fried fish and cheese grits. Cooked to perfection. The coffee was flavorful but the cornbread was a little too dry for my taste and cold.\nThere were a few groups of friends celebrating and many folks waiting to get a seat. Would highly recommend for breakfast fare. Came back with my daughter for lunch and was just as pleased with another fish order with fries and coleslaw. Did not know slaw came with it, so ordered as a side dish. Wish the server would have told me...Two different recipes... I'll pass next time on both. \nGood place for a couple or a group.  Make reservations if you can!"
    },
    {
        "id": 87,
        "text": "Amazing breakfast!  Very satisfying!  One of the best French Toast I've had in Philadelphia"
    },
    {
        "id": 88,
        "text": "It's really disappointing when you try to support Black owned businesses thats a 30 min drive  from home and they fall short repeatedly. Yesterday I visited the Chestnut Hill location and I did not receive all the food I ordered and paid for. Although, I was giving a credit from the manager Jose for the missing items it was useless. I ordered Today from their Mt. Airy location\n (CH was closed). I didn't mention my credit to this location because when I asked for Jose he was unavailable. The Food-Let me start with the fact that I will NEVER eat eggs again as there were shells in our eggs! No cornbread, No cheese grits!! I was told I could get credit but at this point I never want to deal with this restaurant again! It's Unbelievable that BOTH locations failed to get my food right! Yesterday, I was told it was because of the time @ 2PM so I was sure to get there early today @ 10 AM! Fish, cheese grits, cheese eggs and chicken and waffles is not Difficult to make! I get It every weekend at an establishment that's Not 35 mins from my house! It's Not Black Owned but I'm over supporting Black establishments just because ! That's $100 down the drain.. Both days my food was $45 plus and I was disappointed Both days!"
    },
    {
        "id": 89,
        "text": "Super delicious and some interesting creative menu choices. Also veg and vegan options!"
    },
    {
        "id": 90,
        "text": "Food is great. Service is terrible. Staff is always seeming depressed and that effects the customer experience."
    },
    {
        "id": 91,
        "text": "The food was \"OK\".  The poor service is a real turn-off.  Doesn't cost anything to smile sometimes, wish customer a nice day; check on them to see if the order is correct (it wasn't) or if they need more coffee (we did).  Older woman hostess - and perhaps manager? - manages to sit on her stool in the back and manage her cell phone more than anything else."
    },
    {
        "id": 92,
        "text": "I want this to succeed, in part because I want to see more Black run businesses in Philly. Food was very good, especially buttery grits. They were overwhelmed by the big number of customers on a Sunday morning at 8 am - 9:30, so there was a long line. I'm hoping they figure out how to speed up to handle the volume. We enjoyed our meal and will come back in a month, to try again."
    },
    {
        "id": 93,
        "text": "Great food. There was no host. Lots of customers waiting at the door for 10-15 mins. A customer decided to take matters into her own hands and write a list of who is next.  No manager on site. I will say the servers do try their  best. Would give another try but as take out."
    },
    {
        "id": 94,
        "text": "I love this place and glad they created the Mt. airy location . Try the shrimp and grits !"
    },
    {
        "id": 95,
        "text": "So I definitely understand how covid has effectively changed businesses. But I have been here before and Covid and as recently as today. Service is horrible. Please be prepared to watch every table as well as take out orders get served before you do. The one server was nice but waited 45 minutes for a waffle. Food was good the previous times I came despite the horrendous wait times. But I still would recommend just getting a good breakfast from another place unless you have a hour to spare. I will definitely not be returning here. The service at green eggs was much better"
    },
    {
        "id": 96,
        "text": "Oh my goodness, this is the most delicious food, served in a beautiful setting. This is very gourmet comfort food... My favorite items are the shrimp and grits, the beef bacon, the red velvet pancakes and just about anything else on the menu! Wonderful restaurant and I have been to both the Chestnut Hill and the Mt. Airy locations and both are lovely."
    },
    {
        "id": 97,
        "text": "Great take on traditional breakfast foods.  Staff is very friendly and helpful, making for a nice energy and atmosphere. Worth the trip and the wait."
    },
    {
        "id": 98,
        "text": "OMG this is an incredible breakfast spot. Blueberry pancakes, eggs and sausage, as well as the best Chicken and Waffles ever!  Waiter Brian as well as everyone there was so energized and helpful!  Put this on your list people!!!"
    },
    {
        "id": 99,
        "text": "Great spinach salad with blue cheese and chicken. Good service and price. Very happy to stumble upon this place for lunch. Highly recommend."
    },
    {
        "id": 100,
        "text": "Absolutely chic ... food was great... will be back ... definitely found a new breakfast restaurant and it's in one of my favorite places in the city..."
    },
    {
        "id": 101,
        "text": "I ordered take out breakfast today. The place has potential but the 15 minutes I had to wait for my order I had to swat flies. The flies are a big turn off for me. I should have checked my order and instead of giving me waffles I got pancakes. The pancakes were average. The place has potential but dirty. Needs TLC. Don't think I'll be back but I wish them the best of success. First and last time at the Breakfast Boutique."
    },
    {
        "id": 102,
        "text": "Wish I could actually review this place, but we walked in at 3:45, and we were advised that they were only doing take out as they were scheduled to close at 5PM. The hostess asked if we wanted a take out menu, we declined. We won't be back."
    },
    {
        "id": 103,
        "text": "45 minutes later, third fill of coffee, no one coming over to the table to discuss why eggs Benedict is taking over a half hour. Only two tables have food in front of them. I wish this worked better.l"
    },
    {
        "id": 104,
        "text": "Best breakfast spot around!!!! The food was amazing. Our waitress was very nice. I will definitely be coming back!!!"
    },
    {
        "id": 105,
        "text": "Parking: Street. Metered \n\nAtmosphere: relaxed. We had to wait about 20minutes. This location is very small.  We stood out in the vestibule because people where almost shoulder to shoulder. \n\nService: The host was pleasant. Aiyana was our server and she wasn't the best. She wasn't organized and was all over the place. We had to ask for place setting and items several times. She never came back to check on us or to refill our drinks. \n\nFood: I ordered the stuffed french toast with strawberries. It was too sweet for me. I think it was the cream cheese filling. I had the turkey sausage which was two very thin patties and they  were overcooked so they were hard. My Sister got the waffles and they weren't good. She ordered the fried fish and that was pretty good. Sorry I didn't take a pic. We are it so fast! We enjoyed that and left the rest of our food. It was like we hadn't ate. We saw other people meals and they looked good. \n\nWe weren't satisfied with our choices but we will come back for another try."
    },
    {
        "id": 106,
        "text": "Love the people and the food, but the service... \"meh.\"  \n\nWe were the first ones in the door when they opened at 8 (Breakfast places should open earlier than 8, but that's another story.)  \n\nWe didn't get our food until 8:50... so much for a quick working breakfast.  We were told at one point the chef wanted/needed to change the oil in something... do that before you open!\n\nI hope they take this as constructive criticism; I want to see them succeed."
    },
    {
        "id": 107,
        "text": "Went there during a busy time and the service was awful and they were completely unorganized.  The servers and hostess were having to buss tables since there was no busser.  They were cleaning tables off with a dirty rag. The hostess barely acknowledged us when we walked in.  After we were seated they were not very attentive to us.  We asked for iced tea.  They automatically gave me sweetened tea.  My dad also asked for an iced tea and they gave him one without ice.  They forgot a couple items that we had asked for and tried to bill us for it.  It took about 20-30 minutes just for us to get our drinks.  Then they never gave us straws.  When we asked for utensils (which, again, we had to ASK for) the person was kinda rude and it STILL took a while for them to deliver.  My mom's food was cold after waiting an hour.  Just overall, not such a great experience.  Would definitely not go back.  The food was OK.  That's about it... been in the food industry a while so it's hard not to be such a critic."
    },
    {
        "id": 108,
        "text": "My girlfriend and I wanted to try something new, and although we live right around Chestnut Hill, we've never tried Breakfast Boutique. It's a small and beautiful building, it was busy so we were waiting a little before we got seated, about 30 minutes or so. We waited maybe another 25 minutes before the food came out, but let me tell you right now: the wait is absolutely worth it. The food was great, the waiter had a great sense of humor, we enjoyed our time here!"
    },
    {
        "id": 109,
        "text": "I don't usually leave reviews but this establishment deserves it! I simply ordered breakfast to take out and I was pleased from the moment I walked in until my last bite of food. The atmosphere was very comforting and really clean. The staff was very professional and friendly. The food was amazing. I keep telling my friends about my experience. I would absolutely recommend this place to dine in or take out."
    },
    {
        "id": 110,
        "text": "This restaurant is by far one of the worse in Philadelphia I've ever been to.  they do NOT CARE about the Quality of their food! I received Burt bacon although Door Dash gave me my money back. this restaurant needs learn that poor quality isn't acceptable!"
    },
    {
        "id": 111,
        "text": "OMG. Ridiculous. I got there at 8:50am on a non holiday Friday. Waited 20 minutes for a table. Sat down. Waited another 20 minutes. No one even took an order. All together it was nearly an hour. The service was ridiculously slow. This is not Manhattan. It's Chestnut Hill. I wanted to support, but, no. Mt. Airy breakfast and lunch here I come."
    },
    {
        "id": 112,
        "text": "Food was good the service was terrible....\nWaited 45 mins to be seated and that was just the beginning of our wait. After placing our orders we waiting 40 mins for the server to bring out the wrong food. We came to find out the order was put in completely wrong by the new waitress. Things happen and my friend and I were understanding. They told us our correct food will be out shortly. Well shortly turned into another 40 min wait and  they brought our food out piece by piece. My friend did not get his home fries until well after he and I both finished our meals. At thIs point we asked for check and had to wait another 25mins for it to be brought to us. Just be told that the owners felt a 25% discount was sufficient. After spending a total of almost 3 hours at this place. Waiting to be seated is to be expected however, spending another 2 hours in this place due to terrible service is unfathomable. After all of that waiting the food was good but it was not worth the wait or my busIness."
    },
    {
        "id": 113,
        "text": "One of the few restaurants that I get excited about going to. Staff is amazing and so is the food. My goto dish is the fried whiting with grits and cornbread."
    },
    {
        "id": 114,
        "text": "The food is good, the service is good. Even though the phone is always ringing with customers calling, staff remain pleasant! There was confusion one time with my order and honestly I couldn't even be upset because the staff quickly addressed the issue and apologized."
    },
    {
        "id": 115,
        "text": "Skip!!!  This was an Uber eats order.  I wanted to like this place however they forgot a large part of the order when I ordered with coworkers at work.  My coworkers also said they did this happened before when they first ordered before the pandemic .  I will stick to my favorite little diner in Mt airy."
    },
    {
        "id": 116,
        "text": "I know that I shouldn't Yelp while angry.  I should just walk away and digest this experience before commenting on it.  But I can't cause I'm ticked off. (To put it nicely)\nLet's just say that, the length of time spent waiting for one's food should have some correlation to the awesomeness of its ultimate flavor.  And there ain't no food that can live up to a 90 minute wait (from signing in to plates to table). I mean, it's gotta be such awesome delicacy that you'll forget all about the inconvenience.  But I can't.  The food was mediocre and the waiting insupportable. \nAnd to think we brushed off previous comments about too long a wait.  We shouldn't have, but we've learned from our mistake.  \nMy wife wants to add details: \nThe problem here was not just the long wait. The problem is that people who were seated the same time we were got their food, ate, paid, and left before our food arrived. The problem is that when we asked about the food we were lied to and told that the hold up was the dish my son ordered - the exact dish ordered by the gentleman seated when we were. The problem is that when we became visibly agitated we were offered a free price of cake - before our food arrived. Because what one wants before breakfast is s big piece of cake. The problem is that at no point did anyone take responsibility or apologize. The problem is that rather than trying this right everyone has stopped speaking to us - everything has been brought and taken away wordlessly. In short, the problem is the worst service I have ever encountered. \nFinally, my son said: for the wait to be worth it, the food should have been better and fed to me while I laid in bed watching YouTube."
    },
    {
        "id": 117,
        "text": "The food is the BOmB, the staff is amazing love it.  I had everything on the menu. My food was nice and hot when it arrived to my table."
    },
    {
        "id": 118,
        "text": "I was really looking forward to trying this place and was truly disappointed once we got there. The service was horrible and I could have made better food at home. The words of my husband. They shredded cheddar cheese and American were the only options whereas even the local diners have feta cheese. I know I am being picky but the devil is in the details, options and creativity.  \n\nThe shrimp and grits were greasy, and the scramble eggs were overcooked. Very disappointing"
    },
    {
        "id": 119,
        "text": "First time visitor and I was at first very impressed with the decor. However the hostess was rude and unwelcoming. The waitress was professional. However, the food was not good at all. The chicken was dry and had very little meat to be considered a main course. Who considers four small wings a meal? The corn bread was good but the coleslaw was way too watery. I was still hungry after eating there. The portions are so small. I will not be going back."
    },
    {
        "id": 120,
        "text": "Wonderful food, but the worst service I've had in a LONG time. We came in on a Monday afternoon around 1, and there were only 2 other tables seated at the time.  After we were seated, it was several minutes before someone took our drink orders. Then another 10 minutes before we given our beverages.  A few more minutes passed before a waitress FINALLY approached and took our orders.  We weren't served our food until 40 minutes later.  No apologies or explanations for the wait, and the restaurant was very quiet at this point.  I can understand waiting a bit longer for food if an establishment is jam packed, but can't fathom why simple breakfast food should take such an excruciating long time if the place is empty.  The food was delicious when it finally did arrive, but the incredibly slow service and apathetic staff will keep us from returning again."
    },
    {
        "id": 121,
        "text": "This was my first time at breakfast boutique. \n\nWow, the food, the service, and the price, is very fair! \n\nIf you are a vegetarian there are options for you! \n\nDelicious,  filling without being heavily fattening  and soulful. We will go again!\n\nI Look forward to my next visit!"
    },
    {
        "id": 122,
        "text": "Food was great but the service was super slow.  The waitstaff was friendly and polite, but the wait just didn't seem logical because at one point, I looked at table and no one was being served.  May have been an internal issue that no restaurant can afford to have.  I'm willing to come back on a less heavy traffic day.  When I do, I'll change my review."
    },
    {
        "id": 123,
        "text": "This is a Black owned restaurant with a great staff, great service, and great food. The decor is fun and modern. They're always crowded but they try to get you seated quickly. They also don't typically take same-day reservations, so keep that in mind! My favorite person on their staff is the young, gentleman with the beard. You'll know who I'm talking about right away. He's always pleasant, friendly, and brings good conversation to your table. Be sure to try everything on their menu as you won't be disappointed! The have great shrimp and grits, eggs benedict, and French toast!!"
    },
    {
        "id": 124,
        "text": "I had one hell of an experience at this location today compared to the extraordinary experience at the location on Ogontz Ave. First I called to place a take out order, the person who answered the phone told me to hold on meanwhile in the background i have hear the employees holding a conversation cursing up a storm, then I was hung up on. It took three tries to get through, when someone did finally answer i told them i was hung up on trying to place a order and she just asked me what I wanted instead of apologizing for the incident. I get there to pick up my order and two walked past me without asking why i was standing there. When they returned from whatever they were doing the finally acknowledged me. While i was waiting for them to bring my food i watched the girl prepare the utensils for the tables with her bare hands, no gloves or anything.  Lastly i asked for a piece of cake which i felt bad to do because they have the cakes displayed over a table where people were already seated. Finally got home to eat and the chicken i had was too salty."
    },
    {
        "id": 125,
        "text": "Great experience. Host very attentive and friendly, our waitress, Desiree was awesome. Personable and friendly, great recommendations and the food... gone before I even thought to take pictures. Sautéed shrimp & grits and the boutique belly buster both good choices. \nReal cute interior, positive atmosphere. We will definitely be back."
    },
    {
        "id": 126,
        "text": "Great breakfast spot on Germantown Avenue in Chestnut Hill. I went there with a friend of mine for Sunday brunch. There was about a 30 min wait but once we were seated the waiter came over to us to take our order. I got the salmon cakes with grits and it was very tasty. My friend ordered the fish and grits fish and she really enjoyed it.\n\nI would definitely go back, great service and the food is very good."
    },
    {
        "id": 127,
        "text": "The cinnamon swirl pancakes with sweet buttercream (tasted like cream cheese frosting), caramel sauce, and vanilla were fabulous!!! I could eat that everyday! I wish I had a picture. On the other hand, I would not recommend the french toast. It was way too thick, made from French bread, not light and fluffy like French toast should be. I went on a Monday morning, so I did not have to wait at all, which made the whole experience even better. I would highly recommend this restaurant."
    },
    {
        "id": 128,
        "text": "I tried and tried again.  I will not be back!\nI have gone to this restaurant several times. On the first visit, my order was incorrect. They made it right. The second visit, the food was okay.  My grandson needed a cup to take his orange juice home.  He could not finish it.  The server was charged $1.50 for the container.  When I heard about that, I was annoyed and gave them the $1.50. The third visit was fair.  The food arrived at different times, we had kids, and some of the food was lukewarm.  But we were celebrating a birthday, so we made the best of it.  I really wanted to like this place.  The final straw was when my husband and my uncle went for breakfast.  My husband figured that he would give them one more chance.  They waited 20 minutes once seated for someone to acknowledge.  They are slow, so the food took a while to be served.  They chatted and waited.  Once the meal was delivered, the server forgot my uncle's toast.  When he finally got someone's attention, he asked for it.  They brought it to him on a napkin, not a small plate, and laid it on the table.  They didn't speak a word, just put it there.  \nThe final, final straw came when the server came and told them that there is a 15-minute limit after you are done eating. We do understand that the place is small but when you are that slow to acknowledge patrons and to bring their food, don't rush them.   My uncle said that he would never go back even if they send a limousine and the food is complimentary. The food is inconsistent, and the service is consistently slow.  They will not see our family again, nor will we recommend this restaurant to anyone."
    },
    {
        "id": 129,
        "text": "Very nice little breakfast spot. Food was delicious,  I  recommended to others to eat here"
    },
    {
        "id": 130,
        "text": "Made a reservation at 9:15 and were seated at 9:40.  We sat for 10 minutes and were not spoken to or given silverware, water, coffee etc.  We the left and couldn't even find anyone to tell we were leaving."
    },
    {
        "id": 131,
        "text": "Delicious food and really cute atmosphere. The menu had a lot to offer and the food was delicious. The service was good, but not particularly fast. They were very nice and even ran out to give us my boyfriends glasses he left behind."
    },
    {
        "id": 132,
        "text": "This is my second time coming to the restaurant. First visit (Ogontz location) I had the chicken and waffles, and the chicken was extremely undercooked (bloody) and I was not compensated for my meal. Instead, the waiter took the piece of chicken that I bit into and fried it. Needless to say the service wasn't so great. \n\nAlthough I was hesitant I figured I gave them another try at the Chestnut Hill location. I got the pancake platter with grits and my friend got the chicken and waffles. AGAIN, chicken was undercooked and under seasoned. My food also lacked seasoning which is surprising since it is a black owned restaurant. When we told the manager, he handled it poorly. Again, no compensation towards the bill. The service here was also a little off. The servers were friendly but definitely not consistent and very forgetful."
    },
    {
        "id": 133,
        "text": "Breakfast Boutique Chestnut Hill you are truly magnificent, I had an incredible experience here today. We couldn't believe how cheap this place was. I could not decided what to order, but I am so happy that I had Turkey Sausage, it was absolutely fantastic. All of the staff are really helpful - you really feel welcome and looked after. Overall, we definitely enjoyed this place."
    },
    {
        "id": 134,
        "text": "The food was decent but service is very slow. It was almost 2 hours before our breakfast was served. The staff was friendly and apologetic."
    },
    {
        "id": 135,
        "text": "A close friend and I went to the Breakfast Boutique in Chestnut Hill. We were pleasantly surprised at the nice decor. We were seated right away and I was so surprised to have the waitress that I had on Ogontz Avenue's Breakfast Boutique  :)\nKim is the perfect waitress, friendly,  knowledgeable (about what's good on the menu), patient and attentive. \nI decided on the fish (Whiting) and cheese grits with a order of pancakes and coffee.\nI was real hungry, don't judge me!\nMy friend got Jerk Chicken and Waffles with a side of cheese grits.\nOur grits were just warm and when we told our waitress she didn't hesitate to get us a fresh hot replacement. \nOur dining experience was great. Will definitely go back. Only complaint which is not on the restaurant, parking is not the best. It's in a busy shopping area with parking meters, so take some quarters. There is a parking lot around the corner so if you park there be prepared pay and walk."
    },
    {
        "id": 136,
        "text": "The chicken was so salty it burned my lips and tongue. The bananas foster French toast was the extreme opposite- entirely too sweet. But the presentation was beautiful and the staff was really friendly- so I give some stars for that."
    },
    {
        "id": 137,
        "text": "The staff were nice but the food was just okay. Myself and another both got Eggs Benedict and it was clear it was not fresh and had been sitting. The eggs were over cooked and not warm. When we paid, the bill was clearly doubled and we're given no chance to see the bill ourselves. \nOverall, will not go back"
    },
    {
        "id": 138,
        "text": "As someone who cares deeply about supporting Black businesses I will no longer be supporting Breakfast Boutique. The business operations - answering phones, accuracy in orders, ability to work with Uber eats or doordash delivery service all means you may NEVER receive your food.\n\nMULTIPLE TIMES - I have ordered using doordash or Uber eats and the food wasn't accurate or EVER DELIVERED.\n\nThey can't keep up with the orders and don't know how to run the business. The food is not amazing enough to wait three hours for a delivery. \n\nNo longer accepting this poor service."
    },
    {
        "id": 139,
        "text": "This place is horrible. Too slow and unorganized. Rude employees. I will never order delivery again because it never arrives. They shouldn't be allowed to participate in Uber Eats ect... Just horrible ‼"
    },
    {
        "id": 140,
        "text": "Pointers - and you decide for yourself:\n\nWater doesnt run freely from the taps of Chestnut Hill - have to ask for it. When I did, only my friend got water - I didn't. Coffee - had to ask three times for a refill, they kept passing me by with the damn filled coffee jug. Food took around 40 minutes so we decide to pay for the beverages and leave. Then they say its ready. Then, my friend gets his food, I wait - again - for mine. Home fries - stay away. Very very dry, unsalted, no seasoning, zero taste. Also, cold. My banana french toast was bread \"almost\" dipped in batter, kinda not dipped, maybe semi-in-a rush-dipped. Kinda=not. I ate bread with cinnamon warmed up in some very corn syrupy syrup.\n\nStaff seems untrained. Ive never seen in all my years in the industry the waitress put down the tray full of beverages on the customers table then take out the phone from the back pocket of her jeans and answer it, and talk on the phone, while the four of them just starred at her in bewilderment. As were we, from the other table. Since the entire dining room was just starring at each other, no one had food in front of them. Just a bunch of people looking at the kitschy wallpaper, and each other, quietly, hungry, waiting, on a beautiful Sunday early morning."
    },
    {
        "id": 141,
        "text": "The food is amazing and its black owned so I keep giving them a chance. However, the service is so horrible! Every time its an astronomical wait to be seated, wait for a server, wait to receive your food. This was before the pandemic and has gotten even worse now. This past Saturday I tried dining w/a party of 5 and was told to wait because they weren't taking any more customers due to Covid capacity rules. We waited 20 minutes and were told they would call there other location because they had availability. I watched the manager call and put our names in, told us it would be a 30 minute wait but they would seat us. It took us about 15 minutes to get to the other location. When we arrived we were told that the other manager never called (even though I heard him call) and they were not taking any more parties that large. After asking to speak to manager he offered to seat us but it would be another 30 minutes or more. Like I said, this was not the 1st time we have had a bad experience and the managers never are accommodating. One time my husband never received his food, another time they lied and told us they didn't have an menu item when another table received that very item after we requested it, they have run out of orange juice, apple juice, and cranberry juice at times (remember they are known for breakfast). I will NEVER be back to this business."
    },
    {
        "id": 142,
        "text": "A nice and quaint place in Chestnut Hill. Service was great and servers were attentive. Do not be alarmed if you see people waiting. They move fast and the food is still great. There was a great addition to Chestnut"
    },
    {
        "id": 143,
        "text": "I'm giving 5 stars because the food honestly is amazing every single time I order.  The fish is always fresh and seasoned perfectly, their sweet tea takes me back to North Carolina times, and their customer service is awesome.  They are a small restaurant, so at times patience may be needed when it comes to waiting for your food.  But with the wait comes fresh cooked food served with a smile.  The atmosphere inside is lovely as well.  Great lighting and decor, and a homey feeling. There's always music playing, and great people to be around. Definitely a great spot to stop in for a good soul food breakfast."
    },
    {
        "id": 144,
        "text": "They have a really good menu w/a great selection of food to choose from. They even have a small section in it for those that are vegan. The service here is pretty fast saying how the restrictions from COVID-19 could really delay it. They had me seated in 4 mins and brought a menu out no less than a minute or two later. I ordered the fish & grits with their corn bread. Let's start with their corn bread! It was delicious had the right amount of everything in it. The fish & grits were just as good.(You will not be disappointed.) I added a little s&p to it, but they really impressed me with it all. I will be back fasure! Lol"
    },
    {
        "id": 145,
        "text": "I was really looking forward to trying this place and was truly disappointed once we got there. The service was horrible and I could have made better food at home. The words of my husband. They shredded cheddar cheese and American were the only options whereas even the local diners have feta cheese. I know I am being picky but the devil is in the details, options and creativity.  \n\nThe shrimp and grits were greasy, and the scramble eggs were overcooked. Very disappointing"
    },
    {
        "id": 146,
        "text": "Second visit and still just mediocre ‍. Jerk Chicken & Waffles... entirely to much jerk on the wings, yes wings ‍. Extremely salty and again wings ‍. Waffles were cold to the point the butter didn't melt. Waitress was non-attentive. It wasn't all bad, I will try again but there is stiff competition out there."
    },
    {
        "id": 147,
        "text": "I went here with my Cuzns, we're a group of six & everything was great. We'd had reservations & were promptly seated by the lovely Ms. Angel. We ordered a few different options which allowed us to taste different things. I must say that everything tasted delicious. The sweet potato hash was phenomenal. The fish (whiting) was fried perfectly, not too salty or over seasoned. The garlic wings were slamming. The shrimp & grits were as pleasing to the tongue as they were to the eyes. The order of French toast was HUGE. The whole table prob could've shared one order. But they too were tasty & filling. I would definitely recommend this spot & I can't wait to go back for more. Oh, and out waitress Talia was the bomb!!!"
    },
    {
        "id": 148,
        "text": "If I could stand outside all day and warn innocent customers not to come here and eat I would. Worst service I've ever received in my life.\n\nOur order:\nFish and grits\nChicken and waffles\nKids silver dollar pancakes \nRed velvet pancakes\n\nWe waited a whopping TWO hours to receive our food.  I saw tables seated after us served our food (their French toast was burnt) and they received their REPLACEMENT food before we ever even served our initial order.   The food runner was a nice, apologetic gentleman but our server couldn't care less.    \n\nI had to get up and walk to the service area to ask for a refill of water.  My daughter had to get up and do the same to obtain syrup for her waffles.   The kids meal is a joke.  I was told it was a \"whole meal\" but the tablespoon of scrambled eggs and 1/4 strawberry were not nearly enough for my 8 year old who almost never finishes his entire meal. \n\nWe didn't even see our server again until our food was finished and she was asking if we wanted to go boxes.   When I expressed my displeasure with the service she stated she didn't visit the table because she saw other people talking to me. No discount was offered and no apologies were given.\n\nIt's unfortunate that the decent food (7.5) is eclipsed by such poor service.  I wont miss it."
    },
    {
        "id": 149,
        "text": "So my friend says let check out this place I saw on channel 3 this morning. She couldnt remember the name so I typed in breakfast chestnut hill  and wow Google located it. It was about a 30 minute drive and luckily a parking space . So we go in, small place. You don't smell anything. Ok so we sit down, love the deco, black and white paisley on walls. We were given 2 menus, as we looked. We 're like wow, trying to take it all in. The menu called out \" try me\", so much to choose from and some of the choices was vegan. Anyway I ordered grits and whiting, you could have talapia, salmon, shrimp, sauteed or fried and corn bread was included. My friend got homefries and fish,  potatoes was cooked with red and green peppers. Ummm it was spool good. The whiting was fried to perfection,  tasted like not another fish was ever fried in the oil. Fresh and clean, I savored the taste. Grits was good, just too much butter on them for me. The next time I go and I WILL be going back. Next time I will try the pancakes or the French toast, or the Belgium waffles, or maybe the sampler, where you get one of each. Or maybe I will just get fish and grits again, I love grits. So get there early on a Saturday, last seating is at 3:30pm . Go. All other info you have to find on your own. I'm only speaking what I know. It's good and not expensive. Take your time, it is not a rusty place. You order it, it is cooked"
    },
    {
        "id": 150,
        "text": "The very first time I went here it was a wait, which is to be expected but we were seated fairly quickly. Now the second time, a complete disaster. Hostess had an attitude and a mouse was spotted running across the floor. Wait for our order was an hour tops. Second and last time."
    },
    {
        "id": 151,
        "text": "Does anywhere else offer an interesting breakfast menu like breakfast boutique? Shrimp and fried fish we're fantastic. Normally I hate when people mention ambiance, but this place feels like a neighborhood. It's great!!!"
    },
    {
        "id": 152,
        "text": "Never had a bad meal year, and I'm especially grateful that they consider the needs of us celiac peeps. The buckwheat pancakes and waffle are especially tasty."
    }
]