[
    {
        "id": 1,
        "text": "The absolute worst! Sat for 20 min's at the counter waiting for a tuna sandwich. Staff isn't friendly, place is old and dirty. It's insane how good this location could do if they got their act together. HORRIBLE.\n\nI miss Billy G's."
    },
    {
        "id": 2,
        "text": "I can't speak for anything other than breakfast but I've always enjoyed that from this place. I always end up getting an omelette since it comes with home fries, coffee AND a juice. This tops most places that don't even include any of that. \n\nLike others ensure they take your order correctly. I once ordered a Spanish omelette and ended up with a Spinach omelette with feta. It was still really good  so I didn't complain but it was definitely not what I ordered. \n\nThe delivery guy is always nice and courteous and I have no complaints there at all. I will keep coming here since I know the food and pricing includes a good amount of stuff."
    },
    {
        "id": 3,
        "text": "always good food, get some of the named dishes (esp. those with \"Jany's\" name on them) they are the best. Jany's omelet and Jany's salad are excellent. big portions, and low price."
    },
    {
        "id": 4,
        "text": "Today was my first visit and I am less than impressed.  I liked what I saw on the breakfast menu but opted for a lunch item instead - chicken cordon blu.  The wait was average for take out but the person behind the counter seemed new and overwhelmed with the small amount of business (me waiting to pay, and order she just took and already forgot, and a phone call that she took part of the order from and then told to hold).   My chicken sandwich was not made the way it was described in the menu which made it not a CCB.  It was served with a side of what I can only guess was the last remaining breakfast potatoes.  Not only where they not what I was expecting to receive with a lunch meal (ordered at 11am), but they were way overlooked, some burnt, and completely cold.  In addition, most of the pieces of potatoes were just small fragments of what used to be much larger pieces resulting in more of what could be described as potato crumble. Burnt potato crumble.  Burnt cold potato crumble.  All of this came to almost $10 with tax.  Had I not ordered this meal as take out and left the area it would have definitely been sent back. My first experience there left me feeling less than satisfied and ripped off."
    },
    {
        "id": 5,
        "text": "Cheap and delicious. Seriously, where can you get  breakfast sandwich and 16oz coffee for $2.89? \n\nEvery employee I've interacted with has been super nice and the food is great for the price. I work in the area and go here now and again for a solid, cheap breakfast."
    },
    {
        "id": 6,
        "text": "I used to grab breakfast every once in while when the restaurant was Jany's and run by a cute, older Greek couple. Always seemed a little slow, not quite put together. Since selling the business, they've had 2 new owners. I recently visited Cafe Victoria. The service is better. Still makes a great breakfast sandwich. They've set up square so you can pay for inexpensive orders with your credit card. I feel the average ratings are from when the business used to be Jany's."
    },
    {
        "id": 7,
        "text": "I love eating here.  You get the classic diner feel along with great service and good food.  Its not open all day unfortunately, but you can get a great breakfast or lunch for a great price. They have great burgers for a couple of bucks, and if you're there for breakfast you can try a bacon and egg burger!  It's not on the menu but they made it for me at 8am and it was great.  My girlfriend and I eat here pretty regularly and we both leave full for about 15-20 bucks. Enjoy!"
    },
    {
        "id": 8,
        "text": "I loved this place. First because it's right across the street from my apartment, and second because it's one of those old school mom-n-pops diner you end up either loving or hating.\n\nGranted, its served by an older couple and therefore the service is not gonna be as fast as going to a drive-thru. You also won't get the best eggs in the world.\n\nBut you don't come to this kind of diners expecting wonderful service and amazing food. These place cater busy folks that need cheap and quick comfort food. And they deliver. Anybody expecting something different should not go into this kind of diners.\n\nFor the price i paid coffee is surprisingly great, bacon was nice and crispy and the home fries had some actual taste on them. Oh and they do know how to cook sunny side up eggs.\n\nI'm totally coming back. See if I can become friends with these old folks."
    },
    {
        "id": 9,
        "text": "Flounder platter was extremely bland, industrially breaded flounder. It was nothing more than a pre-breaded frozen flounder fillet thrown into a deep fryer. If I'm paying for a flounder fillet at a restaurant, I want it to be breaded on premises. I could have bought Van de Kamp's or Gorton's and had the same thing. I can't imagine their other food is this bad, but I won't be trying them again anytime soon. They also messed up my (in person) to go order, giving me the wrong side dish and forgetting the lemon wedges I requested, even though I stated it clearly twice and I speak clear, unaccented English."
    },
    {
        "id": 10,
        "text": "Jany's  is the classic American luncheonette. The proprietors are Greek, polite and gregarious. The decor is a snapshot of 1987 ( pink and baby blue walls and sentimental motel art everywhere) and customers rarely eat in. \n\nLuncheonettes specialize in fast American breakfast and weak coffee. Jany's lives up to this tradition. You won't get the best egg sandwich, but for $2.15  ( for a large coffee AND a sandwich) my broke ass will go there every day and be quite happy.\n\nShoot for going here before work or during an early break because, like all other luncheonettes , Jany's tends to close around 3 pm. Honestly, there is nothing exceptional about Jany's. It's just a dependable standards when you're late, hungry and in a rush. Go here for the basics, with few expectations and you should be content with what you get. \n\nEnjoy !"
    },
    {
        "id": 11,
        "text": "Quaint corner joint with average fare, staff is friendly. The portions are pretty good, and the price is average. Been here for lunch a few times and it's never really over-crowded"
    },
    {
        "id": 12,
        "text": "Love this place . The new owners are very hands on and nice . Every time we are in there they make it a point to ask how everything is and just chit chat. The service is always quick and on point . The place is clean and has a friendly neighborhood type vibe. The food is always freshly prepared and u always get exactly what you order . My personal fav. Is the egg white and spinach omelette , it's huge and well prepared . Also love their turkey bacon , crisp and delicious . We will def. be back ."
    },
    {
        "id": 13,
        "text": "I work around the corner from this place, so I still end up coming pretty frequently. I only order breakfast items or the veggie burger (which is what everyone on our staff raves about). When I've strayed and ordered other items, they've been sub-par. \n\nYes, the older Greek lady is rude and they constantly mess up your order. I continue to get a real burger instead of a veggie burger, and when I come back to say it's a mistake, I get told that it's my fault and that's what I ordered. \n\nYes, the prices are never the same. Check the menu and make sure that you're not getting charged more than you should. \n\nYou definitely get what you expect here. Poor service, okay food (but the veggie burger is delicious except for the few times they've been overcooked)."
    },
    {
        "id": 14,
        "text": "Breakfast is cheap but you get a ton of food.  Reminds me of a small town diner.  Most people will order food for pick up or delivery but they are always busy in the AM with those orders.  \n\nRarely will someone eat in.  Service is average for a diner.  Free parking is helpful.  Would recommend if you are hungry for A lot of food for breakfast!"
    },
    {
        "id": 15,
        "text": "I have tried to give this place as many chances to redeem itself as I could; however, the food is bland and the service is mediocre. I had a chicken sandwich the last time I went and it looked like they threw it on the bread and dumped barbecue sauce haphazardly on it. I don't think that I will try this place again."
    },
    {
        "id": 16,
        "text": "My boss always complains that they mess up his coffee. It's hilarious because yesterday he sent me down here to get him coffee and a sandwich, and the old Greek gentleman looked at me and said \"how do you want your coffee?\" And I said \"just cream please. No sugar.\" He walks over go the coffee area, puts cream and sugar in a cup and goes \"cream and sugar, right?\" \nI couldn't help but giggle.\n\nThe bacon egg and cheese breakfast sandwich I got was hot and delicious, no different than the average. But my story is a lesson... Check your receipts for mistakes and taste your coffee for correctness before leaving!"
    },
    {
        "id": 17,
        "text": "Café Victoria's is incredibly convenient for those who work or live around Chinatown but aren't in the mood for food of the Asian variety. That being said, the food and location aren't nearly on the same level. The salad was mediocre. The grilled chicken on top did not taste like it'd been freshly prepared. If it had been, it must have been sitting on the counter for a long time because it was lukewarm by the time it arrived at the table. The French fries, however, are delicious and I admire the management's mission to make it's establishment paperless."
    },
    {
        "id": 18,
        "text": "check the bill-they overcharge at times. you have to pay for any coffee cup refill and the parking lot often has glass scattered around. the food is hot,the place is clean and the food average or below  but not many other places around."
    },
    {
        "id": 19,
        "text": "I am continuously dissapointed with this place, her prices go up and down like the stock market and she acts nice to your face #neveragain"
    },
    {
        "id": 20,
        "text": "Cute little cafe in Callowhill! Very inexpensive and great service, all the breakfast classics and sandwiches you're craving. Also, some great diner coffee :)"
    },
    {
        "id": 21,
        "text": "It's a diner. The food is simple. It comes out fast and hot and it's cheap. The owners are very nice.\nAs far as overcharging the bill goes, I didn't check. If they did, I wouldn't care becuase it was only fourteen dollars for my friend and I and we were full. To those of you who complained, don't be such a tight-wad.\nIf you want a three ring circus with your meal, don't come here. If you want diner food in a place that reminds you of home, this is the place for you."
    },
    {
        "id": 22,
        "text": "I agree that the food isn't very good. I decided not to go back after they continually overcharged our bill. Every time I mentioned it the were happy to correct their mistake. I decided to start tracking how often it happened... 100% of the time in a 4 visit test. Walk down to the terminal or hit Billy Gs even."
    },
    {
        "id": 23,
        "text": "ordered an hour and half ago, never received food. called and was told to call grubhub, that they never received order. so now after waiting all of this time for breakfast, we have nothing!!"
    },
    {
        "id": 24,
        "text": "Jany's Cafe is the sweetest little breakfast and lunch shop in town. The owners are husband and wife and they do it all - with a Greek touch added! Great food and you've got to try the Baklava, it is very good and homemade by the wife!! Such a flaky crust on it too!\nThe staff is small and nice and it has such a home feel to it, something you just don't get in a chain. \nPlaces like Jany's Cafe make being in the city a great place!  I love these little cafe's!  \nI totally rec'd for breakfast. They close early- after lunch, at like 3pm."
    },
    {
        "id": 25,
        "text": "I can't vouch for their lunches, but I've been having breakfast here lately and couldn't be happier. The service is consistently excellent, the food is basic but done right, and it's cheap! The poached eggs in particular are done exactly how I like them, and the coffee is brewed properly. It could be I'm just that easy to please. \n\nTwo other huge selling points for me are their cleanliness, and that they take credit cards.\n\nObviously this isn't a four star establishment per se, but for what it is, it's fantastic."
    },
    {
        "id": 26,
        "text": "The owner has the worst customer service skills ever !!! Not to mention he has the waitress and the order taker back in the kitchen cooking  So the \"OWNER\" Took my order a half of hour early so my food would be ready before my lunch hour and when i get there he didn't even place the order (i was beyond pissed because now my break is over )and was unapologetic for forgetting the order so the outcome my food was rushed threw together and not satisfying this will be my very last time getting food from there i rather make a meal from our vending machines !"
    },
    {
        "id": 27,
        "text": "If I could give zero stars I would. We were shocked at the condition of our food. The scrapple was broken into pieces. The grits were a solid block. The french toast, was plain toast. I'm serious, it was so bad even the kids refused it. I attached pics."
    },
    {
        "id": 28,
        "text": "Café Victoria has an awesome location. That's about it. I use to eat there like 3-4 times a week. Boy have things changed. I was there one day last week & my food taste horrible my fries & burger were under cooked. I believe in second chances so I went back today.  The tomatoes on my sandwich were bad. The new owners seem not to care very much. They are always fussing at each other in the kitchen I guess they think we can't hear them. News flash we can. Jany wasn't very nice but these people are 10 times worst at least jany food was good. The guy that works there needs to not be in food service at all, better yet anything that has to do with serving people. There is  this one girl that works there who's awesome.  Not sure what her name is but I'm sure it starts with a k. Oh wait it's kia if I'm not mistaking. She does her job really well, way better then the owners. My roommates eat there as well. The café was the topic of conversation last week & today also. Which is what made me write this review. If it wasn't for the one nice person that works there they would off been shut down. Café Victoria y'all need to get it together.  Things have really changed & it shows. Really not a good look so if y'all wanna make it to see 2016 you better tighten up."
    },
    {
        "id": 29,
        "text": "Very disappointing.  I used to always get their top-notch turkey sandwiches from Jany, as they are known to bake a whole fresh turkey everyday to use throughout the day in their sandwiches but today, something had changed. First of all, Jany wasn't there, it was a different rude woman I'd never seen before. Second, the turkey in my club sandwich was slimy, gross cold cut turkey. What happened to my sweet jany's???"
    }
]