[
    {
        "id": 1,
        "text": "Free drink refills and friendly service and allows Sundays off for all their employees? Awesome place to eat. All this an an airport location where customer expectations are low?!  \n\nGood sandwiches and waffle fries are delicious. Good value."
    },
    {
        "id": 2,
        "text": "Why 2 star ? I came here first time. and I only lived few minutes away. the place seems  very clean. The lady that take my order was very nice,after waiting for around few minutes  the other lady which she gives the order to me was very rude and when she gives me the order she just throw it to me :( not just pass it to me . After I got my food I walked out the door and I check my order,  I order 6 large fries and somethings else but 1 large fries is missing so have have to go back to the store and this rude lady which the one give me the order. Same way she throw that fries in front of me. With the customer came back with the order is missing she didn't even apologize just throw the order to me and walked away. Not sure if I can give my business to them again"
    },
    {
        "id": 3,
        "text": "There is only one word in the English language to describe this Chick-Fil-A, Amazing! Even when it's crowded you get the fastest service. When I go, I go simple, and order the #1 (Chicken Sandwich, w/ order of waffle fries and a small drink). As soon as I order it they send it out to me ASAP, and I'm already sitting down eating. Other than the fast service, you get the best tasting food you can get. Waffle fries to die for, and the best chicken sandwich in Philadelphia."
    },
    {
        "id": 4,
        "text": "RIDICULOUS establishment!! I had to call corporate multiple times on a single employee think the name is Jasmine.  This young person has BY FAR THE WORST ATTITUDE EVER!!!!! Quick snapshot I am a public servant went through the drive thru to pick up my order which is NEVER an issue with any other employee I while in uniform asked can you apply emergency service employee discount? She said \"WHAT\" I again repeated myself same question she immediately turned her back and threw my bag of food on the counter and said I can't believe he wants a discount.  That made me be not so kind in response...my wife spoke to the manager and then called the corporate office they were going to look into it.  Fast forward about a month later went inside same location hadn't went there for a long time because of the little jerk employee she strikes me as the type that would spit in your food... anyway went in there with regular clothes on not sure if she recognized me from the month ago anyway she said \"is there a reason you are looking at me?\"  Again my response was not to kind as I wasn't staring or giving her any reason to say anything to me.. She just in true HOODRAT format I guess called herself challenging me! The manager while seemingly a nice guy has ZERO control over this little young employee to the degree my assessment was I have to reach a higher level to speak on this.  I know that CHICK FIL A everywhere and I have lived in many places has an extensive hiring process to include keeping Bokeefa and dem out dat spot.... through multiple interviews, ensuring no visible tattoos, no mixed hair color, assume a personality check.. Although the aforementioned person doesn't have the hair or tattoo issues the personality is indeed dysfunctional!! SO obviously they missed one!  Had to call Corporate again on the second incident they said they were sending someone to this location based upon second complaint on the same person! Again manager was a nice guy but lacked the control of the establishment! CHICK FIL A is not the cheap place to eat as such (fast food) u just expect a little better in the service department! Do better or change the staff!!! Other than that further up Roosevelt Boulevard is 100% always on point ZERO issues!!!!  Which in my opinion is the best option..... to ensure the correct location I am speaking of the TERRIBLE EXPERIENCE this was at Rising Sun Plaza at Roosevelt Boulevard and Adams Avenue! The one to go to is up by Red Lion Road!"
    },
    {
        "id": 5,
        "text": "Of course Chick-fil-A is great. But this franchise consistently has the slowest service compared to any other franchise I've ever been to. Word to the wise, when you see a long line, move on somewhere else."
    },
    {
        "id": 6,
        "text": "My first time here and it was crowded. Nonetheless it was a very clean looking environment. I ordered the number 4 which was a spicy chicken sandwich. It came with the potato wedges that were nothing like anything I've ever seen but they were alright. The sandwich was delicious. \n\nI also bought a large strawberry milkshake which I can honestly say was the best I ever had. The employees all had a very upbeat attitude unlike the rude ones you get at the typical bottom of the barrel fast food spots.  The two cashiers who served me in particular were very energetic. After I said thank you they both said \"my pleasure\" which was a nice unique touch and a first. They probably say it to everyone but it was a nice note to end on. I will return to try out other items! \n\n*And they do have a play area with a slide for those of you with small children"
    },
    {
        "id": 7,
        "text": "Best service d ever. I promise I thought I was somewhere outside of Philadelphia. I never thought to write a review on a chic Fil a but these guys raise the bar."
    },
    {
        "id": 8,
        "text": "Always had a good experience here! Staff is always great. Occasionally they have a small hiccup, which it's only human to have a mistake every now and then. They always make up and are sincere about their hiccups. The store is always clean. The staff is great. Definitely my favorite fast food chain when I'm want something tasty and fast!"
    },
    {
        "id": 9,
        "text": "Now I finally understand what all of the commotion was all about. We don't have any Chik Fil-As near where I currently reside in Seattle. I've had chances to go in Cincinnati but the timing always ended up occurring on Sunday when the restaurants are closed.\n\nAnyway, on a snowy Friday evening in Philadelphia I finally got my shot. I ordered the spicy chicken deluxe chicken sandwich meal. It came with waffle fries and a soft drink for a little more than $7.\n\nThe sandwich was outstanding. It did not need any type of special sauce. It was more than spicy. It had serious kick. I was surprised and loved that it truly brought some heat. All too often items are advertised as spicy that merely have a little interest. This sandwich was truth in advertising.\n\nThe employees were polite. It is apparently a company policy to say \"my pleasure.\" The staff in this restaurant seemed to mean it.  Great job."
    },
    {
        "id": 10,
        "text": "Yes they food is good but the service is very slow and the drive thru takes way too long sometimes I want chic fil a before I got to work but they take too long and I won't get to work on time"
    },
    {
        "id": 11,
        "text": "The service at Chick-fil-A far surpasses most restaurants I've been to. I sat down at a booth and someone brought me my food AND asked if I wanted a refill. I can't even get some waitresses attention at actual sit down restaurants. I love their spicey chicken sandwiches with pepper jack, and I normally sub out the fries for their small salad. Yes you heard that right, I actually wanted a salad. Their avocado ranch dressing is made by the hands of god and is downright amazing and worth sacrificing my waffle fries."
    },
    {
        "id": 12,
        "text": "My Boyfriend and I went on a Wednesday night around 6 or 7 PM to grab a quick dinner and it was packed. They were very organized with taking orders. There were tons of kids running around, and old people talking loudly, but it was full. If this sort of thing gets on your nerves, just remember its not an intimate BYOB downtown."
    },
    {
        "id": 13,
        "text": "I absolutely love this place. I wish there were more around and that they were open on Sundays. Those are my only complaints. Other then that there are no words to describe this place. I usually get the chicken salad sandwich which is amazing. I love their waffle fries and their chicken nuggets are the best."
    },
    {
        "id": 14,
        "text": "If u haven't had a chicken eggin cheese, than shame on you! This kicks Wheaties ass and is now the breakfast of champions! I saw Michael Jordan, Mary Lou Renton and that other guy that was on the cover of the Wheaties box all eating breakfast here together. I know what you're thinking, why not take a picture of those three, I thought the same thing right after I left and by then it was too late....... It was just too late :-("
    },
    {
        "id": 15,
        "text": "They have the best service by far that cant be beat. They really deserve up to 10 stars.Because the food is really , really good and served super fast and accurate. Anytime u go there its worth the wait. I even  like their iced coffee, and i never drink it elsewhere.  No body can compare to them. Their cob salad is delicious! And their soup.is good, chicken noodle. Just cant stop raving about thrm. They should have more stores."
    },
    {
        "id": 16,
        "text": "I've been a chickfila lover since the moment I came out of my mother's womb. I've never had a bad experience, have always been treated well, and preach to everyone the greatness of the staff who serve so well. \n\nBut today, Chickfila disappointed me beyond belief. \n\nI was visiting from NYC and we ordered at the drive thru for our family of 7. The woman on the ear piece kept saying what and couldn't hear and even though we confirmed our order over the speaker and at the window a total of 5 times, they mixed up and forgot multiple items from our order. \n\nI won't be visiting this location again!"
    },
    {
        "id": 17,
        "text": "Just like any other location I've ever been to good customer service. Fast service. Hot food. & u don't have to go through a song/dance for extra sauce"
    },
    {
        "id": 18,
        "text": "I know it is a chain but this is my favorite fast food place. Great kids that work there and I love their milkshakes more than nifty fifties around the corner. Always get the same thing but if I am going to cave for fast food I will do it here."
    },
    {
        "id": 19,
        "text": "I try not to eat a ton of fast food but sometimes you need to due to time restrictions. I came here for lunch during rush hour and was pleasantly surprised how fast and accurate our order was. The cashier was very warm and inviting and seemed genuinely happy to take our order. The tables were nice and clean for the next set of customers. They even brought out our food when it was ready so we didn't have to wait at the counter. \n\n I ordered chicken nuggets and I always need more sauce, she was very accommodating and didn't try to up charge me for my extra BBQ sauce. They will refill your fountain beverages for you at no additional cost. The food was very fresh and delicious."
    },
    {
        "id": 20,
        "text": "Amazing food ! Great Customer service and everything is ultra fresh. Amazing how nice everyone behavior is. Keep it up !"
    },
    {
        "id": 21,
        "text": "i do believe this establishment follows the same mission statement as disney\ni am sorry to be waxing poetic about a fast food place\nbut\nno matter how long the lines are ....inside or out...\nthe service is swift, sweet, and scrumptious"
    },
    {
        "id": 22,
        "text": "When you consider all the fast food restaurants, you think the same for hear. But that's not the case, I don't consider here a fast food place, I consider it good food that's more on the healthy side. \n\nThis is some of the best chicken I've had. Especially their sandwiches, the waffle fries are amazing, and there milk shakes are really some of the best. \n\nIt's a great spot to go especially in the winter time with children they have a nice play area inside for the kids to enjoy themselves. \n\nTheir menu is average, Great staff always polite, food is always warm never had a cold sandwich. With good menu price options. \n\nIf ever get a chance try the breakfast, it's good. And worth getting. I'm more of the dinner kind of person when eating hear."
    },
    {
        "id": 23,
        "text": "I'm pretty much done with this particular location.  Every once and a while I'll drive by, hoping that things have improved, only to end up scolding myself for wasting my time yet again.\n\nThe first problem is with the drive through line.  It's always wrapped around the building.  That wouldn't be so bad if the line moved quickly.  It doesn't.  Plus, because the restaurant is nestled in a corner of the parking lot, you can't see how crowded it is from the street or even across the lot.  Since getting in and out of Whitman Plaza is a nightmare, it's a huge disappointment to get in there, see the length of the line, and then have to find your way out again...without any food.\n\nThe next problem is the inside of the restaurant.  It's always crowded with a million little kids milling about...and, of course, the parents are nowhere to be seen.  Then there are the beggars that they allow to wander around.  Sorry, but having your meal interrupted several times by bedraggled people asking you for money or food is...why I'd rather use the drive through in the first place.\n\nLastly, if you do manage to make it through the drive through without falling asleep or starving, don't bother asking for condiments like ketchup or mustard.  Even when THEY ask YOU if you want them, 9 times out of 10 they won't be in your bag.  \"So,\" you say, \"ask them if they put them in the bag when you're at the window or check the bag before you pull away,\" right? Well, I've tried asking them, been told several times that, yes, they put them in, only to find none in the bag when I get home.  As to checking the bag...after sitting in line for 10-15 minutes, the guy behind you is in no mood to wait while you rifle through all the bags looking for tiny containers of sauce.  That goes over just as well as when they ask you to pull forward because they have to \"bring (something that's not done being made) out to you.\" You're sitting there, waiting for it, with one or two hungry carloads of people blocked in behind you, who now (finally) have their food but have to wait for your order of fries to be brought out.  Not good.\n\nOther locations don't seem to have these problems.  I'll be going to them instead."
    },
    {
        "id": 24,
        "text": "This is one of my fav go to fast food lunch spot. I love their spicy chicken deluxe sandwich, and their waffle fries are to die for. Service is always excellent, I have never had issues with the staff here. The best part is that they NEVER mess up your order. And I love that they respectfully greet you and always say \"my pleasure\" when you thank them and not \"uh, huh\"."
    },
    {
        "id": 25,
        "text": "The food at Chic-fil-A is tasty and consistent.  We typically get the signature chicken sandwich with American cheese.  We also get a side of nuggets.  I just found out that Chic-fil-A has Chic-fil-A sauce which is a cross between honey mustard and BBQ sauce.  The staff is great and always friendly.  They offer refills if you eat in and walk around to help people clear their trash.  I only wish they were open on Sunday's."
    },
    {
        "id": 26,
        "text": "Simply the best fast food restaurant \nI enjoy coming here \nDrive through or sit in \nGreat food overall"
    },
    {
        "id": 27,
        "text": "Poor service..... A real mad house at Lunch time and the poor service don't help I love these places but this is a bad apple got to the other one in Bensalem horizon plaza much better"
    },
    {
        "id": 28,
        "text": "I love chick-fil-a, but this one is the slowest one I have ever been to. I ordered curb side pick up and I waited for 30 minutes before I went inside and asked where my order was. Apparently it had been sitting on the counter for almost 20 minutes. Then, it took another 5 for them to give me my food that I could see sitting right there. One of the managers finally gave me the food and apologized. But I shouldn't have had to go inside to pick up my food when I ordered curbside. I've had this problem a few times with this particular restaurant and I'm not sure if I will order from this one again."
    },
    {
        "id": 29,
        "text": "Not only is the food delicious here, the service is also great!  The drive-thru employees always tell me it is their pleasure to serve me, and they gave my dog a biscuit when I drove thru with him.  The dining room is also great, they give you free refills on your drink if you ask, sometimes they even walk around the dining room offering refills and clearing your tray.  The line looks long sometimes, but it goes really quick.  Very well managed restaurant overall!"
    },
    {
        "id": 30,
        "text": "This place has a new owner! He is always looking to do things right!  I'm sure this will be the best CFA in philly!"
    },
    {
        "id": 31,
        "text": "Stopped here for lunch on a work trip and boy was it busy! There was a decent sized line but it moved super quick. Once i ordered, my food was ready in about a minute. Food was typical for Chick-fil-A, which is my favorite fast food place. Service was great, everyone was friendly. This location even has a play area for small kids. If in the area again I will stop back."
    },
    {
        "id": 32,
        "text": "First time trying chick fil a here and I loved it!!! Prob now my favorite fast food. \n\nI was not very hungry so all I got was te spicy chicken sandwich and waffle fries. Both were delicious and what made it next level delicious was the special sauce ( honey mustard + BBQ). It's great with the fries and I used some on my chicken sandwich too!!\n\nWish we had more of this chain in NY :/ though it may be good enough to justify a long drive when I have the craving!"
    },
    {
        "id": 33,
        "text": "I hate fast food, but this is the only fast food I eat. I usually come for lunch, sometimes its super crowded, sometimes its not but on the days that it is crowded, they make the line go really quick. I never had an issue with any of the employees, one time I wanted the grilled nuggets but I said the number of the fried nuggets but said I want them grilled instead (politely mind you), I got a rude\" WELL THATS A DIFFERENT NUMBER\".  Well I'M SORRY, I wanted grilled today, don't have a cow! I have the app where I can get free things after a few purchases, I will keep returning for waffle fries and awesomeness!"
    },
    {
        "id": 34,
        "text": "Wow, best service, speed, and cleanliness... Friendly environment and always packed but speedy service. I recommend this over the other fast food places"
    },
    {
        "id": 35,
        "text": "This place is awesome!!!  I've been here for lunch and dinner. They staff is super friendly. I sometimes take my nephews to this location to play in their fun house. They sometimes have workers walk around to see if you need anything.  I stop here every time I take a trip to Philly."
    },
    {
        "id": 36,
        "text": "Very clean place.  Staff goes out of their way to ensure your satisfaction.   Recommend this location to everyone."
    },
    {
        "id": 37,
        "text": "It was weird , all white staff that did back flips for the black customers while I waited longer then all of them who were behind me in line . Food was OK but just a really weird experience  ."
    },
    {
        "id": 38,
        "text": "Was there this past Saturday, drive thru was backed up so we went in. The place was very dirty, straws, food and napkins all throughout the lobby, food all over floor behind counter. We left. If it's that visibly dirty, basic food hygiene is probably being ignored as well."
    },
    {
        "id": 39,
        "text": "This location never disappoints from their food to the customer service. The curbside pick up feature is fantastic. Black Friday the drive thru was 15 cars deep. I ordered while in the car and packed in the dedicated parking spot and a nice young lady came out and delivered my meal to me."
    },
    {
        "id": 40,
        "text": "It has good food, and great service. I tried the spicy chicken and salad, and they were delicious. Must try once."
    },
    {
        "id": 41,
        "text": "What's there to say that probably hasn't been said already. Good food & pleasant atmosphere here..Me & my family favorite fast food. This location is always nice..gets real busy during lunch & dinner. Staff has always been polite & helpful."
    },
    {
        "id": 42,
        "text": "Always had a good experience here! Staff is always great. Occasionally they have a small hiccup, which it's only human to have a mistake every now and then. They always make up and are sincere about their hiccups. The store is always clean. The staff is great. Definitely my favorite fast food chain"
    },
    {
        "id": 43,
        "text": "Love this location. The employees are always nice and respectful and the food is always fresh and hot. Yes it can get busy but it's Chick-fil-A they are always busy because the food is so good. I also like that they have events for the kids my kids love coming here."
    },
    {
        "id": 44,
        "text": "I ordered Chick-Fil-A through the DoorDash app, the official partner of food delivery for Chick-Fil-A. I was SO IMPRESSED. I did not feel like leaving my house on New Year's Day after being hung over and sick for five hours, and was so thankful to hear that Chick-Fil-A was open on New Year's Day AND that someone was available to deliver the food. Ordering was super convenient. I was able to track when the Dasher (the delivery guy) arrived at the store to pick up my food and when he was traveling to my house to drop it off. The Dasher was super polite when handing the bag to my fiance. The bag had many stickers holding down the folded bag, to ensure the food would be nice and warm and that nothing was taken out of the bag. The food was very warm when I received it (my house is a 10 minute ride from the location). The food was delicious and cooked to perfection. Thank you Chick-Fil-A for curing me of my hangover. I needed something that wasn't super greasy, but satisfying, and boy did they hit the spot. THANK YOU TO MY LORD AND SAVIOR, CHICK-FIL-A CHRIST. :)"
    },
    {
        "id": 45,
        "text": "Come here pretty often and recently I have not been happy I ordered curbside the first time they forgot fries for 2 of my meals I didn't see until I got home and the fries are my favorite part. Another time I used curbside i did it because the drive thru was so long and I wanted my food fast I sat there for 30 minutes before receiving my order i was mad because the drive thru was moving faster then I was getting my food. Finally got my order and there was no sauce. I had to go inside and flag someone down because I was not waiting again. Other times i have went for breakfast at 6:30am before work, I ordered the chicken biscuit 3 days in a row they said the biscuits werent ready when they opened thats the only thing I liked so I left each time. how are you gonna have that on your menu but not have it available when your open. Today I went again for breakfast I was the second car in line for the drive thru and I sat there for 15 minutes you just opened how is there already a delay. I made it into work with no time to spare. I would go to another chick but this is the only one in the northeast. You guys really need to up your game."
    },
    {
        "id": 46,
        "text": "Ignorant ash only gave me 3 nuggets and no cheese on my sandwich and sprite instead of Dr Pepper"
    },
    {
        "id": 47,
        "text": "The best chicken. Lightly breaded. Friendly staff. Even gives my dig a dog biscuit. Breakfast burritos are better than at mickey d's."
    },
    {
        "id": 48,
        "text": "My happy place. S/o the homegirl Mary who got refills on deck. The homie Danny C for hooking my boy up with the free chicken sandwich voucher. Shawties in the drive thru are beautiful too. Highly recommend:"
    },
    {
        "id": 49,
        "text": "Great service, orders are always correct, and staff is always so friendly and helpful. Their spicy chicken (sandwiches and strips) are absolutely delicious, as is the Chic-Fil-A sauce. Their fries and non-spicy chicken are a little overrated IMO though still very good. The only bad thing is the place is always packed so the wait times are long.\n\n5/5 stars because the spicy chicken and Chic-Fil-A sauce is mmm baby yes gimme more."
    },
    {
        "id": 50,
        "text": "Great food and service. The staff is friendly and always greets you with a smile. My go to meal is the chicken sandwich. It's the best chicken out there in my opinion. I love the waffle fries. For some reason, fries just taste better in waffle form! I haven't tried their breakfast yet but I definitely want to soon. I've heard many good things!"
    },
    {
        "id": 51,
        "text": "Always clean, fast and consistent here. The best part is the service is impeccable with the friendly staff. They have people walking around and asking if we need anything such as sauce or a refill and that's what sets them apart from other fast food places. The nuggets are salty, sweet and crunchy all in one bite. The spicy chicken sandwich is best with the pepper jack cheese to add that kick. All you other gourmet burgers need to use this as a benchmark cause then you'll be getting business like them."
    },
    {
        "id": 52,
        "text": "Friendly, fast service. Quality food that is consistent and overall clean environment. Drive through is always packed but works fairly fast."
    },
    {
        "id": 53,
        "text": "Ordered curbside to avoid the crowd since I live right around the corner. Placed an order via mobile and drove about 5 minutes. As soon as I pulled up and parked in the designated area, a friendly staff member was bringing my order over. The drive thru, and inside was PACKED so this was definitely convenient. Food was hot as always."
    },
    {
        "id": 54,
        "text": "Slowest chick fil a ever! Got in line at 7:00 and wasn't even at the order station until 7:25!!!!!! Awful service, great food!"
    },
    {
        "id": 55,
        "text": "This particular location at Whitman Square will definitely screw up your order. Do not pull out of the drive-through until you are absolutely sure you have what you paid for... It took three separate attempts to get the order correct... This is not rocket science folks... It's fast food OK? Let's get this right!"
    },
    {
        "id": 56,
        "text": "I just love this place- awesome service- actual service with a smile. And good food! Never had a bad experience at this place yet! The chic fil a sandwich with extra pickles is my go to sandwich with a sweet tea or a black and white milkshake. Staff is always on point with service and friendliness. \nMust try the breakfast to if you ever come- the chicken egg and cheese on a biscuit is so delish!"
    },
    {
        "id": 57,
        "text": "Usually good service but I am very disappointed today. My boyfriend and I went to Chick-fil-A for dinner and for starters, my boyfriend loves Chick-fil-A sauce so he asked for 8 and got 3. I ordered a side salad with my nuggets and I'm assuming they expect me to eat my salad with my fingers because I was not given a fork and their side salad if one of my favorite sides because of their peppers that come with it and I didn't receive a pack. I got charged extra for my salad so the least they could do is give me a fork. Not happy with their service tonight. I guess I have to start checking my bags before driving home like most people do if they went to McDonald's."
    },
    {
        "id": 58,
        "text": "My absolute favorite \"fast food\" restaurant! Sometimes it baffles me that it's considered a fast food restaurant because of how good the service is & how juicy their chicken is! The staff at this specific location are friendly and enthusiastic. They even bring your tray of food to you if you're dining in & sometimes they beat you to clearing your table for you! I've encountered many miserable beings at other fast food chains, but not at most Chick-fil-A's I've been to. My favorite thing to get is the Spicy Chicken Sandwich accompanied by their perfectly crisp Waffle Fries, oh & of course, a side of their Chicken Tenders as well! Yes, I go all out. No fry or chicken gets left behind. Everything goes right in here *pats belly*."
    },
    {
        "id": 59,
        "text": "So I love coming to this chick fil a bit it seems the gentleman there wants to be giving out money back to me is he a little lost or in other words I'd say thank you., normally be amazing  but any way staff there is so great"
    },
    {
        "id": 60,
        "text": "I love Chick-fil-A and I love the convenience of ordering ahead and not having to wait in that ridiculously long line. \nThey do try and speed it up by having two lanes but boy it just didn't seem to move. \nOrder ahead, tell them what space you're in and in a few minutes a friendly staff member will bring you your food."
    },
    {
        "id": 61,
        "text": "Excellent food ! Beats KFC , their spicy chicken sandwich was smoking' hot and delicious !!! Great waffle fries too"
    },
    {
        "id": 62,
        "text": "We ordered a tray of nuggets and choose a pick up time. We got there a few mins after the pick up time and still had to wait 30 plus mins. I wound up having to get out of the car and wait by the employee door because no one was helping us. Once a nice woman listened she was able to get us our order but it was a longggg wait!"
    },
    {
        "id": 63,
        "text": "Came here on Christmas Eve for another tray and this time the entire process was soooo smooth. I pulled into the designated pick up area and staff who were easily identified by their bright outfits came right up to\nMy window, asked me my name and walkie talkie'd my info to the inside staff. They directed me to check in via my Phone as well and within three mins I had my order which was hot and correct and I was out of there. That is the type of service chic fil a is known for and I would definitely come back again! Def recommend this location for trays and ordering in advance make the process so smooth!"
    },
    {
        "id": 64,
        "text": "Without a doubt, Chik-fil-a is my favorite fast food spot for all of the obvious reasons. But mainly, I have never been disappointed with my food or service. Never. And that is no small thing for any business, let alone a fast food place. \n\nThe food is always fresh and delicious. My favs are the chicken minis for breakfast (which are ridiculous) and the spicy deluxe any other time of the day. All the sauces are great but my personal fav is the honey mustard.\n\nThe staff is exceptionally trained and it shows. They are highly courteous and helpful and the place is always impeccably clean. \n\nMy five star rating is in no way an exaggeration. They earned it."
    },
    {
        "id": 65,
        "text": "I love this place, play area for children is wiped down and kept clean as well as the the dining area and bathrooms. \nThe food is always great, and every employee greets you in a welcoming manner and with a smile!!\nNeed extra dressing, \"No problem\" , nothing is ever a problem or inconvenience.\nThe management and the whole staff is just great !!\nIt does get very busy at times but it also moves quickly!!"
    },
    {
        "id": 66,
        "text": "Very few fast food places can produce quality service and food! This place does that times 10! Great service, great food, great people! You get your food as you order and the shakes are amazing! Highly highly recommended!"
    },
    {
        "id": 67,
        "text": "Even with a line a 1/2 mile long, still faster than other fast food places. Take a look at the ppl that work there and youll get it. \n\nThe food was good as usual. Drive thru window was a little extra with covid precautions and they didnt give me napkins. Other then that, all good"
    },
    {
        "id": 68,
        "text": "I waited 30mins for a premade salad that I ordered online before arriving and saw three other ppl who ordered the same way I did receive their food and leave before I got mine. I understand that there are a lot of people but there is no reason people who arrived after me should have received food before me. I even called to check on my order twice and no one answered the phone. Don't waste your time going to this location if you're on a lunch break because I literally wasted my entire one waiting on something I now can not eat."
    },
    {
        "id": 69,
        "text": "Chick Fil A has to be my favorite fast food restaurant. The employees are always so nice. They have never messed up my order. They are also very quick at getting the food to you. Majority of the time I go through the drive thru and there's ALWAYS a long line, but it goes so quick."
    },
    {
        "id": 70,
        "text": "Most disgusting Chick-fil-A I have ever been to bar none. The floor so greasy hasn't been cleaned in a week I should come back with my Harvard  lawyer and fall down. \nI do remediation so I know that this is it not one days worth of Grease and all I got was excuses from everybody here we don't clean when people are here that was excuse that was given to me I hate excuses.\n\nThis is a weeks worth of Grease. Most likely they have something wrong with their vent system\n\nThis place is so bad I haven't even left yet before finishing this review that's how bad I thought I would never say that about Chick-fil-A I thought they had higher standards.\n\nUnfortunately I ordered first whole time my stomach is turning circles."
    },
    {
        "id": 71,
        "text": "The Chick Fil A Spicy Chicken Sandwich was really delicious. Chick fil A is the Great Service in the State of Pennsylvania and the City of Philadelphia."
    },
    {
        "id": 72,
        "text": "Im not a huge chick-fil-a fan, the lines are crazy, especially this location, and its not in my top 5 for fried chicken. All that aside, they do chicken well. Their chicken sandwich is better than popeyes, which is something to have goin for them, and they really keep up the excellent service even with 500 orders, 60 yard length lines goin out the door into the parking lot, 70 drive thru orders, and people flippin out over wrong ketchup packets or somethin; they manage to get you a good lunch. God knows wat the drive thru has been like since covid."
    },
    {
        "id": 73,
        "text": "2 (fruit flies) I Assume in my lemonade. I have been on a chic fila binge for the past wk. Needless to say that is OVER WITH & I am DISGUSTED."
    },
    {
        "id": 74,
        "text": "I've been coming to this location since they've opened and NEVER had a bad experience. The staff are always so friendly and my order is always accurate. Great job! This is our \"go-to\" fast food restaurant."
    },
    {
        "id": 75,
        "text": "Seriously what can you say bad about this place..I went here today ..I received great quick service...if I come on a busy day ...I get the same great quick service ...I got the grilled chicken sandwich today and spicy chicken sandwich last week both were mmm mmm good..."
    },
    {
        "id": 76,
        "text": "This location is seriously SO slow!! It doesn't matter the day or time, you should be prepared to sit in the drive thru at minimum 20 mins.\n\nI visited this location a few times for breakfast and lunch and i have to wait each time. The most recent time, I visited at 11:30am and assuming it was the beginning of the lunch rush I expected it to be somewhat crowded. Well, it was crowded, it was just so slow, I entered the line at 11:31 and did not receive my order until 12:17. \n\nThis all occurred within the drive thru. Since they have cones all over, you can't even jump out of line and leave, after you've been waiting forever.\n\nI know everyone is short staffed. But, compared to the other locations like Neshaminy and Street Road, this location is a terrible. They used to be fantastic, I don't know what happened."
    },
    {
        "id": 77,
        "text": "This place ruins my diet, lol.  Just too good, love the iced coffee. I like the think they did with the drive through."
    },
    {
        "id": 78,
        "text": "I gave an extra star because the issue was resolved but I ordered breakfast on the app 10:20. The app tells you to then drive to the thru and tell the associate working drive thru that you have a mobile order. What the app does not tell you is that you have to let an associate know immediately which means that if you really want your food you must order and arrive and wait in the astronomically long line all before breakfast ends or your order doesn't get served. So I placed my order at 10:20, arrived at 10:25, waited in the astronomically long line for 20 min and then was told because breakfast ended before I reached an associate there would be no food for me. How absurd! Your order should be honored because you placed it within the time constraint of Breakfast served. I cannot believe they'd even let you wait in that line and then tell you oh we don't have any food for you despite the app telling you to pull up and retrieve your order. Now, after speaking with five different people, they managed to \"find\" a way to give me my order with some slight substitutions by 11:10. My confusion now lies at how 10:30 arrives and all of a sudden there is no breakfast. I assume they put it away or give it away but how can you say because of the time of day there is just no longer any food? That just doesn't make any sense. I know this is just an issue with the way the establishment works because their lines are super long any time of day. However, this solidified my thinking that orders on the app should be honored so long as the order is placed within the time constraint or the app should not avoid for you to place the order if the time assumed for the line wouldn't allow you to get the food in time."
    },
    {
        "id": 79,
        "text": "Terrible. Just look at how much fries they skimped out on my order. I guess this is typical Philadelphia fast food when it comes to ordering fries. Same always goes for all the Wendy's. They only fill it up half way. Ridiculous"
    },
    {
        "id": 80,
        "text": "I came here with my family last week for Fast Food Lunch, and although, it's the best for everyone to be honest. The Spicy Chicken Sandwich, one of my favorite meals at the Chick fil A Restaurant was absolutely fabulous and delicious but the thing I like the Beverages is the Ice, how did they do it?!"
    },
    {
        "id": 81,
        "text": "This used to be a great place with great customer service but those days are gone! They have understandably had to make changes due to the COVID-19 pandemic but they ought to have warning signs everywhere about how long the wait is. This has always been a busy location but now 'busy' is the understatement of the year. If you want to go through the drive thru now they have two lanes set up to reduce traffic. This seems like a great idea but it doesn't stop the line from wrapping all the way around the parking lot of the nearby Buffalo Wild Wings. They should have a sign at the end like the ones at amusement parks saying: \"90 minute wait from here.\" So at this point you might be thinking: \"Okay then I'm gonna be smart and order ahead for a curbside pickup!\" Well, I have some bad news for you. I had a similar thought on my last craving for Chick-fil-A and did just that. I placed an order at 2:43pm on a Monday afternoon and arrived a little before 3 thinking my food would be just about ready. I learned the hard way that they don't start making your order or even charge your card until you get there, make your way ally the way around the 50 car drive thru line, and park in one their designated spots. This of course completely eliminated the point of ordering ahead but \"Okay,\" I thought, \"at least my order should be done soon.\" Do I even have to tell you how wrong I was? I waited 30 minutes in a hot parking lot while my phone told me my order was being prepared until it finally change to tell me a team member was bringing me my food now. I wait another 15 minutes and finally they bring me my food and drink. Furious and impatient from the wait, I quickly left the parking lot. On my drive home I took a sip from my drink only to find out that they had given me the wrong drink!!! I didn't return to the restaurant because I couldn't stand to wait there another minute but this has been one if my worst experiences at a fast food restaurant ever. If you're looking for chicken, try the Popeyes across the street!"
    },
    {
        "id": 82,
        "text": "How do you run out of French fries at a Chick fil A !? . Lame and completely unprofessional especially after waiting in line for 40 mins. Get your shit together. This is why you don't open awesome southern spots up north. #Hangrykidsandmom"
    },
    {
        "id": 83,
        "text": "Compared to other fast food places, chicfila always dominates. This branch is American owned, the workers all speak perfect English and it's always very clean. I would NEVER pick McDonald's/BK over one of these."
    },
    {
        "id": 84,
        "text": "This is very good, However, The Drive Thru was only open because the inside is closed due to Coronavirus. As today which is still Lent Season, Chick fil A is now serving the Fish Sandwich. The Spicy Chicken Sandwich that I ate yesterday was not that Fresh such as the Waffle Fries. The Coke didn't have ice in it, The next time I come is that I want my meal to be fresh and my drink to have ice in it. In my house, I made my own Waffle Potato Fries."
    },
    {
        "id": 85,
        "text": "After tonight's experience I will not be back here for a while. Which I am sad about because the spicy chicken strips are really, really good. This is my second time having a bad experience with these managers at this location. \n\nTonight I went through the drive thru and the fries were terrible. Very hard, and even the color of them looked like they had been sitting there a while. I went in to bring it to the attention of the manager (tall, bald white guy) and ask for new fries. He blew me off, never apologized and said he  would get some more. He treated me as if I was complaining for nothing. As if going in with a two year old AFTER going through the drive through for convenience was bothering him. My sons nuggets tasted old as well, very tough. Not only was this manager rude to me, he was rude to the person in front me, telling them \"normally I don't do this, give refunds because this salad is a day old.\" It was a full salad, it wasn't like it was eaten, so maybe she just didn't have time to come right back. Either way, it's not great customer service to publicly shame someone at the counter trying to complain."
    }
]