[
    {
        "id": 1,
        "text": "This place is great! Really cute inside and very attentive staff. My fiancé got the pork tacos and I got quesadillas they were both delicious. The price is completely fair and the food was authentic! Also, they allowed us to BYOB which is always a great find in the city! We're happy we live so close and will definitely go back"
    },
    {
        "id": 2,
        "text": "Tried this place for the first time this morning on a recommendation from our neighbors. They loved it and so did we! I got the veggie omelette and my husband got the huevos rancheros- both served with rice and beans. The staff was so nice! The decor is a bit odd but somehow it fits! It's bright with good vibes. Great addition to the neighborhood! Legit Mexican food- huge menu with tacos, quesadillas, burritos and more- fair prices and friendly staff. Check it out neighbors! And- thanks for the breakfast Cocina Cafe!"
    },
    {
        "id": 3,
        "text": "Best Mexican in the city! Portions are huge, food and sauces are delicious. I even tried their wings and the sauce is some of the best I've ever had. Extra spicy and delicious. Will order again for sure."
    },
    {
        "id": 4,
        "text": "Wow! This is by far the best Mexican food I've had on the East coast. The chicken burrito reminded me of the Mexican food in California where I am from. The quesadillas and tacos are also delicious and the people running the place a super friendly, offering great service including delivery. A must try!"
    },
    {
        "id": 5,
        "text": "I've wanted to try this restaurant since I saw it had opened. I finally made the trip in after not wanting to go through the hassle of cooking myself dinner. Alex, the waiter, was extremely friendly and the food was outstanding. I had the mole enchiladas and they were absolutely delicious. I already have plans to come back! Do yourself a favor and come eat at this new restaurant."
    },
    {
        "id": 6,
        "text": "Amazing little Mexican hole in the wall. They had my favorite dish, \"mole\" and it was outstanding. Generous portions and authentic food. Make sure to stop in."
    },
    {
        "id": 7,
        "text": "This may be a weird start to a review but I didn't use hot sauce once during my entire meal. I can say that it is very much not a thing that happens to me very often. Didn't even think about it once! Everything about my meal was so well seasoned and delicious! \n\nPlace is super nice and cozy inside.\nFood came out really fast!\nThe burrito they brought to the guy in the other corner was huge! \nHe even outwardly commented on the size and then commented after how great it was! \nIf that guys glowing accolades for his burrito isn't enough for you to try this place out I don't know what is."
    },
    {
        "id": 8,
        "text": "How awesome is it to find a restaurant that doesn't hide its authenticity, and yet still makes the food accessible. I had the steak quesadillas and they were way better than I could've imagined them being. The staff (owner?) was super attentive and food arrived quickly. Considering the size of the quesadillas I asked if it would be better to eat with my hands or silverware and wasn't put to shame but given an honest and clear answer. I can't wait to come back on a lunch date."
    },
    {
        "id": 9,
        "text": "Really great new restaurant. Ordered the pork shoulder tacos and loved them. Affordable and came with fresh avocado and cucumber along with  a charred jalapeño and charred onion. The two salsas were tasty and had good heat. Their horchata was fresh and tasty. Can't wait to go back here. Friendly people too!"
    },
    {
        "id": 10,
        "text": "Solid, solid, solid new neighborhood Mexican spot. I helped myself to a nice little chorizo bureet'. My wife got the chicken quesadilla. Despite their marketing shortfalls (i'm still trying to figure out what is a 'home sandwich?) I will def be going back. Don't let the confusing awning fool you, this is a legit Mexican restaurant."
    },
    {
        "id": 11,
        "text": "This was my first time trying their food after hearing great things about it from my siblings. I placed an order for pick up for lunch. The food was sooooo good and the pico de gallo was very refreshing. Absolutely great customer service as well! Can't wait to eat here again."
    },
    {
        "id": 12,
        "text": "I live nearby so was excited to try this New Mexican cafe, and I will definitely be back! Very inexpensive, fresh and delicious, and service was so friendly. Cute little space, and I noticed while waiting for my take out order that the plating for eat-in was lovely. My enchiladas verdes de queso really hit the spot and had a nice little kick. I'll be back to try the huevos rancheros!"
    },
    {
        "id": 13,
        "text": "I have ordered multiple times from La Covina del Cafe. Recently I got enchiladas that were some of the most authentic I have found in Philadelphia in a long time. \n\nIn addition their chefs were able to add some charred jalapeños to my dish. Couldn't have been more filling, delicious and warming during these chilly months!"
    },
    {
        "id": 14,
        "text": "This little joint is amazing! I didn't realize one of my parents at my school job works or owns this place. Their al pastor tacos were definitely unique and on point, in comparison to other taco places. Slight oil, but that's no big deal. Flavor was a 10+. We also got mango bubble tea and that fulfilled my cravings - it's an ice blended drink, not just a juice with ice cubes in it. Which is exactly what I love. Glad to be living just a block from this place! True blessing. It's currently takeout, but I'm so ready to try more food from them. I believe they often update their business things via Google business, something about their menu! I know recently they added teriyaki chicken and rice. I have heard they're Mexican, with a touch of Asian. I believe one of their management or owners are Chinese (she's the one who I've seen at my job) so that is really cool. Gotta support good food places!"
    },
    {
        "id": 15,
        "text": "My sister got the chicken tacos and I got the eggs and potatoes Taco (I requested this and it's not on the menu). Both tacos were really good and we got the bubble tea drinks in matcha and mango. We both really enjoyed our meal and will definitely be back. \nThe owners were super friendly and the food was made fresh quick."
    },
    {
        "id": 16,
        "text": "This place is worth to try for good Mexican food with some Asian flare. At the window  you see a poster of bubble tea indicating that it serves bubble tea as the drink. At the  cashier  table you see very cute waving lucky cat. Lucky  bamboo plants are all around, stems of roses decorate the tables.\n\nThe gentleman who took my order was super friendly. My order came out in  5 minutes .\n\nAl pastor burrito is pretty good. The meat isn't spicy but tender and  not dry. The rice is red Spanish rice with pinto beans,?and they put the lettuce and tomato on the side. They also put green and red salsa on the side.\n\nI will definitely come back to try other items on the menu \n\nI w"
    },
    {
        "id": 17,
        "text": "Great neighborhood Mexican place. I've ordered multiple tortas -- all delicious. My GF ordered very good enchiladas (suiza with salsa verde). Atmosphere is charming, low key but nice. Coffee is good too. Will continue to visit regularly."
    },
    {
        "id": 18,
        "text": "Full plate fresh and tasty. Service wasReally quick and delicious. So close and convenient. My new favorite spot."
    },
    {
        "id": 19,
        "text": "Maybe I'm an idiot for ordering breakfast here but it's on the menu so I went for it. The scramble they had was good but yo, my wife ordered waffles and it was no lie wheat eggos, a freezer hash brown, a sausage and a piece of bacon, extra grease. It was hilarious we were dying laughing. Also the coffee was no bueno. Would go back for actual Mexican food maybe but def skip breakfast here. Service was great though!"
    },
    {
        "id": 20,
        "text": "Burritos, nachos, and tacos are all very good. The portions are large and filling. Staff is super friendly and welcoming. 5 stars."
    },
    {
        "id": 21,
        "text": "I may be biased because this spot is conveniently located right around the corner from me, but they've quickly become a go-to. The beef is great quality and the portions are large. I usually get a steak quesadilla or steak nachos and they're delicious. \nThe owners are really friendly and nice, which is always greatly appreciated! \nPrices are fair!"
    },
    {
        "id": 22,
        "text": "My go to place for a good and quick dinner.  Its only a few streets down from me. The chicken burrito is very filling and delicious.  The place is not pricey at all and food is generally ready quick.  I've never dined in but the place looks very clean every time i have gone to pick up my food. Had a bad experience with a shrimp quesadilla one time (it was just a few pieces of shrimp and cheese). But other than that, everything else has been fabulous. i Recommend any of the burritos!"
    },
    {
        "id": 23,
        "text": "I really enjoyed the environment because it looks like an every-day urban Latin American café, like the ones you can find in Mexico City, Bogotá or Lima. I had some of their special tacos and I have to say that they were not excepcional. Maybe you should just go with other popular choices like Al Pastor. The orchata (drink) and chips were great. The prices are affordable and the quality of the service is also very good."
    },
    {
        "id": 24,
        "text": "I told my sister about this little gem so when she came into town it was only right to try it. We ordered chicken and steak portion of tacos, quesadillas, and burrito. She loved every single dish and of course I did too. This is her new favorite place to eat when she's in town. She also got the green tea boba drink and she loved it better than any other place we've tried. Customer service was on point too. They even offered us free delivery and we really appreciated it. It's safe to say she will be back."
    },
    {
        "id": 25,
        "text": "Reliable. Good portions. Tasty. Go to place for fast Mexican food! Neighborhood gem! We have ordered from here at least 3 times now and they've been consistent. Definitely worth supporting this business."
    }
]