[
    {
        "id": 1,
        "text": "This place was surprisingly good for chinatown. I thought that I was doomed to sub par tea subsequent to moving to philly. the bubbles are decent and the tea is actually tea, not powder. I had a green milk tea not too sweet and good consistency . I would highly recommend this place for the milk teas, it's a step above the other tea spots in the area."
    },
    {
        "id": 2,
        "text": "Ordered the Taro smoothie with boba and it tastes really good!\n\nTakes a while to prepare your order so you need to be really patience.\n\nNice decor and ambience for a small tea and bubble tea store."
    },
    {
        "id": 3,
        "text": "This is the newbie on the street. \n\nNot bad, and I actually would go back because they have loyalty cards. However, it's just so hard to bring myself there when tea do is right across the street, and I like their milk tea just that slight bit better!"
    },
    {
        "id": 4,
        "text": "My best friends brother came here with me. Bought me shaved green tea ice and a green tea shake. He got the mango shaved ice. I got to try his too. The greedy fat girl that I am wanted his too.\n\nThe green tea shaved ice came with recommended topping of black beans and coconut jelly. My mind thought what a weird combo but ok, if its highly recommended, I'm gonna try it. So, the first bite was oh... Wow! This is cool, sweet and delicious. The flavors melted together in my mouth was a delightful burst of Asian flavors. Just lovely... Cause now I want one everyday.\n\nThe green tea shake is stronger then Starbucks flavor and took me by surprise. It was good but I'm so use to my Starbucks green tea frap. Lol.\n\nThe mango shaved ice was recommended with pineapples and pineapple jelly. This was yummy. Fresh, sweet and cold. Loved it. I can't wait to go back and try more desserts.\n\nThis place does serve food. Finger foods that I will come back to try. So for now, the shaved ice is highly recommended. You will not be disappointed."
    },
    {
        "id": 5,
        "text": "We came to Tea Magic and enjoyed a pair of fruit smoothies.  I had a strawberry-coconut smoothie with strawberry bubbles (i think they called it a Summer Love, but I can't quite remember).  JJ ordered a Kiwi smoothie. \n\nAfter a bit more than a 5 minute wait, both were neatly presented.  With plenty of seats, including a sweet looking couch, we stayed to relax and enjoy our smoothies.  Both were awesome!  The Kiwi was thick and full of fruit while the Summer special was smooth and exactly what I was expecting.  \n\nUnfortunately, despite the very comfortable seats, it was a bit difficult to relax as it can get very loud in the seating area.  Honestly, it didn't seem that crowded, so I think it is just how the sound carries.  Otherwise, I have no complains.\n\nTea Magic also happily accepts credit, which is a plus considering the number of businesses in Chinatown that don't."
    },
    {
        "id": 6,
        "text": "Tea Magic was nice inside. The environment was large, fun, and sleek. It was exactly what we were looking for. There were board games and lots of unique teas and tea combinations to choose from. Unfortunately the music was too loud, we came here to hang out but we could barely talk, and I think that this deterred us from playing any board games as well. I will try this again soon to give a better review of Tea Magic's menu.\n\nOur favorite thing here though was the playlist. It was really unique it kept switch back and forth between Adele and J/k Pop. We liked how it seemed kind of personalized and Adele brought a nice balance against the hyper energetic pop."
    },
    {
        "id": 7,
        "text": "First time I've been to Tea Magic, and it was nice! The milk tea was fine, pretty standard stuff. I wasn't expecting the bubbles to have such good texture. Perfectly Q and chewy. If they can keep this consistent, I'll definitely come back! \n\nSlightly disappointed with how much ice was added to the drinks - my friend's was 70% filled with ice! That's not what we paid for... \n\nThe space is a bit cramped width-wise, and the but there are lots of seats and table spaces. \n\nIn my mind this is really a 3.5, but I'll round up in stars because they offer Wifi and Snow Ice, and it's nice to have a place that offers both.."
    },
    {
        "id": 8,
        "text": "The Taiwanese snow ice here is to die for. I tried the mango snow ice which is a thin shaved ice dessert, topped with chunks of mango. \n\nCan't speak to the bubble tea here since i have never tried it but definitely recommend Tea Magic for those craving Taiwanese shaved ice."
    },
    {
        "id": 9,
        "text": "So this is the second time I've ventured into Tea Magic, and the second time I was disappointed in my drink. The first time was OK - the drinks were as expected, but a little sweet. Tonight, I ordered an almond milk tea and made a point to ask for it to be less sweet than normal. The lady assured me that many people tell them their almond milk tea has the right level of sweetness. Nevertheless, I asked for less. My friend ordered the hot citron honey tea.\n\nI received my drink within 5 minutes. My first sip, however, was overwhelmingly sweet. I gave it a few more tries and couldn't assess how it was less sweet than a supposed \"right\" level of sweetness. My friend, on the other hand, was still waiting for her drink. While she went to the bathroom, the cashier asked me what my friend had ordered despite having just rung her up a few minutes earlier. It took them a while longer to rectify the mistake, and after they finally made it, they gave it to someone else! Eventually, my friend got her drink and while it was good, it was definitely not worth the $3 or the wait. \n\nIn short, I have yet to be impressed by the drinks or the service. The inside is laid out nicely to hang out with some friends while sipping, though I noticed that it got really really loud, especially once the jenga broke out."
    },
    {
        "id": 10,
        "text": "The service was horrible and they were rude. Although they do use real fruits for their smoothies but they drove me away because of their rude service.  I rather go to Tea Talk a block away."
    },
    {
        "id": 11,
        "text": "I've got to say, this probably ranks as one of the worst bubble teas that I've ever tasted. With watery drinks and poor customer service, the only thing that I like about this place is that it is very quiet and empty due to no one coming here! I've tried ordering from this place three times, and each drink has been a disappointment.\n\nIf you're looking for amazing boba, try Kung Fu Tea. Excellent fruity drinks, try TeaDo. Pure tea-tasting drinks, go to Tea Talk. There are many other options other than this place."
    },
    {
        "id": 12,
        "text": "We usually go to Tea do for our drinks and small quick eats.  We walked by this place and we figured \"let's give it a try\"  my wife went in and ordered a drink and some fish balls and beef sticks and chicken wings, me and my son went across the street and we walked 3 stores stared at the fire trucks for a lil came back my wife was still waiting this is like 15 mins already, I went to use the bathroom, it looks nice but the soap dispenser ran out, no biggie it happens me and my son go stand outside for a bit, and came in my wife asked the girl at the counter how much longer she replied \"not that fast\"  no apology or anything... u must be kidding me had we not paid we would have left already, oh yeah btw some folks came in after my wife like 10 mins later and they were eating their food already while waiting, while me and son were standing outside he saw a picture of a strawberry milkshake and he was asking me for it, I would have bought it from them.... but no thanks... would probaly take another 20 minutes if I'm lucky....  sorry Tea magic there was no magic about the place, it looks decent, tea is mediocre, oh yeah the beef sticks were nice and dry and the curry fish balls were ok... and chciken wings are the size of pizza hut wings... the place might look nice but your service is beyond lousy, instead of your employees playing on their phones maybe they should pack some orders,  I hope your management does not wonder why Tea do is so successful, you guys could learn a thing or 2 from them.  If I had to tip I would tip the Lesean Mccoy standard!"
    },
    {
        "id": 13,
        "text": "1. Watery\n2. Lacking in flavor\n3. Pricey\n\nConsumed: Hot Japanese green tea milk tea with tapioca\n\nThis was my first time here and I have to say I'm somewhat disappointed.  The quality of the drink just did not make me feel satisfied with the $4 I paid. The drink was more watery than expected and it would have benefited from a stronger green tea flavor. However, the texture of the tapioca was really nice though. Perfectly soft and chewy. The tapioca and the nice ambiance are the only reasons I gave Tea magic a 3 star. \n\nI'm not sure I would come back..."
    },
    {
        "id": 14,
        "text": "The place were very relaxing and pretty, very stylish seatings with free WI-FI in the shop. What I like about Tea Magic is their smoothies, it was made with fresh fruit, so I thought it was pretty healthy?.. But the bubble teas were not so good.. hope they could improve it the following week.\n\nAlso, very exciting to try their new come up, which is the \"Snow Ice\"!!!\n\nFighting guys! :)"
    },
    {
        "id": 15,
        "text": "I happened upon Tea Magic while taking a stroll through Chinatown and was drawn in by the pictures on the menu in the window. I ordered the cucumber, celery, apple, honey juice and it was amazing! I also ordered some BBQ lamb on a stick, which was pretty good and only $1.50! I have since been back several times with mixed results, so I will sort of jumble the visits into one review. First of all....check your order when it's done! They messed up my order on three visits, by forgetting an item or two. Once, they forgot an item, then said they would make it for me, but totally forgot about it and after waiting over a half hour for it, I gave up and left without it. Plus, their juices are very inconsistent. You can order the same drink, but it's different everytime, both in taste and texture. They are, also, very slow at getting your food and drinks ready, even when it's not busy. Their octopus balls are out of this world and because of them, I overlook the bad service!"
    },
    {
        "id": 16,
        "text": "My friend and I came to Tea Magic for iced tea and coffee yesterday afternoon, and it was A-OK.\n\nI ordered an iced cafe latte, and it tasted like it was made from powdered coffee mix- which it probably was. My friend ordered black milk tea with red beans, and while she liked the red beans, she said that the tea itself wasn't that good.\n\nThe space was cool though, and is a nice place to hang out with a group of friends or study."
    },
    {
        "id": 17,
        "text": "Whelp, I came here for the first time over the weekend, and was pleasantly surprised.  The recent string of bad reviews have me worried that what I experienced was the exception not the norm! I hope I haven't spoken too soon...\n\nI can't remember why I decided I needed to come here instead of Tea Do. Of the Asian tea/smoothie/snack hybrid places in Philly, I've only been to TD. It was competent, and it just became my go-to. I didn't see a reason to try other places, and in fact have never even ordered food from TD. Anyway, I think I might have seen Tea Magic's pictures in their windows and was tempted at some point. Sunday afternoon just seemed like the right time to give them a shot. \n\nI knew I was craving two very different drinks, so I just got both an forced one onto the boy. I wanted a passion fruit smoothie with lychee jelly, and they didn't have passion fruit because they use fresh fruit and I'm going to guess passion fruit isn't the easiest/cheapest to procure. No matter, mango was a fine compromise, refreshing and not too sweet (VERY IMPORTANT). I also got a taro milk tea with egg pudding. I didn't give any specific instruction dictating sweetness, so I was happy to find that it wasn't too sweet (SERIOUSLY CAN'T STRESS THIS ENOUGH). \n\nI also ordered Taiwanese popcorn chicken and Shanghai pan fried buns. The chicken was a little on the dry side-- the meat pieces are abnormally small, so there was a lot more breading in every bite. Not the worst thing to happen to popcorn chicken, and it was far from inedible. Frankly I haven't had any good Taiwanese popcorn chicken since leaving California. The pan fried buns were a greasy delight. It was definitely average, but 'average' is above the level of execution I expect from a tea house. \n\nI ended up boxing my savory snacks because I wanted a shaved snow ice. I misread the ambiguous font and thought it was supposed to be $7.50, and I think I confused the cashier a little too. Anyway, it's a steal at $3.50 and 50 cents per topping. I ordered green tea snow ice, with egg pudding again (i'm kind of an obsessive eater), and red bean. Green tea and red bean is probably my favorite flavor combination in an Asian dessert. I also wanted those little taro sticky rounds, but they didn't have any. \n\nWe had the snow ice to go because we didn't want to stay any longer. frankly we only opted to eat in in the first place because the boy is still using a cane and needed the break. i think only actual children linger inside. i am a bit too old for 'hanging out'. \n\ni thought the staff was pretty attentive. i had no idea how these places work, and they brought me my drinks and my snacks. then i think, observing that i was slow and seemingly unable to provide for myself, someone brought me utensils. 15 seconds later someone brought me napkins, all without prompting. later on i discovered that these were all available for self service at the counter, so i was probably a charity case in their estimation."
    },
    {
        "id": 18,
        "text": "I normally don't give negative reviews unless it's terribly a bad experience. This is usually not my go to place for drinks but figured I tried this place out. All the tea places were busy so I figured to try this place. First off, you don't get greeted when you walk in. Ok, fine. I checked out the menu ordered a few items like the chicken on stick, beef stick, fish balls and coke marinated wings and a japan green milk tea all for to go. The tea was ok but not the greatest. A guy came in about 10 min after me ordered food to go and few other people came in for drinks. The girl was really busy playing with her phone. Anyways, where I was sitting at (front of the register) I can see the guy cooking in the kitchen and looks like he packed up the food in a red bag and placed them on the counter. I wasn't sure if it was my food and wanted to make sure its not those 2-3 tables of customers food ordered to go. I waited about 5 min more its already close to 20 mins. I asked the girl whose BUSY ON HER PHONE how much longer does it take? She goes \" not that fast\" maybe about another 10 min. I'm like uh ok.. I would have to wait 30 min for a place that wasn't even busy or pack. I told myself why did I not go to Tea do which they don't even take that long on the snacks. The guy who ordered after me like 10 min later another girl gave him his order... He was already munching his way out the door and I'm still waiting? So yeah, the red bag sitting on the other counter for the pass 5-10 min was mine afterall. Then the girl with the phone went to check on my food after the other girl gave the food to the other guy. She handed me my bag and she said I think this is yours so I gave her my receipt. I looked in the box to make sure I got everything and I was missing one of the stick. I turned around after a minute checking my food and asked her for my receipt back I believe i'm missing something. She looked around.. receipt? So how the heck you misplace a receipt handed to you less then a minute ago? She then went to the kitchen and grabbed the receipt with chinese writing. I told her I was missing an item. She was pointing at the chinese writings. Yes I can read. I was fed up by then and did not plan on waiting another 20-30 min for an order they left out... I left. FOR GOOD. But with a rude employee who doesn't even know the basics of a HI or THANK YOU or SORRY this business will be shutting its door very soon, your employee will have lots of spare time to spend with her PHONE. \n\nTried the food when I got home. Whatever you call those skewers and wings they are nothing but dried up checken dipped in black peppers. This place is no magic. Save your $ and time. Wasn't even worth the hassle and the long wait when it's not even busy."
    },
    {
        "id": 19,
        "text": "When I saw a sign that read \"Tea Magic\", I was honestly expecting potions and elixirs for drinks, but lets get on with the review. This place is one of the new additions to the already many bubble tea places in Chinatown. You would figure, a new competitor who has the balls to open less than 5 yards away from an already dominating Tea DO.. you would expect some magical, out of this world drink.. however, that's not the case here. I walked in around 11 am  and the place was empty because they probably just opened. There were 6 workers behind the counter. I ordered 2 drinks. Simple milk tea, and papaya smoothie. Took about 20 mins to complete.... I guess the magic casting time for the spell takes that long but come on..... people have places to go.. I was expecting some good awesome drink for me having to wait that long, but all I got was water that looked brown and a smoothie that tastes like ice. It was that bad.. The place is very warming and comfy but your a place that sell drinks. Get that right and your good to go. I would try this again after a month, if their still in business."
    },
    {
        "id": 20,
        "text": "Best bubble tea yet! Great price! $3! Love the green tea flavor! Would def go back! The atmosphere is clean and hip! Close to Penang too!"
    },
    {
        "id": 21,
        "text": "I love this place, amazing customer service! Amazing real fruit smoothies! Atmosphere out of this world, and their \"Snow Ice\" is to die for!!! Not to mention they have 'Jenga' and playing cards on every table! Now I still need to try their pastries but so far every time I go my whole experience is perfect, it's the perfect cafe"
    },
    {
        "id": 22,
        "text": "I first want to start off with mentioning that they have the worse customer service let alone customer etiquette. The workers are simply rude. I do understand that the place gets busy sometimes but as a worker you should always cater to your customers. I do not expect you to feed me grapes but I do expect a little smile and friendly tone. It was not busy the days I went and the girl at the register who took my order was simply just rude from the way she looked at my friends and I up and down to her tone. But I noticed that when she took the orders of a few customers who were of her ethnicity she was so friendly and smiled the entire time. I do not want to say this but it is simply discrimination, you should treat all your customers equally. This did not happen only once but both of the time I made my trips there. If the worker(s) do not learn proper customer care etiquette they might just jeopardize the owners business.\n\nBesides the awful and rude service, the black milk tea is pretty good!"
    },
    {
        "id": 23,
        "text": "I tried the honey green tea iced $3, green tea sweetened iced $2, and egg pudding $2.5. All are delicious and relatively cheap! The tea taste is strong, which I approve, and the honey gives the green tea a medium sweetness that's quite rich. It's great! The egg pudding has some sweetened condensed milk added to it and makes every bite wonderful.\n\nSeating is comfortable, too! There are some squishy high chairs and sofas :D\n\nMy only complaint is that it can get very noisy because of the crowds. So, this isn't for you if you're thinking of a quiet ambiance like a coffee shop. Expect occasional screams and bickering from customers playing games. That's a con to me but could be a pro to you!  To he his own!\n\n(Haven't tried the bubble tea yet though. I see they use powder, so that makes me feel a little eh. Maybe I'll still give that a shot next time!)"
    },
    {
        "id": 24,
        "text": "Review for the snow ice.\n\nIt's unusual to find this dessert here in Philadelphia, so I was incredibly excited to try out this place, While not your traditional shaved ice experience, it is delicious in its own right. My friends and I chose the green tea base (it turned out to be green tea ice cream, it seemed) with hot grass jelly, red beans, and passion fruit. The toppings were fresh, and the overall price is reasonable.\n\nI like the atmosphere in the back, with lots of small tables set up. I could easily imagine this becoming a college kid hangout, if it were closer to campus."
    },
    {
        "id": 25,
        "text": "Delicious, authentic bubble tea right in the heart of Philly's Chinatown.  Unlike the other bakeries and bubble tea cafes close to it, this place accepts credit cards, so that's a plus. If you drive in to Chinatown this place is also right near the cheap $10 \"Bright Parking garage,\" so that's another convenience."
    },
    {
        "id": 26,
        "text": "Had black milk tea and grass jelly tea here. It's a cool little spot. They have a couch or two and a table where you can play jenga and card games.  The milk teas were pretty good - nothing special.  I guess it's a cool spot for locals."
    },
    {
        "id": 27,
        "text": "Picked up bubble tea at Tea Magic last weekend when I didn't feel like standing in the ridonkulous line at Tea Do. The new kid on the block had plenty of bright lights and games with extra seating in the back... Great for hanging out - but the bubble tea was just a little blah. (I had the original black tea bubble tea.) Slightly over sweetened and watered down with not much tea flavor. Kind of disappointed but at least I gave them a whirl."
    },
    {
        "id": 28,
        "text": "The girl at cashier was rude. I felt like being judged all the time. She even yelled at my friend when we were bit late taking our tea. The music's loud place's crowded service's terrible, and the tea's just so so. Not a good choice in China Town."
    },
    {
        "id": 29,
        "text": "I usually avoid cool tea shops like these because I rather get a simple $1.60 HK-style milk tea from Zhong Gang. But of course, it was past 8pm the other night, so I decided to give Tea Magic a try. \n\nI wanted something refreshing, so I stuck with the \"Cirton Honey Tea\" which I assume to be \"citron.\" The young girl at the cashier had no idea what I said and took a few glances at the board menu to make sense of my order. I motioned multiple times to the \"Cirton Honey Tea,\" but she still looked confused. She then awkwardly asked me if I wanted black or green tea -- I chose black tea and also added that I didn't want it to be too sweet. \n\nWaited for a couple of minutes as I eyed the guy making my drink because of the unnecessary confusion with the order. Everything looked good except for when he carelessly poured half of my drink into the cup and the rest on the counter. When it finally came to his senses that he spilled half of my tea, he attempted to cover it up by pouring the rest of the foamy tea mixture on top to make it seem \"right.\" \n\nLuckily, it wasn't too bad. It was what I wanted, actually. Not too sweet and it didn't leave a dry aftertaste. I took a look at the sticker and it read, \"Honey Black Tea\" in English with \"little sugar\" in Chinese. Not what I originally wanted, but that's okay. My boyfriend even tried a few sips and liked it... too bad it was $3 for a half-filled foamy tea. \n\nOn Saturday night, the boyfriend and I craved the \"Honey Black Tea\" again. The boyfriend went down this time to order it as I manned the car. Few minutes later, he came back with two milk teas. I asked him why and he said the young girl punched in \"Milk Tea\" when he ordered \"Honey Black Tea.\"  Both cups read, \"Milk Tea,\" so I went back to ask what was up. The same young girl seemed confused again and asked for our receipt. I motioned to the \"Cirton Honey Tea\" again and she apologized. What do you know... we finally got the \"Cirton Honey Tea.\" It was very citron-y and not all that great. I'm kind of glad they messed up my order the first time.\n\nLong story short, the youngsters here have no idea what's going on. If you don't speak Mandarin Chinese or if you order something that is not popular, beware. But then again, it's clearly communication, customer service, and overall management that are the issues here. \n\nI won't say we'll completely avoid Tea Magic, but I hope the next time we go back, we'll get our refreshing \"Honey Black Tea\" we mistakenly gotten the first visit."
    },
    {
        "id": 30,
        "text": "While I was touring in Philly Chinatown, friends and I decided to try this new spot. I got black milk tea, and friends got almond milk tea. My black milk tea looks paler compared to black teas from other places. But it tasted quite okay. Almond was a little too strong for me. Good thing about this place is that it has nice couches and coffee tables where you can just chill or bring your work here. They also have jenga, chess, and other board games for groups. It's worth a try."
    },
    {
        "id": 31,
        "text": "The interior is awesome. In terms of places to chill, it's not as loud as tea do (which is sometimes ok depending on your group size) and not as far as TeaTalk. The drink itself wasn't so bad, but the bubbles is what made the score so bad. It was wayyyyy overdone and it was so mushy and had no flavor. I'll give that it's new, and I'll try again for curiosity sake, but not in the near future."
    },
    {
        "id": 32,
        "text": "I used to not like this place until they added a lot more variety to their menus especially the skewers. The skewers here are so cheap compare to other places in Chinatown. Their portions are good too. Their snow shaved ice is good too, I like to add grass jelly because adding anything else would be too sweet for me. I don't like their smoothies and their milkteas are just ok. In the end of the day, I think how it offers a lot on their menu and I can always find a table to hangout with my friends here."
    },
    {
        "id": 33,
        "text": "I came here on July 4th as my friends and I were walking back from the parade, and we were surprised to find a new tea shop since we love bubble tea! The place itself is pretty modern and I really like that it seems like a good hang out place... they have free Jenga and comfy seating.\n\nI ordered the coffee milk tea with bubbles. The coffee milk tea had a strong coffee flavor, which I really enjoyed. The bubbles, however, were small, hard and too chewy. Not a good thing. My friends ordered the taro milk tea w/ bubbles, original milk tea (they ran out of bubbles, so with lychee), and the honeydew milk tea. We all agreed that while the milk teas ($3) were really good (not too sweet, unlike Tea-Do which literally makes me feel like I am diagnosed with diabetes), while the toppings, which cost an extra 50 cents, were not.\n\nIMO, better than Tea-Do but worse than Tea Talk. Would definitely come here again for their milk teas, and might try their shaved ice too! I'm cutting Tea Magic some slack for running out of toppings and shaved ice since this place is new."
    },
    {
        "id": 34,
        "text": "I was out with a friend in Chinatown and came across this cute little place. I got a coconut milk tea with boba and quite enjoyed it. The drink was a little on the watery side but the boba were perfect and the prices were abut normal for boba I've had before. The lady behind the counter was nice as well. Super cute place that I could go back to."
    },
    {
        "id": 35,
        "text": "Well, I had a great experience.\n\nOrdered the Pieces smoothie (orange + green apple + yogurt) with boba.  Tasty, refreshing, creamy.  Sweet without being cloying.  I love how the boba here seems to be soaked in a brown sugar syrup. Yummy, chewy perfection.\nPlus, the smoothies have REAL FRUIT. \nFriend got the thai tea and it was perfect.\n\nWe also enjoyed the atmosphere a lot--especially compared to Tea Do across the street.  The workers here are much nicer and the crowd is more relaxed as well.\nSaw people getting hot snack foods, which looked good.\n\n And at a fair prices, I will be back.  \nWant to try the patbingsu (shaved ice) as well."
    },
    {
        "id": 36,
        "text": "I actually prefer the boba tea here out of all the nearby boba places. The drinks have a stronger tea flavor and the boba is the perfect consistency  -- soft, but springy. As with other boba places, this place can get pretty packed and loud, but it's great place to grab a quick drink to go before sprinting to the train station. I recommend the iced green tea with boba and less sugar.\n\nMy only knock on the place is the inefficient way they set up the counter to order. It's impossible to see the menu if there is a line so unless you're a regular, you don't know what you want to order until you get to the register. As a result, this makes the ordering process rather slow. Please fix this!!"
    },
    {
        "id": 37,
        "text": "Ok environment, order three drinks and waiting for 15 minutes(no customer before me) They do not take credit card. Fresh fruit smoothie is made by fruits and fresh cut. But just takes too long. only one size for drinks and do not have toppings now. I tried milk tea, mango smoothie and mango green tea."
    },
    {
        "id": 38,
        "text": "Been here a couple of times. Bubble tea drinks are pretty tasty as are the appetizers. The boba has good chewiness to it, just the right consistency. I will say this - some places cannot get the boba right to save their lives and it's one of the hallmarks of good bubble tea.\n\nThe salted pepper chicken and curry fish balls are a good bet if you understand that it's a place to snack on appetizers, not feast on gourmet food.\n\nChill place to make a pitstop. A limited number of tables to chitchat, play card games/Jenga. You may have to wait a bit for the dweebs to leave.\n\nP.S. The \"medium\" cups would be a small anywhere else, so upgrade to the large."
    },
    {
        "id": 39,
        "text": "Sooo good. Very nice and clean on inside. The people are so nice and the drinks are great and inexpensive"
    },
    {
        "id": 40,
        "text": "I came here with a group of my friends several times and the bubble teas and smoothies are delicious.\n\nHowever, the service was quite slow and it took them at least 5 minutes to get my order done for me.\n\nThe spacious and cute atmosphere made up for the service. There was upbeat music and a lot of nice leisure time games like Jenga, stacks of cards, and even Uno available."
    },
    {
        "id": 41,
        "text": "Went here because another tea place nearby was busy, despite the lower rating here.  The boba tasted bad, and the thai milk tea was bad.  The mango shaved ice was very weird and stringy too.  No reason to go here."
    },
    {
        "id": 42,
        "text": "While it's great to finally have a spot in our local Chinatown that attempts to give Philadelphia a taste of trendy Asian desserts, the key word in all of this is \"attempt.\"  I recently paid the place a visit just to check out the hype over the ice dessert and shared an order of green tea snow ice with my siblings.  I'm going to *assume* that this is supposed to replicate the shaved ice dessert popularized in places like Taiwan & Hong Kong.  \n\nConsidering I've had my share of the real deal in Asia, I've got to say this is a really poor attempt at recreating it.  The texture is too thick, icy and almost rocky which is a far contrast from the light and fluffy quality of authentic Asian shaved ice.  At one point, I watched as the green, rocky bits stuck onto the condensed milk that was dangling from my spoon and it just looked like I dipped my spoon into some kindergartner's arts and crafts glue concoction, ick.  I don't know if I just got unlucky to get a bad batch, but I don't plan on coming back to figure that out.  I took a sip of my brother's green tea smoothie, and it was essentially the same but in melted form.  \n\nDespite the disappointment of the offerings, what the establishment has going for itself is the large lounging space it has in comparison to its competitors down the street.  That's probably going to be its only competitive advantage at this point, which is actually kind of a big deal considering how cramped the other shops are.  So, if you're looking for a guaranteed seat to hang out during peak hours, you can bet on Tea Magic but otherwise, meh, it's not that special."
    },
    {
        "id": 43,
        "text": "I normally go to Tea Do, their drinks have never failed me.  I was with a group of friends and Tea Do was completely packed, so we decided to try Tea Magic across the street.  It was almost completely empty, which should have been a red flag.  We were a party of 7 so at least there were tables for us here.  \n\nI ordered a mango milk tea and I could literally bite on the powder they use to make it... The two girls making bubble tea here also don't have the proper shakers as they were doing everything by hand, which took forever to crank out drinks for 7.  \n\nThe atmosphere was different though, we could actually hear ourselves speak.  But after all, this is a bubble tea place, and it was terrible."
    },
    {
        "id": 44,
        "text": "I liked the ambiance! The decor was nice. It's definitely a modern day tea shop. It also provides competition to Tea Do( almost directly across the street). They offer milk teas, regular tea, smoothies, and desserts. I liked how they had a display with fresh fruit and dessert. It showed the average customer what the store provided. We were at this place on a cold day, so my fiancee and I both decided on the ginger honey tea. I was not impressed! The tea was spicy( I realize that it would be slightly spicy, but I did not expect this). I was left wondering where the honey was.As I drank my tea, I realized that the honey was all the way at the bottom of the cup; the drink was not mixed well."
    },
    {
        "id": 45,
        "text": "I was here after they opened on the second day and was super excited as always when new places open in Chinatown. Tea Magic sold me on the space, decor and snow ice. It was lacking initially because it didn't offer any food items like Tea Do and  my first milk tea drink wasn't great. \n\nHowever, after many visits here, I've become a regular simply because Tea Magic has the better seating and is more spacious compared to other tea places around. Also they have really good durian and avocado smoothies. When they first opened, there wasn't much but I give Tea Magic an extra star for trying and constantly improving. \n\nThey went from CASH ONLY to taking credit. Then they added in cheesecakes and other dessert items. There is also fresh sugarcane drink, which is great. I also like the large drink size option. Tea Magic has reward cards, free wifi, and games for use while you're there. They recently installed a TV, which is good."
    },
    {
        "id": 46,
        "text": "This is clearly a hangout for teens, which, if you are a teen, then this might be your ideal. However, there are definite problems with this place, even if you are a teen with a need to hang out somewhere. The food is terrible. I ordered a bunch of different things, and the only thing I liked were the macaroons. The beef was chewy/stringy, the xiaolongbao tasted like they came from a cheap frozen package, as did the scallion pancake. The milk tea was OK, but much too sugary. Maybe I would request less sugar and see if it is any better, but I definitely wouldn't order their hot foods again."
    },
    {
        "id": 47,
        "text": "I like the American cafe decor in this place but that's about it. \n\nThe only time I've been in here, I ordered a hot drink because it was a cold day. It was some sort of taro flavored milk tea. BIG mistake. It tasted like taro bubble powder added to water with WAY too much powder to the point where I can taste the partially hydrogenated oils and the starchy thickener in the powder--of course it's not real cream in these \"creamy\" drinks--and it was way too sweet. There was no tea what so ever in the drink because it looked taro-food-coloring-purple where as if black tea were added, it would be brown purple. If you don't know what taro bubble tea powder taste like, imagine adding an excess of powdered coffee mate creamer to hot water, stirring it up a bit, and drinking that. That's what my drink tasted like. My sister got a black milk tea, also hot. I think that one actually had black tea and milk in it and tasted normal.\n\nBetween Tea Magic, Tea Do, and Tea Talk, this place has the worst drinks. They do have the \"shaved ice\" desserts that the other two places don't have but it doesn't look right. Taiwanese shaved ice should look like snow. Instead what they offer looks like the consistency of a gelato 'cept it's not a gelato. Doesn't look appetizing to me."
    },
    {
        "id": 48,
        "text": "Atmosphere is cozy and homely, not very modern. Felt like it was just a place to bum around. There's Jenga, cards, etc. on the side where you can play. I wouldn't sit around there to hang out. But the tea is better than the tea I had from tea do. Had the lychee green tea & mango green tea."
    },
    {
        "id": 49,
        "text": "Pretty solid place.  They really fill their stuff up to the very very brim.  I can't wait to try their foods though - I am really looking forward to coming back hear to try their snacks:  Fish balls and squid.  I hate to say neither of them were very good.  The curry fish balls were tasteless and it one of the worst calamari I had ever had.  Spaghetti thin rings of squid coated heavily with batter.  Do not recommend.  \n\nThey also have this coconut smoother special called that has \"summer\" in its name.  I stand ashamed for not remember, but there is coconut and strawberry in it.  They are also one of the few places in Chinatown that accepts credit cards and is cheap at the same time.  it's pretty spacious and clean, including the bathrooms, which tend to be very run down in many Chinatown joints.  You can tell is a new place, but it is a new place that is kept n shape."
    }
]