[
    {
        "id": 1,
        "text": "This is nice little Chinese bakery in the heart of Philadelphia's Chinatown! The female cashier was very friendly (flirtatious!) and the pastries shown in nicely adorned display cases. I stopped by early one evening had a sesame ball, which was filled with bean paste. The glutinous rice of the ball was nicely flavored, similar to Bai Tang Gao. Definitely as place worth stopping at if you are in the area."
    },
    {
        "id": 2,
        "text": "This is the bakery I usually go to in Chinatown.  They have a decent variety of buns and pastries.  Red bean-filled buns, mung bean-filled buns, coconut stuff, egg tarts etc.  If you buy a dozen, they will give you two more for free.  The prices are standard for a Chinese bakery, with most things at approximately $1.  The service has always been good.  They do serve coffee and tea.  There are a couple of tables inside, with usually the expected group of older Chinese guys chillin' in the corner table debating about something.  Great place to stock up on the buns, which I usually do before leaving town."
    },
    {
        "id": 3,
        "text": "A delightful find in Chinatown! Very clean, and very kind service. Everyone always seems happy in here, and their treats are absolutely delicious. You can also get a ton of sweet treats without any judgement! They're my favorite."
    },
    {
        "id": 4,
        "text": "I ordered a graduation cake for my niece and it came out absolutely perfect. Will come again for future events! Staff was nice also and the cake was really good."
    },
    {
        "id": 5,
        "text": "HK-STYLE MILK TEA:  FOUR STARS\n\nNot quite sure why there are two Saint Honore Pastries business listings on Yelp, but I have been checking in to this one.\n\nBoyfriend and I go by it all the time while in Chinatown, but it never crossed our mind to try it.  I think we might have tried it once a year or two ago, but it wasn't memorable.  I decided to try the HK-style milk tea not too long ago and was hooked.  I think I went here almost every day one week to get the milk tea, only to realize that I should REALLY watch my sugar intake...it's sooo good!  \n\nI personally don't think it's better than Zhong Gang's HK-style milk tea because they have their off days when a certain lady makes them (not enough ice, too much ice, etc.).\n\nOn a side note:  I wanted to try the crispy roast pork bun, but accidentally said the wrong name in Chinese and got the roast pork bun.  It was decent enough, although I will get to trying the crispy roast pork bun soon!  \n\nI will be back~"
    },
    {
        "id": 6,
        "text": "This is my favorite bakery in Chinatown! I usually get a pineapple bao (bun), red bean bao, and pork bun. \n\nThese buns are the cheapest and they also have bags of multiple buns, with and without filling. They have boba but I've never tried it, as well as custard tarts. I love the buns and that's what I go here for. \n\nThe service is decent. They don't speak much English, which isn't out of the ordinary in Chinatown. There's lots of seating and it's decently clean. \n\nCome here for the cheapest priced buns and baked goods (which are yummy) in Chinatown!"
    },
    {
        "id": 7,
        "text": "so I dropped in to this store since it was the same company as you would find in Hong Kong. Thought it might have the same delicious pastries you would find in Hong Kong. Although you did find your egg tarts and sweet buns, they weren't as ... how would you call it... fresh. They didn't have the same \"zest\" as you would find at the little stores along the alley ways of Hong Kong.They do have egg tarts which will satisfy your craving but doesn't leave you as tickled as you would hope. They don't take credit cards by the way and there's a lot of construction going on around them so it looks like they're closed."
    },
    {
        "id": 8,
        "text": "Impression: The good thing is that there are like 5-6 of these kinds of Asian Chinese bakeries around Chinatown- Mong Kok is another one that sells the same get up: sesame balls, roll cakes, taro buns, egg tarts, meat buns, ham and cheese breads- your typical Hong Kong South East Asian kinds of bakeries that sell their fares for less than 1$ each. The bad thing is, b/c it is the same as the rest, it may be hard to find something you've never tried before- but their cheese cakes looked to be their stand apart from other bakeries. This is the only \"Asian\" bakery on this street across from Nine Ting, the new Taiwanese popcorn chicken, right by Red King BBQ, and Wong Wong Restaurant. It's a solid Chinese bakery- neither fancy nor cheap and poor quality, neither special or bland but solid if you're looking for the typical Chinese desserts and pastries \n\nBecause it's cheap, feel free to load up on a large stash of goodies! Egg tarts were 0.80$, sesame balls were also 0.80$ and the green tea roll cake was only 3.50$. I like to take these treats home and eat them slowly over the next few days. The sesame balls and the tarts taste great if you stick them in the microwave and zap it for 30 seconds to 1 min. Pair it with some good tea and you got yourself a nice afternoon tea for your studies/work/friends"
    },
    {
        "id": 9,
        "text": "Best egg tarts? \n\nI was lucky to get them fresh and right out of the oven. Oh my goodness, a little piece of heaven they certainly were! With the right amount of flakiness and the sweet creamy filling, their egg tarts that I tried this time was probably one of the best that I've ever tried, if not the best. \n\nIn terms of pricing, this bakery is on par with every other bakery in Chinatown. There really is not significant, if any, differential in terms of the prices."
    },
    {
        "id": 10,
        "text": "Little square cakes of happiness with cute bunnies, cherries, and fruit, and for 90 cents each.... Don't mind if I do!  I still can't believe the prices in here.  I was wondering what was wrong with the cake at first for that price, but it was surprisingly as delicious as it looked.  Everything in here just looks appetizing.  I like Asian bakeries because the cakes are not overly sweet as most ones are in American Bakeries.  \n\n      I have tried the chocolate cake, and different versions of the vanilla cake here (bunny and cherry).  Both were fluffy, moist, simple, and slightly sweet.  They didn't really have any difference in taste though.  The main difference here seems to be the cute decoration.  I'm okay with that though.  I get excited like a five year old child at the idea of what cute animal or fruit I will get on my cake next.  The mango pudding was okay, but not as good as I've had in some Thai restaurants, or even what I could make at home.  I haven't tried any of the buns, but they do look tasty and are priced right.  They also offer bubble tea and smoothies here, but I haven't tried them.  I'm always too distracted by the cake.\n\n    You should drop by here after a nice dinner in Chinatown and get some sweets to take home.  It doesn't matter if you're still full from your meal like I usually am. The cute little cakes look and taste just as good the next day."
    },
    {
        "id": 11,
        "text": "This is my second favorite place for pastries down in Chinatown.  The egg tarts are second best, first being Asia Bakery.  I usually end up in here if im too lazy to walk over to Asia Bakery lol.  The breads are soft and chewy and always fresh.  Im not a big fan of their cakes though.  They have been too dry for my taste.  They have almond cookies and they are very good and cheap.  As most bakeries down there, they make milk bubble tea and smoothies.  Not a fan of the bubble tea and never had the smoothies, though alot of people do buy it here.  I'll stick to my favorite bubble tea place down there. (see my other reviews lol)\n\nGood bread, cookies and egg tarts here.  So give it a try!  \n\nHappy Eatings!!"
    },
    {
        "id": 12,
        "text": "This was my and the bf's go-to HK pastry place for the last two months. I thoroughly enjoyed their hot dog buns and egg tarts. Cash only and they're nicer to you probably if you speak their language. Overall, a good chill spot after roaming around Philly/Chinatown all day if you need a short 5-10 minute break. Let the soy milk drink go though, it really didn't taste like anything and I don't like the foam silky part on the top.\n\nIt was authentic and I wish I can get one of em hot dog buns right now but whoever is reading this - enjoy one for me!"
    },
    {
        "id": 13,
        "text": "Excellent dim-sum but better get there early. Often sold out."
    },
    {
        "id": 14,
        "text": "Nice pastry shop.   We went in for bubble tea after dinner at Wong Wong and left with drinks plus a bag of savory pastries.   The bubble tea is more flavor and less sugary which I like though my kids have come to expect a certain level of sweetness from their fruit flavors.  The boba were perfect, small & chewy.  The cups were smaller than most places but then again none cost more than $3.  In the evening Monday pastries ranging from $0.80 and up are 2 for $1.00, which is a good deal...similar to ABP's twofer sales.  I picked a variety of savory pastries and they were all tasty the next day - one difference from buns I've had  before is that I could see bits of onion inside the bun but not in the filling.  Will go back."
    },
    {
        "id": 15,
        "text": "3 pastries for $1.25 after 7:00 pm!  I love coming here on a Sunday and stocking up for the week with a box full of rolls and custards.  The baked goods here are always very fresh and consistent.  I'm a big fan of the egg custards, which have a layered, flaky shell, and the coconut milk buns.  The cakes are better at Greenleaf's but the breakfast pastries here are excellent."
    },
    {
        "id": 16,
        "text": "I've walked down Race many times, but never noticed St. Honore before. I asked the woman at the counter if they were new, but she gave me a polite smile and no answer - either there was a communication gap or she couldn't believe that I was so clueless (seeing as how Yelp reviews date back to 2008, clearly I am just  unobservant). \n\nI ordered an Egg Tart and was pleasantly surprised that a baked good was still so moist at the end of the day. The crust was sweet, light, and flaky and the egg filling was the perfect consistency - definitely one of the best I've had in Philly. Now that I know this place exists, I'll be back to try some other baked goods."
    },
    {
        "id": 17,
        "text": "I would give five stars, but I probably didn't try enough things to qualify. The sponge cupcake was really light, fluffy, and perfectly sweet. I also got some egg tarts, which my boyfriend loves, and he said they were perfect. It's cash only, they have some cheesecakes and such as well as Asian desserts."
    },
    {
        "id": 18,
        "text": "While I've never tried their bao (and usually go to KC for that), they have the best egg tart that I have found in Philadelphia Chinatown! Not too sweet and a light flaky, buttery crust. That alone is worth a trip here."
    },
    {
        "id": 19,
        "text": "Stumbled upon this little gem after having Pho with my friend from work....I had a slice of cake-- 95 cents! Where in the world can you still get a slice of cake for 95 cents?? It was very light and fluffy, almost like angel food cake with super light frosting."
    },
    {
        "id": 20,
        "text": "I am quite partial to the St Honore in Mei Foo, Hong Kong. For a short while, I think I may have been a mild addict.\n\nSame logo, same wrapping, so yep, yep-----\nOrdered some vanilla cream sponge slices.\n\nSoooo good with Starbux decaf for dessert in a warm bed. Simple pleasures:)"
    },
    {
        "id": 21,
        "text": "The steamed pork buns here are out of this world!  I've tried them at several other bakeries in Chinatown, but those don't even come close.  Perfect consistency, flavor, and they actually fill them up with big pieces of pork! You can get a pack of 8 for $6.50, which is a great price! The egg tarts are also some of the best I've ever had!  This place is a gem!"
    },
    {
        "id": 22,
        "text": "I've been looking for a good place that serves good roast pork buns that isn't stuffed with tons of fatty meat, but has a generous portion of non fatty meat in them. This place is it! At first, I only ordered one bc I was afraid that it would be lacking meat, but once I took my first bite (whoa...meat on the first bite!!!!), I ordered a full box. :-) If you purchase a full box, they give you 2 free. AWESOME! I also ordered an avacado shake and a strawberry shake. Both are made with real fruit. I hate places that use powder. The shake was great. She made them without milk (like I requested) and I couldn't have asked for anything better.\n\nThe service is spectacular! I loved the fact that she could speak english very well and understood everything I asked for. I hate going into some places and give you dirty looks bc you can't speak their language. She asked if my shake was good and to my liking. I really appreciated her taking the time to get my order correct. I will def be back here for more pastries!"
    },
    {
        "id": 23,
        "text": "Their prices were very good, and the lotus cake I tried was tasty. I can't speak for their other pastries, so I'll have to stop by again sometime."
    },
    {
        "id": 24,
        "text": "My go to place to get a nice birthday cake. Not too expensive (12$ for a strawberry cake), and very delicious ! They also gave me birthday candles, which is nice !"
    },
    {
        "id": 25,
        "text": "Got my wedding cake here and it was the best decision ever. So much more reasonable priced than American bakeries and way more delicious since it is not fondant based. Owner Kevin is an artist when it comes to cakes and he offered me great suggestions when I was torn between flavors and designs.\n\nWe ended up with 3 tiers: top: Strawberry shortcake 2nd: Chocolate sponge with strawberry filling 3rd: Green Tea with homemade red bean filling.\n\nIn normal weddings, there's usually a whole lot of cake leftovers. In normal Chinese weddings, there's usually a whole hecka lot more cause people leave after the lobster is served. So it's a huge deal when I tell you that other than a take out box that the server set aside for us, we had no cake leftover! \n\nThey also custom made mini coconut tarts for our Cocktail Hour which were a huge hit! Much thanks!!"
    },
    {
        "id": 26,
        "text": "Really good egg tarts. Scratch that, probably the best egg tarts in Philly. I keep trying to catch them straight out of the oven, but I think you probably have to ask them for that or something, because the last time I watched them bring out a fresh batch of egg tarts, and ordered it, it was still cold. Definitely still, good, I just want to try them right when they come out of the oven. I wish I knew when they baked those darn egg tarts. I'll have to ask them next time. Anyways, unlike most of the places in Chinatown, they use a flaky crust for their egg tarts. Pair that with the sweet, creamy baked egg custard filling, and it is a match made in heaven haha. Flaky crusts are the way to go for egg tarts. \n\nTheir other buns and savory pastries are standard; taste the same to me anywhere I get them. My sister favors their butter bread though, which is very good, and can act as dinner rolls. The drinks here are ok, nothing special. They serve the standard milk tea, lemon tea, and they also have bubble tea, but I've never gotten that here. They have a few small tables for you to sit on, and a refrigerator with soda and canned/boxed drinks right by the door so you can grab and go(no five finger discount!!! Remember to pay). I've also had the lemon cake before, which wasn't bad, but sometimes I do stray from the cakes, as they don't always look fresh.\n\nI don't think I've ever seen young people working here; it's usually 1 or 2 middle aged ladies behind the counter. They're not mean, but they're not overly friendly either. They just do their job, that's all it is. No extra smiles or small chat. And usually, there will be one or two middle aged/old men sitting toward the back reading the newspaper, making it seem more like the cafes in HK, where old people will hang out in cafes just to drink a cup of tea and pass the hours by. \n\nAll in all, definitely come here for an egg tart, if nothing else. You won't regret it."
    },
    {
        "id": 27,
        "text": "St Honore Pastries is another one of those places that if I'm ever nearby I have to make a visit. They have a wide selection of individual size cakes, buns, and other nibbly things almost all less than $1, usually .70-.90 a piece. \n\nMy personal favorite is the \"cupcake\" which looks like it's baked in a flower pot, it has a very eggy taste and a light and fluffy texture. The snowman cake, already mentioned by kathy t. is kind of really cute so I got one last time and it was pretty tasty. \n\nThey also have a fairly large drink menu so if you're looking for a durian shake, or something more appetizing, this is the place to get it."
    },
    {
        "id": 28,
        "text": "People are really cold and reserved didnt feel welcomed at all. Was rushed out the door quickly. Feeling welcomed is always important."
    },
    {
        "id": 29,
        "text": "The pastries are decent but the coconut bread and raisin breads are very dough-y and had the tendency to stick to the roof of your mouth.  The coconut bread only had a very scant amount of shredded coconut and was, itself, a bit on the bland side.  Definitely not even close to what you would get in Flushing.  We had to toast the bread just so we could actually swallow i The sesame butter cookies were fantastic: light, crisp, covered in sesame seeds, and containing the perfect amount of sweetness.  These are much akin to the butter cookies from Roma's and Isgro's, except with an Asian twist, compliments of the sesame seeds.  The almond puffs are also quite delish and very flaky and light with plenty of sliced, toasted almonds and a drizzle of honey on top.  The egg tarts are great with a flakey, layered, and buttery crust.  Come here for the cookies, egg tarts, and pastries, not for the breads."
    },
    {
        "id": 30,
        "text": "A nice Chinese bakery that gets you the goods. Rather than the shortbread cookie like crust of egg custard tarts at other Chinatown bakeries, St. Honore's egg tart has a flaky multilayered crimped crust (probably full of hydrogenated fats, but life is short). Full range of multilayer cake slices (snowman cake! peach cake!), jelly roll like chocolate roll, sweet pastries (sponge cake like cupcake, almond cookies, coconut cream bun, coconut cocktail bun) to the usual savoury pastries (beef curry bun, bbq pork bun, etc). Most of the individually sized baked goods run under $1 and an extensive bubble tea and fruit flavored shakes menu is posted on the wall.\n\nSeveral fourtops along the wall if you want to eat in, but I generally takeout and munch in the park etc. If you get a dozen pastries, they'll often throw in two for free."
    },
    {
        "id": 31,
        "text": "Their egg tarts are the best. The crust is flaky and buttery and the custard is baked to perfection- soft, creamy, and jiggly, the way it should be! I love that they're not overly sweet too. Get there early in the morning and get the egg tarts while they're still warm, it's the best thing ever!\n\nSome bakeries in Chinatown get their pastries delivered, I like that they bake on the premises. You know you're getting fresh pastries!"
    },
    {
        "id": 32,
        "text": "So I don't know how the other review was double posted, and I didn't notice till now. But here's an update. I don't go here for egg tarts anymore, they are not as good as they used to be. (Go to Zhong Gong if you're looking for great puff pastry egg tarts.) That being said, I still think their tarts aren't too bad, just not the best, and all their other baked goods are still good too.\n\nBut the real gem here are the custom chinese cakes. If you like soft, light, and fluffy Chinese cakes, then you'll love the cakes at St Honore. They bake to order, and their fillings, toppings, and whipped cream are always fresh. It's a little more than what you'd pay at some of the other asian bakeries in Chinatown, but you're paying for quality and consistency. Try one for the next birthday!"
    },
    {
        "id": 33,
        "text": "Absolutely love this bakery.  My guilty pleasure after work.  Croissants and raisin buns are so fresh they melt in your mouth.  Prices insanely low for the quality... cheaper than the surrounding bakeries which don't quite cut it like St Honore. Also, the owner is so sweet. She even is honest about how fresh her coffee is; when fresh, it is excellent and also cheap."
    },
    {
        "id": 34,
        "text": "I was so glad when the smoking ban in Phila  was implemented,because the old men smoking would have been the only the only reason I would have gave this place a lower score.Phew! it was foul smelling. The prices are unbelievable.I don't know how they can create such beautiful works of art for such small amounts of money .60 cents for a magnificent pastry decorated with glazed fruit to look like a expensive $5.00 french pastry.Crazy! and delish.My favorite is the buttery cream filled coconut bun.It is so rich we tend to share one with coffee.Buy a few and refrigerate them or impress friends at a party .So many lovely sweets so cheap and yummy.Nice enough for a bridal party. Street parking sucks but one goes in while the others circle."
    },
    {
        "id": 35,
        "text": "Arguably the best Chinese pastry shop in Philly's Chinatown... another favorite of mine when I was doing time in Philly for college years ago...\n\nThey have all the traditional favorites - hot dog buns, roast pork buns, coconut cream, coffee rolls, egg tarts, etc.  Prices have gone up since I last visited -- but the place is cheaper than most bakeries in NYC - ranging from $0.60 to $0.80 for most items.\n\nThey also serve up drinks including bubble tea - it hits the spot but is by no means earth shattering."
    },
    {
        "id": 36,
        "text": "Just came from this bakery this afternoon and I really liked this little shop. They have the fluffiest, soft bolo bao (pineapple bun) I have ever had. Their milk tea was made fresh. I would probably ask for a stronger tea brew in my milk tea though. Their prices are very affordable. Yum!\n\nThe only downside to this place is their packaging. I'm from out of town and the open wax paper packaging makes it hard to travel around with and to keep fresh."
    },
    {
        "id": 37,
        "text": "Horrible 3rd world service. After I picked out my pastries, I asked for a box. The woman behind the counter scolded me:\"you have to ask that in advance!\" Then she proceeded to take out each pastry from its little bag to put them in the box! I asked if that was necessary and the response \"you can get bags OR a box,\" not both! I nearly fainted. I guess they are going to re use the bags, which is UNFATHOMABLE to me. I am a grown ass adult and I won't be spending any of my hard earned $ here!"
    },
    {
        "id": 38,
        "text": "Looks like a nice place from the outside, but the Bubble tea really sucked. If you are going to blend ice into it, at least do it so it's smooth and not gritty or rocky. Also something is wrong when you Green Tea Bubble Tea looks white and not green. Bubbles had the wrong texture too. Yuck!\n\nWe also ordered the egg tarts which were good.\n\nBased on my experience though, I have no desire of coming back."
    },
    {
        "id": 39,
        "text": "I just walked in to this random bakery to order a birthday cake for my family member's birthday last week. I picked it up this afternoon. It was beautiful fruity and cheap. I only paid $27.00 for  pretty big size cake. The most important thing is it was DELICIOUS !! I can't believe it !!. It was not too sweet, it was just perfect. Just perfect for the birthday party. I willing to try another kind again for the next birthday party."
    },
    {
        "id": 40,
        "text": "Stopped in yesterday while on an unsuccessful hunt for something else in Chinatown and grabbed a coconut cream bun ($0.70) and a curry beef thing ($0.80). \n\nI ate the coconut cream bun while I was waiting for the train and it was so delicious I briefly considered seeing if I could make it to St. Honore and back before the train came. The bun itself is sort of elastic/chewy but in an inoffensive way, the filling is delicious. \n\nCurry beef pastry was ok, extremely flaky which is a plus but not very much inside. Roast pork bun is a better bet."
    },
    {
        "id": 41,
        "text": "We have tried many of the bakeries in Chinatown and beleive that this is the best one. The quality of their pastries is superior and their deserts are also more attractive than the other bakeries. This is my go to for a chinatown bakery."
    },
    {
        "id": 42,
        "text": "Escaped the bubble of business travel and happened upon this Chinatown bakery early in the morning. Buns are standard Chinatown freshness and deliciousness but prices were amazing. Maybe I have my SF goggles on?"
    },
    {
        "id": 43,
        "text": "bun is sucked here and the waitress was really mean and cheap... will never come anymore... I really think that the review above 3 stars are fake"
    },
    {
        "id": 44,
        "text": "I can only comment on the cakes but my cake experience has been great. They are not pricey by any means. I think a 6-inch strawberry cake for Mothers Day cost me only $12. Don't think that because it's not pricey that the taste will be bad. We all loved the cake. The cream was light and the cake moist and not too sweet, which I appreciate.  We've tried the taro one before too. I was skeptical about the flavor but it was terrific too. They'll write what you want on the cake on the spot. They gladly wrote \"happy Mother's Day\" in Chinese on it for me. I'm not sure if they make custom cakes.  I've never tried their other things but I'm going to try their sponge roll cakes next- just 4 bucks if I remember right. Give their cakes a try!"
    },
    {
        "id": 45,
        "text": "This place is cheap with a capital \"C.\" Though most bakeries in Chinatown are very affordable, what made this place great was the service! The woman behind the counter chatted us up and helped us decide on which bubble tea to order. We went with the thai tea which they prepare themselves earlier in the day. The thai tea was tasty but could have been a little sweeter. I was tempted to try out some of the treats since they were only a buck but I was stuffed from dinner. Next time I'll try to the egg tarts."
    },
    {
        "id": 46,
        "text": "Cute pastry shop, very authentic chinatown feel. I had their egg tarts including the almond tart. I definitely prefer the egg tart over the almond tart. It was flaky and the egg custard was sweeter than the almond. The almond tart didn't have any almond taste to it. The flaky crust was definitely a good compliment to the egg custard. Not bad for 80 cents a pop."
    },
    {
        "id": 47,
        "text": "Ordered a birthday cake here for the first time based on the reviews. I ordered a few days in advance, a chocolate cake with vanilla frosting that said happy birthday mom. They only did 8 in chocolate cakes which is fine. When I went to pick up, I was disappointed to see they had put some chocolate frosting on the top of the vanilla. I paid $23, my mom would still like it but it's not my order 100%. The lady at the counter didn't seem to speak English and I didn't want to argue. The lady I spoke with over the phone spoke perfect English and we confirmed at least 4 times my order back and forth. I think just be careful when placing an order here. There must have been a miscommunication or it wasn't written down right as the paper that came with the cake just said chocolate cake. The cake was delicious, the price was fair and the cake was beautiful so that's why I give it 4 stars. I may just order all vanilla next time."
    },
    {
        "id": 48,
        "text": "This bakery is a gem! It has the most delish pineapple buns!! The service was excellent as well! We enjoyed buns with Vietnamese coffee! They were very kid friendly as well! I highly recommend this bakery!"
    },
    {
        "id": 49,
        "text": "Cheap chinese bakery. Pretty consistent with the quality. They make decent cakes here too!"
    },
    {
        "id": 50,
        "text": "One of the better places in Philadelphia Chinatown for rolls and egg tarts (multiple layer crust here!).\n\nService is generally faster if you can speak in Cantonese, though... I tried to use Mandarin and it's still faster than English.\n\nTeas here are okay, although probably better elsewhere.\n\nLimited baked good selection, but they do everything almost equally as well, and they're very consistent about it."
    },
    {
        "id": 51,
        "text": "This use to be my goto bakery for coconut buns. Then I became a freak about my sugar intake and I stopped getting most baked goods.\n\nI remember Linda N.'s review about them and ventured there during my lunch break. I didn't want a drink but saw they had a sign for custard buns, my childhood favorite!!!  I go in and look for their steam machine thing... But nothing is in it. I ask for the bun, and they said it was frozen. I assume for take home orders. Womp Womp!!  \n\nI felt weird leaving without buying something so I got the egg custard. I'm glad I did, it was pretty bomb. Well done in my opinion. Can't beat price, 80 cents. I'll try the hk tea next time... Didn't realize they sold it in ice lol.. Didn't want hot since it was hot outside."
    },
    {
        "id": 52,
        "text": "I ordered so many cake from here for our family's events.\nThey all came out good. Easy to communicate with the owner cuz her English is pro. Price is reasonable."
    },
    {
        "id": 53,
        "text": "We usually buy durian birthday cake from this bakery but this will be my last time buying from here. Just got a 10\" durian birthday cake and the quality is going down while price is going up. The cake cost $50 and back then you'll get more durian filling but now you get more cream! The cream is not even good."
    },
    {
        "id": 54,
        "text": "I have been looking for chestnut cake around for a while for my birthday and they have it! It's like an angel fruit cake with chestnut paste as the filling! It's delicious!\nThe quality is very good!and it's very affordable as well!\nThey also have regular fruitcake,tiramisu mousse cake and more!some of the items are made to order like the chestnut cake,and some are pre-made(see pictures)Have a look next time when you are around!\nAuthentic Hongkong style pastries!!"
    },
    {
        "id": 55,
        "text": "TERRIBLE TERRIBLE service. I have never felt so disrespected by any establishment EVER. I walked in around 7:30pm on a Friday to pick up a birthday cake pre-ordered. I was waiting for a friend so I decided to buy an egg tart (somehow they charged me 90c even though the sign CLEARLY said 80c, but I wasn't in the mood to argue over 10c) and use the rest room while I waited. The door to the bathroom was locked and all I got as an explanation was, \"the last person to use it must have locked it behind them. We have no key.\" HOW do you not have the key to your own bathroom? I was confused at first and thought it must be a simple misunderstanding but nope, they really just didn't want me to use their restroom. I asked them where they used the restroom if its locked and they just mumbled and didn't answer me (mind you, there was no language barrier--they completely understood me). So I sat down with the egg tart (which honestly wasn't even as good as those at other bakeries) and waited for my friend.\n\nWhen I checked on the cake, the name was spelled wrong even though we had confirmed the spelling multiple times. So when I asked the woman to change it, she just had the biggest attitude. I could hear both women behind the counter talking about me, I guess they didn't realize that I could understand. Believe me, I am the first to admit if I am in the wrong or if I had any part in bad service received but this is the first time I have genuinely been shocked at how I was treated. I will never be back here again. Get your pastries somewhere else, where the employees are friendlier, where they won't unreasonably overcharge, and the food tastier."
    },
    {
        "id": 56,
        "text": "Went just for the egg tarts. The crust was incredibly thick and while flaky, the edges had the texture of being stale. The egg custard was sweeter than I am used to but I did not mind that as much the crust."
    },
    {
        "id": 57,
        "text": "Really good egg tarts. Scratch that, probably the best egg tarts in Philly. I keep trying to catch them straight out of the oven, but I think you probably have to ask them for that or something, because the last time I watched them bring out a fresh batch of egg tarts, and ordered it, it was still cold. Definitely still, good, I just want to try them right when they come out of the oven. I wish I knew when they baked those darn egg tarts. I'll have to ask them next time. Anyways, unlike most of the places in Chinatown, they use a flaky crust for their egg tarts. Pair that with the sweet, creamy baked egg custard filling, and it is a match made in heaven haha. Flaky crusts are the way to go for egg tarts. \n\nTheir other buns and savory pastries are standard; taste the same to me anywhere I get them. My sister favors their butter bread though, which is very good, and can act as dinner rolls. The drinks here are ok, nothing special. They serve the standard milk tea, lemon tea, and they also have bubble tea, but I've never gotten that here. They have a few small tables for you to sit on, and a refrigerator with soda and canned/boxed drinks right by the door so you can grab and go(no five finger discount!!! Remember to pay). I've also had the lemon cake before, which wasn't bad, but sometimes I do stray from the cakes, as they don't always look fresh.\n\nI don't think I've ever seen young people working here; it's usually 1 or 2 middle aged ladies behind the counter. They're not mean, but they're not overly friendly either. They just do their job, that's all it is. No extra smiles or small chat. And usually, there will be one or two middle aged/old men sitting toward the back reading the newspaper, making it seem more like the cafes in HK, where old people will hang out in cafes just to drink a cup of tea and pass the hours by. \n\nAll in all, stop by here for an egg tarts, if nothing else. You definitely won't regret it."
    },
    {
        "id": 58,
        "text": "my friends and i were on the search for the best hong kong milk tea today. while st honore's version wasnt remotely as close to the best i've tried, it is by far the best in philly. give this place a go if you are on the hunt for some good hong kong milk tea."
    },
    {
        "id": 59,
        "text": "After coming from New York I knew I'd have to go through trial and error to find my go-to Chinese bakery in Philly.  After trying nearly all of the bakeries around Chinatown, this is probably my favorite.  First of all, the staff is very nice and helpful.  I wish I knew their names because I'd like to give proper credit to the staff, but the lady who speaks English without an accent is so friendly.  Every time I stop in she'll say hi and ask how I'm doing with a big smile.  I really feel like I'm a regular at this point.  I once came with my mom and now she's always asking how my mom is and when's the next time she'll be back.  \n\nOn to the buns.  I've tried most of the items available at the bakery.  There's a wide assortment of sweet and savory buns, desserts, and prepackaged steamed buns ready to go.  I'm really obsessed with Chinese style dried shredded pork, so I always have to get either the 'pork over bun' or the rolled up bun with green onion and dried pork any time I walk by.  To someone without much Chinese bakery experience this may sound weird but you have to give it a try, such a great balance of sweet, salty, savory, decadence.  Everything else for sale is also top notch.  I was lucky enough once to grab some egg tarts that were literally straight from the oven and I have to say at that point they were the best I've ever had in my life.  \n\nThey also have an assortment of hot and cold drinks available, but I don't have much experience with those.  All in all this is a must-go if you are wandering around Chinatown.  Stop in for a bun or a dessert.  It's a great treat, from an exceptional staff, and it definitely won't break the bank."
    },
    {
        "id": 60,
        "text": "My favorite go-to Chinese bakery for roast pork buns, egg custard buns & tarts, and fried pork dumplings! I especially love coming here in the morning because I get to see/listen to the old Chinese men in the back talking/gossiping about the latest news (old people are so cute!). \n\nPros:\n-- Cheap prices! Almost every baked good is under $1\n-- The ladies who work here are so friendly and always smile\n-- Very consistent with almost always getting \"fresh out of the oven warm\" baked goods\n-- Get to practice my Cantonese!\n\nCons:\n-- Very small place, so not much moving room\n-- Not a place to go to sit down and do work"
    },
    {
        "id": 61,
        "text": "If I'm driving to Philly for some cheese steaks from NYC, I know I have to go to St Honore Pastries for some egg tarts. I guess with everything going on with the pandemic, I thought the staff would have taken more precautions.  I didn't realize it at the time, maybe I was just too eager to have some egg tarts, but the lady that took my order used her hands (without gloves) to get the egg tarts instead of tongs.  Am I being overly paranoid?!?  I mean, I've been to Chinatown and Flushing in NYC, so a woman using her hands to get me a bao isn't out of the norm but that was before Covid.  If I had to rate the egg tarts (yup, ate them waaaaay before I played back the experience in my head) and cha sui baos, I'd definitely give it 5 stars but because of the lack of safety precautions, had to bump them down to 2 stars. Oh, the store hours aren't correct on Yelp, I made the mistake of going at night (before closing time) and they were already closed."
    },
    {
        "id": 62,
        "text": "Support this business! I grabbed 4 pastries here to taste and they were all awesome. The woman who runs this plan was so sweet and kind to me. I regret not trying the cheesecake they offered!! Luckily, everything I did grab was awesome, and I got to share it with my friends who also loved them."
    },
    {
        "id": 63,
        "text": "Oh pastry shop, how you now disappoint me! I've been here often and they have always stuck with the moto \"We only use fresh fruit. We don't have powder stuff here.\" And now, what happened to you?!?! You stooped to the level of some other tea places that use powder. YUCK!!!!!! And it's not even blended good either. It taste gritty and just plain disgusting. After making it, I noticed the funky looking color and asked if this was fresh. \"No, it's powder. You didn't ask for the fresh fruit one which costs more money.\" From all the other times I have been here, you have never given me a strawberry drink made of flavored powder. Who even asks for a fruit drink made of powder??? Also, my sister ordered the thai tea. It did not taste fresh. :-( When my family wanted a good bakery, I was so happy to introduce them here, but then all this happened....shame.\n\nAnd the pork buns aren't as good either anymore either. It was stuffed with tons of onions when before it was stuffed with a balance of meat and onions. Are you cutting back on quality bc of costs?? I rather pay a lil extra money for your old quality then you trying to cut cost and making your products non-edible.\n\nI thought I found my new bakery, but my search continues...."
    },
    {
        "id": 64,
        "text": "I've only tried the roast pork buns/char siu bao and egg custards here, and both were solid. I've tried bao at a few of the other Asian bakeries, and I think this one is my favorite thus far. The meat isn't too sweet and is tender and flavorful enough, and the ratio of meat to bun is such that the bread doesn't fall apart while eating. The egg custard was also enjoyable. I liked the consistency and flavor of the custard, but prefer a flakier crust. \n\nFor now, this is my go-to place for bao."
    },
    {
        "id": 65,
        "text": "I love this place..  I love their chunky fried dumplings, sesame balls, n more... never disappointed when I go there...  you even call them in advance if you have a  party , they can even make extra fresh bakery for u!"
    },
    {
        "id": 66,
        "text": "Tried just about every sweet bun available. This has got to be the best brioche dough I have tasted in a long time. The fillings, while delicious, were a bit skimpy in some of the buns. Red bean and crispy coconut were standouts. Taro was lovely but could've had more oomph. Sesame balls were the one thing I didn't like: fryer needed an oil change, so that was all I could taste. Would return for the brioche goodness, great prices, friendly staff."
    },
    {
        "id": 67,
        "text": "My mom loves this joint. A trip to chinatown is not complete without some  egg tarts. They are delightful even two days later.\n\nThey are also insanely cheap and take credit cards."
    },
    {
        "id": 68,
        "text": "I love this place!  The cakes are always beautifully made and very fresh!  The buns are also very delicious! My favorite bun is the pineapple roast pork bun.  The mixture of sweet and savory is yummy to my tummy!"
    },
    {
        "id": 69,
        "text": "They are still open and fully stocked during this pandemic! :) Stopped by on a Saturday mid-day and they had everything. The lady who helped me at the counter was very friendly. She informed me what pastries just came out fresh. (Their egg tarts are very popular by the way.)\n\nOther times that I've come here, they've sold out on the pork scallion roll. I was so glad to see they actually had some when I stopped by!! Finally got to taste it and I was not disappointed. The bread is so soft and tasty. It has the light taste of pork and scallion. I honestly expected a little more scallion to be in it, but it still tasted delicious. For those not familiar with this kind of roll, forewarning to those who don't like mayonnaise: it has a mayonnaise-like spread inside. I personally think it enhances the roll.\n\nI also tried their roast pork bun for the first time. Do not miss out on this if you like roast pork !! This is a great combination of sweet and salty. The bun itself has the sweet topping and it's filled with the roast pork inside. I regret not buying more than one, especially because it's so affordable. :(\n\nIf you're looking for some cheap and delicious asian pastries, definitely stop by here and check out what they have. I'll have to try their desserts next!"
    },
    {
        "id": 70,
        "text": "AMAZING!!!! Everything is so cheap! I got the egg tart, neapolitan, and \"cupcake.\" The place smelled bit weird when i came in, but that was fine since i wasnt planning on staying there to eat. Neapolitan is perfect combo of sweet and crispy. It's not crazy sweet like others with icing on top. The cream in between is also not that sweet, tastes bit like whipped cream, but the pie is AMAZING. The \"cupcake \" is like spongy soft angel/pound cake which is what i was expecting. Egg tart EXCEEDED my expectations the crust was to DIE for and it actually tasted like an egg tart not a tart with yellow cream in middle!!! COMPLETELY recommend this place"
    },
    {
        "id": 71,
        "text": "If you know me, I LOVE iced HK-style milk tea... a lot. I used to frequent Zhong Gang, but it has been very, very inconsistent - too much half and half, not enough syrup, or not enough ice. \n\nMy new favorite HK-style milk tea is from here. $1.50 for iced. It is consistent most of the time. I like to ask for crushed ice, but there's just too much clumped ice leftover... most likely because of the cold weather. Maybe it will be different when the weather gets warmer. \n\nDefinitely recommend their iced HK-style milk tea and HK-style iced tea!"
    },
    {
        "id": 72,
        "text": "The breads were SUPER SOFT. The egg custard in both breads were on point. Whenever I go to Chinatown, I always stop by at least one local bakery. The breads are so cheap and packed with goodness. There wasn't much variety around 4pm. I was hoping for more savory choices. But this is a great snack stop."
    },
    {
        "id": 73,
        "text": "Not sure what happen. I have order a taro cake from this place 4 times and each time it was delicious and fresh. However, the fifth time, I ordered a 12inch taro cake for my moms birthday it was bad. The cake was order on a Friday, picked up on Saturday, and party was on Sunday. I had put it in the refrigerator immediately after coming home with it. The taro fulling of the cake was sour and tasted very odd. They must of used old taro or just completely messed up the order. I was and still am embarrassed and disappointed at the cake because we had 20 guest and we served bad cake at my moms birthday party. I call the bakery immediately and they did refund me my money, however, the party was somewhat ruined and literally left a bad taste in my mouth. I will no longer recommend this place nor will I return to purchase anything from here anymore. I wish I can give it zero stars."
    },
    {
        "id": 74,
        "text": "Clean little Asian pastry shop and owner was very friendly and kind. Prices are reasonable - came away with 6 pastries for $6.75. Recommend the pineapple buns, roast pork buns, sponge cake, and wife cake!"
    },
    {
        "id": 75,
        "text": "Saint Honore Pastries is one of the best bakeries in Chinatown. Although the location is small, but the pastries are good and the place is clean. If you buy a dozen pastries, you get a free pastry or the raisin bread. My family is a fan and we always buy from here when we hit the beach. Our favorite is the shredded pork roll, which is moist and flavorful. They have the best shredded pork roll in Chinatown. They do serve other foods as well and not just pastries and desserts. Saint Honore Pastries is good to sit for a quick bite and some tea as most Asian elders do around in the early morning."
    },
    {
        "id": 76,
        "text": "Awesome pastries, awesome price! This place is the absolute BEST in Chinatown for egg tarts and they're only 80 cents each! I got 10 of them and it came out to $8. You can't beat that! The service is so nice. It's your typical cute Chinese bakery. This place is great for getting a quick treats and walking around the city of ordering a bunch and bringing them home like I do."
    },
    {
        "id": 77,
        "text": "Great breads, cookies and cakes. Great service, and the owner who works on Sun. always has a friendly smile to greet you and make you feel welcome. Also sell moon cakes for the Autumn Fest. and New Year cookies. 2 of my favs are the butter buns and the green tea roll cake."
    },
    {
        "id": 78,
        "text": "The bakery was very simple and didn't have many items out on display but the woman who helped us was very nice and friendly. We bought two pork buns and a milk boba/tapioca tea. The tea and the buns were both very good. We asked that the buns be warmed up and she quickly obliged. We ate them as soon as we got back in the car."
    },
    {
        "id": 79,
        "text": "The crispy roast pork is SO GOOD and lowkey it's 2 little buns stack next to each other for the price of 1. Amazing amazing and can't recommend enough.\n\nWhen I got there ~2 pm the bun I got was warm!"
    },
    {
        "id": 80,
        "text": "Great swiss roll cakes! The pandan flavor is delicious. The cream is so thinly rolled in, just the way I like it--aromatic yet fluffy and light."
    },
    {
        "id": 81,
        "text": "This is my favorite bakery in Chinatown! It's my go to spot at all times.\n\nI love the egg tart, pineapple bun, and milk tea there. The staff are so nice and friendly. Once you walk in they will greet you right away. When I walk in they already know my order.\n\nAfter 6 o'clock, they have a special for buns - 2/$1. It's what's left from the afternoon. The buns can sit overnight; I normally eat it right away as a snack or eat it for breakfast the next day. \n\nDefinitely recommend this bakery!"
    },
    {
        "id": 82,
        "text": "Yesss, the bakery is open and with my favorite worker lol. After months of no Asian pastries, my husband and I ordered a dozen of goodies to ourselves. We miss the egg tarts and buns. Yum, so happy they're open and cravings satisfied for sure."
    },
    {
        "id": 83,
        "text": "The owners do a great job with this place. It is clean, well lit and managed well. They are always friendly and helpful. Bought some great mooncakes for the Mid Autumn Fest and were reasonably priced. My 2 favs are their butter buns and steamed buns - best in Chinatown. Also they have a good selection of cakes, buns and cookies. You gotta try their custard cakes. There are like 8 or 9 bakeries in Chinatown. This one is at the top of my list."
    },
    {
        "id": 84,
        "text": "The lady at the counter was very pleasant. I was on the hunt for the best big combination steamed buns (Baozi). It was good, but the bread to filling ratio needs improvement."
    },
    {
        "id": 85,
        "text": "I really enjoyed my brief visit to St.Honore Pastries. I'd originally planned to go to one of the newer spots but I've been here many times and knew they wouldn't disappoint me. I wish the rest of the city was like Chinatown that place is always jumping it feels like NYC. \n\nService 4.5/5\nThe counter lady was all business but the two people in front of me were elderly and I thought she could have been a little gentler with their cake box. I'd a feeling there was an actual cake inside and the man commented to me that \"this is a peaceful place,\" right before she slammed his cake box on the counter. Now he epitomized customer loyalty but I could see (though he didn't say it) he didn't feel appreciated by the counter lady. A loyal customer is special and should be treated accordingly. \n\nAmbiance 3/5\nI've been here before it's not peaceful. But I enjoyed the people watching. There are usually senior citizens sitting together watching the news in Chinese with a cup of coffee or tea it's lovely to see them. And even better b/c the scent of coffee wafting through the cafe/bakery smelled divine. I didn't order it though b/c I'm a habitual insomniac so no caffeine for me after 2pm.\n\nFood\nEgg tart 3/5\nThough it was delicious it was way too sweet for me and i love sweets. The tart crust was perfect but the egg custard was too sweet. I won't order it again although it was very creamy and otherwise cooked perfectly.\n\nRainbow cake 5/5\nNot too sweet - it was perfect and just the right amount of frosting. The sponge cake was moist and had the right texture. I basically have the pallet of a little kid so if i see rainbow sprinkles i say yes please.\n\nMy check came to $2 so I highly recommend you make a visit and try different items b/c at those prices you can afford to take some risks !"
    },
    {
        "id": 86,
        "text": "The lady on the counter looked like she did not want to do business at all, her face was very unpleasant. I went to this store specifically to get their egg tarts cause they WERE delicious. Now, not anymore. The fillings had watery texture instead of the creamy taste they should have. \n\nI also ordered \"honey citron tea\" which the sign said $1.25, then the lady charged me $1.50. I positively thought they must have changed the price. As I went back, she got my order wrong and gave me \"honey ginseng tea\" instead. Ugh. I also bought a slice of tiramisu cake, and it was ok, not too sweet but I hardly tasted the coffee at all.\n\nI will not be back."
    },
    {
        "id": 87,
        "text": "My favorite chinese bakery. I love their buns. And their eggtart is best in whole Chinatown"
    }
]