[
    {
        "id": 1,
        "text": "The food is much worse than previous Sakura. The service is terrible. They don't care much about the customers, but just chat with each other. You have to ask a few times for water. At least 20 min each dish. Furthermore, one order is totally forgotten.... Don't order noddles. Super bad quality. Can't believe Chinatown has so bad noddle. Miss Sakura very much!"
    },
    {
        "id": 2,
        "text": "The restaurant is renovated, and menu is replaced. Ordered pig feet pot and spicy fried rice. Both were so delicious. The pig feet was so tender and flavorful. The spicy fried rice also becomes to my new favor. I will bring my friends to open a party over there. Strong recommend!"
    },
    {
        "id": 3,
        "text": "The food here is very delicious amd they make the effort to make them look very appetizing as well. The environment is also very casual and calm. The price is also cheaper than most other places."
    },
    {
        "id": 4,
        "text": "In town to visit some friends. We stumble upon this restaurant, the place look newly renovated. We order the soup dumpling and I can believe how flavorful it was. Also the whole fish with pepper was very delicious, I normally cant take 2 much spice. The waiter/waitress were very attentive. All in all we really enjoy the food. Would definitely come back again if I'm in town again."
    },
    {
        "id": 5,
        "text": "酸菜鱼非常好吃\n费城终于有好吃的湖南菜了\n\nPickled fish is very delicious\nPhiladelphia finally has relatively authentic Hunan food."
    },
    {
        "id": 6,
        "text": "Wonderful ambiance and terrific service! Maggie made my experience at the newly renovated restaurant easy and fun. This is my favorite Asian restaurant. Same owners as Sakura, with the same authentic Asian flavors I've come to love."
    },
    {
        "id": 7,
        "text": "It is the same owner but the interior and menu has been upgraded. They kept the old shanghai style dishes and added Sichuan and Hunan style, which we found delicious as well. We enjoyed the dishes and the servers were very nice. The only reason it's not 5 star is the price is higher than before with cash only."
    },
    {
        "id": 8,
        "text": "This place reminds me of Trader Joe's. On the packaging of the tj toilet paper, there's a cartoon where a man says, \"if you like the brisket you should try the toilet paper!\" Well if you liked the toilet paper you should look no further. It is the blandest and most tasteless Chinese food we have ever had. We went because we wanted something flavorful, and came out with sinking feelings. To make things worse, the meal of two courses cost more than 50. To pile on top of that, it was cash only. \n\nMiss the old Sakura. It was not the tastiest but it offered good value. The updated interior is welcome, but does not make up for the quality of the food.\n\nThe dishes looked nice, though"
    },
    {
        "id": 9,
        "text": "Make sure you have Cash because this place does not take cards. However the food was awesome make sure to order off of the Dim Sum menu!"
    },
    {
        "id": 10,
        "text": "Authentic Chinese food !\nThe food is pretty good especially the hunan beef noodle!\nMy friend likes intestine. \nThe environment and service are all good!!"
    },
    {
        "id": 11,
        "text": "Came here after the recent renovation for a late night dinner. We ordered Xiaolongbao, eggplant with preserved eggs, and bamboo shoots stir fry with pig stomach. \nThe flavor for each dish is on point! Normally Chinese food I've had in the US is heavy with taste and all dishes taste more our less the same. What we had here has a great variety of flavors without being too spicy/heavy. Each dish had its unique flavor. \nWe didn't try any spicy dishes. We'll come back for that!\n\nAll dish we ordered were perfectly cooked. It's easy to overcook the pig stomach dish but they did really well! It tasted crunchy and chewy.\n\nLoved the xiaolongbao! The most juicy xiaolongbao I've had in Philly. Probably one of the best out of all xiaolongbao shops I've been to. The size is bigger than what you'd expect, and the skin can be a little thinner. However, still 5/5 on the taste & soupiness.\n\nWould recommend. Would visit again."
    },
    {
        "id": 12,
        "text": "Be wary of the 5 star reviews written by accounts with zero friends.\n\nI am very disappointed at both the service and food here. My server did not bring us water until I asked again and then they only brought one glass for the entire table. \n\nThe food here is pretty bad as it is now run by a pasty chef. \n\nDon't be fooled by the new fancy decor. The food is anything but fancy. They should have funneled the money into hiring better chefs. \n\nWe ordered the beef pancake, chili chicken, and Shanghai udon with pork. The beef pancake was sliced beef on white bread. The chili chicken was chilled and served in a warm soup, very spicy but why the heck was the chicken ice cold? The Shanghai udon was overly sweet and salty. No good. \n\nThis place is cash only. I won't be back."
    },
    {
        "id": 13,
        "text": "Good portion size and nice price. Waiters are nice as well. The most importantly Food is great!"
    },
    {
        "id": 14,
        "text": "Best Spicy Stir-Fry Bowl I have ever had in my life! After they renovated the place, the interior is much more comfortable and the best part is the food is still as delicious as before! Strong recommend!"
    },
    {
        "id": 15,
        "text": "This is my favorite restaurant in Philly!!!!!!! They have the BEST Chinese food in America."
    },
    {
        "id": 16,
        "text": "Be prepared to come here with cash only or pay with Venmo.\n\nA lot of the dishes run salty, especially the fried soft  shell crab and kung Pao chicken. The sauces are good to compliment the flavorful dishes. There was dish that was super extra salty and the staff heard our comment, and was kind enough to return the dish back to the kitchen to exchange for a new one. I would say, do make a reservation in advance if you can, the food takes awhile to come to the table and it isn't like a traditional dim sum restaurant where carts of dishes are rolling by for you to choose - it is more of a la carte menu."
    },
    {
        "id": 17,
        "text": "We were in town and craving some Asian food-stumbled upon this place not far from our conference. It looked nice from the outside. First up, they only accept cash or venmo (which was very weird). The owner/manager is kind of rude (no people skills whatsoever). They charge for soda refills and it's by the can. Ok now that that's outta the way let's get to the food - we ordered appetizers and entrees - both were brought out at the same time even tho we put in for the apps way before the entree. The spring rolls were stale - as though they microwaved it from the night before. There is no flexibility on the menu (for instance, I wanted a different side other than rice - nope, no can do, the manager is really strict... and also the only Side they have is rice). I had the spicy beef and I couldn't even eat 1/4 of it cause it just wasn't tasting good. I ended up having to nibble on the nasty spring roll since it was better than my entree. Oh and the waiter came and took the spring roll away before I finished it without even asking - like wth. I wish I could give this place a negative star because it really did suck. I'm assuming the manager is just trying to cut cost but it's not working. Save your money and go somewhere else."
    },
    {
        "id": 18,
        "text": "I'm surprised this restaurant have traditional Hunan Style food, which I can't find from anywhere in Philadelphia and New Jersey. I'm really impressed by the dry carrot fry with smoked pork, as a Hunanese, I know they must did a lot of work to make the most authentic dry carrot and smoked pork. And the pig feet is the best! Tasty, soft and chewy, everything balanced just right! I mixed the sauce with rice, it's fantastic!"
    },
    {
        "id": 19,
        "text": "We used to order the spicy stir fry pot (your own choice of meat and veggies) at the old Sakura and liked it. We tried the new smelly pot dish and it's as good as the old. The same reasonable price and I think better service"
    },
    {
        "id": 20,
        "text": "The farm raised pork was so tender and delicious.  Really enjoyed our stop here.  Surprised at the other reviews - we love china town and thought this was excellent!  Only 4 stars because was only tried 2 dishes."
    },
    {
        "id": 21,
        "text": "Worst service ever. Called twice here tried to order take out. The girl taking the cal could not understand me. Rather than getting someone else who understands. She just hung up instead. Price is a little more than usual places and service is terrible. Would recommend"
    },
    {
        "id": 22,
        "text": "I'm impressed with the food quality and service here. I love everything I ordered. It was recommended by a friend and decided to give it a try when they first open, I have been back several times after that. Price is right for the quality."
    },
    {
        "id": 23,
        "text": "Stopped by since their renovation and change of menu. Everything was reasonably priced with terrific good food quality. We had the best Life Fish in vinegary vegetable soup. Dumplings were awesome. Service was very prompt, pleasant and friendly. Store was very clean. Only disappointment was they don't take credit cards. Cash only with sales tax in addition. I would have given them five stars, otherwise."
    },
    {
        "id": 24,
        "text": "Everything we ordered was amazing! I used to love Sakura and was wondering WHY they would close the restaurant until I saw Bai Wei opened. Many Hunan dishes were added and I was very excited to try them all! Must try their \"smelly pot\" (Taiwanese Chou Chou Guo) and fish dishes. Will definitely return!"
    },
    {
        "id": 25,
        "text": "Great food and great service! Been here for several times, love their smelly pot and sweet rice ball soup."
    },
    {
        "id": 26,
        "text": "Sakura Mandarin was amazing and this is even better. One of my favorites in Philadelphia."
    },
    {
        "id": 27,
        "text": "After a visit to the Philadelphia Auto Show, we went to Bai Wei to satisfy our craving for noodle soup. The restaurant's interior is modern and spacious for a Chinatown venue. The waiter reminded us at the entrance immediately that they did not accept credit cards. Only cash and Venmo was accepted. I suppose they want to earn a little extra by not having to pay credit card costs, which is not a customer friendly way of doing business. If you want to earn more as restaurant, then you should improve your service, not cut costs by limiting the customer's options. Luckily we had enough cash with us. The waiter assigned us a table in the back. After a while, we noticed that other customers got water and tea on arrival, but we did not get anything. How can you treat customers differently like that? We are paying the same as everybody else, so we also want the same service as everyone else!\nAnyway, the Taiwanese noodle soup has too many noodles and too few vegetables for my taste. Moreover, half of the meat was skin, which I find chewy and not particularly tasty. We enjoyed the scallion pancakes however."
    },
    {
        "id": 28,
        "text": "Very authentic northern Chinese food. Highly recommended! My favorite dish was the intestines. The rock shrimp was good too!"
    },
    {
        "id": 29,
        "text": "Came here for restaurant week\nStarted off with the soup dumplings, and fried dumplings in chili oil. \nThese appetizers were pretty good\nThe rest of the meal was very satisfactory. I ordered the general tso's chicken along with the pork belly and it was very heavily flavored. The chicken pieces are HUGE. \n\nDessert is where everything goes bad.\n\nFirst off 2 of their dessert items ran out and this is at noon.\nAll of the items were pretty bad. The cheesecake tasted awfully weird.\nThe sakura mousse was just some mousse topped on a cheesecake and had some weird gelatin on the surface.\n\nOverall, I would come back for the very good dumplings, but the rest of the meal was dissappointing."
    },
    {
        "id": 30,
        "text": "Excellent food and service! Best Chinese restaurant for REAL Chinese cuisine in Chinatown. Loved it. A must to try!"
    },
    {
        "id": 31,
        "text": "First sign of trouble: We thought we were trying new restaurant but this is actually rebranding of former Sakura Mandarin that occupied the same space, which was a decent place when it first opened many years ago (known initially for its soup dumplings when these were rare to find) but had since become mediocre enough to point that we had stopped eating there. We had already been seated so decided to stay.\n\nSecond sign of trouble: Almost immediately after we placed our order, our pan fried soup dumplings (these are actually little buns) were delivered to the table. They were tepid and clearly had been sitting in the kitchen for a while. There was no soup in the dumplings either (perhaps soaked up by the dumpling dough while they sat in the kitchen).\n\nThird sign of trouble: In contrast to the dumplings, our order of Dan Dan noodles didn't arrive until we were basically finished with our meal and only after asking about its status. By this time, we had already decided that despite the interior makeover (which you will recognize in the innumerable cheap 'hip' restaurants in China if you spend any time there) of new Sakura, the mediocre food quality was as we had remembered it and wouldn't be returning, again. The noodles, which were delivered cold, made sure of it. We brought the cold noodles to the attention of staff, who told us that Dan Dan noodles are served cold. I am Chinese and just returned not long ago from spending a year in Chengdu, where my family ate Dan Dan noodles several times weekly (yes, the real thing is that tasty!) and were never served it cold across dozens of restaurants we visited - there are various cold noodles in Sichuan cuisine but these are types of Liang Mian. There's also the fact that the noodles were served warm when we previously ate it in the restaurant's Sakura days. I switched from speaking English to Chinese and called them out, but they insisted the noodles are served cold. Fed up at the staff's lack of scruples, we returned the noodles and left no tip (first time ever!) to register our poor experience with the restaurant. As we left, the staff angrily chased us about not tipping. I explained we didn't have a good experience. Given one last chance to own up to their lie or even say something like our restaurant's version is served cold, the waiter just called me an asshole."
    },
    {
        "id": 32,
        "text": "Really good food, I would recommend their Kung pao chicken and it's only 12$ with a big portion. Interior is amazing and the atmosphere is enjoyable. In love with the painting omg the wall, really great choice of artwork."
    },
    {
        "id": 33,
        "text": "Amazing Soup Dumplings! \nLoved the bubble tea and deserts are super cute! I would recommend getting the crab and pork dumplings very yummy."
    },
    {
        "id": 34,
        "text": "The food is decent here, I have been wanting to try this place out for a while now since I have always walked past it. I was told that the soup dumplings would take about 20 minutes to come out but it came out pretty quick! The service is good. The spicy beef noodle soup was not spicy at all which made me a little sad, but it was still good. \n\nOverall the experience was decent, nothing too special, maybe it's because I came in about 40 minutes before closing. But the interior is beautiful, it's clean and very modern looking, it is also very spacious inside."
    },
    {
        "id": 35,
        "text": "Place was super busy but the staff were really friendly and helpful! Soup dumplings were ridiculous!! Wontons in chili oil were great First time I had a scallion pancake and was delicious. My non-adventurous friends from out of town loved it as well. Will definitely be coming back."
    },
    {
        "id": 36,
        "text": "Hunan Beef Rice Noodle\nMy sister took me to here again, despite the first bad experience here they seems improved over the time. Couple months ago the first time I tried their \"Hunan Beef Rice Noodle\" is was really good(first photo), I really enjoyed it, but yesterday I tried another time it was different in the bad way(the second photo)...not flavorful as first time I was little disappointed.. I hope you guys can stay the same taste as possible as you can.."
    },
    {
        "id": 37,
        "text": "The delivery is pretty fast but they gave me wrong food. And it did not serve with rice! If it needs to prefer separately it should remind at the end does customer need Rice? Otherwise I will think I ordered the dishes it would be attached with rice automatically."
    },
    {
        "id": 38,
        "text": "The pig feet is so amazing, not that spicy but delicious. Also highly recommend the drink in Baiwei. The restaurant environment is the best in Chinatown, good for taking a selfie!"
    },
    {
        "id": 39,
        "text": "Really nice looking place that serves authentic szechuan dishes - beware.. only accepts venmo and cash!"
    },
    {
        "id": 40,
        "text": "Very good 服务员态度很好，还送饮料，黑糖珍奶茶和奶盖下次尝一尝吧。我们尝了咖喱臭臭锅新品，不过点菜不配饭。。不知道说些啥就这样吧，为了免费的奶茶也是豁出去了啦啦啦啦啦啦啦啦啦啦啦啦啦"
    },
    {
        "id": 41,
        "text": "I have been here 3 times since they re-opened as Bei Wei. Love that they are BYO. Food has been really good, with only a little inconsistency (i.e. dry chicken in one of the casserole dishes one time) which seems completely normal based on them being so new and getting their feet under them. The portions are good for the price. I really like the beef and the shrimp drunken noodle, the double cooked pork belly, the soup dumplings, and the eggplant casserole with preserved egg yolk and ground pork. Service has been great each time and the presentation beautiful. Excited for their presence in Chinatown and hope they continue to do well!"
    },
    {
        "id": 42,
        "text": "The dishes we got were very good. There was a nice assortment of dishes I had never heard of and we got adventurous. The prices were reasonable. You did however have to pay for hot tea and white rice. It was also cash only. We would have ordered more and brought the extra home if we were able to use a credit card."
    },
    {
        "id": 43,
        "text": "Food is decent but the service and interior is amazing.  Second time here, Definitely come back."
    },
    {
        "id": 44,
        "text": "Although they changed their name from \"Sakura\" to \"Bai wei\", their dishes are still in high quality. Will return and try more."
    },
    {
        "id": 45,
        "text": "Woooooonderful meal for the new year. Perfect and authentic chinese cuisine Generous amount of meat and fish. Really saved our trip to Philly! Definitely a not miss!"
    },
    {
        "id": 46,
        "text": "I have been here a few times already. There dim sum is limited but the szechuan style food is amazing. MUST order items.\n\nCrispy fried fish. This dish is slightly spicy, crispy on the outside and tender on the inside. Fish will never be the same if you try this dish.\n\nMopo is a silken tofu dish. Mild in flavor but softens the spicy crispy fried fish. It pairs very well together. It has minced pork, silken tofu, carrots and peas and hot peppers. But there is no spice to this dish at all.\n\nFlaming stinky pots. Actually. I don't know the name of these dishes, But I can tell you have a pungent smell to it. It has that numbing peppercorn spice that makes the dish super unique. I love it.\n\nOrder a side of rice and get the black tea. These 2 must go hand in hand with all of their meals. \n\nA beautiful asian couple mural makes this place very modern and gives it a classy asian ambiance. Cash only or venmo. Parking is crazy around here but there is a parking lot right next door."
    },
    {
        "id": 47,
        "text": "Excellent authentic cuisine.  Ordered pig feet stew stirred fried Clams, and pork stomach w bamboo shoot.  The pig feet was tender and flavorful. The clams were fresh and delicious.  The service was attentive and fast.  Very nice addition to Philly Chinatown"
    },
    {
        "id": 48,
        "text": "First time came to Bai Wei. When I first came in the restaurant, I was attracted by the modern design and cozy environment. My husband and I ordered 5 dishes and I like the Thai style pot most. The fired rice was so delicious and my husband loves it. The price is fair and affordable. Definitely would come back again."
    },
    {
        "id": 49,
        "text": "We loveeee this place! Great sushi and great Chinese. the soup dumplings are out of this world! Good prices and a super clean place. We go all the time!  It's definitely a great place to try if you want an authentic place in China town Philadelphia."
    },
    {
        "id": 50,
        "text": "I've been here twice now since they changed their name, and have been very satisfied with the quality of food I got. I tried out different soup dumplings each time (regular pork soup dumplings and pork soup dumplings with black truffled), and I was satisfied with the dumpling skin thickness, the amount/taste of the \"soup\", and also appreciate that they provided enough vinegar and ginger shreds to go with them. I didn't like how sometimes the dumplings would be stuck to each other and they end up rupturing before even getting off the rack.\n\nDuring my first visit, I tried out the lamb with cilantro (because I love cilantro), and it was so good I had to try the beef cilantro on my second visit, which also left me very satisfied.\n\nI think this place has a lot of interesting options on the menu which I am down to try in the future (might leave the famous stinky tofu dish to the last since I've never had a food like that before)"
    },
    {
        "id": 51,
        "text": "This is my new favorite restaurant. I have been here a few times. They have a pretty big menu. The menu is very clear though. With food photos, it's easy to see and pick. I love many dishes here. Soup dumplings, live tilapia with pickle, crispy and spicy fish fillet are so delicious. The service is attentive and the atmosphere is so great. I love the painting on the wall. Will keep coming back."
    },
    {
        "id": 52,
        "text": "I had a Thanksgiving meal with my friends in this renovation Chinese restaurant. There are not only fashion decorations, but also very delicious food. This restaurant is very neat and dainty. Highly recommended！"
    },
    {
        "id": 53,
        "text": "Haven't been there for a while. Seemed like they just upgraded the interior. But the most important thing is the food is still delicious and I like their new house special -- Smelly Pot."
    },
    {
        "id": 54,
        "text": "Everything is wonderful here. I love foods here and service here. Music is also very good btw. I am gonna come back with my friends next time."
    },
    {
        "id": 55,
        "text": "From the outside this place looked awesome - the decor was nice and the place looked very clean. First thing I noticed on the door was the picture of their black truffle soup dumplings and I knew immediately I had to try it.\n\nMy friend and I ordered the pork wontons in chili oil as well as the black truffle pork soup dumplings. The pork wontons in chili oil might've been the worst dish I've ever had - there was barely any meat filling - the actual meat filling was loose and bland. The chili oil sauce was bad as well, lacked flavor and spicy kick. Very disappointing.\n\nThe only reason I'm not giving this place a 1 star is because the soup dumplings were decent. Not good, but very mediocre. Hope to see the food here improve in the future."
    },
    {
        "id": 56,
        "text": "This place use to called Sakura, was shanghai style food. Now with the new look of the restaurant, it comes with new name called Bai Wei, and new style of food , the hunan style. I love the food here. I love the spicy dishes. The servers are really nice. I recommend this place for small group and big group. Today we had 8ppl sit in the round table, we order different dishes. Love the fish in the soup, the spicy cauliflower, and ribs. Try it out my friend!"
    },
    {
        "id": 57,
        "text": "Came on Saturday night around 7 pm. I have to wait about half hour. So maybe next time, you need to do reservation first.\n\nI'm not so sure what did we order, because my friend who made all the order for us. And he is speakin Chinese which I'm fully not understand. However the food came great and looks appetizing. The pork with soy sauce was not bad but need more cook to make it tender. I love the fish soup with the veggie. Dumpling soups is good too. We will be back"
    },
    {
        "id": 58,
        "text": "This is a very good and traditional Chinese restaurant in Philadelphia. It is spicy and new. We ordered the coucou pot, it was delicious. I also highly recommend the eggplants and the milktea."
    },
    {
        "id": 59,
        "text": "Everything here is good! My favorite is the beef fried rice with black truffles. OMG!! Also the scallion beef and the soup dumplings. I always pay via Venmo makes life so much easier."
    },
    {
        "id": 60,
        "text": "I stopped by the China town on the way to the airport, and was so lucky to find this restaurant. The food taste very authentic. Also, there's plenty of option to choose from."
    },
    {
        "id": 61,
        "text": "Bai Wei is a really unique restaurant in Chinatown - they serve dishes that I don't think you could get at any other restaurant here that feel very traditional.  The interior is cute, and there's no need to make a reservation it seems. Our service was wonderful as well.\n\nFor our meal, we ordered the century egg with eggplant, duck tongue, lamb dry pot, and truffle pork soup dumplings.  We also ordered a pot of red tea that was recommended.\n\nThe duck tongue is hard to comment on, I'm not going to lie we just went out of our comfort zone and tried it since we've never had it. For us, we personally didn't like it but that's not to say it wasn't prepared well!  Everything else was just spectacular - the lamb was spicy and tender and marinated super well.  The soup dumplings were so juicy and the pork was tender - my partner said they could now be his favorite soup dumplings, although next time we'd probably get the regular and not the black truffle as the truffle flavor was slightly overwhelming.  The eggplant and century egg was so good! This we also tried for the first time and loved it, and I really don't know of another restaurant that would serve this. Don't let the egg make you feel put off - it really just tastes like a salty egg. For people who don't know, the dish comes with a pestle that you can use to mash everything together. Don't eat the egg straight! Mash it in with everything else.\n\nThey had a great dessert selection that looks super cute and delicious but unfortunately they were out of everything we wanted to try! I would definitely come back to try other things on their extensive menu, and to expand my horizons more (and hopefully get some of their desserts!). \n\nJust as a heads up, they are cash only and they charge for rice."
    },
    {
        "id": 62,
        "text": "I read a Craig LaBan review that he liked this place so strayed from other solid places. The chicken lo main smelled weird and was kind of mushy and greasy. the fried pork soup dumplings were average, better than the lo main. These items were highlighted as popular favs - WTF."
    },
    {
        "id": 63,
        "text": "Came to Philly for business, wanted to find some authentic Sichuan restaurant.  The decorations of the restaurant is nice, but the food is not so great.   Portion is small and it's too pricy; scallions pancake is too oily and small, water boiled beef is small again, not a lot of meat and definitely can tell they use tenderizer, and most importantly, the flavor is not there at all!! Not spicy, not pungent, I feel I waste my stomach and one meal to this restaurant.  One more downside, they don't take credit card, only cash, very inconvenient!! If I ever come back to Philly again, this is definitely not a choice!! EMei is much much better!!"
    },
    {
        "id": 64,
        "text": "It is really good.  Quality good, genuine portion, and their food says they care.  \n\n\nSoup dumplings are the best in town.  My h still likes Tom's but he has agreed that Bai Wei is tasty,  most importantly it is not fatty and greasy."
    },
    {
        "id": 65,
        "text": "One of the best Szechuan in Philly. Amazing soup dumplings and fresh. Overall great atmosphere and restaurant."
    },
    {
        "id": 66,
        "text": "This is a really unusual gourmet Chinese restaurant.  They have completely redecorated the inside and it has a much cleaner feel than the previous Sakura Mandarin restaurant.  The soup dumplings were great."
    },
    {
        "id": 67,
        "text": "Decorations were beautiful and the dessert was cute, but soup dumplings were not as flavorful as I anticipated them to be. The pork belly though was amazing!!"
    },
    {
        "id": 68,
        "text": "Best food in chinatown!! I like the dry pots and the fish fillet w pickle. They taste amazing and the waiters are well trained ,they treat every customer very nice."
    },
    {
        "id": 69,
        "text": "Really great food, I love their spicy dry pot! Also they have really good drinks there"
    },
    {
        "id": 70,
        "text": "Really!!!! Really !!!! Bad Host she doesn't know what she was doing at ALL. Waited about  45 mins for a table for 5 ppl when they are tables that are empty \nWaiter have to help her to Figure out where to set customer. Don't go here when they are busy\nYou will not get your foods."
    },
    {
        "id": 71,
        "text": "We loved the food here, however I felt that the tables were too small for the size of their dishes. It's also family sized. They take cash and Venmo which is nice! Rice is not included with the dishes but you'll often need it. The pictures I took were after we had begun eating, so the portions are A LOT larger than reflected in the picture."
    },
    {
        "id": 72,
        "text": "I've been here a couple of times and it's taken all those times for me to finalize an opinion so I could share with the world lol. This place serves dim sum and szechuan style food. If you're looking for true authentic dim sum, then you might want to consider the other dim sum places in chinatown. However, if you're craving some dim sum at like 8pm (which I normally do) then Bai Wei serves enough dishes to satisfy your craving. Although their dim sum options are limited, they are pretty good. I love their appetizers. The scallion pancake, cheese fried wontons and rock shrimp don't sound like anything amazing, but I always have to order these when I go because they're just THAT good. Anytime I come here with friends we always end up ordering soup dumplings. They aren't bad, but they're definitely not my favorite. My partner really enjoys their salt baked squid (which is the dish he orders at EVERY Chinese restaurant so you could say he's a salt baked squid connoisseur). I, on the other hand really love their noodles! I enjoy szechuan food because I like a little spice to my dishes. The dandan noodles and their drunken noodles with beef are my go-to's. I definitely have to come back and try more of their options, but from what I've had so far, I really enjoyed. Their staff is very friendly and the atmosphere is a great place to catch up with friends. Just know that it's cash only, but they also accept venmo, so plan ahead! There's an ATM if you need to grab some cash too."
    },
    {
        "id": 73,
        "text": "Recommended by a local friend and apparently it is one of her favorite restaurants in Chinatown, now it may be my favorite Chinese restaurant in Philly as well! Being a Chinese from Baltimore I am so jealous of the peps in Philly...\nThe food is authentic. Even the menu is authentically Chinese, you see, it is important to have pictures that go with the name of the item, so anybody can order straight by pointing at the pictures. I am 100% sure their menu will be helpful for the non-Chinese speaking diners.\nWe ordered a steamed sea bass with peppers, beef stew with dry bean curds in a casserole, and hot and sour rice noodles. Really love the fish, very tender and fresh, the peppers that go with the fish are so tasty... \nNot a fan of dry bean curds but the beef stew was really good. The hot and sour rice noodles should not be called 酸辣粉 in Chinese, better be 酸辣米粉 since the default idea is the transparent starch noodles instead of rice noodles, but the rice noodles turned out to be too good to be complained: smooth, tender, seem to be fresh-made.\nThe only pain is that now they only accept cash/Venmo --which is a bummer since who would carry 50-100 dollar cash nowadays! If you only expect your customers to spend 10/pp then it is fine, but here is more like at least 20-30/pp. Hopefully they can get their credit card system ready soon."
    },
    {
        "id": 74,
        "text": "I wish we could do half a star because is it 3.5. The food was just okay. The best thing we ate was the Peking Pork. If everything had the attention and flavor that this pork dish had, this would have been 5 star rating. I would not make a special trip to eat here again. The restaurant is nice clean and comfortable. My dinner companions and I shared everything we ate. We all agreed the food wasn't bad but it wasnt spectacular."
    },
    {
        "id": 75,
        "text": "This place sucks, and the price is ridiculously expensive. I miss the old Sakura restaurant.  They need to improve their customer service. Their waiters have no idea about what is mean by customer service. They do not greet you, or offer any water. They let us seat by a table where the AC dropping water. Terrible service. Terrible food !"
    },
    {
        "id": 76,
        "text": "We went there on a Sunday at around 1:00 for lunch and it was super busy but for a party of two it was a 15 minute wait so that's not bad. \n\nThe service was pretty slow but I'm guessing that because it was just so busy. \n\nThe food was pretty decent. I really enjoyed the steamed dumplings and the scallion pancake. The chive pancake was good but not great. I have to say that anything that was fried was EXTREMELY greasy. Beware of that. Towards then end of our feast it became a bit much. The crispy fried fish was good too but I wouldn't order it again."
    },
    {
        "id": 77,
        "text": "Service is AWFUL and the food is subpar. Our server looked like he didn't want to be there. I ordered something and didn't like it after the first bite or two, and he refused to bring it back to the kitchen unless I paid for it. Definitely not worth the money."
    },
    {
        "id": 78,
        "text": "The food is authentic. The Xiang style chicken was fresh and delicious. I don't think it might be anyone because it has bones, which is common in china. The service is prompt and attentive. Will try out other dishes next time. The restaurant has a quit good selection of authentic Chinese dishes."
    },
    {
        "id": 79,
        "text": "Delicious. We stopped here after a conference in the convention Center. Cash or venmo only. Scallion pancakes were amazing fried bread, wontons in chili sauce, pork dumpling in soup, and pan fried beef dumplings. Everything was good. Quick service"
    },
    {
        "id": 80,
        "text": "This restaurant is wonderful!\n\nMy friend and I came hungry and we're glad we did!\n\nWe had every dish to share, starting with chili oil wontons and soup dumplings. Yum! Then we shared a stir fry pot; you get to choose the main ingredients and we used everything we were craving from octopus to beef. \n\nHighly recommend! Would come again!"
    },
    {
        "id": 81,
        "text": "First trip to Bai Wei yesterday was a success! Went with two friends and shared 6 different dishes - all of which were delicious. Highlights were the black truffle vegetable fried rice and cumin beef steam buns. Pork soup dumplings were good as well, but not as good as the soup dumplings at Dim Sum Garden. Overall, very good experience. I would recommend to others!"
    },
    {
        "id": 82,
        "text": "Clean spot, fast service, and tons of ways to pay: cash, card, Venmo, Alipay. Dim sum was good and a good option compared to some of the more popular and overhyped spots here in China Town."
    },
    {
        "id": 83,
        "text": "Indoor dining opened up yesterday at 25% capacity and it was my FIL's birthday today so perfect timing. First time dining out since pre-covid and this restaurant made us feel comfortable eating out again. All employees wore masks, sanitizing table by entrance, and paper cups are used. Extremely friendly service too. Food is a bit on the salty side especially the beer duck and dry pot frog but everything else was sooo good! Definitely support this business and we will be back."
    },
    {
        "id": 84,
        "text": "Very good casual restaurant in Chinatown.  The soup dumplings, shouldn't be missed.  Other dishes are fresh and generous."
    },
    {
        "id": 85,
        "text": "I ordered lunch for take out. \n\nBeing a huge fan of dumplings, I had to try the Steamed Crab and Pork Soup Dumplings. You won't be disappointed; They we're so yummy.\n\nI also ordered the general tso's chicken lunch option- served with white rice and your option of soup (wonton or hot and sour).\n\nI'll make sure to give this place a try dining in just so I can have those dumplings again!"
    },
    {
        "id": 86,
        "text": "The food was excellent. Came here for lunch and had the truffle soup dumplings. I loved the Dan Dan noodles also. IMO, I'm happy they don't use a lot of sichuan peppercorn. Highly recommend to anyone that loves modernized authentic Chinese food."
    },
    {
        "id": 87,
        "text": "If I could rate this a zero I would! Not only was there a hair in my food, but my husband got a severe case of food poisoning because of their pork belly. He has been sick all day!!! This is unacceptable. Please be careful ordering from this place!"
    },
    {
        "id": 88,
        "text": "Been to Chengdu three times and other parts of China as well. Some of the dishes we had were just like the dishes in China. Some Shanghai dishes too.  Very authentic, at least from my experiences. Yum"
    },
    {
        "id": 89,
        "text": "I ordered the special dish, spicy stinky pot with beef, last night. As a Chongqinger, growing up eating spicy food, I'm a really picky person on spicy food. But this dish really surprised me! I really love it! People should definitely order one to try! I think the spicy flavor is the best, if you really can't eat spicy food, just tell them to make it less spicy. \n\nOtherwise, since Sakura changed to Bai Wei, they don't have the sushi bar anymore, but I didn't concentrate on that before. However, they redesigned the restaurant to a more modern style and added more traditional Chinese food with special drinks and French style desserts. I especially love the Triple Chocolate, Matcha Mousse and Cheese Sea Salt Foam series drinks. I will come back to try more foods here!\n\nThe last but not the least is that they still have the spicy dry pot! That was my favorite before! Come to check out. By the way, the servers are really nice and care about customers, the manager will also come to greet, just feel free to provide any suggestions."
    },
    {
        "id": 90,
        "text": "Not good.  Made the mistake of trying to avoid the line at dim sum garden.  Soup dumplings mushy.  Spaghetti noodles.  Fishy flavors in the pork dish.  Chili oil has peanut butter...no thanks.  Cucumbers flavorless.  Scallion pancakes overly oily and dense.  Offers Thai, Chinese, Japanese options...Classic case of trying to make everyone happy but ends up disappointing all.  It was clean and relatively quick.  Should have headed the warning of seeing a half empty restaurant on a Friday night."
    },
    {
        "id": 91,
        "text": "The best kept secret in Chinatown. Awesome food at great prices. I just wish they had their own delivery service. I have been in Philly for over 10 years and this is one of my go-to places for cheap high quality food. Shanghai fried rice.\n\nUPDATE: I've ordered take out from here two times recently. They don't have their own delivery service. They send through third party. I've been very disappointed in the food for takeout. Down 2 stars."
    },
    {
        "id": 92,
        "text": "I came in last week with two friends. We order three entrees and a few appetizers to share. One of our appetizers was never came. When we ask our waitress about it. She told us she would check on it. Straight face. Not apologetic. And guess what? She never came back. We waited for another 15 minutes and had to wave her down. The she told us our missing appetizer was coming up. At this point, we told her we didn't want it anymore. She then said we couldn't cancel because they already started making it. And yes, the appetizer was on our bill at the end. We were all pissed. The food is either too salty or too spicy anyway. Won't go back."
    },
    {
        "id": 93,
        "text": "I came here with my boyfriend bc I was craving soup dumplings and Bai Wei definitely exceeded expectations. Bai Wei was a recently opened restaurant when I visited and the restaurant itself was small but decorative with great artwork. My boyfriend and I got the pork and shrimp soup dumplings, along with the Beef Drunk Noodes -- very tasty although I wished it was a bit spicer! The best part about the restaurant is that they also accept Venmo as a method of payment! \n\nThe only negative thing that I have to say is that the staff/wait staff blocked off a couple tables for the staff to eat in front of the restaurant. When a customer comes in, the wait staff would stop eating, sit them down at a table, and then return to their own table to eat. I completely understand that it was their lunch break, but maybe do this in the back where customers aren't observing? I don't know if this has since changed but that was the only issue I had. Needless to say, the food was excellent and I will be back for some more dumplings!"
    },
    {
        "id": 94,
        "text": "This place deserves 0 stars. They are the rudest wait staff and they overcharge you for nothing. We called ahead and agreed on paying only for what we ordered, a fairly normal practice, and they insisted on charging us $25/person. I didn't eat a single bite of food but was forced to pay $25. Don't waste your time coming here!"
    },
    {
        "id": 95,
        "text": "Came back again and tried some new dishes. I loved the food here. They were delicious. And the service was great as last time. Will come again."
    },
    {
        "id": 96,
        "text": "Same owners as for Sukura, however it seems like the interior has been given a face lift. Overall the food seems to be about the same with the exception of no more sushi. My go to for this place is the Taiwan beef noodle soup. Wait time can vary but they seem to be quite accommodating."
    },
    {
        "id": 97,
        "text": "This spot is pretty good if u are craving for Szechuan cuisine. I personally like the Dan dan noodle and fried chicken that I ordered, but the frog leg dry pot was very salty. \n\nThey have a big menu, offering a variety of dishes including dimsum so it's perfect to share among a group of friends."
    },
    {
        "id": 98,
        "text": "Food taste good but no credit card is really a pain if you're not prepared. Nice environment and good service."
    },
    {
        "id": 99,
        "text": "I was in the neighborhood the other day, and Bai Wei's menu taped to the window really caught my eye. One of the best things you can do in a neighborhood that serves a lot of the same dishes, is catch the eye of your possible patrons with pictures! We walked around for a bit and all I kept thinking about was the dumplings in the window. \n\nWe ended up coming back to slate our craving and were not disappointed. We ordered a bunch of things to share and had more than enough to go around for 4 people for about $50.00 (not including tip).\n\nThe soup dumplings were a hit, albeit not the best I've had in my life, but pretty good nevertheless. Seeing as we ordered a bunch of different things our server brought things out as we finished almost without a gap in between, it was perfect. \n\nOverall the menu was pretty lengthy, so the next time I visit I'd probably get the soup dumplings again, but try something different for the larger dishes."
    },
    {
        "id": 100,
        "text": "Great selection of food. Very authentic .\n\nHad this Crab Soup Dumpling, cost reasonably, and ready as good as the ones in PRC."
    },
    {
        "id": 101,
        "text": "Wow, could not believe the new look of the place. Very fancy and would definitely come back for the ambience itself. The waiter was very attentive and the service was amazing. Unfortunately, the food was not at a level I'd hoped it would be. Besides the fried rice, the fried crab was very extremely salty and their signature dish was flavorless. The best thing on there menu was the not their food but their drinks. The salted cheese foam drinks had a very unique taste and made the overall disappointing dishes bearable."
    },
    {
        "id": 102,
        "text": "Been here many times when they were Sakura and then few times as Bai Wei. Seems like the food similar for the most part. The scallion pancake is usually buttery but wasn't today but still good. I like the texture of their scallion pancake, not too thick either. The pork soup dumplings are are good. The skin is a bit thicker than before but best in the area for now. Tried the spicy soup today for the first time, pretty good. \nDecor is light colored. Reminds me of a beach spot. Large painting of a an Asian couple having tea as the backdrop. Some booth seating. \n\nOnly accepts cash, Alipay or Venmo. I actually like that they accept Venmo, wish other places did this too. ATM available in house."
    },
    {
        "id": 103,
        "text": "I give it my highest recommendation. The food and service were top notch. Still cash only. Well worth that inconvenience.  Some of the very best Asian food I have ever had."
    },
    {
        "id": 104,
        "text": "Ordered delivery for soup dumplings,  beef dry pot, and diced chicken with hot pepper. Beef dry pot cost $20, which did not come with rice and the container was half full. After speaking with the restaurant, they explained that they couldn't send the rice because they were trying to figure something out with Grubhub for the rice situation (Have no idea what that means).  They also stated that the portion was much smaller than if you ate at the restaurant because they didn't have a larger container. So, we are paying more for half the portion size. To top it off, soup dumplings were torn and had leaked all over the bag. Very disappointing."
    },
    {
        "id": 105,
        "text": "Walked by the restaurant and decided to stop in. Inside is absolutely gorgeous, extremely clean, and has a great atmosphere. The service was extremely quick and friendly. The food was absolutely phenomenal and I strongly recommend the soup dumplings."
    },
    {
        "id": 106,
        "text": "Came here with my old coworker for lunch. No wait to get seated. Food is good. A bit salty. Cash only."
    },
    {
        "id": 107,
        "text": "This place was called Sakura before and wanted to try the bai weei food. The quality of the food anD the service is good. Tried their soup dumpling, dry pot and the dessert. Not the fan of their dessert but enjoyed the food."
    },
    {
        "id": 108,
        "text": "YOU HAVE TO GO HERE!!!!! Find a parking spot in one of the many lots in China town and walk, no RUN here because I am telling you, you will NOT regret it. They only accept cash, venom, or cash app but honestly once you have the food you will not care! Where to start! You have to make a reservation if you do not want to wait because it seems like everyone knows how good their food is, but trust me, its totally worth the wait! We have gone here 3 times in the same week because we (my fiancé and I) could not stop thinking about how amazing the food was. And also I was 5-6 months pregnant so that also was a factor ;) We start with the soup, and it was truly the best I have ever had. You can tell that it is fresh and they make the dumplings there because they do not taste like your typical around the corner ingredients. Next up we did the fried dumplings and again, WOW! They were soooo good we ordered a second round. For dinner we had the Truffle beef fried rice and when I tell you I dream about this rice and my mouth waters, I am not joking. I can honestly say that this is the best fried rice I have ever had. We have also tried a few of the sides, but we just kept going back to the rice. The first time there was after the auto show and my fiancé ordered the sweet and sour chicken which was also really good. You could tell they batter the chicken there and it is not frozen which is really important. The prices are NOT that bad, I am not sure what other reviewers are talking about. Other places in china town have cheaper menus because you can taste that they use frozen food. Bai Wei does not and it shows! We were so happy and delighted with everything we ordered I can not wait to go back again soon! You HAVE to go! And don't forget about their desserts. I can promise you wont have room left, but make sure you get one to go! And if you're as hooked to the candies you get after your meal like I was, they are guava and you can get an entire bag of them across the street for less than $2! This is totally my favorite restaurant in China Town! Hands down!"
    },
    {
        "id": 109,
        "text": "Went for Christmas dinner! I liked it quite a bit. Cash only , big menu. Modernist looking for Chinatown. We ordered everything. Soup dumplings were quality. Two others were good. Scallion pancake great , chive pretty good. Two noodle dishes were solid. Dan Dan and pan fried. Many more dishes. Good tea selection. Service was a bit scattered. But friendly. It will go on the rotation."
    },
    {
        "id": 110,
        "text": "So glad we came back and they now have new outdoor dining and seafood menu. We tried the garlic butter and lemon pepper flavor, both were amazing. The snow crab legs and very fresh, mussels are juicy and shrimps are big. We also had pancake and dumplings appetizers and both were delicious. Everything was delicious, good service and clean tables. Highly recommended."
    },
    {
        "id": 111,
        "text": "Food was delicious! Service was good! They only take cash, Venmo and Alipay tho. I would definitely recommend this place to anyone."
    },
    {
        "id": 112,
        "text": "-based off of my milk tea experience only right now-\nI was drawn in by their ad about brown sugar milk tea. Wanted it to be like the brown sugar milk tea from The Alley but not even remotely close. Literally just normal milk tea with hard bubbles and 'dark brown syrup' squirted around the edges to look like desirable brown sugar drips and really just makes it super sweet. The syrup doesn't even taste like brown sugar either :( disappointing sad bubble tea that deserves 1 star BUT I'll give the place as a whole a 3 bc the space looks nice and sleek and staff seemed nice. Menu also looks pretty good so will give a full/updated review after having tried the whole place"
    },
    {
        "id": 113,
        "text": "Great food and taste! Love the new spices. \n\nMust try their fish with sour cabbage and cauliflower. Their spicy hot pot is one of my favorites"
    },
    {
        "id": 114,
        "text": "Best Chinese food I've ever had in any Chinatown I've visited quite frankly. I went there 3 days in a row bc I loved their food so much and tried as many different items as I could. The Black Truffle dumplings are amazing as is the Eggplant and Preserved eggs dish. Honestly nothing here that I tried disappointed me. I only wish they were just a little faster in making the food. But I will say it was worth the wait!"
    },
    {
        "id": 115,
        "text": "My family was visiting from Michigan, and I really wanted them to experience the magic that is Chinatown. Our original plan was to go to Dim Sum Garden, but as you might guess, it was packed and the line was insane. I had passed Bai Wei a few times before and was intrigued by their beautiful interior filled with happy looking customers, so we decided to give it a try. Currently, it's cash and Venmo only, which is perfectly fine because they have an ATM at the front. We were seated immediately and the waiter, who was such a sweetheart, suggested a delicious tea, the name of which escapes me now (sorry!). We ordered A LOT of food, and the dishes came out in a timely manner. The crab and pork soup dumplings, in my humble opinion, were better than Dim Sum Garden (*GASP*). In fact, all the food was delicious. So, without further ado, I'll let the pictures do the talking."
    },
    {
        "id": 116,
        "text": "Bai wei has a great and really slick interior design, the artwork you see when you come into the door is wonderful and eyegazing. The furniture placement is delightful and the chairs are comfortable, table has a great amount of arm space. Food and drinks are delightful and delicious. Bai Wei is definitely a late night restaurant to eat at and the cakes they provide from Ala mousse is easy on the eye and has great structure on each cake, near to perfection if i must say."
    },
    {
        "id": 117,
        "text": "One of our new favorite dim-sum spots!!\n\nThe boyfriend and I traveled into the city for Comic Con....Walked into Chinatown for some good eats--short walk from the Convention Center, and a short 5 minute walk back to Jefferson Station to catch the train home. This place came recommended to us by good friends, and it did not disappoint! \nWe arrived and there was a short line..about a 10-minute wait. Hostess was kind and handed us a buzzer/beeper.  Informed us that they only accepted cash or Venmo payment. \nOnly frustrating thing about our visit was that it took our waiter a little while to take our drink and food order. But other than that, the service was friendly and prompt.  \nScallion Pancakes--YUM! Crispy and light.  Delicious dipping sauce that we used for the soup dumplings. \nSteamed Pork Soup Dumplings--Delicious! Watch out, they came out SUPER hot.  I didn't care for the dipping sauce--too much vinegar for my taste buds. \nSpicy Stir Fry Pot-- The boyfriend loved this! Ordered this as \"regular\" spicy: flavorful;  he expected  it to be a little spicier, which turned out to be the perfect level of spicy for me to enjoy as well. \nDrunken Noodle with Beef-- Good, solid drunken noodle dish. \nDiced Chicken with Hot Peppers-- This was my personal favorite. I did ask our server to take it to a milder spice level...I will definitely be back for this dish!!\n\nWe will absolutely be back!!"
    },
    {
        "id": 118,
        "text": "Reservation for 14 people - we were in town for the Midnight Lion Dance, everything was fantastic. We brought many bottles of wine (and baijiu) - glasses and teacups were provided as soon as we sat. We put in 10 orders of soup dumplings right off the bat, of which were brought out in time for us to put in a large food order. We ordered multiple orders of scallion beef, kung pao chicken, bao buns, truffle beef fried rice, rock shrimp, pork belly. All excellent.  Our servers were fantastic. We had a great night! Cash only - but you can pay via Venmo, we've been there before so it was as expected."
    },
    {
        "id": 119,
        "text": "Amazing pickled cabbage fish. Service is amazing and the decor is very chic! Just remember, cash only."
    },
    {
        "id": 120,
        "text": "Food taste good, service is okay. The only thing that make me feel uncomfortable is the white chair (haha) i feel like i can fall easily. The chair is too light and i don't feel safe to sit on it."
    },
    {
        "id": 121,
        "text": "I went with my sister and friends to this restaurant today. The food was ok and service was ok. But the only one thing I don't like about is when I look at my check, I find out that they automatically add 18% tip for on my check for themselves, and I'm confused, I asked my friend to ask one of the servers why the tips are added to my bill. The answer was when above to 6 person and they will just automatically add 18% of tips to the check, no matter if we want it or not. (We are like 9 people)He also said all other restaurant do the same. That's bullshit, I have went so many restaurant such as Cheesecake Factory and Jade Harbor Chinese Seafood Restaurant more and more, they never just automatically put the tips for themselves just because we are  a group of people. I feel like tipping to the server is customer right and depend on how well the server do. Not just force customers to pay for the tip that they wants. I am happy to give the tips but whatever they do just make me feel that I do not wanna tipping. In the future I might think about if I still wanna go there anymore even the food was ok. For the last if you guys are going as a group of people I suggest you do not go there."
    },
    {
        "id": 122,
        "text": "I was pleasantly surprised to find this restaurant with a perfect combination of my 2 favorites, dim sum and Sichuan cuisine. The inside looked very clean and modern, especially for a place in Chinatown. We ordered soup dumplings, spicy fried fish, and the dan dan noodles. The spicy fried fish was so crispy and fresh, I can't wait to order it again!"
    },
    {
        "id": 123,
        "text": "Formerly, Sakura the new restaurant Bai Wei is still pretty decent. Spicy Szechuan style food and seafood boiled options.  Same owner, new name and look. When I first came here was after they had renovated, everything looked really nice. I thought the food was really good. Then I came back a few times after that. Most recent visit this month, the restaurant is looking a bit shabby. On top of that, they don't take credit card anymore. Only cash and Venmo. However, food is still delicious so that's good."
    },
    {
        "id": 124,
        "text": "Excellent mapo tofu! I have been coming here for years, since back when it was sakura. The service is great and the food is wonderful! I love coming here!"
    },
    {
        "id": 125,
        "text": "One of my friends recommended this place for me! Overall, I think the food was good and the service was great! One of the good things is that they accept venmo, which is really great and handy! I had their mushroom dry pot which was so flavorful! However, I wasnt too impressed with flavor of the lo mein. Apart from that I loved their drinks and desserts!"
    },
    {
        "id": 126,
        "text": "Let's start with the good. They served a nice pot of tea which was $5. The problem is that the tea was the most flavorful part of the meal. The crab soup dumplings have a crab topping. The filling and the broth are bland. The skin is thin on the bottom but terribly thick on top. The vegetable dumplings, bland again. Then there's the sheng jian bao. The filling is bland. The skin seems to be half cooked and the dumplings came out lukewarm to cold. Given that we are talking about Shanghai cuisine which is not supposed to hide behind a ton of spices, heat, fermented products, and sour and salt, it is actually so much more critical that the ingredients stand on their own merits, meaning that the chef has to meticulously personally select even the most mundane ingredients.   In Shanghai and Cantonese cuisine, one is doing the flying trapeze without a net. Corner cutting shows up immediately.  To say, this restaurant is provincial would be to insult the other good restaurants in the area, so this is 2 stars, grading on a curve.  It's also worse than the previous incarnation of the restaurant."
    },
    {
        "id": 127,
        "text": "MUST ORDER!!! Xiang style Chicken!!! And BrMao's Braised pork!!! And get two ice water or any drink with cheese mike foam drink!! Addition: eat your rice with the Xiang style chicken! Then your life fulfilled!"
    },
    {
        "id": 128,
        "text": "If i could give this place zero stars I would. AWFUL service. We waited 20 mins just to get orders in. Then they brought my food but not my friends for ANOTHER 20 minutes. THEN the waiter who refused to give me his name DEMANDED a tip."
    },
    {
        "id": 129,
        "text": "I ate at Baiwei on Sunday and had the braised pork and ginger chicken. It was so amazing! Better than any other place! They also have really good drinks. I had the passion fruit drink with milk foam. It was all so good I came back for lunch for next day lol."
    },
    {
        "id": 130,
        "text": "I went to Bai wei and it was absolutely disgusting I would never eat here again. I used to eat here when it used to be Sakura and it was amazing and really delicious. But now they dint even sell the soup dumplings I would not recommend this place at all. They should change it back to Sakura!"
    },
    {
        "id": 131,
        "text": "Bit early for me to review as I've only been once. Had soup dumplings (step below Dim Sum Garden, but still can easily recommend) as well as chicken in garlic sauce (really good). Food seems authentic, service is relatively friendly for Chinatown. Have to try more of the menu before I evaluate in more detail."
    },
    {
        "id": 132,
        "text": "I really liked the spices and flavors from this place. It really surprised me how much \"punch\" it had especially for a fried fish dish that I had. The inside isn't too grand for larger parties, but since we are still in a pandemic, I don't think I am too worried about larger parties. They do have some outdoor seating, which is nicer for the summer time. \n\nI was sitting inside near a window to people watch  and it was nice. The amount of food I ordered needed two tables though - I was hungry. The soup dumplings were filled with soup and that is always a good thing. The flavor of the soup dumplings paled in comparison with other places and the fried fish I just had. Really loves that fish that much. Honestly, I would probably come back just for the fish dish. \n\nI had a soup as well, but I could not remember much about that dish. \n\nThey accepted Venmo and cash, but not credit cards so that kind of took me by surprise. Luckily, I did have cash on me, but I generally don't carry cash. Just be cautious."
    },
    {
        "id": 133,
        "text": "Ambiance is nice but either the owner or the staff's kids and relatives hang out there.  The little boy was crying and screaming at times and the girl was running back and forth behind the counter and the seating area.  Kitchen staff were walking in and out for smoking break.  This was during peak dining hour, 7:30 PM on a busy Friday.  We had 4 dishes and they were all too salty to us.  The soup dumplings weren't tasty.  We had been to many that were way better than this.  After dinner, we both kept drinking water so we suspected there were MSG."
    },
    {
        "id": 134,
        "text": "We chose this restaurant because it was really close to our hotel and it was freezing!! The price was a bargain for how flavorful everything was! We ordered the #3 dumplings, holy wow amazing! The rock shrimp also so good! My main course, the pad Thai meal was huge! I will for sure ask for it to go box and eat that later in the hotel. Highly recommend this place!"
    },
    {
        "id": 135,
        "text": "The beef fried rice with truffle made me poop my pants not out of digestive issue but out of pure euphoria. Soup dumplings, scallion pancake, and wonton soup also slapped"
    },
    {
        "id": 136,
        "text": "This place is new, not the same owners or menu. I've been here a few times now. I've had the dim sum and other items from the menu and must say, they are doing a great job. Service is better than most places in Chinatown. Dim sum is on par with other Chinatown places, but the rest of the menu is definitely above average. I can't remember all the names, but I'll try. I know I had the Szechuan beef, which was delicious and tender, the smelly pot with chicken which was also very good, the beef dish with peppercorn was very intense if you bite into a peppercorn, so avoid the peppercorn directly and you'll love it, but the best item I've had so far is the crispy fish, which I don't think is the name of it, but I'll put up a picture so you can order it. I'm not the biggest fan of fish dishes, but I guarantee you that you will love it! I know I did. There was another dish with intestines and stuff, which was also very good, but not as memorable as the rest."
    },
    {
        "id": 137,
        "text": "I came in because I wanted some dumplings and they were soooo delicious!! The customer service was wonderful as well ! Everyone was friendly and answered all the questions I had. The location inside is very modern looking and they also has a dessert area! Would definitely recommend"
    },
    {
        "id": 138,
        "text": "Excelente restaurante.  Atendido por orientales que hablan poco inglés pero son muy amables.\nPedimos unas empanadas fritas llenas de queso que se sirven con una salsa agridulce. Estaban excelentes.\nLos Rock Shrimp eran unos camarones fritos con una salsa similar a mayonesa ligeramente picante.  Los camarones estaban bien (en Estados Unidos los camarones son ligeramente insípidos, pero es un problema nacional) pero la salsa los complementaba muy bien.\nLos fried pork dumplings estuvieron deliciosos.\nLa estrella de la noche fue la carne con cebolla Scallion Beef que estaba muy suave, sabrosa y perfectamente cocinada.\nQuedamos muy felices con la visita.\nSoy de Costa Rica y me encanta cuando encuentro restaurantes tan buenos."
    },
    {
        "id": 139,
        "text": "This is one of the best Chinese food I ate in a long time. Great atmosphere and the decoration is beautiful. Come check it out!"
    },
    {
        "id": 140,
        "text": "My go to spot for authentic Chinese. Food is always on point and the staff is very nice. Would recommend the dry hot pot!"
    },
    {
        "id": 141,
        "text": "08/29/2021;\nThe first meal we had when we got to Philly this time... a restaurant we've tried back in 2020, pre-COVID time\n\nIt's raining hard outside so the foods here are comforting \nThe bao 小笼包 are juicy with a lot of soup in it.\nThe pig trotters 木桶蹄花 smells good when it's first serve. The portion is enough and the taste is legit too.\n南乳空心菜 the veggie is a bit overcooked :/\n\nWith so many memory with my bro here now"
    },
    {
        "id": 142,
        "text": "Why was the food all so good?? Such a pleasant surprise, paying a visit after my friends raved about this place for a couple months.\n\nOrdered the following items via family style: Japanese sizzling tofu with shrimp, braised pork belly,  mushrooms, basil chicken, and a stir-fried pot (custom).\n\nFor the customized stir-fried pot, there's sheets where you check off which ingredients you want in your bowl of stir-fry (kinda like how you order at an AYCE sushi restaurant or a dimsum restaurant).\n\nAll the dishes did NOT disappoint. Full of flavor and  left us all so full! The meats were all tender, especially the braised pork belly! Definitely recommend coming here for some Chinese food! \n\nService was pleasant and quick as well!"
    },
    {
        "id": 143,
        "text": "We were in Chinatown on a cold December Friday night. There must have been a convention going on as everywhere was packed. We tried Bonchon but that was over an hour wait for a table. When we walked by Bai Wei, the line was not too long and we were told a 10 minute wait for a table. No brainer.\n\nBai Wei was true to its word and we were seated in less then 10 minutes. The new interior is sophisticated and hip and seems to be the way Chinatown is moving these days. We started with soup dumplings and we all agreed these were very good and up there with DSG and Shanghai#1. We had the Dan Dan noodles and a fish stew dish also. Both were tasty and brought the heat. The fish was was very tender and deboned. The wait staff was both friendly and attentive.\n\nI liked Bai Wei, it is another option for us in Chinatown. The problem is there are so many new and cool restaurants popping up down here, it may be difficult to get back soon.\n\n3.75 Yelp stars"
    },
    {
        "id": 144,
        "text": "This place was excellent! Loved eating here with my (Chinese immigrant) parents and my boyfriend :). There were lots of other Chinese families eating here on a busy Saturday night, which I always take as a good sign for a Chinese restaurant in America (speaking as a Twinkie ;)). Every table was occupied at 7:30 pm-8:30pm. We came in around 7 and waited 20-25 minutes to get a table for a table for 4. This restaurant was very clean.\n\nThis place is cash only/Venmo/Alipay. For a big and higher end Chinese restaurant, it's kind of annoying they don't take credit cards, but maybe this'll change in the future.\n\nThe service was excellent. The waiter refilled our Longjing Tea pot ($5) at least 3-4 times and the restaurant used high quality tea; despite the ongoing 20+ minute wait for tables after 7:30 pm, we never felt rushed during our meal and the service was quick when we received our food. \n\nThis restaurant has excellent authentic/traditional tasting xiao long bao soup dumplings - I would argue they were as good tasting as the ones you find at Nan Xiang in Flushing NY! My boyfriend happily devoured the XLB. The pan-fried pork soup dumplings were great texture-wise (there's a bit of an extra \"crunch\" at the bottom of them), but only good/okay taste-wise (the meat filling is more savory-tasting than slightly sweet/salty like at some other Shanghai-cuisine restaurants - also, I didn't really taste much of the \"soup\" that was supposed to be in these (but the dough was a little thicker/heartier like in regular bao-zi, so maybe it just absorbed the soup). The vinegar/ginger that came with the XLB was great.\n\nWe also had a more traditional dish, pickled cabbage soup with tilapia ($28), that was fantastic! The soup came with a whole fish that was de-scaled. The broth had a rich, creamy texture with a deep flavor that clearly showed they used fresh, live fish in their soup and it was a huge portion for the 4 of us. This was my favorite dish in terms of flavor/depth and my Caucasian boyfriend (who can sometimes be hesitant/not-super-adventurous when it comes to Chinese food) was pleasantly surprised and even enjoyed this soup - he ate a huge portion of it.\n\nThe salt/pepper double delight fried squid & shrimp dish was also great - the batter was light and crunchy and not too heavy/oily, so I didn't feel like we were eating ourselves into a greasy food coma like some other restaurants that serve this dish. We also had the eggplant with garlic sauce and this dish was also made well - a little sweeter and not spicy enough for my own personal taste, but the texture of the eggplant was firm/cooked well and it was a good-sized portion for the 4 of us. Pretty reasonably priced meal for the 4 of us that came out to approximately $102 with tax & 18% tip with 1 tea pot, 2 XLB orders, 1 pan-fried XLB dish, 1 huge multi-portion fish soup, 1 veggie dish and 1 protein dish.\n\nI would definitely come here again! Thanks for the awesome dinner with my family and boyfriend :D"
    },
    {
        "id": 145,
        "text": "This was my first time at Bai Wei and I would highly recommend it. Impressed after one meal.\n\nThe restaurant is clean. The decor is stylish. The staff are polite, friendly, and professional. The food presentation is excellent. The food is delicious. I was impressed with the size of the shrimp - not the usual once-frozen shrimp at most restaurants. Great night out!"
    },
    {
        "id": 146,
        "text": "I have tried the place 2x now.   Chicken dumplings were served raw inside and sliced beef served was rancid.  Disgusting...I will never return."
    },
    {
        "id": 147,
        "text": "Upscale Asian eatery.  Pleasant staff.  Greeted and seated immediately.  Nice decor and clean place.  Ordered beverages of Diet Coke, coconut mango drink and mango lychee drink.  Tasty and pretty.  We ordered the walnut shrimp, pork wonton, pan fried pork dumplings, fried rice and fried seafood noodles.  Everything came quickly and looked great.  Food was delicious.  We had leftovers.  Parking lots and some street parking in the area."
    },
    {
        "id": 148,
        "text": "Waiters lying about the waiting time and keep finding excuses. They make us wait from 30min to 1h and then 1h and 15min. Terrible experience."
    },
    {
        "id": 149,
        "text": "My friends and I decided to pop into Bai Wei on a whim because we hadn't been there before and didn't know what to expect. We were pleasantly surprised at how good the food and service was. But, for us, the downsides outweighed the positives. Although the food tasted good, the portions were so small. Usually, Chinese restaurant gives customers large serving sizes--which is what we expected when we ordered--but we were shocked at how small of a size the servings were. From what we saw, either the food was overpriced or the servings didn't meet the exceptions set by the price. Rice was free but it was served in the smallest rice bowl I have ever seen in my life. I would recommend going here if you're alone but never with friends or in a group because you'll spend more than $50 before you feel like you're full. \nAlso, they alone accept cash or Venmo as payment"
    },
    {
        "id": 150,
        "text": "Bai Wei is the successor to Sakura Mandarin at the corner of 11th & Race in Chinatown, Philadelphia. Same ownership. Renovated and expanded dining room. Where the focus was formerly on excellent xiao long bao and other Shanghai delights, it has now expanded to include a strong taste of Szechuan and Hunan pepper and black bean hot dishes. I quite liked the old house, and returned late last week to see what the newly imagined kitchen held in store.\n\nFrom our exploration of the two dishes we ordered, it would appear Bai Wei (many tastes) has it going on.  Their takes on crispy spicy chicken and cumin lamb dry pot were excellent. The chicken was loaded with red Szechuan peppers and small morsels of deep fried chicken. Enough to give our tongues a sincere capcesin workout and loosen our sinuses; stopping just short of bringing on tears. Completely addictive. The lamb, tender in a mix of chopped onion and more peppers and overwhelmed with a dusting of coarse cumin seed. Delicious. About as good as the best Szechuanese bowls I've found in the USA.\n\nThe only downside was the continuing attempt by the staff at up selling our order. We were repeatedly asked about appetizers, drinks and rice - even after we declined multiple times. Sure, they want more money per customer, but it became excessive and annoying. \n\nBut for that weird dynamic, we thoroughly enjoyed the meal. Just train your servers to accept the customer's wishes and you have a winner."
    },
    {
        "id": 151,
        "text": "We used to go here before they upgraded and we are still very impressed! The pork wontons in chili oil stole the show! It came flavored with peanut sauce - it was unique and spot on love. The truffle pork soup dumplings are an interesting twist but not enough soup in them  (Dim Sun Garden is better)- still good though. Their place is one of the more \"Americanized\" spots in Chinatown in terms of service & atmosphere.  We'll be back for those wontons again!"
    },
    {
        "id": 152,
        "text": "Great staff. Authentic food. AND a 10% discount for checking in on Yelp? I call that a triple threat. They were so kind and let us stay even past their open hours until they really really needed to close out. I can't recommend this place enough. Go for a nice family style meal and try as many dishes as you can!"
    },
    {
        "id": 153,
        "text": "Authentic Chinese food, great environment and service! One of my fav places to go, everything on the menu is pretty legit"
    },
    {
        "id": 154,
        "text": "Delicious!!! The restaurant was super clean and my gf and I were seated immediately, which was nice given it was a busy summer Saturday night. We shared a pot of the red tea and would definitely get it again. We also got the spicy diced chicken, green beans, and rice. All was super tasty and high quality! The servers were friendly, helpful, and attentive. Would highly recommend"
    },
    {
        "id": 155,
        "text": "We only visited for a pit stop of soup dumplings and beef pan fried dumplings.  These were both fresh and good but not the best I have ever had.  Pricing was great service was quick.  I'd love to go back and try more of their food!  I would recommend it!"
    },
    {
        "id": 156,
        "text": "I enjoyed eating at Bai Wei. I came here late around 930 pm on a friday. The beef tendon and tripe was a very tasty appetizer and so were the crab soup dumplings. The waiter also recommended the whole tilapia with peppercorn which came as a fish soup in a chicken broth that was sour and spicy. I didn't like the sour notes initially but The dish grew on me. The soup portion was big and i enjoyed the leftovers for days. The brown sugar lychee drink was pleasant."
    },
    {
        "id": 157,
        "text": "Food is very good. Kind of out there. A lot of very spicy dishes which i love. Accepts Venmo which makes things very convenient. Setting is nice.  Service is good. Price is a little higher than your average Chinese food."
    },
    {
        "id": 158,
        "text": "Update: we saw the same guy again, but he is not waiting our table this time. He seems to be a lot better than we last saw him. I decided to give it 5 stars for his improvement :) \n\n\nWe have been here before they changed the name to Bai Wei. We usually have fairly good customer service, and the wait staff are attentive. However, we just had one of the worst services today. We came in when the restaurant was completely empty. The waiters were just standing around and chatting. It took them 10 minutes to notice us, and we had to ask for the water. After they brought the food, our waiter never came back again. I'm not sure if he is just young or lack theexperience, but if you have the time to stand there and stare into space the whole time, I'm sure you can spare one minute to ask us if we need anything just once. My boyfriend and I are generous tippers but not this time."
    },
    {
        "id": 159,
        "text": "Probably one of the nicest interiors of a restaurant that I have ever seen. Good modern hip hop playing on the radio as well, which was a good change from most places. We had the garlic eggplant, fried pork dumplings, and wonton soup. All were very excellent and presented nicely. Server was beyond friendly and were kind enough to offer us silverware when seeing us struggle with chop sticks! Will definitely be back again"
    },
    {
        "id": 160,
        "text": "Bai Wei stands in the place of the former Sakura, at the corner of 11th and Race. I came by Bai Wei after the line at Dim Sum Garden was too long for my group, and we were seeking other options for soup dumplings on a Saturday night. I was pleasantly surprised by my experience! Bai Wei has upgraded from the previous decor, with modern light installations and beautiful ceramic bowls lining the walls. The wait for our group of 10 was less than 30 minutes at prime dinner time on a weekend. We ordered $120 of food, which was more than enough for us all to feel stuffed. The standouts were the scallion pancakes, which were buttery and flaky, as well as the house special with pork, egg, and vegetables. I will say that the soup dumplings are not the best in the Chinatown. They broke easily, and the meat was not as flavorful as I would have liked. The fried soup dumplings had no soup inside, which was also disappointing. However, the service was decent, although we were seated at the same time as another large group, so it took a while for all of the food to come out. BYO, so bring beer or wine! They accept venmo (1 transaction per table) and cash only. Overall, worth adding to the rotation for a meal in Chinatown!"
    },
    {
        "id": 161,
        "text": "I will admit I was nervous coming here because of some of the bad reviews previously written, but I did have a good experience. We went for restaurant week; 4 courses for $35 a person so I can't speak of the price. Food was GOOD! Lots of people raves about the soup dumplings which I got but I liked my partners rock shrimp more. Service was very fast despite some previous reviews claiming it is slow. I gave 4 stars instead of 5 because the servers did some serious hovering and also took my chopsticks away and proceeded to give me 5 forks throughout the meal. I know I'm about as white as they come but I at least deserve the chance to fail on my own using the chopsticks before swallowing my pride and asking for a fork! But the food was very good and I will certainly go back."
    },
    {
        "id": 162,
        "text": "02/01/20;\nKnown here for a while (peeked inside before cuz the interior looks good)\nTurned out that they have legit Chinese food! The 麻辣香锅 is probably the best one I've ever had in philly. Other dishes are good as well.\nIt's a somehow pricy but, hope to go eat again!!"
    },
    {
        "id": 163,
        "text": "This place is perfect on a cold or rainy day when you're craving something warm or hot. They have many options from their menu such as hot pot, seafood boil, stir fry, etc so everybody has options whether you're a vegetarian, pescatarian or looking for meat! The establishment was very clean and the waiter was very attentive and informative. Our dishes were delicious and flavorful!"
    },
    {
        "id": 164,
        "text": "Very nice decor and modern. It's defiantly a place that you can't miss as you walk around Chinatown. The staff are attentive and the food comes out in a reasonable time.\n\nWhen you order food from here I feel like it could be very much a miss or hit depending on your palate. The shrimp, double cooked pork, and dumplings were amazing! Savory with just the right amount of sauce to not overpower or make the food slimy. The stir fried radish with egg can be a pretty big miss for some. They use the yolk of salted eggs to make it creating a very meat and savory flavor with a slight gritty texture.\n\nOverall for me it was a decent meal. Very filling and lots of food. The price wasn't too bad either. A great place to come and try out once in a while."
    },
    {
        "id": 165,
        "text": "Good food and I like them more after the remodeling. For us, their food seem to be on the spicy and oily side. But we can always ask for less spicy and less oil."
    },
    {
        "id": 166,
        "text": "Food was very good. We got the free general tso with $40 purchase on an app and it was exceptional, not gross like most general chicken. PorkWontons in chili oil was our favorite, we ended up using the oil for rice. The Dan Dam was very good size. The steamed crabmeat dumplings were very good, if I'm being picky I'd say the could use more crab flavor. \n\nUnfortunately they forgot the braised sparerib noodle soup so we can't review that. GH refunded the $15 but we were sad  Nonetheless the food was so food we would definitely order here again or go in-person."
    },
    {
        "id": 167,
        "text": "Sat outside for lunch. They have the best lunch specials! We always add Drunken noodles with beef and their famous pork dumplings. The place is always clean, the food is always fresh. By far my favorite place in Chinatown."
    },
    {
        "id": 168,
        "text": "Tldr; a mid-priced comprehensive Chinese restaurant with decent food. Cash only, which is a little annoying if you are with a large group. \n\nI have no complaints with this restaurant. The restaurant was recently renovated and has a modern interior with lots of white and dark wood finishes. You can get entrees starting from approx $11 and all the way to 30's (for seafood, hot pot, etc). Service was pleasant and efficient and speak both English and Chinese. I ordered the chili oil dumplings and they were delicious! I also recommend the mango dessert, just for the cute factor."
    },
    {
        "id": 169,
        "text": "Bai Wei is not my cup of tea. We stepped in the restaurant and before anything else was said, some teenager abruptly said to us \"cash and Venmo only\". We already knew that from the paper sign scotch taped to the front door.\n\nService was slow and seemed more interested in flirting with young female customers than serving food. When we sat down some guy came over to us and said \"hello\" unenthusiastically. He didn't say anything else. We said hi back and it was a little awkward until my girlfriend said we would like some water. \n\nWe ordered dim sum and scallion pancakes that were recommended by the server. Dim sum is supposed to be ready to go when you order it but we waited like twenty minutes for it. They brought out what appeared to be Worcester sauce and ginger immediately but nothing else for a while. The food was just okay. The pancakes were pretty greasy and not very good. Dim sum was really hot but at least it wasn't bad. The menu was pretty expensive for what it was. Entrees priced around $16. If they were as good as everything else, definitely not worth the money.\n\nIt got pretty crowded and loud so we paid and left. I wouldn't go back here unless I was really really hungry and there was nothing else open."
    },
    {
        "id": 170,
        "text": "Amazingly high quality Chinese food. My friends and I visited here during Lunar New Year weekend, and it was a great choice. Loved the vegetarian dishes like eggplant and string beans. The beef soup had really good glass noodles which a great spice kick in the soup. The chicken was also quite spicy (make sure you don't accidentally eat the peppers if you have a low spice tolerance!!!) We also ordered the thousand year egg, which came with eggplant. It was fun to mash it-they give you a pestle to mix the ingredients of the egg, eggplant and sauce together. That was probably my favorite dish because it was so rich with flavor. It's the move to eat family style eating here because the portions are so large, and you can try out all the various dishes they offer. The menu is large so try not be too overwhelmed. OH AND THEY DO NOT TAKE CARD- cash, venmo, and wechat pay are available."
    },
    {
        "id": 171,
        "text": "We have been here several times before they changed the name to Bai Wei. We usually have fairly good customer service, and the wait staff are attentive. However, we just had one of the worst services today. We came in when the restaurant was completely empty. The waiters were just standing around and chatting. It took them 10 minutes to notice us, and we had to ask for the water. After they brought the food, our waiter never came back again. I'm not sure if he is just young or lack the experience, but if you have the time to stand there and stare into space the whole time, I'm sure you can spare one minute to ask us if we need anything just once. My boyfriend and I are generous tippers but not this time."
    },
    {
        "id": 172,
        "text": "This is by far one of the best Chinese restaurants that I've been to in the area. We had the dry pot, soup dumplings, and cauliflower dish. They have a decent menu to pick from. They also sale a la mousse bakery and king fu tea there too. Makes you think if the owners are related... I like the easily payment system, it's like how China with WeChat. Next Tim I'll be back for other dish."
    },
    {
        "id": 173,
        "text": "Bai Wei has very nice and patient servers and the food they serve are very good as well. Would highly recommend it."
    },
    {
        "id": 174,
        "text": "Our regular place closes at 8 pm now so we needed to break out of our routine at 8:15 pm on a Sunday night and so glad that we did. Have been going by Bai Wei for a while and it's always crowded - we went for the first time tonight. Outdoor seating, plenty of space between the tables. Food was amazing and so different than what we get at our usual haunts. Had pork soup dumplings, shredded duck with Peking sauce and Lamb/Cumin dry pot. All really delicious - clean flavors, not greasy at all. We will definitely be back!"
    },
    {
        "id": 175,
        "text": "We dropped by now that outside eating is up and running for a quick Sunday lunch. There was plenty of seating about 1:30 when we arrived. Service was prompt and friendly given the need for masks and gloves. Food was a little slow but not so much as to be annoying. Everything arrived hot and tasty. \n\nBe aware that they're presently cash only but if you forget there are plenty of ATMs in the area"
    },
    {
        "id": 176,
        "text": "Perfect for cold weather! We chose the \" stinky pot \" consist off beef and tofu , the noodle dishes are good too . Can see why they are busy. Server was very nice and accommodating. Only thing is that they only take cash , might be inconvenient for some and restricted some guests who might've order more"
    },
    {
        "id": 177,
        "text": "Bai Wei has pretty good service, the people there are very nice. I spoke in Chinese, so I'm not really sure how fluent anyone's English was. The interior is beautiful! It's a very clean looking place. The portions are normal sized. The food is pretty good in general. It's just like any basic Chinese restaurant. I came here on a chilly March evening for dinner because I was in the area. There doesn't seem to be much heat, so I had to keep my coat on. The food came a little slow, but it was also quite busy, so that was fine. Another thing I like about this place is that it is well lit, so if your coming here with a group, it's perfect!"
    },
    {
        "id": 178,
        "text": "I came here with my family for dinner. \nThe food was incredible, the fish and pork are so delicious. We enjoyed the atmosphere a lot. The decoration in this place is very stylish and very clean.  The service is great, the waiters are very helpful and friendly. They always come checking on us at the right time and all smiling.  We had a great time!"
    },
    {
        "id": 179,
        "text": "My friend and her boyfriend claim they visit here twice every weekend so I had to give it a try. Situated on the outskirts of philly chinatown, I completely missed this location the past times I visited Philly . \n\nWe got the sizzling Japanese tofu with shrimp, beef in spicy chili sauce, and the chinese water spinach. Let's say I now see the reason why they like this place so much.\n\nFirst of all I have not yet found any other place that serves Japanese tofu in either Philly or DC, and it was one of my favorite childhood dish. Seeing the sizzling Japanese tofu on the menu already hyped me up, and I was definitely not disappointed by the taste of it either. It definitely brought back memories of when I had this in China.\n\nThe beef in spicy chili sauce was perfectly within my spice tolerance range. The beef slices were really tender and easy to chew, and the flavor of the sauce really seeped in as well. I even enjoyed eating the bean sprouts on the bottom. Personally I do wish this dish was less salty, especially for this genre of Sichuan spice dish. \n\nThe competition for authentic chinese food in Philly Chinatown is fierce, but I would still recommend giving it a try. It definitely checked all the checkmarks for a tasty Sichuan meal for me."
    },
    {
        "id": 180,
        "text": "Sensational service coupled by solid food\n\nService:\n\nWent on a Saturday, and it was quite busy. With a reservation, though, we were seated in about 5 mins, although there was a wait to the door. \n\nWe ordered the food swiftly as we were in a bit of a rush. They didn't disappoint. It felt like a bit of a procession with the food just perpetually coming out in what was seemingly perfectly spaced intervals. We were in and out in 35 minutes \n\nFood:\nScallion pancake- unlike your conventionally doughy, decadent scallion pancake you get, this was cracker thin, buttery, with a delightful crisp.\n\nBlack truffle soup dumplings- they were ok. The texture of the actual dumpling was adequate, being robust enough to encase the insides safely. The porky soup of the dumpling, though, was lacking that rich umami flavor I long for in a soup dumpling, rendering this dish inert for me.\n\nBlack truffle, beef fried rice- I can see why there is some fanfare for this dish. With the truffle, it adds this mystical flavor profile that I can't really pinpoint, but is tantalizingly yummy. \n\n\nIn actuality, I'd give them a 4.5. But I'll give them the benefit and knock them up to 5"
    },
    {
        "id": 181,
        "text": "I love love love this place! They have the best shrimp fried rice in the city. Everything I get from here is always tasty. Soup dumplings are delicious as well. I try to try something new every time i come here. I definitely recommend it! Lunch, dinner, with family, friends or by yourself!"
    },
    {
        "id": 182,
        "text": "There's like, a 20% surcharge on their grubhub prices which I didn't realize was there until I dined in last week for the first time, so I recommend NOT USING GRUBHUB for Bai Wei. Even for a cash/venmo only restaurant, 20% is a little insane. A dish I paid $18 for on grubhub was only $15 on the menu, and the fish I got on Wednesday that cost me $16 at the restaurant is listed at $20 on grubhub! And that's not counting if you then pay for delivery and tip your delivery driver.\n\nBut anyway, on to the food. The first time I got sizzling Japanese tofu and shrimp off grubhub, it looked nothing like another reviewer's picture, the shrimp were tiny \"medium\" sized shrimp barely the size of a nickel (why grocery stores call those medium shrimp and then have to go up to large, extra large, and then jumbo, I'll never understand, marketing, I guess), there were some diced carrots and onions which were undercooked, and the entire dish was orange and tasted of, what I guess I'd call \"shrimp blood\". Now, my mom uses fresh head-on shrimp in her pork steamed buns  and it's great, but when she tried to do the same trying out a chiang fun recipe, it was an orange disaster. In a dish that's more mild such as tofu, using head-on shrimp is more disaster territory than a good idea, just stick with headless frozen shrimp please. Japanese tofu is always tasty though, no matter how bad you screw up the rest of the dish, so I still ate the whole thing.\n\nBut because TT Skewer and I are forever starcrossed (that's another story), I decided to give Bai Wei another chance, and I'm glad I did (and not just because I caught the grubhub thing). I got fish fillet in spicy sauce (水煮鱼 and the server had to verify I wanted the spicy dish and not literally boiled fish, which was topkek). And now, the only restaurant I've ever had this at served it with tofu and peanuts which is about as far from traditional as you can get, so my perception of this dish is way out of whack. Bai Wei does it more typically with cabbage and bean sprouts and it was equally good and I felt healthy getting some vegetables in.\n\nThe server did not stop by at all during my meal because I was all set with a gigantic pot of tea and it's typical in China to flag down waiters rather than wait for them to come to you (my parents HATE it when servers pop by to ask how we're doing), but within a few minutes of finishing eating and pulling out my phone, a server came by to ask if I was finished, so I assume they're relatively attentive and quick to respond, so just don't be shy you'll be fine at Bai Wei. \n\nThe white furniture and elevated dining area is also pretty cute, so I'd dine in again sometime, just not grubhub, never mix grubhub and this place."
    },
    {
        "id": 183,
        "text": "Wow I cannot believe how bad the food was.  I leave a LOT of room for errors or issues these days, but this was horrendous. \nThe scallion pancakes were drenched in oil. So greasy. \nThe beef dumplings had a really gross and overcooked filling.  I had one and had to chuck it. \nThe soup dumplings had absolutely no soup. Not even an exaggeration. \nThe dan dan noodles were absolutely not authentic (or even mildly tasty). The noodles they use are like spaghetti noodles. And the sauce doesnt taste like anything but peppers.\nEdamame was old and gross. \nThe only good thing was the lychee tea. \nI really don't think anyone should eat here."
    },
    {
        "id": 184,
        "text": "I went with about 25 people for a club event and they accommodated us in their back room. The service was excellent and the food was abundant. Preferred a little bit more flavor but everything was very good and I will definitely go back. Again everyone there was super nice."
    },
    {
        "id": 185,
        "text": "I went there to try its spicy fish. After I ordered the fish, I waited for close to an hour,  but only to learn that they did not place my order yet, a complete waste of my time."
    },
    {
        "id": 186,
        "text": "It's early delivery and it's very nice to have paper note in the bag for ordering a rice separately. Thanks for the note. It's very good reaction and proactivity."
    },
    {
        "id": 187,
        "text": "Omg! I read the reviews on here and they were correct! I got the crispy fried fish and the dice chicken and the plum spare ribs. Also the soup dumplings. They had to bring us another table because we ordered so much for our table.\n\nThe food did not disappoint! The place was packed on a Saturday night. But our wait was only about 15 minutes. Service was good for being so busy.\n\nI'm still thinking of the crispy fish days later."
    },
    {
        "id": 188,
        "text": "The place is super nice. It's bright modern and food is delicious. The wait staff was diligently working with the Christmas Eve rush. They were attentive despite the place being packed. We ordered the pork and crab soup dumplings, spicy fish filets, shrimp with walnut and mayo sauce and our dessert called the Tangerine which looked like it came out of a Michelin Star restaurant it was that pretty. The only down side of this establishment is that they only accept cash or Venmo. So keep that in mind. It's also BYOB."
    },
    {
        "id": 189,
        "text": "I've worked in the restaurant industry for 7 years, so I'm pretty forgiving when it comes to mistakes, but my experience here was so bad I actually made an account to share what happened.\nOur order arrived by delivery on time. However the bag was absolutely COVERED in red oil, and 2 of the items we ordered were not delivered.  \nI called the restaurant to let them know about the missing items.  I was told bluntly that the mistake happened because they were busy, and that they were also too busy to deliver the rest of the order.  I asked, \"Is there anything you can do to make this right?\"  And was told, \"No.\"\nSo now I'm on here writing this review and talking to my credit card company.\nMistakes happen, but that type of terrible customer service is just wrong."
    },
    {
        "id": 190,
        "text": "This restaurant used to be Sakura Mandarin but just underwent renovations. I've been to Sakura a few times before so I was excited to check this place out once it reopened.\nThe interior is totally revamped with a new drink/dessert menu but I can't say that I was impressed by the food. We ordered the chili pepper chicken off the specials and the flavor was overpoweringly spicy with no complexity. It was definitely not worth the price it was billed. The beef pancake appetizer was not what I expected. Instead of scallion pancake around the beef it was literally a patty bun. The stir fried udon with pork was also lackluster.\nI was honestly disappointed by the whole meal. Plus it's cash only. There are way better options for eating out in Chinatown."
    },
    {
        "id": 191,
        "text": "One of our favorite place to go eat in Philly. Excellent scallion pancakes, soup and pan fried dumplings. Great lunch specials during weekdays."
    },
    {
        "id": 192,
        "text": "I love the food at Bei Wei! It's the ONLY Chinese food I will eat & yes, worth the drive to Chinatown! Jack & staff are SUPER nice & desserts are from A La Mousse...around the corner & other location, with Anna, Jacks wife, as head pastry chef...high end, delicious ingredients...just like Bei Wei..."
    },
    {
        "id": 193,
        "text": "I really enjoyed bai wei! First things first, the interior of this restaurant is very clean and modern. The menu is a little pricier than what you usually see around Chinatown but for the atmosphere it's worth it! I got to try out the black truffle soup dumplings which were alright but cool to try. We also sampled the tangerine cheese cake and mango mousse cake. The mango cake was really great and unique but the tangerine cheesecake was not as great. I definitely think this place is worth checking out!"
    },
    {
        "id": 194,
        "text": "I hate being that person on here because I understand restaurants might still be struggling with staffing still with the ongoing pandemic, but I was so excited to try this place after seeing good reviews and it was truly very disappointing :( I love Asian food and restaurants so I have been trying to tackle the dim sum spots in the city , so I have a few good ones to compare it to!\n\nI ordered a few items to try for the first time of things that you can really go wrong with at a decent dim sum spot usually - scallion pancakes, edamame, wonton soup, and steamed and pan seared pork soup dumplings. This is the first time I've ever been unhappy with every single thing I tried at a restaurant unfortunately....the edamame was the best part and even that was lacking salt. The scallions pancakes were soaked in oil and pretty chewy. The wontons in the soup were pretty small and just tasted off. And both orders of soup dumplings had 0 soup in them and they were undercooked :/ \n\nMaybe my experience was slightly different than dining in since I ordered delivery - but that didn't affect that the overall taste and flavors, quality, and execution of the food preparation that was more than lacking. I don't think I'd even be willing to give this place another chance since there are way better options in Philly."
    },
    {
        "id": 195,
        "text": "Not pleased at all... my husband  & I are Dim Sum hopping today.  This is the three place we stopped at!! Second was not worth mentioning... the food is not good at this location. -although, my husband loved the wonton soup! I found the spring rolls bland with little favor. Same for the Pork Wonton in Chili Sauce. \nStaff is neither friendly nor unfriendly, I am just not comfortable here."
    },
    {
        "id": 196,
        "text": "One of my favorite Chinese restaurant in the Philly area. They have a very modern-esque vibe to the place and there's plenty of seating. The only thing that some people may not like is that they only accept cash, venmo or alipay. For me it's never been an issue, because I am a big venmo person, but this may be a turn off for some. \n\nI have been to Bai Wei several times at this point and I have never ordered anything that I have disliked. The food always comes out hot and fresh and this is also one of the places I always bring friends to if they've never tried \"real Asian\" food before. \n\nService has always been pretty good, however nothing too memorable. I have always had speedy and good service while I have eaten here. I also like how they partner up with A La Mousse for their desserts, you can sometimes see the desserts at the counter window, but if they don't have what you want A La Mousse is right around the corner not even a minute walk away."
    },
    {
        "id": 197,
        "text": "---SAFETY CONCERN---\n There is a huge fly in fried chicken wings.  Gross... \n\nCustomer care was like hell. No apologies from the business. \n\nTerrible experience"
    },
    {
        "id": 198,
        "text": "LOVE this place! One of my favorites for dumplings in the city. Pork soup dumplings are a must here. Casual, bright setting with lots of windows."
    },
    {
        "id": 199,
        "text": "Service was absolutely great but the food was ok. I was really hoping to love it and have a new spot to go to on rotation."
    },
    {
        "id": 200,
        "text": "It's a decent option in Chinatown if you are looking for a \"generalist\" type fare as they serve Szechuan, Shanghai, Taiwan, and some Cantonese dishes.  I would say that the quality is just okay.  The variety is the draw here and they also offer a 10% Yelp check-in offer.  The staff are fiendly but they seem very rushed as it was quite busy and there were only 2-3 waiters in the entire restaurant serving all the tables and taking takeout orders as well. \n\nCash and Venmo only!\n\nA recap of the dishes:\n1. Sweet osmanthus and sesame mochi dumpling soup: This was perfectly light, sweet, and refreshing with thin shreds of osmanthus and egg whites.  The dumplings were fluffy and filled with sesame.  They are smaller than normal but each was  perfectly balanced bite of filling to shell.\n2. Crabmeat and pork soup dumplings: These were kind of meh with a thick shell and barely any soup and filling.  Maybe it was an off-day but I would suggest the other pan-fried options instead.\n3. Pan Fried buns: These were better than the soup dumplings but the filling was pretty sparse and definitely could have been more generous in portion.  4. Pan fried dumplings: These were solid with a plump, juicy filling and nicely crispy pan fried shell.\n5. Chive buns: Nice nd crispy with a flavorful egg and chive filling.  The only thing that would have made them better would have been some vemicelli inside but pretty solid overall.\n6. Stir-fried clams: Pretty flavorful clams albeit small ones.  It's a bit on the salty side but still pretty solid.\n7. Plum spare ribs: Fried sweet spareribs with sweet plums.  Overall, a nice appetizer-sized option (the ribs are small).  The meat is flavorful and pretty tender but the dish itself is not very filling so this is more of a starter vs an actual main entree.\n8. Seafood tofu casserole: Mostly light silkn tofu with 3 prawns, some fishballs, and 3 pieces of surimi.  This is very light but the seafood portion was tiny.  The nice part is that it isn't oily at all but it's definitely not your traditional seafood hot pot.\n9. Seafood udon: Stir fried udon with seafood in a traditional brown oyster-soy.  This was pretty standard but it was branded as a Shanghai stir fried thick noodle and it resembled more of a Japanese stir-fried udon.  It was just okay but a bit salty.\n10. Marinated sliced roast beef: This was just okay.  The beef was tender but slightly dry and didn't have that sweet and savaory marinade that is the hallmark of the 5-spice Shanghainese beef.\n11. Seasonal stir-fried vegetables: This was light and refeshing and surprisngly one of the best dishes with sliced lotus, cauliflower, broccoli, snow peas, mushrooms, woodear, carrots, and asparagus.  There was just a very slight coagulation of the corn starch thickener on some pieces but they were very busy tonight and likely understaffed in the kitchen so they were likely making this in a rush."
    },
    {
        "id": 201,
        "text": "Ordered takeout from Bai Wei tonight. First time I've ordered from here and was really happy I did. Went with the General Tso, Chicken Pad Thai, Pork Fried Rice, Scallion Pancake, and Spring Rolls. Everything was awesome! Scallion Pancake was the highlight for me...love those suckers! Pork Fried Rice was awesome as well. Will be ordering from here again."
    },
    {
        "id": 202,
        "text": "I have ordered from Bai Wei for at least 20 times, but now, I really worry about their food health problem, especially during COVID-19, we have no idea about how they cook, pack, and deliver. In the last order, I found a feather in the box. I contacted the restaurant, they claimed that \"there is no way that a feather could exist in our food\", and they only willing to return 1/4 of the dish's price. That's almost a humiliation and a representative of how they ignore their food health problem."
    },
    {
        "id": 203,
        "text": "My friend and I got the boiled seafood with Alaskan crab. She got shrimp as her second seafood and I got crawfish. My crab was amazing, big chunks I could pull out all in one piece. I loved the butter sauce with just a hint of spice. They also put corn on the cob and potatoes in the butter sauce. It's so good. The staff were all masked and gloved and we were given sanitary wipes and plastic gloves to eat with. Also, the outdoor seating area was very cute, with sunflowers and string lights."
    },
    {
        "id": 204,
        "text": "My bf and I ate here for the first time the other night and wow! We tried to come back for dinner the very next day (Memorial Day) but they were closed. It was that good we tried to eat here two nights in a row. The restaurant is very big and clean inside. Staff was friendly and quick with the food. We ordered the scallion pancake, steamed crabmeat and pork Soup dumpling, and drunken noodle with shrimp. Everything was absolutely amazing! My boyfriend was obsessed with the drunken noodle and I'm tied between the noodle and soup dumplings. The total was $25, which was mind blowing because it came with a lot of food. Check this place out!!"
    },
    {
        "id": 205,
        "text": "\"Good things come to those who wait\" (so they say). Bai Wei has been saved in my collections for a while now & I'm glad to say I finally made my way here (though it wasn't planned)!\n\nArrived shortly before closing and although you can tell they were preparing for that, the waiter was super nice and took his time attending to my guest & I. \n\nWe ordered the Shrimp & Vegetables dumplings along with two separate orders of fried rice. Even though I am not a beef fried rice fan, I decided to try their Beef Fried Rice with Black Truffle. TBH! The idea of truffle in fried rice did not sound all that appealing, but since the waiter recommended it I decided to go with his suggestion. Thank God! Because, WOW! I have never had anything like it. If you ever get a chance to visit Ba Wei, I would highly suggest trying this dish out. \nThe dumplings were also pretty good. \n\nFairly priced, located in Chinatown and the decor is super chic and modern. Would definitely recommend (However, bring cash because they were not taking cards at the time.)"
    },
    {
        "id": 206,
        "text": "Originally the Sakura restaurant, same location with an updated menu.\n\nWe had an take out order.  Overall taste is good on couple of them and average for the rest.  They don't accept credit cards, so cash (or some Chinese payment like wechat pay, etc).  One of the fish dish we ordered looks like an appetizer size, the container is only like half full.  And even though we ordered 6 full dishes, there is no white rice; the server told me they never include rice (unless you pay for it); this is kind of strange, I haven't been to any Chinese restaurant that does that.  \n\nOn the pro side, the service is pretty fast; my order is ready within 20 minutes and they texted me to pick up."
    },
    {
        "id": 207,
        "text": "We have eaten here many many times- never disappointed and actually every single\nThing we have ordered has been excellent. Fried fish. Fried truffle rice. Soup dumplings. Cabbage. On and on and on. We have some take out and eat in and eating in is definitely much better"
    },
    {
        "id": 208,
        "text": "This is a great lunch spot with quick service and tasty soup dumplings! Just one star short of five because the pork inside the pork soup dumplings were a tad bit undercooked. The crabmeat dumplings were excellent though. I don't know exactly what kind of sauce is given to use with the soup dumpling, but it has a nice citrus taste to it (reminded me a lot of Japanese ponzu)."
    },
    {
        "id": 209,
        "text": "20/10 recommend! This place is amazing everything is great be sure to try the pork wonton in chili oil and braised pork noodle soup!"
    },
    {
        "id": 210,
        "text": "Food was great but the service was ok. If you're looking for some good Szechuan food, you can check this place out."
    },
    {
        "id": 211,
        "text": "overall, definitely satisfied with the experience. my boyfriend and i originally intended to dine at dim sum garden down the street, but the line was out the door, so we stopped by bai wei. the food was pretty good, but the only payment options they accept are cash and venmo. we got the beef pan fried and pork steamed soup dumplings, scallion pancakes, and scallion beef, which were all tasty."
    },
    {
        "id": 212,
        "text": "We were greeted warmly and promptly. Despite being packed, our waiter provided water and took our order within 5 minutes. Our triple delight and beef in chili sauce were fabulous with the lovely Sichuan pepper taking front and center in the savory beef dish. My son cleaned his plate of triple delight. I would definitely recommend and look forward to dining here again upon my return to Philedelphia."
    },
    {
        "id": 213,
        "text": "I don't understand why they don't give rice with any dishes for takeout and no utensils How do I eat mapo tofu without rice...."
    },
    {
        "id": 214,
        "text": "We really enjoyed the dumplings from Bai Wei. We ordered delivery through caviar and was very pleasantly surprised by the quality of the soup dumplings and pan-fried dumplings! Will certainly order again!"
    },
    {
        "id": 215,
        "text": "My wife and I came in evening time around 5:30 and it wasn't overly packed. We got seated right away which was nice. I had to take away 2 stars because the servers took awhile to come take our orders (about 10 mins). We made eye contact with them but they just ignored us. When we finally ordered, we also wanted to order Spicy stir fry bowl which requires a separate menu paper to fill in what we want in it. They handed us that paper but it took another 10 minutes for them to come pick it up. I had to wave them down to get their attention. When we got our orders, it took another while to get the stir fry bowl and by that time, our other main dishes were done. \n\nSadly, the spicy stir fry bowl wasn't what it used to be when the restaurant used to be called Sakura. \n\nThe crab soup dumplings were good though. \n\nOnly complaint is slow service even though it wasn't overly busy and they had a good handful of servers around."
    },
    {
        "id": 216,
        "text": "Pretty Average, but That's Okay\n\nWe dined in at Bai Wei and they do a pretty good job of following safety protocols. \n\nThat being said, much of the food we ordered was over flavored. I know this sounds ridiculous to say but there is such thing as too much spice. The Tofu soup was good initially, but there was way too much ginger in it. The Chinese Sausage with Leeks was borderline inedible due to how salty it was. It was so salty that we packed about 3/4 of it to go and washed it with water at home to eat it so we didn't waste any food. The only thing we really enjoyed was the cold beef dish that was actually pretty good. \n\nI do want to compliment them on their service. The key to hospitality isn't the food, though it's a key component obviously, it's how an establishment treats their patrons and this place does a wonderful job. We'd go back on this alone and try some other dishes.\n\nOverall, okay food with great service considering they seemed like they were short staffed for obvious reasons. We still loved the night out because no one should take that for granted anymore."
    },
    {
        "id": 217,
        "text": "Already came back to this establishment and left very happy and satisfied. My bf and I wanted to try something different since the menu is pretty big. Everything we ate tonight was delicious, but the food we ordered the first time was way better. Tonight we ordered the pork wonton in chili oil, steamed shrimp and vegetable dumplings, sautéed seafood noodles and diced chicken w/hot pepper. The pork wonton was good, but the chili oil wasn't what we expected. It had a nice kick to it and also a strong peanut taste. The sauce was good and I wish I could've saved some because it would've been good with noodles, rice or anything really. Strong peanut taste so if you're not about it maybe skip this dish. We both agreed that the shrimp and vegetable dumplings was the best thing we had tonight. It was so good!! Sautéed seafood noodles was nice because they were very generous with the assortment of seafood, BUT drunken noodles was 100% better. Seafood noodles were very wet drenched in sauce and was nothing mind blowing. The drunken noodles w/shrimp was out of this world and we also just prefer the wide noodles. Diced chicken was good, but also wasn't something we expected. It was a bit overpriced compared to everything else on their menu. $14 for the entree and 50% was all hot pepper flakes and 50% was small fried popcorn chicken. Tasty but we both dipped it in the dumpling sauce because it was fried and needed a tad bit more flavor. Everything was still delicious, but the food we ordered the first time was way better. Will definitely come back again to try more items. This place is byo so don't forget to bring some drinks!"
    },
    {
        "id": 218,
        "text": "Waiter was friendly, quick service, and checked in a few times. Food isn't that spicy, so if you can't tolerate it then nothing to worry about. One of the best authentic Chinese food places in Chinatown Philly."
    },
    {
        "id": 219,
        "text": "Bai Wei, previously Sakura popped up as one of the RESTAURANT WEEK options this winter. Bai Wei's restaurant week menu offered three courses plus dessert but we decided to order a la carte. The appetizers - pork soup dumplings, scallion pancakes, chicken in diced red pepper, the typical Chinese staples were decent, nothing out of the ordinary but the entrees truly sets them apart from other Chinatown haunts. With a terrific range of options, we got to experience a great range of Chinese food from Shanghai to Sichuan and more. \n\nThe fish filet with peppercorn was one of the best fish dishes I've had in a while. The smelly pot with chicken and sichuan sauce scores high on presentation and taste.  The dish has 'smelly' tofu, hence the name. You can choose to order this with less spicy sauces if you have a low tolerance for spice. The Japanese tofu and shrimp is another standout. The food is authentic, there are dozens of options, the portion sizes are huge and the experience in the end was very gratifying. The service was not quite at the same level but on this day, thus turned out to be a minor glitch in a hugely satisfying experience."
    },
    {
        "id": 220,
        "text": "We were excited to visit because we had terrific dumpling in the past .. especially the soup dumplings ... well that was not what we received ... soup dumplings couldn't be any drier and on top of that they had holes all over them !! we asked one of the servers what happened ... he gave us a BC story saying that the soup dumpling had soup but they only put a tiny bit now ... LMAO ... really !! That's the story your going to give us ... it was disappointing."
    },
    {
        "id": 221,
        "text": "I love nearly everything on their menu... and by this point I've nearly had everything on the menu!  I usually visit with a friend or two, but finally attended with a small crowd this weekend.  After another excellent experience, I wanted to get a review in.\n\nBai Wei offers a selection of Szechuan and Dim Sum.  While the dumpling and dim sum selection is limited, what they have is amazing.  Of course I'm going to tell you to get the crab and pork soup dumplings!\n\nOn the Szechuan side, you have all sorts of dry pot, stir fry, and pepper based dishes.  My top recommendation is the Lamb (or Beef) Cilantro. It was a hit for our group of six this weekend.  A dish I was surprised I loved so much was their assorted mushrooms.  The cumin dry pot is tasty and not as spicy as I suspected it would be and the eggplant is another solid order, especially for vegetarians. \n\nService is polite and quick.  Since Bai Wei is also a BYO, they won't rush you out as you relax to finish whatever it is that we brought.  Worth noting, they only accept cash or venmo!"
    },
    {
        "id": 222,
        "text": "Excellent takeout, inspired by Craig Laban's Instagram on Christmas. Got the assorted mushrooms dry pot (cut the heat on everything else and really good), diced chicken with hot pepper, and shredded pork in garlic sauce (which comes with a different kind of mushroom). Plenty for 2; only didn't realize I needed to order rice separately."
    },
    {
        "id": 223,
        "text": "This has become a take out staple for me. \nThe scallion pancakes are a must. The crispy and spicy fish filet still show up at my house mostly crispy.  It's got that nice numb at the end spice!\nThe soup dumplings, while tasty, tend to travel less well. \nThe beef and bean curd casserole was overly greasy but the flavors are amazing.\n\nDefinitely give this place a try."
    },
    {
        "id": 224,
        "text": "The dishes are delicious, but only cash is required, and an 18% tip is forcibly charged on the bill during lunch time."
    },
    {
        "id": 225,
        "text": "Their soup dumplings were ok. Tea pots are a definite with the fresh tea leaves. The only option for our dumplings & soup dumplings was the balsamic dip which was over powering and only took away from the dumplings. No soy or chili pepper oil was available which was a let down because the soup dumplings needed it. Service was really slow, but like most places they appear to be understaffed. The ambience is nice, staff was pleasant and food was appealing to the eye. Cash or Venmo ONLY."
    },
    {
        "id": 226,
        "text": "the food is very good and authentic, especially the soup dumplings and spicy cucumber. i've been here about 5 times and they've been very consistent except for once when we ordered a serving of pork soup dumplings and every single on was broken. they still tasted good however i would definitely come back."
    },
    {
        "id": 227,
        "text": "It was alright. Long-ish wait for two simple dishes, but the food was alright by my standards. The atmosphere was a bit weird - modern, but with a weird and dark colored/classic art mural wall with the modern white renovations. Servers were the usual you find in Chinatown - decent."
    },
    {
        "id": 228,
        "text": "I was out with a friend the other day, trying to find a new place to eat at when the bears outside caught my eye. We ordered the House Special Smelly Pot with Chicken (Schechuan Spicy) and the Beef Stew & Dry Bean Curd Casserole.\n\nThe chicken was cooked really well, and it was very flavorful. However, we were late to realize that the Smelly Pot had stinky tofu in it which contaminated the whole dish (both of us do not like stinky tofu). The Beef Stew & Dry Bean Curd Casserole was also pretty good and tasted exactly as I expected. \n\nOverall, I would come back to try other dishes (but will never order the Smelly Pot again).\n\nAlso, it is good to note that this place is CASH ONLY (or Venmo)."
    },
    {
        "id": 229,
        "text": "We've passed Bai Wei/Sakura hundreds of times and never wanted to check it out. This last weekend though, we decided to give it a shot.\n\nSadly, our preconceived notions of the restaurant was confirmed. Subpar food at high prices. We ordered the marinated duck, the House Special Spicy bowl and the mushroom dry pot.\n\nThe food was bland and the portions were on the smaller side for the prices they were charging. I was also annoyed that there were no variety in the mushroom dry pot. There was only one type of mushrooms stir fried, and not the quality kind.\n\nOn top of that, you have to pay for rice?!?!? Never have I eaten in a restaurant in Chinatown where I have to pay for rice. Rice is  FREE when you buy dinner from a restaurant!\n\nDo yourself a favor and skip this place. There are plenty of better options not far from Bai Wei."
    },
    {
        "id": 230,
        "text": "Came here for Saturday dinner. When we were done, this place was packed.\n\nOrdered the soup dumplings with black truffle. Love it! A lot of soup inside!\n\nAlso love the seafood tofu soup. Very fresh and a lot of seafood too!\n\nThe spicy chicken was just okay. Not the usual Chinese style, but more Americanized... The chicken had too much flour on the outside that you can barely taste the chicken..."
    },
    {
        "id": 231,
        "text": "Took my grandma out for an early thanksgiving dinner. She really liked the dark brown sugar bubble tea. She noticed the quality in the tea right away. She doesn't eat anything spicy but for the food we got, it was suitable for her taste. I feel this restaurant is for everyone. People who like spicy, don't like spicy, people who likes sweets and soup dumplings. This place is a must go!"
    },
    {
        "id": 232,
        "text": "Very authentic Chinese food. Love it.i will recommend friends to this place. The favorite one is steamed bum"
    },
    {
        "id": 233,
        "text": "Seriously delicious. I've never had dim sum and this place was the best place to give it a try! On their menu there is pictures with pretty much every type of what that food looks like - which is super helpful when you're a newby like me. Clean and inviting environment."
    },
    {
        "id": 234,
        "text": "If you've ever had quality Asian food, this place is a big disappointment. The pan fried pork soup dumplings came out so quick. It wasn't even hot. There was so soup in it. It tastes like it's been sitting out for awhile and all the soup got absorbed into the bun. Their main dishes don't even come with rice. There's a separate charge for white rice. Their spicy fried fish is literally seasoned with taco seasoning. I would never come here again. I only came because all the other restaurants had long lines and this one didn't. Now I know why."
    },
    {
        "id": 235,
        "text": "This place was great! My family loves the dim sum and everything we ordered was delicious! They accommodated our large party on a busy weekend without any issues and provided friendly, attentive service!"
    },
    {
        "id": 236,
        "text": "I love the fact that Chinatown Philly is updating the dining scene with new regional Chinese cuisine-- the menu here has some interesting dishes. \n\nI started with rose tea with foam. I'm not sure how they make their tea, but it was really really strong rose flavor--very unpleasant because it didn't taste natural. It tasted like potpourri. I had to add water to make it enjoyable. Rose tea should have a nice smooth rose flavor!!! \n\nSoup dumplings. I normally don't order this and restaurants that don't specialize in it. The crab and pork ones were cheap so I tried it out. These were ok. Good amount of crab compared to other places. The soup wasn't too flavorful and the dumpling skin was somewhat thick. \n\nI ordered a noodle with pork sauce. Sometimes this dish gets bad translations so you might get something different than expected... This was one of the times. I thought it would be Zha Jiang Mian, but I think they served me Dan Dan noodles. It had a strong sesame seed/peanut taste so that's why I think it was Dan Dan noodles. Portion was good, but if this was considered Dan Dan noodles, it lacked flavor. \n\nOrdered a fried chicken with chili. I forget the name. This was pretty good. I would order this again. \n \nFood took awhile which was fine bc it was soft opening. The soup dumplings I figure would take the longest but that came out first. The noodles took a long time to come out, so that's why I think they served me Dan Dan noodles and not Zha Jiang Mian. However, if I'm wrong, please let me know! \n\nOn food and service, I would rate it 3 stars. It was just ok. Im talking away 1 star for something that shouldn't have happened. \n\nThe restaurant had about 6 tables full. A server was moving plates/napkin/chopsticks to make room for another table. She DROPS the chopsticks on the floor. She picks it up and places it back on the table. .  \n\nI'm Asian so I'm not usually bothered by this stuff but for a new restaurant to do this IN FRONT of people eating is not good. If we were in Asia, that's culturally acceptable, but in America, we should have better standards. I'm stating this so the owner can train the staff better. \n\nI'll visit again, bc they had some interesting looking dishes that other restaurants don't have."
    }
]