[
    {
        "id": 1,
        "text": "Cute and trendy! The phoratha was good! Could definitely taste the depth of the pho broth within the beef, pate is always a thumbs up in my book. I like the crunch of the paratha along with the distilled veggies. The flavors are there!\n\nMy brother got the pork belly Banh mi. Can't speak on his behalf, but he seemed to enjoyed it. \n\nDrink names are cute and the drinks are good. And a lot of thought was placed into it. We only had the peach oolong and the berry drink. \n\nOverall 4/5."
    },
    {
        "id": 2,
        "text": "I wish I can say I was impressed, but it's just not for me. I felt it was extremely overpriced and didn't even remotely fill me up. The place was nice though\n\nThe Phoratha was extremely small and not very flavorful at all. Stuffed with tons of veggies, but lacked in the protein department. Yes, this is probably the really only place in Philly (that I know of) that offers this \"type\" of sandwich, but its not living up to other places. \n\nI also did order a fruit tea with jelly. I felt they did a good job with this as it wasn't overly sweet and was pretty refreshing, however, the price!!!! Again, what's with the price?!\n\nOverall: I highly doubt I will be back as there are plenty of bubble tea and sandwich places in Philly."
    },
    {
        "id": 3,
        "text": "The strawberry peach jasmine tea I had was amazing! The store also has a nice ambience. I recommend. Cant wait to go back and try the food."
    },
    {
        "id": 4,
        "text": "I love how you can split the tea. Their banh mi is really good as well. The taste of their food and teas also has a different twist compared to other places. Overall, good quality food and taste!"
    },
    {
        "id": 5,
        "text": "The staff is great and the food is delicious!! Oh and don't forget to get some bubble tea!"
    },
    {
        "id": 6,
        "text": "I usually don't write anything negative but I am really disappointed with this place. I ordered the Chicken sandwich and side pho.\n1. Took a while to prepare, almost my whole break waiting, and  I only have 30 minutes for a lunch break \n2. Sandwich was lukewarm \n3. Side pho tasted like salty water, I had to add water to dilute it\n4. Way Overpriced! I paid over 14 for this 2 subpar items"
    },
    {
        "id": 7,
        "text": "Great spot! I got the teriyaki tofu bahn mi and the Billie jean matcha tea and coconut milk drink. I loved that the drink wasn't overly sweetened, so you could actually taste the matcha. But I guess I should've thought ahead because the teriyaki tofu was almost too sweet for me. But regardless, tofu was cooked to perfection, bread was amazingly soft on the inside while crunchy on the outside (the perfect bahn mi roll) and service was friendly and quick! I just wish they had boba! And I'm sure as time goes on they'll get more tofu options. I'll definitely be back."
    },
    {
        "id": 8,
        "text": "Phorathas and 'coco, is it tea you're looking for?'...so so good! Highly recommend  I LOVE scallion pancakes, so to me it's almost like eating a flavorful banh mi wrapped with  a scallion pancake-like bread. AND the drinks aren't overly sweetened. Cute, clean and health conscious."
    },
    {
        "id": 9,
        "text": "It's a cute little stand-in place with a small table for customers.\nLoved the frozen matcha. \nDefinitely coming back to re-purchase the frozen matcha.\nThe butterfly pea tea was interesting. \nIt was sour because it's lemonade but the tri-color was interesting. \nToo bad I didn't get a picture before my friend shook it."
    },
    {
        "id": 10,
        "text": "Frozen matcha and coconut drinks were both delicious! I think the coconut one has a slight edge with the jelly pieces inside. I ordered the chicken phoratha and really enjoyed it. Very flavorful and a large portion. I was expecting something smaller after reading reviews but it was very filling. Order was ready ahead of schedule ordering through Yelp. We will be back!"
    },
    {
        "id": 11,
        "text": "The phoratha is a really unique item--basically taking the ingredients of pho and putting it in a toasted taco shell. It was incredible. Fantastic textures and bursting with flavor."
    },
    {
        "id": 12,
        "text": "Only been there a couple times but my husband and I highly recommend this place, the staff was awesome, caring and very patient with us. As a picky person when it comes to boba tea I can say that their thai tea with egg pudding was great, not too sweet but just perfect. It may be a small place for kids but my toddler love eating there. Its a really great place to grab some lunch, their beef phoratha and pork belly banh mi was delicious and filling with an acceptable price."
    },
    {
        "id": 13,
        "text": "I have only had the Tofu Bahn Mi & I liked it but it's a little small/skimpy for $8+ and there is a spot literally 1 block away that has a much larger/fuller tofu bahn mi for $6. The service was pleasant, the inside of the place is cute but the outside....ohhh the outside...the sign is horrible! I can't stand it & allot of residents in the neighborhood feel the same way!!!! Why the tongue??? No, no, no! Not on Passyunk, honestly not anywhere,  but not right for the area AT ALL!!!"
    },
    {
        "id": 14,
        "text": "Honestly haven't tried any of their foods but i'm a big bubble tea addict and this is my go-to place (& only place in south philly) that has it and definitely satisfies when you're craving one. Wouldn't mind trying their food either--i've heard all good things!"
    },
    {
        "id": 15,
        "text": "Comfy atmosphere with great staff. Food/Drinks are great like always. Highly recommended."
    },
    {
        "id": 16,
        "text": "If you haven't been here before - do not hesitate to go! The phorata is AMAZING. A friend recommended this small little shop in south philly and I can't wait to go back! I was able to try the banh mi with spicy lemongrass tofu and phorata with bbq tofu and both were delicious. The banh mi wasn't extraordinary, but no complaints. The phorata was phenomenal- next time I'm ordering this again (or two). Definitely recommending this to my friends!"
    },
    {
        "id": 17,
        "text": "Love this place! Super clean with fresh, high quality ingredients and a friendly staff. I come here often for the Chicken Pathkora"
    },
    {
        "id": 18,
        "text": "Cute space, two tables with some chairs and a window ledge along with a TV playing music videos. \n\nSignature themed tea drinks like \"Billie Jean is MATCHA lover\" and \"let's Marvin Gay and get OOLONG\" are my favorite of their puns.\n\nI like how they make their drinks less sweet, I usually ask for it that way at other places. They do have 2 condiment bottles of sugar syrup if you prefer it sweeter.\n\nI ordered a Vietnamese Coffee (which they only offer cold) without ice and a Taro Milk Tea. I ended up receiving a Thai Milk Tea but was in a rush so didn't say anything. \n\nIt was pretty slow - looked like there was only one employee there. She made my two drinks then went to the back to make the sandwiches. \n\nIt was also later so they had run out of bread for the bahn mis so she offered it phoratha style with folded paratha.\n\nThe pork belly was still pretty fatty didn't seem like much of it was rendered down. Didn't eat it right away and it got pretty soggy with the mayo sauce. \n\nOverall pretty good flavors but nothing too exciting. Based on the size and price there's definitely better bahn mi options in Philly that are cheaper."
    },
    {
        "id": 19,
        "text": "Wish I could rate higher but this bahn mi was inedible. The tofu was covered in a very thick very sweet goo, incredibly unappetizing. Two stars because the Thai iced tea I got was decent."
    },
    {
        "id": 20,
        "text": "I was curious as to how the phoratha would taste like so I decided to go check it out during their grand opening today.\n\nBruh, all I have to say is that jawn is flames .\n\nI wish I got two because I could've definitely devoured another one. Glad to have something like this in the neighborhood and I'll definitely be back for more."
    },
    {
        "id": 21,
        "text": "Tried this place for the first time last week and I am glad I discovered this place. Ordered the lemongrass chicken sandwich and it was great. Next time I go back I am going to try their bulgogi hoagie. Their ice coffee was good also and they have a nice larger size which is perfect because the more normal smaller sizes is just not enough most of the time. The service was good also. I finally have a place on Passyunk where I can get some ice coffee with condensed milk. Great addition to Passyunk Ave."
    },
    {
        "id": 22,
        "text": "I've been going since they opened and never had anything I didn't like. Love stopping for tea and that delicious pho taco after a long work day"
    },
    {
        "id": 23,
        "text": "I had pretty high expectations for this place, and I really wanted to love it. We walked in the pouring rain to try out this place because for some reason, i really wanted to go there that day. I got the tofu lemongrass bahn mi and my boyfriend got the chicken bahn mi. The bahn mis were alright, but a bit lacking in the tofu and chicken area. I feel like there could've been a bit more protein given the prices for the sandwiches. The flavor on the chicken is good though. There are definitely better bahn mi options in south Philly for much better prices. The person at the cashier was very friendly and the place was clean. I didn't try the phoratha, which Is what they seem to market a lot. Given the high ratings, I might come back and give this place another shot."
    },
    {
        "id": 24,
        "text": "Inventive and cute punny menu complete with the best take on Vietnamese banh mi of my life. I got beef phoratha, chicken phoratha, carmelized pork belly banh mi, and cold cuts banh mi, complete with a myriad of drinks. Definitely coming back again and again and again!"
    },
    {
        "id": 25,
        "text": "Refreshing drinks and sandwiches that just hits all the right spots. Notes of savory, spicy, sweet, and tangy all in one bite!"
    },
    {
        "id": 26,
        "text": "Do you like Bahn Mi's but feel like something is missing or they're sorta dry or it just needs a little extra love? You have to come here. They have what's called a Phoratha and well it is incredible. The flavors are all time hitting every salivary gland in existence. Bother the chicken and beef are phenomenal."
    },
    {
        "id": 27,
        "text": "Foods okay - tried the chicken parotha which was filled with mayo. The one star is for food. The service is terrible."
    },
    {
        "id": 28,
        "text": "not good - GREAT - the best Banh Mi I have ever had anywhere...NYC, Chicago, SF, Hawaii, Philly - luscious pork belly, fresh baguette, crispy-colorful-flavorful veggies, all together - WOW! I'll be back many times"
    },
    {
        "id": 29,
        "text": "I'm eating the tofu teriyaki banh Mi from your fooda pop-up right now and it's divine. I'll definitely be visiting the store. Bravo!"
    },
    {
        "id": 30,
        "text": "Had the Phoratha and jasmine honey tea yesterday and it was delicious!  highly recommend"
    },
    {
        "id": 31,
        "text": "(1 star for Yelp, not the restaurant) I ordered thru Yelp, got to the restaurant, and they said the order didn't ho they despite it saying outt was ready and processing my credit card. The employee said they \"don't use Yelp.\" Yelp, please straighten this out."
    },
    {
        "id": 32,
        "text": "This is one of my very favorite  places to get food from. The banh mi is excellent  and the teas are out if this world! I wish there were one closer to where I live, but the quality  of this place is definitely worth the drive from Cherry Hill to Manayunk.  I can't wait to go back!\n\nThank you to this restaurant and staff for taking the time and care to provide  such a great experience,  especially  during these hard times."
    },
    {
        "id": 33,
        "text": "Had the pork belly sandwich and it was amazing. Very generous with their meats and the roll is fresh, not overly toasted. Personally for me, I would like the sandwich to be cut in half, but nothing major."
    },
    {
        "id": 34,
        "text": "Not good...GREAT!!!\n\nThe BEST Banh Mi I have ever had, & I've lived all over the country, eaten at every Banh Mi place in every city. I've never had one so fresh, so stuffed, so flavorful. I'm lucky to be 1 block away. In fact, I'm going there now to pick up 3 more, for my wife & sick friend in the hospital.\n\nI also wrote about it on my FB page, Flannel Country Dining."
    },
    {
        "id": 35,
        "text": "I've been to this place before just for teas, and will probably keep it that way. The drinks have always been good, I got a thai tea this time. The banh mi I had, had cute wrapping, but wasn't very exciting. I also had to put the fillings from my whole sandwich onto one side. I was all the way near broad on Passyunk, but if you're into a walk go to Washington ave for a banh mi. The macarons and the tea would be the only thing I would recommend."
    },
    {
        "id": 36,
        "text": "This might be my first ever one star review. Came here during the Passyunk car festival and bought a chicken paratha. Was surprised when I had handed over the cash (suddenly they were cash only despite advertised) and asked if they'd honor the yelp coupon even though I had already paid. They said no. For such a small business, it felt a bit unaccommodating and rude. And to add insult to injury, they had locked their bathroom doors so that paying customers couldn't use it. When we asked if we could (after paying), they also said no. Bathrooms were closed to the public today, without explanation. If the food was phenomenal I might bump this review up to three but I can't get over the rudeness on more than one instance in such a short time."
    },
    {
        "id": 37,
        "text": "Tried this last week and it was great! All together we got a strawberry green tea boba, coffee milk tea, pork belly banh mi, spicy lemongrass chicken banh mi, and a beef pho. Both drinks we got were very refreshing - the coffee milk tea was pretty standard, but the strawberry flavor was just right, and tasted fresh. Both banh mi we got were delish! A lot of flavor in the meat, and the bread was fresh and had a nice crunch. The pho was also a nice size for a side order, but was pretty comparable to other restaurant's pho in terms of taste. Great experience all in all, will definitely be back!"
    },
    {
        "id": 38,
        "text": "Was in dire need of a banh mi and figured I could explore the neighborhood as well, when I found Teas N' Mi for pick up. Breezy call in for pick up, paid when I got there, and got the food with all the proper sides for the pho and a smoothie to top it off. Large smoothie with fresh fruit, a relatively large sandwich for the price and for the neighborhood, and the pho was a great flavor. They put the noodles on the side as well so you can add them, not letting them get soggy before you get them home! I have had a few banh mis in the area and this one is fresh, long, spicy, and my favorite so far. Pho was filling and I will definitely by sharing this meal again when I have someone craving Vietnamese food."
    },
    {
        "id": 39,
        "text": "So unique! Great tea on a beef bun mi! \n\nSmall little shop, with great flavor! \n\nOrder: \nBeef phoratha ( not your traditional bun mi , made with a green onion pancake as the bread. So it's like a taco with tender beef and their spread is to die for, taste like pho. I was full off one, but people used to the traditional bun mi, might think it's small so should order two) \n\nPork belly bun mi ( this is more like the traditional bun mi, but the pork belly just melts in your mouth ) \n\nTaro milk tea ( always on the hunt for a place that uses real taro and not the powder, this is your place! How to know a place uses real taro is the color, is the color is light it's real taro, if the color is dark it's made with powder. Perfect sweetness to my liking and they make taro pudding!) \n\nVanilla bean smoothie ( brother liked it, nice twist is they used taro whip"
    },
    {
        "id": 40,
        "text": "You ever wondered what Pho brisket rolled up in Naan tasted like ? Well, I'll tell you that it taste like what dreams are made of. Introducing the Beef Phoratha. You must order this , it blew my mind , my tastebuds and my heart . And by heart , I mean that my girlfriend took one too many bites and I wanted to break up with her for leaving me with less of this AH-MAZING delicacy. So soft , so meaty , so juicy. It's a cultural explosion in your mouth. I washed it down with Thai Milk iced tea and they just simply do it bigger and better here. You can tell they don't just use simple syrup like other bubble tea places. Tea's N Mi is poppin off so make sure to be a part of the flavor explosions."
    },
    {
        "id": 41,
        "text": "We got the pork belly bahn mi and the spicy lemongrass chicken, both of which were amazing! The teas were delicious too. I will definitely be going back, for $8.50 a sandwich it is worth the money. I would highly recommend it here!"
    },
    {
        "id": 42,
        "text": "I REALLY like this place. Compared to a few other banh mi's I've had in South Philly, I prefer this one. I really liked the bbq chicken banh mi but it looks like they replaced it with a bbq pork which..should be better but the meat was chewy. The flavor is there though. The boba is also really delicious."
    },
    {
        "id": 43,
        "text": "Loved the Korean iced tea! They also have a great selection of macarons (not all your typical flavors)."
    },
    {
        "id": 44,
        "text": "I try this place good sandwich and good drinks\nMy son and I like it \nPrice maybe according to the place around there \nBut I will try again sometime soon. I recommended this place for friendly place small and cozy's spot."
    },
    {
        "id": 45,
        "text": "Took a bit longer than we had hoped to get our order, but everything was fresh and extremely delicious. My wife and I came here on a Saturday for an early lunch. We ordered the spicy lemon grass chicken bahn mi and the pork belly bahn mi. We also got the egg rolls as an appetizer and two Thai iced teas. The total order was $40, which is on the cusp of pricey. The Thai iced teas took less than 10 minutes to make. They were delicious. Not too sweet and very flavorful. \n\nWe waited almost 20 extra minutes for the sandwiches and eggs rolls. We were sitting inside the restaurant waiting for the food. There are only three small tables, that can sit a total of 6 people. Even though we sat down, the counter person bagged everything to-go. We just unpacked everything and ate there.  \n\nThe egg rolls were super crunchy and delicious. The bahn mis were incredible. The bread was so fresh, crunchy on the outside and soft inside. The sandwich was so tasty. The mayo and seasoning were on point. The lemongrass on the chicken was strong and the chicken was also spicy. It was a great combo of flavors. I preferred the pork belly, which was crispy and delicious. We cant wait to comeback and try the other bahn mis. I would suggest calling ahead and taking it togo."
    },
    {
        "id": 46,
        "text": "**This is a review of the drinks.**\n\nWe ordered Vietnamese iced coffee. Ice wasn't crushed fine enough, and it was served with a large bubble tea straw, so we got annoying ice particles in each slurp. Besides that, if the price for an iced coffee is $6.50, the cup shouldn't be two-thirds full of ice. \n\n2 stars instead of 1 because the flavor of the coffee itself was decent."
    }
]