[
    {
        "id": 1,
        "text": "Seriously one of my favorite places to order from. The food is fantastic and I love that all the employees took the time to get to know us because we give them good business. I love that this place popped up so close to my neighborhood!"
    },
    {
        "id": 2,
        "text": "Bang bang chicken wings = possibly the best wings in Philly\n\nCheesesteak banh mi = possibly the best cheesesteak in Philly\n\nLavender bubble tea = best non-alcoholic drink in Philly\n\nHaving these three things at the same time = victory\n\n\n*Note: Only vouching for the wings, sandwiches, and bubble tea...I once tried the Chinese food and it was pretty unremarkable."
    },
    {
        "id": 3,
        "text": "Good:\n - Lavender bubble tea.\n - Thai iced tea with bubbles (boba). 50 cents extra.\n - Philly Cheesesteak banh mi - wow! Not a traditional cheesesteak, but delicious\n - Meaty wings (yet still deep friend and a bit greasy)\n - Pork banh mi.\n - ASIAN SLAW for $1.75! (Very delicious)\n\nMediocre:\n - edamame\n - Chinese food"
    },
    {
        "id": 4,
        "text": "Eh, nothing too amazing here. I've only ever ordered Stix for delivery, and every time, I swear it's the last time I'll make that mistake. The only problem is the food is so unmemorable that I forget and accidentally order it again a couple months down the road. Oh well.\n\nThe portions are really small for a Chinese place, and the ingredients are pretty lackluster. My most recent order was curry shrimp, which was 100% unremarkable. The shrimp were tiny and most likely had been purchased in a massive frozen bag from Sysco. It did the job but only in a very basic sense. I would not recommend."
    },
    {
        "id": 5,
        "text": "Really impressed with Stix - they are two for two with me. \n\nThe BBQ beef is fantastic in both the hoagie and the taco. The bang-bang wings are good too and we enjoyed the dumplings. Wasn't crazy about the spring rolls though, a little too greasy for me. \n\nThe delivery is very fast and very friendly which is a nice bonus."
    },
    {
        "id": 6,
        "text": "Tried this place out of curiosity. The price seemed decent and the menu was interesting so I gave it a shot. I have to say it wasn't the best and it sure wasn't the worst. The house lo mien with bacon was okay along with the almond cookies. I can't say I liked the Broccoli Entree. \nOverall I got what I paid for, and I mean that in a totally neutral manner."
    },
    {
        "id": 7,
        "text": "Cheesesteak good. Bang bang wings. Delivery fast. Price cheap. Horatio Jackalthorpe pleased."
    },
    {
        "id": 8,
        "text": "Great bubble teas and smoothies! Glad I found this hidden treasure. Had the wings and garlic parm fries- YUM!! I will be back Stix."
    },
    {
        "id": 9,
        "text": "I had been meaning to try this place out for a week and finally got the chance to today.  It was so delicious.  I ordered the garlic fries with siracha ketchup and edamame.  If you love garlic you will love these fries.  They are light and not over fried.  The ketchup isn't very spicy but gives the hint of chili flavor.  the edamame was also very well done.  I will be going back next week for a bubble tea and to try out their curry.  They have asian fushion cuisine with some Mexican and Americana items thrown in.  I'm already hooked."
    },
    {
        "id": 10,
        "text": "Ordering system has a few kinks to work out. \n\n I ordered pick up through GrubHub and when I got there, the counter girl looked at her computer a bit confused.  I knew right then that they did not process my order.   She said it would be \"just a minute\" so I sat down in the joint not minding to wait another 20 min for the food.  \n I ran back to my house through the Projects and looked at my offerings.  Two Korean Bulgogi Hoagies, Garlic Fries, Bang Bang Wings, and an extra side of fries...er...wait, those were missing from the order.  Oh well.  For the price, the food was decent.  The hoagie beef was a bit dry and lacking any zest and soy flavor that you would normally associate with Korean bbq beef.   The \"slaw\" was not your typical Korean kimchi, but more like a cole slaw.   The Bang Bang Wings were a bit bland, and needed more spice.\nI hope this place is successful b/c Hawthorne could use some decent food establishments.  Goooo Asian food."
    },
    {
        "id": 11,
        "text": "Haven't eaten here but have been a number of times for their Bubble Teas. Excellent flavors and they are not shy on the boba!"
    },
    {
        "id": 12,
        "text": "If they can get their delivery time to under 60 minutes, and FOR SURE under 90, they will get bumped up a star. Because their food is excellent! But man, they have always taken forever to deliver. Granted we may be a bit far for them, but they never objected so I figure it must be acceptable.\n\nE really likes this place and he always hates on Chinese food when that's what I want. Which is often. He gets the lo mein and is always pleased by how non-greasy and fresh it is. They also put in a ton of veggies. I have gotten the general tso (probably would have been better hot and fresh instead of 90 minutes old and a bit soggy) and the sweet and sour chicken (really good!) dinner combos. The fried rice is also fresh and tasty, not oddly yellow and hard like some places, and prepared sans onion as requested.\n\nDon't get the popcorn chicken app. It has cinnamon sprinkled all over it. Don't ask me why, but it wasn't good at all. The dumplings were decent and seemed house made, but the filling was a little on the mushy side. Good dipping sauce. Also greatly enjoyed the bang bang wings.\n\nMy only beef with them, other than the delivery issue, is that they don't have hot and sour soup on the menu. It's usually the dish that makes me want Chinese food, so that's a little bit of a bummer."
    },
    {
        "id": 13,
        "text": "Awesome! Their Lavender bubble tea is amazing, and their owner and employees are really cool and polite. They also deliver!"
    },
    {
        "id": 14,
        "text": "I live in this neighborhood and was SO excited for Stix to appear.  I am something of a bubble tea connoisseur, and they really deliver.  They actually make their own fresh boba (the tapioca \"bubbles\" in bubble tea).  I am such an addict that I've had about six of their teas in the week since they've opened.  Every single one has been more amazing then the last (especially the boba in their fresh fruit ice teas--it's been so hot this summer and they've been perfect.)  My recommendations: passion fruit ice tea with boba, lavender bubble tea (best bubble tea flavor ever!), and the thai iced tea with boba.  Awesome, refreshing deliciousness.\n\nI was actually so excited about Stix opening that I ordered from them for my birthday party, so I've had about half the items on their menu already.  Let me say, their Wonder Wings are absolutely incredible--perfect amount of meat-to-fried-to-crispy-perfection-skin ratio.  And the BBQ and Buffalo flavors are great but, seriously now, get the BangBang wings. Thank me later.  \n\nAll their sandwiches have been great--a manageably-sized menu means that everything I've had has been thoughtfully made.  I am a huge fan of their vegetable wrap (get it with the soysesame sauce.  Again, thank me later.)  But their pork tenderloin sandwiches are delightful--a pork tenderloin take on Bahn mi.\n\nWow, now that I think about it, I've eaten a LOT from them this week.  Calamari--excellent, with a great sweet chili sauce to go with.  Popcorn chicken and firecracker shrimp - perfectly cooked.  (Seriously, they must have a fryer engineer working back there--everything they fry comes out just right.) Edamame served with freshly-cracked sea salt on top.  Dumplings - I'll have to ask the owner, but I'm pretty sure they make them on site.  Fresh, delicious, and pan-seared.\n\nSeriously, just try it.  Nothing on the menu is more than $7.  And if I sound overly enthusiastic, well, I've been in there every day this week, all their staff are great, friendly people, and I've been wanting a good-quality, inexpensive neighborhood joint for a while.  So I might be a little bit in love.  \n\nNow, excuse me, I have to go drink my bubble tea."
    },
    {
        "id": 15,
        "text": "Can't judge a book by its cover when it comes to this place. This is the former \"D'Andre and Monique's Deli\" that was somewhat infamous in the neighborhood for being a \"hangout\" of sorts. The new occupant of the property, Stix Asian Eatery, is something completely different. On the outside, the place still looks like a bit of a hole in the wall, but once you go inside it's actually pretty inviting and tastefully decorated. There is also a limited amount of seating, with some high chairs along the counter and 2 or 3 tables. The place is owner operated and the owners were friendly.\n\nI stopped by and got the Grilled Lemongrass Pork Tenderloin sandwich, which was quite tasty. It consisted of a grilled, seasoned slab of pork in a soft roll, along with some veggies and sauce. The meat was tender and not stringy or dry. It also came with a small side of \"Asian Slaw\", which is similar to the slaw most people are used to, but Asian seasoning rather than the mayo based sauce regular slaw comes with. I think it had bean sprouts, along with shredded carrots and cabbage. Perfect for a light lunch. I'll definitely be back.\n\nThey accept credits cards, but there's an $8 minimum."
    },
    {
        "id": 16,
        "text": "Living in G-Ho I've only ordered delivery from this place. That being said they are always fast and the food is always fresh. I love the idea of getting Bubble Tea and bánh mì DELIVERED. Speaking of bánh mì give their cheesesteak bánh mì a try for a great twist to an old Philly staple."
    },
    {
        "id": 17,
        "text": "A bright and tidy spot for snacks! Stix is a little place that specializes in bubble tea and Asian type munchies (egg rolls, fried rice, edamame, etc.). The staff is extremely friendly and the service was pretty fast. I had the fish taco with coconut curry and mango salsa. All the ingredients were crisp and fresh. The bubble tea is powder based, but it's not watered down too much so you can still taste the flavor. A solid 4 stars."
    },
    {
        "id": 18,
        "text": "Had a lovely dinner from Stix! My boyfriend brought home some take-out and we both loved it. We had a great amount and variety of food for about $20. Green tea bubble tea was great! Just creamy enough, just sweet enough, loved it!\n\nLove the wings! We are wing addicts and these were some of the best non-buffalo sauce wings I've had in a while. They were nice, meaty wings covered in a sort of sweet BBQ sauce. Definitely recommend throwing some on as a side to your order.\n\nWe also had veggie egg rolls that looked handmade (??) and were delicious. I'm a sucker for egg rolls and there was definitely something about this that made it stand out from the generic frozen-then-deep-fried egg rolls you usually see. \n\nWe also split a chicken salad. Generic salad with some grilled chicken and veggies. I definitely prefer the creamy ginger dressing, but this was pretty good. It's probably enough for the general person, but I LOVE ginger, so I was looking for a little more flavor.\n\nLast there was a beef taco. That's right, folks! I said TACO! I was quite surprised to see a taco from an Asian eatery, but my surprise turned into love at first bite! Shredded flavored beef, lettuce and cilantro...amazing combo. It was served with Asian slaw, which is very similar to usual cole slaw (cabbage and carrots), but it is coated with a light oil and seasonings instead of mayo.\n\nWill definitely try this place again! Next time I'm going for the edamame falafel pita!"
    }
]