[
    {
        "id": 1,
        "text": "I love love love the Wow milk tea! I like that they use real tea unlike other places that use instant powder or flavoring. It wasn't overly sweet (but you can always have the sugar and ice adjusted to your own liking). I love that they also have a hot version of it (my go to for the winter bubble tea craving lol) which tastes just as great but be careful it can be rly hot!"
    },
    {
        "id": 2,
        "text": "I usually omit boba whenever I get drinks but not here. They have the best tasting boba and I love adding pudding to my drinks too which is like of flan consistency. My favorite!"
    },
    {
        "id": 3,
        "text": "Brand new spanking fruit tea place in south Philly. Came here twice already for their soft opening for both their cold and hot fruit teas; so good! Glad they opened up another location closer to me."
    },
    {
        "id": 4,
        "text": "Like the regular milk tea with bubbles. Its like it taste the same almost. Irregardless of the store you get it from. But anyways. It was alright. \n\nThis is a hang out spot for pre teen tweeny bops. Come in and dance to the K-Pop music videos."
    },
    {
        "id": 5,
        "text": "I got a peach tea with pulp and it was lovely. The Mr Wish character is this green blob dude so I found that interesting. It was quick to get. Standard flavors available. If I'm in the shopping center again grabbing Pho, I'll probably grab a bubble tea too, but it's not one of those, go out of your way to have it, places."
    },
    {
        "id": 6,
        "text": "This place knows how to make mixed tea drinks. Everything is on point about this place. Interior is nice and new with several big screen tvs. Staff is friendly and helpful. Drinks are delicious. I just wish I had another stomach to enjoy more of their mix drinks. I'd recommend the matcha milk tea with pudding. Adjust sugar levels according to taste."
    },
    {
        "id": 7,
        "text": "Sweet, fresh and a lot of variety. I like the Mango Iced Tea with Mango Pulp, the Special Fruit Tea and the Pearl Milk Tea. You can pretty much make whatever kind of tea you like."
    },
    {
        "id": 8,
        "text": "A great spot to hang out and enjoy a range of quality specialty teas and drinks; silky smooth milk teas and fresh fruit drinks. The decor is clean and well kept with a friendly staff. Grab a drink, watch some tv or play a friendly board game or Jenga. Plenty of parking and other things to do and check out right here in colorful south philly."
    },
    {
        "id": 9,
        "text": "Best pearl milk tea I've had (and I've tried a lot!) Pretty basic I know, but nothing 'basic' about the taste. Even the bubble have just the right softness. So glad they finally opened up one in South Philly!"
    },
    {
        "id": 10,
        "text": "Come to this place if you want a refreshing drink to washed down your food after a delicious meal from the restaurants around the south philly area. There's no powdery flavored drinks offered here like other bubble tea places. All their drinks are made with fresh fruits.  I personally like their avocado drink.\n\nThe staffs are polite and friendly.  The décor at this location is nice, clean, and bright. It's a nice place to chill to digest your food or meet up and hang out with friends.  There's also free Wi-Fi if you want to hangout and do some work.\n\nWill definitely return to try out their other drinks on the menu."
    },
    {
        "id": 11,
        "text": "I enjoy going to Mr. Wish for their bubble teas and mango fruit drinks. It's clean and there are Jenga blocks and games for the kids to play. \nThe staff is nice and although the wait can be kinda long for drinks, I don't mind bc they always taste delicious.\nMy only problem is you can't get bubble tea any time from opening at 10am until about noon because it takes them 2 hours to make boba. Idk how other bubble tea shops do it, but I can order boba from opening to closing. Perhaps Mr. Wish should try cooking boba earlier or the previous evening bc it's a little silly to me that I can't get a bubble tea until noon if I'm there in the morning."
    },
    {
        "id": 12,
        "text": "Great place for drinks and to hang out. Comfortable atmosphere and friendly service. My favorites are Avocado Smoothie (so filling) and Peach Mango Babo (fruity sparkling drink). You can make your drinks as sweet or less as you desire. Bonus: free drink on your bday!!"
    },
    {
        "id": 13,
        "text": "Ordered Mango Sherbert. It came without the usual mango pieces and it was overly sweet and too icey. Also ordered kiwi but didnt taste like kiwi"
    },
    {
        "id": 14,
        "text": "Mr. Wish's Colorful Fruit Tea was absolutely amazing.  The combination of pineapple, apple, passion fruit, and kiwi makes the drink an absolute knockout.  I also love the fact that you can customize the amount of added sugar in the drink since the fruits I had were already sweet and fresh on their own.\n\nThe location also makes this Mr. Wish much more accessible than the one in center city since there's free parking.  The decor is very bright, open, and inviting which is much needed in the area."
    },
    {
        "id": 15,
        "text": "Great atmosphere with friendly service and a great selection of beverages to choose from. My personal favorite was the green tea with orange. I will definitely be coming back."
    },
    {
        "id": 16,
        "text": "They have very good drinks here. My personally favorite is the matcha milk with bubbles. Their pearl bubbles are the best bubbles I ever had. They are so soft, chewy and slightly sweet. The staff are always nice and friendly. If you are in the area you have to give this place a try! They also have another location in chinatown!"
    },
    {
        "id": 17,
        "text": "After grabbing pho in the same plaza, boba sounded like the perfect ending to our night out. For me, these were the reasons why I would frequent Mr Wish again:\n1. they have a parking lot (PTL)\n2. the people working here are incredibly nice\n3. they were super fast - we were in and out in 5 minutes.\n\nI had the kumquat green tea and my boyfriend ordered the passion fruit green tea because he likes being basic haha. They have an extensive list of options, but I was happy with my choice and it was really refreshing. Also, while writing this review I just realized the timing couldn't have been better since today is the start of the New Year! I was told kumquat signified luck and prosperity. Who doesn't want that."
    },
    {
        "id": 18,
        "text": "So far I tried the orange green tea and the mango smoothie, both are very good and so fresh, you can take the actual fruit in the drinks, I got both at 60% sugar level which is perfect for me!  Extremely clean and the service is great!"
    },
    {
        "id": 19,
        "text": "They brew fresh tea before making the WOW! Pearl Milk Tea. The quality and taste are superb!!!\nFor the K-Pop fans, they play BTS Music Video in the store."
    },
    {
        "id": 20,
        "text": "Their bubble tea is definitely the best I've ever had, at least in original and matcha - the bubbles are made perfectly, and the flavor is always very fresh and delicious, not overly sweet.  However, one star off because 1)  sometimes you end up waiting a long time, and 2)  the chocolate one I ordered once on a whim was frankly, disgusting.  Not mixed well, lumpy, and cheap quality.  Just avoid the chocolate."
    },
    {
        "id": 21,
        "text": "Their tea is like no other! SO FRESH AND ALL NATURAL. I usually am blind to bubble tea spots because they all seem the same but Mr. Wish is different. I don't feel sluggish, full of sugar or fatty dairy when I finish their teas because Mr Wish doesn't use that fake powder crap. All of their drinks are made fresh from fruits and fresh brewed teas. I honestly love them best for their fruit teas -- my personal favorite is Orange Green tea  \nThis is my honest opinion! (Also im glad their chain has expanded to a perfect spot in the Asian community in south philly)"
    },
    {
        "id": 22,
        "text": "Love this place and the drink that I normally get is the orange green tea ! Tonight I tried the passion fruit green tea and it was good! I have not tried their other drinks, but they look delish ! I would highly recommend the orange green tea, it's so refreshing !"
    },
    {
        "id": 23,
        "text": "Nice people, ordered a chocolate milk tea.  I got all the employees to laugh unintentionally when I asked to buy a piece of fruit which isn't on the menu."
    },
    {
        "id": 24,
        "text": "I had a mango smoothie. I went yesterday around noon, so I didn't have to deal with a line. It was hot out and this cooled me off."
    },
    {
        "id": 25,
        "text": "Came here after a long exam in hopes of something refreshing. \n\nI did not know quite what I wanted but knew I wanted something that tasted like orange with coconut jelly. \n\nI got the Orange Green Tea with Coconut Jelly. This drink is good but not amazing according to my taste buds. The drinks are genuinely made fresh as you can see fresh fruits on the side of the cash register and see the cut fruits in your drink.   \n\nThe service was fast and the store was very clean. It is also located around a lot of restaurants near Washington Avenue so it's a great place to treat yourself after a meal. \n\nThere are sitting areas for either yourself or a group of people. They have one cash register so be willing to wait if it's a very hot day like all drink shops. \n\nI will be back to this place to try other drinks and to find the one drink that I will love. \n\nThey also have one location in Chinatown, PA on 10th and Spring, I'll definitely be there to try other flavors as it's closer to me."
    },
    {
        "id": 26,
        "text": "I think out of all the bubble tea places in Chinatown I always liked Mr.Wish the best. Mr. Wish is a Taiwanese based tea store that serves fresh fruit based drinks. They literally have chopped up fresh fruits and will add to your drinks. Some may not like them, but I find it to be refreshing and maybe a false sense of healthy drink (good thing you can adjust the sugar level and ice). I go into Chinatown often enough, but when they opened Mr.Wish at 11th and Washington Ave a little while ago I was so happy. I have been going to this one for a while and the service has been wonderful. Workers are friendly and efficient; inside the store is clean. I pretty much get few same drinks every time. My all time favourite is their babo drinks (it has a bit of carbonation and the chopped up fruits are delicious). I like their macchiato (aka salt milk foam) drinks, but it's a bit heavy and tastes like cream cheese. In the past I have tried their oolong milk tea and one of their vinegar drinks, both were good, but probably will stick to my favourites. This is a convenient location where you can grab something to eat, shop at the market, and get some drinks!"
    },
    {
        "id": 27,
        "text": "I had the avocado smoothie with bubbles and 30% sugar. The bubbles were the perfect amounts of soft and chewy with a hint of sweetness. I also tried the tea with mango slush and it was absolutely delicious. The pieces of mango were perfectly ripe, and the tea was fragrant. There was ample seating when I went on Sunday afternoon. Great experience all around and can't wait to come back!"
    },
    {
        "id": 28,
        "text": "great milktea, good place for hangout, good employees, place is clean, big parking space, great place for bubble tea"
    },
    {
        "id": 29,
        "text": "Gotta come here for the kumquat green tea. It's one of the best bubble tea I've tasted so far. I will definitely come back here to try out other flavors."
    },
    {
        "id": 30,
        "text": "My drink was sort of lukewarm, which was annoying.  I liked trying matcha pearl tea without sugar, I never realized that they had sugar amount options at places like this. It was very good without sugar and the pearls has a little sweetness.  Service was a little slow, which was strange because we were the only people in there.  I would stop by again for tea on South Street.  \n\nI was hoping for some Vietnamese coffee in here, because I was dead on my feet, but there were only tea options."
    },
    {
        "id": 31,
        "text": "Bubble tea! Philly does it well and Mr. Wish is one of the best! It's a very clean and bright shop along South Street. The moment you walk in, the servers are more than willing to serve you. They have a large menu of bubble teas, but I recommend their milk tea with bubbles. It's very creamy and tasty. \n\nNote: Most of their drinks have caffeine in them."
    },
    {
        "id": 32,
        "text": "I LOVE THIS PLACE!!! I realized that it took them 2 hours in the morning to make these delicious bubbles. The bubble here is so soft and smooth. \"Mr Wish special fruit tea\" is also very deliicious. I ordered only 30% or 60% sweet because 100% is too sweet for me. Would strongly recommended."
    },
    {
        "id": 33,
        "text": "Great take on traditional bubble tea. They use fresh fruit and fruit juice which gives it a distinct taste. Good price and well made!"
    },
    {
        "id": 34,
        "text": "Gotta try the red bean pudding tea, really good stuff. Place is really clean and staff is really friendly. Overall great bubble tea. No problems here."
    },
    {
        "id": 35,
        "text": "My most favorite bubble tea among all I've tried so far. Especially the bubbles! They are so chewy and soft to the middle. Unlike other bubbles that are hard inside which I don't prefer and they have prefect sweetness too. I WISH they have more milk tea flavors (please add taro milk tea). I come here often just for their bubbles tbh! So addictive!"
    },
    {
        "id": 36,
        "text": "Love the teas and service at Mr. Wish in South Philly. They are open pretty late for a tea place as well, very convenient."
    },
    {
        "id": 37,
        "text": "Second time i came here, Saturday night. It was a bit crowd but the waiting time is still okay. \nAlways love their smoothies and milk tea.\nNot disappointed this time, as good as always. They have new menu, macchiato. Not really like it, but still okay"
    },
    {
        "id": 38,
        "text": "Writing this as I walk out the store. I have never been so disrespected before. My first time coming into this location. A girl who works there wears glasses decided that her conversation with her friend was more important then telling me it's my turn to order. So I walked up myself and asked if I could order and she didn't answer. So I just proceeded to tell her my order and she just takes my money not even telling me the price of it. I asked for $5 ones back because regardless I wanted to tip her. She doesn't even look and drops the money on the counter even though I had my hand out for my change. I was so disgusted by her attitude. Then after wrapping up her conversation with her friend, she finally acknowledges me and asked what size I wanted, even though I already paid? I never seen such horrible customer before. At that point I just wanted to walk out and get refund for my drink but I just left. Beware if you order here, you might get a healthy dose of attitude from the young  female workers."
    },
    {
        "id": 39,
        "text": "This is one of my favorite bubble tea store. Their pearl milk tea is just amazing, especially how chewy the bubbles are. And I just love the fact that I can change the sweetness level which some store don't even have that option! I am also very much in love basically everything on the menu. The staffs are very friendly and give customers great recommendations. The sitting area and the couch area are very clean. Totally recommend to go and get a drink!!!"
    },
    {
        "id": 40,
        "text": "I love love love Mr Wish so I was super excited when I found out another chain location opened up just a few blocks walking distance from me. Talk about convenience!\nThe people are very friendly here and I've only come twice since their opening. However, the second time around it took over 20 minutes for our drinks. Granted it's only been a month since they have opened but still -- it's fruit tea/bubble tea...\nI highly recommend any of their fruit teas - their menu is slightly different from the chinatown location so don't expect the same things. However, there is more space for seats and their bathroom is clean. Wait a few more months for the paint smell to dissipate and hopefully it'll be more efficient!"
    },
    {
        "id": 41,
        "text": "My review is for the waffle cake in the form of dog paws.\n\nI arrived there when they just opened. I wanted to order that dessert and was told that the machine was not ready and asked me to come back in 15 minutes. 15 minutes later I saw customers wanted black tea but was told it was not ready. Only green tea was available.\n\nWhen the store is open they are supposed to be ready for any kinds of orders. Customer isn't supposed to wait for them to be ready.\n\nI tried to connect to WiFi by following the password on display but didn't work.\n\nThe waffle cake has 3 varieties: plain, custard, and red beans. There's not much fillings as pictured in the poster. It's soft and nice when it's warm with crispness on the edges. I like red beans and the custard is my second best. After it's cold, it has lost the crispness. I tasted something artificial in it. \n\nI will not getting it again next time."
    },
    {
        "id": 42,
        "text": "Service was quick and friendly, got 5 drinks to go. Drinks were very tasty. One drink busted open before I could drink it which was sad...the plastic seal top they put on wasn't properly sealed I guess. Half the drink was in the bag before I realized it. Otherwise it was good."
    },
    {
        "id": 43,
        "text": "My review is for the crepes cake. It's small $3.75 a piece. There are matcha, red beans, mango, or taro.\n\nMy favorite is the red bean because you can definitely taste the red bean . The mango is pretty good too. What I like about it is there one layer that has the most filling so you can taste the flavor. It retains the shape and not overly filled with whipped cream like those at A la Mouse. The container for the take out is sturdy and you get a cute small spork to eat it."
    },
    {
        "id": 44,
        "text": "I live in the area and used to come by consistently for bubble tea, but recently the service has declined. Their new policy allows for some customization of their bubble tea (eg the amount of sugar), but the menu is relatively fixed compared to other bubble tea places like Vi Vi, TeaDo, Tu's and other great bubble tea places in Philly that allow you to customize your tea to taste. For example, today, after years of coming here, the server refused to make a plain bubble tea with just tea and bubbles, claiming that she could not serve a tea without the fruit juice. Not only has this been made every single time previously, the young server had attitude and ended up \"calling her manager\" which I'm not sure if she did or not. It wasn't worth it to cause a scene, and I don't believe in paying $5 for a  \"made to order\" drink if it can't be made to order... \n\nThe service recently has been inconsistent at best. Wouldn't venture to South Philly just for the bubble tea. Go to Chinatown or West Philly if you have to travel."
    },
    {
        "id": 45,
        "text": "I love boba tea and this place is perfect. They not only have boba tea but also have variety kind of tea and fruits. I would definitely recommend this place if you re around. The only problem I had was the parking lot. It's really hard to find parking lot in this area at the weekend."
    },
    {
        "id": 46,
        "text": "I always get either one of their boba milk teas or the fiber jelly drinks since it's the closest bubble tea place near me. There's always usually seating when I've been and they're always pretty quick with in and out - the only comment is that I find that the prices at Mr Wish are a bit more comparatively to some of the other bubble shops in town."
    },
    {
        "id": 47,
        "text": "I walked in and was not greeted. The cashier looked like she didn't wanna take my order. I ordered the strawberry green tea and my sister had the matcha macchiato. My drink was mostly filled with ice rather than drink. I was done in about 4 sips and only tasted a lemon wedge. The matcha macchiato had cheese foam on top and had bits of cheese in the drink which wasn't pleasant. I'm confused about the high ratings, maybe Ill give them a second chance, but at a different location."
    },
    {
        "id": 48,
        "text": "Thought i'd stop into this Mr Wish to pick up a bubble tea this morning. Why on earth do i have to wait over 30-45 minutes for a bubble tea. Store had already opened and there were not that many people putting in orders. Bubble tea is a common and basic item from the menu. For a store that just specializes in tea drinks, shouldn't most drinks be available to serve without an absurd wait time if it's not crowded. It's not similar to trying to order a breakfast item at dinner time. Staff was not very accommodating and basically shrugged their shoulders. If this Mr wish says they are open for business at a certain time, I think more thought should go into the preparation, so that they are not limited into what they can serve."
    },
    {
        "id": 49,
        "text": "Great place! Great bubble tea except I had to wait 10 minutes luckily I wasn't in a hurry. But it had real pieces of mango in mine. Yum"
    },
    {
        "id": 50,
        "text": "Pretty exciting to see another one of these pop up in the Philly area. As prior, this place is bomb for their fruit teas, which are freshly made and on point. Well, at least for me, it really helps my conscience that I'm not drinking in so much sugar all at once. I've come to really like the Mango Tea with Pulp ... there's something wonderful about the mango and tea combination & how they complement one another so wonderfully & perfectly. You can add in other toppings and additions as you so desire for an additional upcharge per ingredient. Granted, it's far for those who don't live in Center City, so if you're closer to Chinatown, it's more feasible to stick with that location, but in general, a great addition to the CC/South Philly (on the border) area!"
    },
    {
        "id": 51,
        "text": "Just visiting from Texas and mr wish is probably one of my favorite places for milk tea boba for sure! More flavor and great taste different from the milk teas in Texas! Love the atmosphere of the place it's extremely on the chill side and can see myself coming a lot if I lived in philly. The logo looks funny and simple but if it works then it works bc the drinks here speak more than it looks. When coming to philly I highly recommended coming here and getting a drink anytime you see a mr. Wish stop and get a milk tea with boba!"
    },
    {
        "id": 52,
        "text": "Always heard about how great Mr. Wish is so I had to stop by. The aroma of the waffles just draw you in.... almost like you are in heaven. \n\nI had the milk tea with tapioca with less ice and sugar.  This was just perfect.\n\nThe custard filled waffles have to be eating right away. Fresh off the waffle maker, it tastes better this way. Despite the overwhelming sweet smell, this is not an overly sweet dessert. It's just right.\n\nVery busy place even though it was around 2pm."
    },
    {
        "id": 53,
        "text": "Great fruit-based bubble teas!  Also has bright atmosphere and decent service.  I would recommend browsing the plaza it's located in, which has a great supermarket and food options."
    },
    {
        "id": 54,
        "text": "Every time I come here, the bubbles are inconsistent. Either they're soft pillows of wonder and dreams or one of Willy Wonka's everlasting gobstoppers. Otherwise, just your typical Mr. Wish. They have some games available that you can play."
    },
    {
        "id": 55,
        "text": "Mr. Wish has a large menu with many variations of bubble tea and a couple small bites to choose from. They are very well equipped to find something you like, and they are knowledgeable in your craft. The bubbles are cooked better than most places that I've tried. Additionally, there are other types of tapioca pearls and jellies you can try. The price is reasonable, and I would definitely return if I was craving some Bubble Tea. The atmosphere is standard for a bubble tea location, and is fairly bare so you may like to get your drink and enjoy it in a more exciting area. Regardless, they do play the top pop songs if you're into that!"
    },
    {
        "id": 56,
        "text": "I was walking out of Nam Phuong after having lunch thinking about how thirsty I was when I saw a horde of school children excitedly running towards and into Mr. Wish. I loves me a good smoothie & boaba tea place so I took it as a sign that I needed to check them out and dropped in.  \n\nUpon entering, I discovered that Mr. Wish actually boast itself as being \"the No. 1 Fruit Tea Franchise from Taiwan\", so no wonder it was bustling with customers.\n\nAfter looking over their drink menu I decided to order one of their Mango Smoothies, which is one of their most popular best sellers.  It was really refreshing and hit spot. I could taste that they use real fresh fruit in their smoothies too, which I really appreciated. \n\nI can see what all the hype is about when it comes to Mr. Wish. I will definitely keep them in mind for my smoothie needs the next time I'm in Philly. I have my eyes on their tea cakes for the next time I have a chance to pay them a visit."
    },
    {
        "id": 57,
        "text": "Been here a few times. Got the large ice milk tea today. I didn't realize that they don't have the herbal jelly pudding topping since I usually get the hot milk tea here. I think the hot milk tea has better flavor than the ice version. \nI like their fruit teas here too. The fruit is cut up really small so it can fit through the straws. Other places just put big pieces of fruit so you cannot eat the fruit until the end so I like how each sip here has fruit in it."
    },
    {
        "id": 58,
        "text": "Just like the other Mr Wish, I love the pearl milk tea the most. It's just so basic but so good, the boba is cooked well, and I think it can't be beat in that department. The fruit teas are delicious as well."
    },
    {
        "id": 59,
        "text": "Good tasting milk tea, but confused why the hot tea is more expensive than cold tea. Workers were slow and she did not close the cap completely on my drink so when I picked it up, the drink spilled all over and burnt my hand. They did not offer any apologies or replacements."
    },
    {
        "id": 60,
        "text": "Love the drinks, but there's a lot of room for improvement with operations. Your sign says you open at 10, but when I get there, nothing is available except for black tea. Last Sunday I was there at 10, the girl tells me bubble teas won't be ready for another 30mins and there's only black tea. Fine. I come today at 10:30, and the girl tells me there's not bubble tea for at least another 30 mins, and that the bubbles take 2 hours to make. I call BS. The wait time for bubble tea should never exceed 15min, especially when the store wasn't even busy. Anyway, whatever the case, if your sign says you're open for business at 10, everything on the menu should be ready upon opening. There should be no reason why only 1% of your menu is ready and the rest takes 2 more hours to prep. If that is the case, then the employees need to be staffed earlier. Management, get your act together!"
    },
    {
        "id": 61,
        "text": "Most authentic bubble tea in Philadelphia - it's also cheaper than a lot of other bubble tea places. I paid $7 for two medium sizes bubble milk teas - SO EXCITING! \nHaving grown up in Hong Kong, I live for bubble tea and have tried a number of places in Chinatown, this place is by far the BEST. \n\nTheir bubbles are exactly how they should be, fresh and not stale like some other places in the city. They also make their drinks fairly quickly and don't add too much sugar. Other places make my stomach feel awful after drinking their bubble tea but this Mr.Wish's doesn't make me want to hurl after I drink it, the tea/milk combo tastes great. The drinks are made fresh as each one is ordered. The regular milk tea with boba is made exactly how it should be, without needing to limit the amount of sugar or boba. \n\nThe location itself is convenient and easy to find as well. Will definitely be returning...more often than I think my wallet can handle."
    },
    {
        "id": 62,
        "text": "So for many months I was in love with the bubble tea, with the perfectly sweet and creamy milk tea and lovely chewy boba. \n\nThen I tried the mango sherbert...and loooove this place even more. Who knew that was possible. The flavors, the textures, aah, absolutely awesome. I feel like there's actually even real bits of mango in there! 100% recommend trying this out. \n\nI know you can adjust the amount of sugar, which is a nice option, but honestly I'm not going here to keep track of my sugar intake :) Zero regrets! I almost missed this place in the shopping center, but glad we made another loop to find it tucked away in the back. So happy to see these popping up all over--also been to the one in Center City and KOP mall, and the products are all consistent.\n\nI will say the crepe cake I tried wasn't great, but doesn't matter. Go here for the drinks!"
    },
    {
        "id": 63,
        "text": "Friendly organized staff. The lychee tea with pulp is perfectly sweet enough without being too much, would recommend it."
    },
    {
        "id": 64,
        "text": "Went there recently and the cashier put in the wrong order (was corrected), employees in the back made the wrong drinks anyways. The employees were too busy dancing to music and when we left, they obnoxiously told us to have a good day after we told them about the wrong order and they remade it. Show some professionalism and take the right order and make the right drinks. You can dance and act like fools any other time."
    },
    {
        "id": 65,
        "text": "I ordered a custard waffle cake, and I got a PLAIN waffle cake. The thing is, I wanted the turkey one but they only had DOG PAW ones?? They should've taken their limited time offer poster of the turkey ones DOWN!!!!!!!!!!!!!!!!!! Also idk why they take FOREVERRRRR to make drinks and food when there's 5 of them WORKKKKKKKIIIINNGGGG but ya and their games suck"
    },
    {
        "id": 66,
        "text": "The drinks are obviously amazing, but the customer is surely lacking. Don't be surprised if you're not greeted or left hanging when trying to place an order. I'll take my business elsewhere, where my patronage will be appropriated."
    },
    {
        "id": 67,
        "text": "I understand the image of Mr. Wish to hire young girls but when the quality of service and product goes down, management needs to think of a better way. \n\nI was the only one out the counter while the cashier was yelling at a lady who took a cup from the counter. \nThe young cashier at the register yelled at her and said do not touch the cups because they are expensive.\n\nThe mother who was there with her three boys apologized and offered to pay for the empty cup. With an attitude and shaking her head the counter cashier said no.\nOk, fine people make mistakes. \nI ordered my mango tea with bubbles and waited 10 minutes for it. The female who is making the drinks in the back came to the front and was speaking to a couple that she knew and totally ignored making drinks. It was a hot day and the line was at the door. I waved to the cashier to say hey where is my tea? She said oh sorry we forgot it's getting busy.. \nhow is this place even functioning? People were walking out! You can't just stop your work to talk to people that you know..."
    },
    {
        "id": 68,
        "text": "I came here this past weekend at night time to try out the new Brown Sugar Boba Oolong Drink. I prefer this over the milk ones. I love the tea instead of the milk version especially if you are lactate intolerant. If you don't want a drink as sweet as the Tiger Sugar--get this. The man that took care of my drink was so professional and nice."
    },
    {
        "id": 69,
        "text": "The worse location of them all. Always making wrong order on drinks. Staffs are unfriendly and inefficient. Go to Chinatown Mister Wish if you can!!!"
    },
    {
        "id": 70,
        "text": "Really great boba tea cafe. I'm really glad I found this place. Super nice folks behind the bar, quick service and fun atmosphere with music playing. Great selection of tea, bobas were good (I've had better, I've had much worse) I didn't get any food but really wanted to try some of the items. I'd definitely suggest this place. It's great :)"
    },
    {
        "id": 71,
        "text": "I just ordered 3 colorful fruit tea drinks today and got charged $1.08 for Sugar Tax plus 8% sale tax. Honestly, I have never heard about the sugar tax before, and it was the first time I got charged for this silly tax."
    },
    {
        "id": 72,
        "text": "I used to come here often like a couple times a week to get my weekly dose of bbt. But the last couple of times that I came here the past year or so, my orders were always made wrong or the drinks tasted different from how it used to. My friends that go here also experienced the same things; orders made wrong. I've heard from at least 4 people that I know complain about how this place mess up orders frequently. One of them ordered a milk green tea with red bean toppings and they received pearl milk tea with red beans (its a combination of tapioca AND red bean toppings). I once ordered a honey lemon gt and the honey was missing or lack thereof so it was literally the sour lemon taste. Keep in mind we go to mr.wish oftennn so we know what our favorite drinks tasted like. Maybe it's new staffing issue since the people we used to recognize isn't there anymore. But we are pretty disappointed in the drinks from here."
    },
    {
        "id": 73,
        "text": "I don't think I've had tea this fresh elsewhere! We live nearby and had grabbed some banh mi from one of the nearby bakeries for lunch, and thought that bubble tea would be the perfect way to wash this down. However, I made a last minute switch to a fruit tea based on how good it looked in one of the posters in the store, and while it took a bit longer than expected for our order to come out, it's because of the surprising use of fresh fruit! I also really like that you can adjust the level of sweetness, as I like to be able to taste the tea more than the sweetener."
    },
    {
        "id": 74,
        "text": "I love how this place doesn't use powder like most bubble tea places these days.  Try it out and you'll never want to go to places that use powder again.  The menu is extremely large, and you'll be sure to find something you like! Colorful fruit tea!! seriously soo good!! I will be backkkk"
    },
    {
        "id": 75,
        "text": "MY FAVORITE BUBBLE TEA PLACE EVER! Wish I could bring it to Boston with me. For my 3 day trip to Philly, I visited Mr Wish for all 3 days. Their colorful fruit tea is hands down the best one. I love how they have fresh fruit with passionfruit seeds as toppings. It's very different from your regular boba place. It's a healthier option than other toppings like bubbles, rainbow jelly, or pudding. If I get a chance to visit Philly again, this is definitely going to be my first stop!"
    },
    {
        "id": 76,
        "text": "6 employees working. Cashier was nice. But I waited almost  10 minutes for my drink. I ordered 2 drinks. I was the only customer in the store before others walked in. My first drink came out. But it sat there for 5 minutes. After seeing a customer who ordered after me receive their order I got impatient. I asked where my second was. They didn't even know about it. Waited 10 minutes for them to tell me wait another 5 minutes."
    },
    {
        "id": 77,
        "text": "The cashier was not happy today. I come all the way from VA to Philadelphia for brown sugar boba with cream mousse, and she tells me it changed and is only available on the weekends. That's not the problem. I understand that changes occur,  but I didn't like her tone of voice when she spoke to me. I just expected for someone in her line of work to be more friendly."
    },
    {
        "id": 78,
        "text": "Omg!!!! This great fruit teas are amazing and definitely needed on a hot summer. I had the grapefruit green tea and I almost orgasmed on myself. It was sooo good! I decided to take on a new project and learn how to make fruit teas and them ready for summers. I could drink fruit teas all day in place of Pepsi products. I want to start exploring Fruit Teas in the DMV area. Great and healthy interventions!"
    },
    {
        "id": 79,
        "text": "Wish special fruit tea was flavorless and sour.  I wouldn't recommend it. They bubble drinks looked good because you see it fresh behind the window. I gave it 2 stars because the girl at the counter was rude. She wasn't in the mood to answer a single question and  nice at all.  I asked what's the most popular drink because it was my first time there  but she was not in the mood.  FYI, there was no one behind me to so I wasn't holding up the line.  Bad experience, my drink wasn't good and I forced myself to finish it, I wouldn't go back."
    },
    {
        "id": 80,
        "text": "Convenient location since it's in the Hung Vuong Market area where there's no real drink place. They have a large variety of drinks and even have an interesting drink called Babo which is sort of like a fizzy soda-y type beverage, but with exploding bubbles. It's definitely a refreshing drink if you're not in the mood for something creamy or heavy. Mr. Wish is decently big enough for groups to come in a chill....maybe while parents or others are grocery shopping! Overall I recommend this place if you're in the area and need a quick drink! The service is good and the staff is friendly and don't rush you!"
    },
    {
        "id": 81,
        "text": "The cashier is not that friendly today. I asked the colorful fruit tea. She looked at me and said \"we re out of that\", then I changed to the special fruit tea. She told me \"go get in line\" where there is no line.  \nI just notice that there is a sugar tax adding into the drink, and there is an additional 8% tax on top of the drink + sugar tax. \nI have been here every time I came to Philly but I got the worst experience ever as of today. It was not closing time and the drink are out. The cashier told me to go get to the line where there was no line and people was waiting for their drinks."
    },
    {
        "id": 82,
        "text": "Love Mr. Wish! and right here in South Philly!!! Wish they offered onigiri too."
    },
    {
        "id": 83,
        "text": "The best of the best ! I can always rely on Mr. Wish for the perfect bubble tea. I always go to the one and the staff is nice."
    },
    {
        "id": 84,
        "text": "This location is super clean and pretty fast. Huge fan of the 3Q milk tea, it's all I get!"
    },
    {
        "id": 85,
        "text": "I have been to Mr. Wishes very often when it first opened but lately this south Philly location the customer services and the drinks have been very inconsistent. One time we came 30 mins to closing time they finished making our drinks and just kinda left it there on the counter. Then we asked for a bag to put them in the boy that work that give us a bag and didn't even bother to bag it for us yet. Show no appreciation to the customers. I rather spend a $5 for the same drink at the Chinatown location than come here and they act like we beg them for drinks!!"
    },
    {
        "id": 86,
        "text": "I was in the mood for bubble tea and happened to pass a Mr. Wish location. I figured it was a sign from the universe. \n\nOutside the restaurant there were a few tables for customers to enjoy their drinks. Upon entering (masks are required), the tables were pushed to the back of the store which made for no indoor seating. \n\nThere were large photos of various drinks for sale. It was a tad overwhelming, so I decided to go with a fruit tea with standard boba pearls to compare against Yaa's Fruitea. I decided to order a strawberry fruit tea (with regular boba) and a waffle. I went to the counter to order and the employee behind the counter was distracted. I stood there for a minute and the employees were chaotic and seemed like there was some sort of confusion. Finally the person behind the corner took my order. \n\nWhile I waited for my drink I saw a bunch of people come in and order and a few grub hub drivers pickup orders. After a 5 min wait my order was ready. \n\nI was pleasantly surprised to see real strawberry in my tea. The waffle was warm and yummy. So why a 3 star rating?  The boba pearls were nowhere as good as Yaa's. They were way too soft and were a little chewy. Additionally the ice was kind of ground a bit too finely. This resulted in ice getting stuck in the straw which was frustrating when drinking my tea. I would suggest keeping ice whole so it would not get caught in the straw. I did appreciate the fact that they give you an option of how much ice you want and amount of sweetness. \n\nThe ice, boba pearls, and chaos at the counter combined led to a 3 star rating. If Mr. Wish can address these issues I would definitely come back and give a higher rating. They are a chain so not sure if all locations have similar issues or just this one.  \n\nThings to know:\n-free WiFi\n-no credit card minimum\n-lots of illustrations of menu items\n-can customize sugar level and amount of ice\n-staff was not rude but come across as not the friendliest"
    },
    {
        "id": 87,
        "text": "I have dreams about their orange green tea with bubbles. Last time we were there I ordered two large ones and drank 'em both. Why is it so good?!\n\nMy husband got a mango smoothie and it was so fresh and magical... it is my preferred way to eat a mango now. \n\nIt's worth the slight pain of finding parking... but anytime we're in the neighborhood, it's a must."
    },
    {
        "id": 88,
        "text": "Ordered the Wish Special Fruit Tea and it was so refreshing and delicious! Perfect light drink for a hot day. Not heavy with any of the toppings and a very easy fruity drink. 10/10!"
    },
    {
        "id": 89,
        "text": "They normally have really good service and drinks. Lately there drinks have been very inconsistent and just ok. The staff don't pay attention or just don't listen. The past 3 times I've gone, I've either been given an entirely different drink than ordered or the wrong size with no boba when clearly both size and boba were mentioned. Check your receipts once handed to you: they continuously punch in the wrong item which sometimes I've corrected beforehand. I don't get it. Otherwise they've been cutting corners with the jelly or just don't know the recipe. And YES!!! Skimping on boba... why??? It's a boba drink! How do you put in barely a tablespoon in a large drink."
    },
    {
        "id": 90,
        "text": "I hate boba (and still do) but the other drinks really are good enough that you don't need to necessarily like boba/tapioca/(whatever else people say) to get a drink from here. Seeing the employees juice/cut the fruits is a nice sight in that I know its a real fresh fruit drink. Also the staff are very nice and polite (and kinda cute, slide me their numbers no cap) would highly reccomend this place."
    },
    {
        "id": 91,
        "text": "Better than sex (unless your partner is DELISH)\nBetter than spooning (and running with the DISH)\nBetter than Gillian Anderson (and Annabeth GISH)\nBetter than arranged marriages (too TRADISH)\n\nBetter than Katy Perry ('specially in Swish SWISH)\nBetter than The Band Perry (and all that country ISH)\nBetter than doggy (but not quite as good as MISH)\nThe best fruit tea in the world is MR WISH\n\nWHAT!\n\nI remembered to blow out my candles but I missed a wish. Well if you, like me, missed a wish, then make up for your wish by wishing yourself away to one of the greatest boba/bubble tea franchises in the world.\n\nSince my main wish didn't come true (turned out he wasn't into boys), perfect fruity bubble tea was my wish, and it came true.\n\nI don't even like fruit tea usually (too chemical-sweet or too lame), but at Mr Wish? I'm all over it.\n\nThere are just so many amazing things on the menu of Mr. Wish that I don't know where to start. They probably have a larger number of truly excellent drinks than anyone else. They particularly excel at the fruit drinks although their Wow milk tea is absolutely WOW as well.\n\nMr Wish standouts:\n- The incredible Apple fruit tea (with black tea)\n- The amazing Passion fruit tea (with black tea)\n- The perfect Wow milk tea\n- Amazing mixed fruit drinks (there are 2 or 3 of them on the menu)\n\nPart of the reason their fruity drinks are so good is that they use real fruit and so the taste is just magnificent whether it's the apple or the passion fruit or the mixed fruit or so many others. The Peach and some other drinks are not as good as those amazing choices.\n\nMy fave location is in Flushing Queens NYC, and it closed down. Mr Wish in Chinatown Philadelphia would not put the toppings we wanted in the drinks we wanted LOL. They reminded me of KFT in that regard. There is no reason on earth not to adjust things the way we want, but whatever. However, this one in South Philly were exceptionally friendly, and are the \"last best Mr Wish still standing\", if you like. It's definitely the best one that is still open, out of the ones I've been to.\n\nOwners and employees had a nice chat with me, and discussed their bubble tea/boba and whether I had enjoyed it. I had.\n\nAnd all that aside, we're talking about one of the best bubble tea shops in the world. Much better than the location everyone knows and goes to, further north in Philly's Chinatown.\n\nAnyway, I'm looking for my Mrs Wish for tonight, so if you think that's you, call me on 1-800-I-HAVE-8-WISHES-4-U-RIGHT-HERE."
    },
    {
        "id": 92,
        "text": "So this is how one of my drinks look before I even take a sip. Please train your staffs to fill up the cups. Every large drink is $7-8 plus but customers can't have their cup fill up properly?"
    },
    {
        "id": 93,
        "text": "I love Mr. Wish!!!  You can order timed deliveries but I usually just go there to order my drink.  I highly suggest any of the milk teas, and I like to add boba to most drinks.  The staff here is always friendly to me and they churn out drinks quickly.  If you're going in the next few days, try the limited edition peach sunset drink, you won't regret it!"
    },
    {
        "id": 94,
        "text": "Got the mango and passion fruit babo.  Very refreshing on a hot summers night!  It's a sparkling drink and has great mango flavor.   You can also relax and play games that they have!"
    },
    {
        "id": 95,
        "text": "Another addition of the franchise that makes the best bubble tea in Philadelphia or possibly anywhere. \n\nThis particular one however is the best in Philly.\n\nThe staff is nicer and the establishment is cleaner than their other locations and I make the trip down to this particular one for my post lunch or dinner treat...even though the other location I know is only a half a block away from where I eat most of the time. \n\nThe fruit teas are awesome too. \n\nLove Mr. wish.\n\nLove this location the best of all.  The staff working there, in my opinion, is the reason. \n\nThe owner should know that his staff does a very good job.  As a pretty picky individual and someone with experience in the restaurant and food industry I really appreciate that."
    },
    {
        "id": 96,
        "text": "So this two star review is for the take out portion of their business....I'm pissed off that $9 worth of drinks is wasted and a mess was made that I needed to clean up. \n\nI ordered 4 drinks as take out to bring home....but before I even got home...it was a mess in the car and bag. If I wasn't too busy cleaning up I would have taken a picture of the mess before I cleaned it up.\n\nThe plastic cups are flimsy at best and cracked on the side so resulted in the drinks pretty much ended up in the bag and car. See pictures of the cup after I cleaned them out to throw out. \n\nMaybe have cup holders for large drinks instead of bagging them...I'm saddened because I do order to go more often then sitting on site to drink it...\n\nOn site service and immediate drinking is not a problem and should be enjoyed because their drinks are good....but to order large orders to go hasn't been a good experience so far...first time the seal busted and second time cups cracked...."
    },
    {
        "id": 97,
        "text": "Delicious new spot for bubble tea! Liked the one in China town Philly, but super happy to see there's a new location in South Philly! Perfect place to hangout! New favorite tea is the Colorful Fruit Tea!"
    },
    {
        "id": 98,
        "text": "This is my second time to this location. It did not disappoint. I had the passion fruit green tea with boba. I love that they use real passion fruit pulp and seeds. It is very flavorful and refreshing. The service is pretty fast and there is some seating available if you want to enjoy your drink there. Parking can be a challenge as it is in a retail center anchored by an Asian supermarket. Still, I find a way to get to my passion fruit bliss!"
    },
    {
        "id": 99,
        "text": "I happen to give Mr. Wish another chance and their drinks tasted better than before. However, I am giving it 3 stars because the one cashier constantly gives attitude. When I was there, I stood at the counter for about 5 mins waiting for someone to take my order. She rolled her eyes when she had to take my order. This is not the only time she has given me attitude. After this I would rather go to the Mr. Wish on South Street and pay for street parking than deal with her."
    },
    {
        "id": 100,
        "text": "BAD SERVICE!! \n\nSo i bought two hot drinks and one of the cup didn't close properly because the cup was bend. I asked them if i can get a napkins because it was hot and I spilled it on top of my hand. The other guy just said the napkins was there( with a little attitude) ! I said okay and i asked the other person if i can have another cup , I couldn't close it at all! They just standing and do nothing, not even apologize! He only said don't worry i will clean it, of course is easy to clean . Your drink is HOT and that can burn my hand!! At least apologize i will really appreciate that!! I understand you might have a long shift but being kind and professional is still part of your job . I can said that because i also working at the food industry, so i get it!! But make sure they closed before you serve  a HOT drinks!!!"
    },
    {
        "id": 101,
        "text": "Drinks are great but I don't understand when a store is open but the majority of menu items are not available. There is no tea, there is no boba, no lychee an hour after opening.. on a Saturday?\n\nMr. Wish franchise is a given with deep tea flavors and fresh fruit. I have been to other franchises and they start early so when hours are open they are able to service.\n\nVery disappointed. \n\nDon't come during early business hours. I recommend the oolong tea drinks and all the lychee sunrise and dragonfruit drinks. My go to is also the grapefruit green tea if you like that taste."
    }
]