[
    {
        "id": 1,
        "text": "It's nice to have a bubble tea truck on Drexel's campus but it's average at best. I recommend getting their super hero named teas over the traditional ones as they are refreshing and taste pretty good. Their snack and food options are nice to have with your ice cold tea on a hot day. I try to stay away from the traditional bubble teas from them because they have an almost powdery texture and are often too sweet. There's nothing special really about their bubble tea other than it's on wheels and is the closest one on campus. Getting tea from them in the summer though is really uplifting as there aren't many drink places on campus that don't serve coffee.\n\nOne thing I found weird was that they take credit cards sometimes and other times they only take cash which is slightly a pain if I am running low on cash sometimes."
    },
    {
        "id": 2,
        "text": "Great selection of drinks and ability to customize. Lots of interesting snacks available and the prices are pretty reasonable. My only complaint is that sometimes I will go out of my way to go to Royal Tea and they will have a little sign that says \"be back soon\". This has happened a couple times and usually I don't wait since I don't know how soon \"soon\" is."
    },
    {
        "id": 3,
        "text": "The bubbles here are so fresh, they're so much better then the places in China town,  I'm actually surprised that they have this kind of quality here in a food truck of all places"
    },
    {
        "id": 4,
        "text": "Like I said in another review, there is a food truck exploooosion in Philly right now. This truck is the newest kid on the block, having just been open for 3 days. And wow, you can already see how needed this truck is by the continuous line in front of the truck throughout the whole day. It's in a great location, being the only truck on the NW corner of 33rd and Market and has flashy paint job, drawing any curious passerbys in. But how it's drawing the crowds is by the awesome food niche it fills - bubble tea and Taiwanese snacks. Sure, there's a couple other trucks that do bubble tea, but more as a side item, and nobody wants a half-assed bubble tea. These guys make quality bubble tea, and have a variety of other add in options, such as lychee jelly, which is delicious. Price is on point at $3 for a regular, comparable with Chinatown prices. And the tea is not too sweet, which is huge for me cause I hate tea that's just a cup full of sugar. \n\nWhat's really got me excited for this truck though, is the downplayed food menu, which consists of a variety of buns, skewers, popcorn chicken, and dumplings - all the best Asian snacks your heart could desire. Prices are again on point, ranging from a couple bucks for skewers to $7 for 3 buns, just the right price for a lunch. Unfortunately, when I visited, they had been so busy serving the tea, that they hadn't had time to roll out their food items yet. The guy told me they're busily hiring, so hopefully that will change soon. \n\nBut for their tea and for the menu they're slated to have, this is a 5 star truck. Will update once I try their food. Please don't disappoint!!"
    },
    {
        "id": 5,
        "text": "Always closed unpredictably. Very inconvenient. The bubble tea is ridiculously sweet. Make sure not to get 100% sugar if you do happen to go at a time that they are actually open."
    },
    {
        "id": 6,
        "text": "Professional bubble teas and awesome Chinese snacks!!! My favorite drink from this truck is Thai tea and favorite food is dumplings! Overall, very recommended:)"
    },
    {
        "id": 7,
        "text": "While I love Lulu, their boba consistency just varies too much. I've always wanted to try this and decided to go out on a limb today. I'm so glad I did! \n\nGot a large Jasmine Milk Tea with bubble (boba), 50% sweet. I'm very picky about the consistency of boba as well as milk tea not being too powdery. I was pleasantly surprised that this met both my requirements despite ordering this at the end of the day (at 6:30pm, close to closing) and despite getting the bottom of the last batch of boba. \n\nBoth boba and tea were on point! I'm hooked!"
    },
    {
        "id": 8,
        "text": "Glad I found this bubble tea truck in Philly.  Walked by Drexel last week when there was a longest line I've ever seen for a bubble tea place. Today I've come and try it out. Hands down the best boba tea I've tasted in philly and I've tried many places. It's also hard to find places that makes good milk tea and yummy tapioca. The boba actually tasted of honey and the milk tea wasn't watery or bitter which was exactly what I was looking for. Definitely recommend this place.   (Picture was taken from last week Friday)"
    },
    {
        "id": 9,
        "text": "This is my fav bubble tea truck! Excellent service and great flavor options. My only request is that there would be more locations!"
    },
    {
        "id": 10,
        "text": "Im so ecstatic that Teassert is now conveniently available on UPenns campus!! The boba is very chewy and the same high quality they serve at their China town shop. \n\nMy favorites are the passion fruit green tea and the milk tea boba. I also tried the matcha milk tea and it is pretty decent as well. \n\nSweetness level and ice can be adjusted."
    },
    {
        "id": 11,
        "text": "I passed by the truck on accident on my way back from a class on Drexel campus.  They were parked on market & 33rd st.  I love boba and my neighborhood I just moved to does not have a location that sells bubble  tea at  all.  I was beyond excited so I decided to stop and try their taro bubble tea. I waited in line behind two people and then ordered.  They do accept cards, no $5 limit either!\n\nI did wait for what seemed forever for my drink and when I got it I felt like an idiot... there was a clear plastic seal on the top with no opening.  I looked for a place to put the straw with no luck. After a couple of minutes i just asked the guys who had ordered after me.  PUNCTURE THE PLASTIC he told me. You won't injure your straw me, trust me...\n\nIt was the best floral taro flavor I have had. It wasn't too sweet either! I'm going to have to try their other flavors as they do smoothies and lychee and some sort of black drink. Definitely worth the wait!"
    },
    {
        "id": 12,
        "text": "Currently my favorite food truck in Philly!\n\nI came here with a friend and ended up trying a lot of their menu. At first, I was a little skeptical of getting bubble tea from a truck (had never done it before), but I was told by a lot of people that this place was great, so I decided to check it out.\n\nI tried some of the royal tea and the hulk (green apple + lychee) and both were great. They were out of the aloe jelly and tapioca, which was really unfortunate. :( Granted, we came pretty close to closing time, so it was sort of our own fault. I had some of the takoyaki, which wasn't the best I've ever had, but for its price ($4 for 6 pieces) was great! The taiwanese popcorn chicken was good and very flavorful, but I mainly liked it because I thought there was a lot of chicken for the price (again, $4). Lastly, I tried the pork belly bao, which was also super flavorful and tasty. Overall, I was very impressed with the quality of their \"snacks\" and boba.  \n\nI definitely need to come back here to try their tapioca, but overall, this place gets a very well-deserved 5 stars!"
    },
    {
        "id": 13,
        "text": "Do not get the strawberry ice tea! It tastes like bubble gum, not strawberries. Horrible, chemical flavor. I had one sip and asked to exchange it. They would not. Not the best customer service."
    },
    {
        "id": 14,
        "text": "This tea truck has SERIOUSLY gone downhill this summer. It used to be the best bubble tea and takoyaki in Philly. I used to come here nearly everyday but the service is honestly just so awful now with the employee who is usually there. They were new and I decided to give them the benefit of a doubt and time to learn despite a long string of poorly made orders including takoyaki with excessive soy sauce and almost nothing else, and matcha tea with so much powder it was visible and tasted strongly of fish. But now a lot of time has passed and the service continues to be as bad, if not worse! Just the other day I ordered a tea with a little ice. Not only was more than half the cup filled with ice, the cup was coated in this sticky brown residue. I had to ask for tissues to remove it with and got no apology or explanation as to why there was this gunk on my drink! And there hasn't been any takoyaki for about a month now. I've spent a lot of money at this truck and introduced it to many of my friends but now it is only a shadow of its former self. I will not be returning.\nEdit: As another review mentioned, it is difficult to get into contact with this truck and they have often not been open when their posted hours say they will be. Back when I was enamored, I let it go, but that is another thing to consider about this place."
    },
    {
        "id": 15,
        "text": "Finally - a bubble tea truck close enough to campus that I can go between classes or during lunch break! I heard from a few friends that this place had some tasty bubble tea so I decided to give it a try one sunny afternoon. First of all, this truck is awesome. I mean, look at it! It's so bright and vibrant and if you're walking anywhere around Market and 33rd, you can't miss it. The staff are always very nice and even when the line gets long (which it does fairly often), it still takes only about 5-10 minutes to order and get your tea. \n\nSo far, I've tried the Thai milk tea with boba, Royal tea, and black milk tea with boba. All three were good but I have to say my favorite is definitely the royal tea! The royal tea (jasmine milk tea with boba and pudding) is on the \"special menu\" and is $3.50 for a regular size. The thing that the Royal Tea Truck does best is their boba. They are never soggy or too hard and have the perfect amount of softness to them, while still being a little chewy. The boba here are sweet which actually gives them a taste. The pudding is also very good and compliments the jasmine milk tea very nicely. The one thing I will say about the boba is that they do run out of it later in the day and even sometimes in the afternoon on the weekends. When this happens, I just get the jasmine milk tea with pudding.\n\nThe Thai milk tea is good but I've had better. I'd say if you're looking for Thai milk tea to head over to Chinatown and go to Tea-Do. The black tea was so-so but I noticed it was VERY sweet for some reason. I only got it once so I'm not sure if it's always that sweet but it was like candy.\n\nAlso, the Royal Tea Truck has food which is a great bonus. When I come here for lunch, I usually get the Taiwanese Popcorn Chicken. I believe it is $4 and you get a good amount of chicken for that price. It is always fresh and piping hot which I'm definitely a fan of. The sign says that it's spicy but it's really not so don't be scared to try it for that reason. It has a bit of a kick to it but I wouldn't really consider it to be spicy. The pork bao bun is also delicious and the truck uses a special sauce on it that really makes it good. \n\nI gave the Royal Tea Truck 4/5 stars because they do run out of boba pretty frequently. Other than that, I love everything about this place. If you're craving some bubble tea but aren't really feeling a trip to Chinatown, the Royal Tea Truck is the place to go!"
    },
    {
        "id": 16,
        "text": "I just love this place! I stop by a lot times! Delicious Thai tea, Hunk and milk teas!"
    },
    {
        "id": 17,
        "text": "I was excited to try this place, since there aren't many options for pearl milk tea in University City. I checked their hours, saw that they are open every day, and braved the heat to walk here last Saturday around 1 PM with my boyfriend. We were disappointed to find the truck locked up and closed for no apparent reason. Its windshield was littered with parking tickets, suggesting that they haven't been open for business in awhile. What a disappointment!\n\nEdit: I returned to this place when they were open, and got a black milk tea with pearls. It was pretty good, though I wouldn't go out of my way to return. Tea Do in Chinatown is far better!"
    },
    {
        "id": 18,
        "text": "I really enjoy the drinks here and simply the gyoza. But the thing about this place is their pricing of their appetizer is kind of high. But that's not the reason why it lost its stars. This tea truck been at temple for the past couple months but the time of it being open is simply not the same as stated and their phone number simply does not work. I wish there was an easier way to contact this truck because I would love to pick up my favorite drink the jasmine green milk tea from there but sometimes walking all the way to the truck and it still isn't open just becomes a disappointment..."
    },
    {
        "id": 19,
        "text": "The bubble tea from this truck is pretty close to how the West Coast does their bubble tea (or boba, as they call it) - aka amaaaazing.\n\nThe bubbles they use in their drinks are the perfect amount of soft and chewy.\nAnd the drinks that I've ordered from them (Royal Tea, Spider Man, Thai Tea and several more) were all perfect!\n\nI've never tried their snacks, but it's definitely going to be on my list. \n\nIf you're looking to satisfy your bubble tea craving but don't want to make the trip to Chinatown - go here!\n\np.s. They take card! :)"
    },
    {
        "id": 20,
        "text": "Bubble tea was never something that I was a fan of because it was too sweet and sometimes boba were a weird texture but this place has really great tea and great teriyaki bowls for the price! Only 7 bucks for a tea and a bowl with rice and a protein"
    },
    {
        "id": 21,
        "text": "Bubble tea was okay - I've definitely had better. They opened half hour late which ruined my scheduling (I was dead set on trying this place out). To make it worse, I didn't get to try what I originally came for, which was the pork bao. So, I will be coming back to try that and will update my review accordingly."
    },
    {
        "id": 22,
        "text": "Bubble tea is fine, but that's all that I recommend getting here. The 8$ lunch special, while enticing, fails to hit any standard, however low. Just few pieces of bland meat thrown on rice, with lightly drizzled sauce. The combination of lettuce and tomato is less \"salad\" than what you would even find in halal trucks.\n\nTl;dr just get bubble tea. Lunch sucks."
    },
    {
        "id": 23,
        "text": "I ordered the teriyaki lunch special with bubble tea and waited over 35 minutes for it, while other customers who arrived after me and ordered the same thing received their orders before me. I asked the cashier to check on my order because I thought I had been forgotten. When I pointed it out he said, \"Yeah... it's a mess\" and then turned away. No \"sorry\" or \"I'll look into it.\" When I finally got my order, there were no boba bubbles in my BUBBLE tea... the tea itself was very good but I waited about 40 minutes and didn't even get the right thing. Also the teriyaki chicken was far too sweet and covered in thick sweet sauce. The workers could have at least apologized for the wait. There were other customers who ordered just tea and were still waiting 25+ minutes for their tea and there were only 4 customers waiting and no one else in line. How hard is it to organize and complete 4 orders for tea?"
    },
    {
        "id": 24,
        "text": "I'm addicted to royal tea truck. It's got an amazing selection of cold drinks with boba and jelly. Food is super good. It's gyoza is by far the best gyozas I've had in town. Cheap, delicious, and super refreshing! Worth every bit of your money."
    },
    {
        "id": 25,
        "text": "Very good bubble tea in a convenient location. The line is long sometimes but they move pretty quickly"
    },
    {
        "id": 26,
        "text": "Quick and convenient bubble tea and food. Got the large Thai tea, (4$), ($3 for small), pretty good amount for the price compared to the almost nonexistent alternatives. Tea was better than winterfell and bubbles I think have some honey flavoring. Got little sugar(25%) which was definitely a good choice. The oreo bubble tea was also pretty good and is refreshing. Also, they are looking for someone to hire currently, email them if you are looking for a job, maybe you'll get some free food and bubble tea!"
    },
    {
        "id": 27,
        "text": "I've had my fair share of bubble tea. To be honest, I've probably had way too many haha. \n\nYou know whether or not a place has decent bubble tea when their \"regular\" milk tea tastes amazing. It actually tastes better than some of the bubble tea chains in Taiwan. Some might find the drink a little bit to sugary, I think it's just right. They also have the option to adjust the sugar content level of your drink. Unlike other bubble tea stores, they have a wide variety of toppings, including pudding!!!!\n\nBEST PART, they accept credit card.\n\nThey also have some asian Xiao Chi or snacks. I don't remember the list, but they definitely had taiwanese \"popcorn\" chicken or salt pepper chicken. \n\nI will definitely be a regular :)"
    },
    {
        "id": 28,
        "text": "Refreshing for the summer!! I skipped all the food options and went straight to the drinks. Rainbow jelly? Fun! Popping boba? .... what is that? Oh, it's those colorful balls that are at all the fro-yo places. Also fun! \n\nTakes cards, are very nice, although a little slow I would say considering that there wasn't that many of us. Worth the visit if you're in this area or you're just a fan of bubble tea in general."
    },
    {
        "id": 29,
        "text": "Finally, a bubble tea place that's good! I sometimes make the trek from Penn just to get their drinks. I love their variety. I got the iron man (passion fruit and mango flavor with colorful jelly and popping boba) and love their green apple flavor. Honestly don't think you can go wrong with whatever you choose."
    },
    {
        "id": 30,
        "text": "So so delicious!! I usually go about 3 times a week now. They've been closed the past few days but I'm hoping they open again soon!! I get the black milk tea and it is so so good!! My friend gets the Thai tea and thinks it's delicious. The drinks are typically pretty sweet but you can choose the amount of sugar you get in it!"
    },
    {
        "id": 31,
        "text": "I'm so glad I don't have to go all the way to Chinatown for some good bubble tea.  The bubble teas are fairly priced considering other places. I'll definitely come back to try the different snacks on their list!"
    },
    {
        "id": 32,
        "text": "Came back here to try the tapioca (they were out the last time I visited) -- it was excellent. Nice and chewy, and really sweet (which might be a little much for some people but I love sweet drinks). ....maybe my favorite bubble tea in Philly."
    },
    {
        "id": 33,
        "text": "Fresh bubbles, and not too sweet! I personally hate milk teas that just taste like sugar and have no essence of the tea whatsoever. \n\nEasy to customize to my own personal liking which is always a plus for me too!"
    },
    {
        "id": 34,
        "text": "This is the ideal place to stop by for a good drink if you're in University City! My friends and I have heard about this bubble tea truck quite often so we decided to stop by one day. They have a large variety of options but you can't go wrong with one of their starred drinks. \n\nThe tapioca bubbles were made just right. Fresh, chewy, and not overwhelmingly sweet! I ordered the Thai Tea, which is my go-to drink and apparently one of their most popular orders! Delicious. The workers are friendly and the wait is never too long. \n\nThis definitely beats your typical Starbucks or Saxby's if you're interested in trying something new and tasty on campus. I will be back to try some of their snacks one day!"
    },
    {
        "id": 35,
        "text": "so convenient to go to when it's hot outside and you're craving good boba thats close by. so far have only gotten the green tea and Thai tea but they were soooooo good and the lychee bits at the bottom are a nice touch. they also have a lot of interesting nontraditional boba flavors but relatively cheap and will definitely stop by again"
    },
    {
        "id": 36,
        "text": "This truck is awesome! The bubble tea is excellent, you can choose your sweetness level which is nice, and the boba have great texture-nice an chewy. Popping bubbles are really good, and jelly has good texture too-also they have a lot of flavor a to choose from. We have been 3 or 4 times recently, and the service is excellent and very friendly :) they even drew a cute little dog drawing on my snack container. All the snacks we've had have also been very tasty. We love bubble tea, and have been to many local spots, this is our new favorite!"
    },
    {
        "id": 37,
        "text": "This is the place that got me to really fall in love with bubble tea.\n\nWith the truck's colorful exterior and convenient location at 33rd and Market (right by the trolley stop, how smart!), I was attracted to it right away. The menu has a fair spread of drinks and Asian/Taiwanese snacks too, which is a huge plus for people who are looking for something light and flavorful, but not too filling.\n\nIn the many times I have been here, I--without fail--get the Royal Tea. The bubbles are always a great texture, and aren't too chewy or too hard. The additional pudding in the Royal Tea is also extremely good. It has a silky texture, and is a pleasant flavor that adds to the depth of the drink. While I was worried about the sweetness (especially since I don't have a huge sweet tooth), I was actually surprised by how pleasantly sweet my drink was at 100% sugar. I've also sampled the Taiwanese Popcorn Chicken, Pork Belly Bao, and Takoyaki. I love the bite-sized pieces of popcorn chicken and the spices on it are phenomenal! The size is perfect for sharing with friends. The bao and takoyaki are both good as well, and have bold Asian flavors that I hadn't expected from a food truck.\n\nI will continue to frequent Royal Tea for great boba, without question. Just make sure you're there before their tapioca runs out..."
    },
    {
        "id": 38,
        "text": "Iron man - mango and peach flavored. Very refreshing. Although too sweet but I noticed later that they do have sugar level mentioned and we can ask per our need which is really cool."
    },
    {
        "id": 39,
        "text": "As an avid bubble tea drinker, I'd have to say Royal Tea is definitely on the top of my favorites list. The menu has various options for drinks as well as toppings, and the workers are so friendly! Definitely try it out if you're in the area."
    },
    {
        "id": 40,
        "text": "Good, quick, cheap eats for the one-the-go student. \nGot a Thai milk bubble tea and a pork bao.\n\nThe milk tea was a little disappointing, but maybe I'm spoiled by better spots in Chinatown, at least the boba were fine--not soggy nor hard, though they are not flavored.\n The bao was good, especially for the price--the portion was more than I expected.  Expect it to be a little messy."
    },
    {
        "id": 41,
        "text": "I stopped by Drexel one day to meet up with an former coworker and we walked passed Royal Tea Truck, in front of Drexel's gym.  I ordered the Black milk tea with bubbles and pudding.  Unfortunately, they did not have herbal jelly.  Bummer.  Coworker ordered strawberry (I think) with popping boba.  She thoroughly enjoyed her drink.  Mine was okay, not the best but the texture of the bubbles were decent and it was a quick fix.\n\nThey also sold some bites here but we didn't try any.  The bao does sound tasty."
    },
    {
        "id": 42,
        "text": "Good price for a regular sized milk tea. The bubbles are good. It's chewy but a bit on the harder side. Japanese green milk tea isn't worth it. It's very watered down and you can't taste the matcha. Also it's very powdery. I get a powder after taste lingering in my mouth after each sip. Will try other flavor milk teas."
    }
]