[
    {
        "id": 1,
        "text": "Stopped by today for the Grand Re-Opening weekend. The interior was clean and bright, a nice contrast to the still ongoing construction outside (no sidewalk, just plywood). The young man who took my order was pleasant, but he did need assistance with entering the order into their POS system.  \nI ordered a Mango Green Tea Slush without Milk Foam and a Dragon Fruit with Crystal Pearls and Milk Foam. Both drinks were wrong. The Mango Green Tea Slush had Milk Foam and the Dragonfruit was missing the Crystal Pearls. The Mango was refreshing and sweet, while the Dragon Fruit was a bit flavorless. This is incredibly disappointing since the drinks are $6-7 each. They were running a promotion for BOGO drinks, which was nice. Hopefully they can work out the kinks, but until then, I'll continue to go elsewhere."
    },
    {
        "id": 2,
        "text": "I just had a HORRIBLE experience at this place. I ordered a cup of bubble tea with cheese milk foam and ready to enjoy it when I got home. I was a big fan of the bubble tea from Tsaocaa, but the first sip proves me WRONG. A little bug is still surviving and struggling in my mouth. In the beginning, I thought, why does this milk foam taste so funny, then I realized there is a bug in my mouth.\n\nAfter I washed my mouth with mouthwash for five times, I contacted the manager of this place. The manager told me there is no way a bug can get into my drink, and their milk foam was made yesterday and kept in the refrigerator overnight, which implies implicitly that the bug was put into the drink by MYSELF. How ridiculous was that!!! Moreover, I am now wondering if it is sanitized to store the milk foam, part of the drink, in the refrigerator overnight? I will call the department of public health of Philadelphia for details. If the department of public health says it is illegal to put the milk foam into the refrigerator overnight, I will report it to them.\n\nI will personally not coming to this place anymore, and I also want to share this piece of experience with you guys.\n\nOverall, here is the takeaways: 1. Be ready to find bugs in your drink, and don't be surprised cause you put it in. 2. Enjoy your overnight fantastic tasting milk foam."
    },
    {
        "id": 3,
        "text": "Wouldn't let me use their restroom after buying a Wouldn't let me use their restroom after buying a Wouldn't let me use their restroom after buying a Wouldn't let me use their restroom after buying a Wouldn't let me use their restroom after buying a drink. I can see the bathroom. I bought something and I wasn't allowed to use it."
    },
    {
        "id": 4,
        "text": "Manayunk is so lucky to have acquired a shop like Tsaocaa. The staff goes above and beyond for their customers, and you can tell that they genuinely love what they do. Every time I'm in Manayunk, I make sure to stop by and order a bubble tea or some froyo. My favorite tea is the Honey Citrus Lime Jasmine Tea. It doesn't come with any of the bubbles/pearls, but I always add some. The location is spacious enough to bring a few friends, and it's an extremely cozy spot. Highly recommend!"
    },
    {
        "id": 5,
        "text": "I stumbled upon this place as I was walking down the street checking the area out. I went safe and tried the lime green tea. LET ME TELL YOU THIS TEA IS PHENOMENAL! It's the right amount of lime, sweet, and green! The cup they give you I believe is hard plastic and reusable. It's definitely not a regular plastic cup. They also sell food and other specialty drinks. I'll be coming back soon!"
    },
    {
        "id": 6,
        "text": "Putin de Jjzjdhdhdvdbsvdhjsjhdhdhasjjsjh are h de rvevdhehehrhytrqwwerttyytttttttjjdppppoiuytteyyyyyyyyyyyyyuiauuuqhwuwyw a Arch a agotadas"
    },
    {
        "id": 7,
        "text": "A great new addition to Main St.! Not just a bubble tea store, but also froyo and some food items. This is my second Tsaocaa location I've tried, and this place is definitely cleaner with nicer service. \n\nSorry, Tsaocaa, although you are not my favorite milk tea place (too watery for my taste), you do win when it comes to fruit tea in the city. \n\nPlus, this location sells freshly made chicken wings, somewhat korean fried chicken style! As in it will take a while for your order to come out because it is freshly fried and smothered in your choice of sauce. Soy garlic was pretty salty but still delicious."
    },
    {
        "id": 8,
        "text": "The chicken sandwich & the honey wings were great! & enjoyed the jasmine milk green bubble tea.\nGyoza were alright and the soy wings weren't that good."
    },
    {
        "id": 9,
        "text": "I'm seeing a lot of 5 star reviews so maybe I went on a bad day, but what I was served today is a disgrace to food. It was inedible. It was frozen watery rubbery chicken. I ordered a chicken sandwich, fries, 5 pack of wings, and a mango green tea. \nThe sandwich was disgusting and after 2 bites I had to throw it out. The mango tea is almost tasteless and the mango bits they leave in there are almost like backwash in a drink. The fries were mushy and disgusting with no good taste. The wings were the best part of the entire meal, edible. They were still very bad, clearly frozen watery chicken. The only thing I thought was genuinely good was the honey garlic sauce, but that doesn't help when everything else isnt worth eating\n\nI never write reviews, but this place was so disgusting I just had to share. If they consistently come out with this garbage it's my hope they close down and make room for a place with edible food. With the prices they charge, you'd be better off going to McDonald's and finding better quality."
    },
    {
        "id": 10,
        "text": "Nice hidden gem on Main street serving boba or bubble milk tea. I really like their brown sugar milk tea and mango green tea w milk foam. Their chicken strips are pretty good too! Nice quiet study spot as well with plenty of seating!  Stop by for a visit!"
    },
    {
        "id": 11,
        "text": "I come here way too often as this is the best place for boba tea outside of Chinatown!! I've tried every boba tea worth trying in philly and this is my favorite. They also have hella crispy wings that are just delicious. The owners are extremely friendly and sweet, they make you feel like  part of the family. They also have a great gift card plan that's worth checking out. Definitely worth supporting during this tough time!!"
    },
    {
        "id": 12,
        "text": "This is a review for the bubble tea. One of the best bubble teas I've had. Tastes very fresh with real fruit. I had the passion fruit lime with mango boba with half the sugar. Tastes amazing and the boba tasted like real mango. I would get 30% sugar next time. \nMy friend got the mango slush with mango boba and no sugar and believes that mango purée was used. She loved it stating it tastes like real mango. \nWould highly recommend!"
    },
    {
        "id": 13,
        "text": "Came here from California where we drink bubble tea like it's coffee. We ordered Mango milk swirl and Strawberry milk swirl which is kind of unique. These are not their specialties, but both of them taste amazing!! There are fresh fruits on the bottom of the drink and the milk on the top is very creamy and delicate. The flavor was rich and well balanced, but you can also choose different sugar level based on your preference.\n\nWe ended up ordering more food: chicken sandwich and honey garlic wings (half spicy). The chicken sandwich was so good!!! The buns are so soft and there's a huge piece of juicy chicken in the middle! :D Definitely recommend getting that if you are craving for a bite. The wings are a nice plus. It's crunchy on the outside and tender on the inside. Yum.\n\nThere are also many other options on the kitchen menu. For sure will come back again and try other stuff. \n\nP.s. They got a lot of puzzle games in the store."
    },
    {
        "id": 14,
        "text": "Bubble tea was fantastic. Bubbles had great texture, not soggy. Half sugar with less ice for the brown sugar Milk Swirl Bubble tea was perfect.. it was sweet like a dessert but not excessive, was rich but not heavy feeling, and the brown sugar taste clearly evident in it. Perfect dessert drink. The seasoning in the fried chicken both sandwich and boneless was delicious without it being too salty. Chicken was very juicy. Also it was a bit chewy but the manager explained why in-depth and reassured me about it so I was fine about the chewy part. Great service and the manager was very accommodating and considerate. Definitely would recommend this location."
    },
    {
        "id": 15,
        "text": "Came in for a Spicy Chicken Sandwich and a Pineapple Passionfruit Green Tea. The Tea tasted great and the Chicken Sandwich was very tender. Eager to try the Extra Spicy Chicken Sandwich on my next visit."
    },
    {
        "id": 16,
        "text": "This newly opened place is just starting up but they already have so much going for it. The two owners care they get things right and the customer is without want. From the cute mind puzzles at all the tables to the food! Oh the food! I was lucky enough to be able to sample their boneless wing chicken. Great sauces and REALLY good chicken quality (thigh but they have white meat available for request for the boneless wings)! After sampling that we knew we had to come in and try out some apps. They have one of the best egg waffles I've ever seen and their takoyaki packs a punch! For dessert, they have a collection of 6 biweekly rotating soft serve ice creams and topping bar, we did not partake this time but the crowd seemed enthusiastic about what they were having! I will definitely be back to try it all!"
    },
    {
        "id": 17,
        "text": "Great bubble tea and egg waffle! Customer service is also amazing! Have contacted them through social media with some questions and they were very responsive and helpful."
    },
    {
        "id": 18,
        "text": "Crispy, hot, juicy and fresh chicken wings. The honey garlic were amazing. I also got an egg waffle and dipped it into the leftover sauce. I love this place. Give it a try. \n\nIf the pandemic is still happening when you read this, know that their pickup system is VERY non contact. They have a speaker on their door you talk through (you don't even have to press a button. Just talk) and they bring your order out. \n\nThey also give you plastic gloves to eat your wings with. I'm not sure if this is all the time or just pandemic-times, but that was also appreciated."
    },
    {
        "id": 19,
        "text": "This is a review for the bubble tea. Overall, this bubble tea spot brings a lot of flavor to Main Street on Manayunk. It is comparable to Mi'N Tea, which is located nearby. \n\nPros:\n- Very carefully designed interior. Very warm and inviting\n- Price was definitely on the affordable side \n- when you ask for 30a% sugar, you will actually get 30% sugar \n- a lot of bubble tea flavors to choose from. We went with the Jasmine milk tea and the matcha bubble tea.\n- I liked the packaging a lot. Very unique compared to other boba tea places.\n- Great customer service. \n\nCons:\n- I felt that the texture of the boba was very rubbery"
    },
    {
        "id": 20,
        "text": "Alright - so I'm a huge fan of bubble tea. Philly has a dearth of bubble tea outside of Chinatown, but this one is a great extension. I've had several options here and they were all great. I got their Thai Milk Tea, which is always a classic. It was not too sweet, which is great, and had freshly made pearls. I really want to complete the meal this day with chicken wings, so I'll be back shortly. Of note, I think this is one of the few ones in the Queen Village area."
    },
    {
        "id": 21,
        "text": "Passed by today and decided to stop in. So glad we did! Great selection of specialty tea, bubble tea, and asian snacks like my favorite takoyaki. Talked with the owner who is so nice and enthusiastic about his tea! Great spot, will be back."
    },
    {
        "id": 22,
        "text": "This Strawberry Puree Milk is THE BEST boba I've ever had. If they used black boba, the texture would be a little more enhanced but that's all preference based. Overall, the taste of this drink is a MUST TRY.\n\nUpdate: \n\nI went again the second day in a row because I had such a good experience. I decided to try something different today called the Lychee Green Tea Slush, and boy did it not disappoint! The sugar level was spot on, and I am a fan of the foam on top. \n\nUltimately, definitely check out this boba shop. I've been to many around town and I can say that this is a solid place to try out."
    },
    {
        "id": 23,
        "text": "Amazing bubble tea in Manayunk!! Bubbles are so fresh and the COVID protocol is great inside the store. Always very quick service and delicious bubble tea. I'd recommend the brown sugar bubble milk tea!"
    },
    {
        "id": 24,
        "text": "One of the best spots to grab a good meal on Main St. I went into Tsaocaa thinking about just getting boba tea (which you obviously should), but was tempted by all the chicken dishes; and I'm glad that I was.\n\nFirst up, the boba tea. I got the King of Milk tea which is one of the best no-fuss milk teas I've had. But that is not the star of th show here. Their milk swirls are a-m-a-z-i-n-g. We tried both the Mango and the Strawberry milk swirls and they were just one of the most unique drinks I've had. There are real bits of strawberries and mangos in there - and they just combine so well with the creamy milk. Make sure you get it with the boba; it just makes it better.\n\nOnto the food - we got the chicken sandwich and some wings. The chicken sandwich is just so flavorful. It is fresh and the thick biroche buns do well to contain all that flavor. It's a must-try. The wings themselves are Korean-style and taste exactly like how you want your Korean fried chicken to taste like. \n\nOh and they also have a frozen yogurt section. It is a separate section and you just get to make your own bowl. I had fun combining the different flavors together. \n\nOverall, though I thought it was just a boba place, this is just so much more. I've never had fried chicken and boba together before and I think I might have developed a new craving. And the best part about this restaurant is all the space. There are nice and quiet spots out at the back where you can get some work done. There is also a TV in the front if you just wanna watch the Eagles play. And the one last thing? They have so many tiny puzzles and Jenga lying all around the restaurant. Yeah, it's just a perfect place to get some good food and spend some time!"
    },
    {
        "id": 25,
        "text": "This place has some of the best bubble tea around.  The chicken wings and the sweet potato fries are awesome too!"
    },
    {
        "id": 26,
        "text": "Amazing chicken wings.  Tea tastes much fresher than other places on the same street.  A notch above Kung Fu (which is near my house).  My kids love the egg waffles and so, we always end up buying several and air frying them the following am for breakfast.  I was not a big fan of their chicken sandwich but hubby liked it so likely just a matter of preference.  If it was closer, we would go every day given distance, we go once a week."
    },
    {
        "id": 27,
        "text": "The chicken and wings really hit the spot, glad they've got solid covid takeout options!"
    },
    {
        "id": 28,
        "text": "The chicken sandwich was good. Did Just fine satisfying the craving I had. I don't think it's worth $8 tho."
    },
    {
        "id": 29,
        "text": "Tsaocaa is amazing!!!! Every drink is delicious , the staff is beautiful and kind and if you go also try the boneless Honey Garlic Chicken"
    },
    {
        "id": 30,
        "text": "We were in the area and wanted to get some tea, so I put in an order on DoorDash for pickup and headed right over.  The order was ready by the time I arrived, so I grabbed it quickly and was headed out shortly.  I guess DoorDash overestimates the timing sometimes, so it was ready before the app had said it would be, which is great!\n\nMy tea was the Honey Citrus & Lime, which might not fit everyone's tastes, but I'm really enjoying it!  Great blend of sweet and sour, and very refreshing in the hot weather!\n\nI hope to be back in the future for more!"
    },
    {
        "id": 31,
        "text": "Easy to use ordering service and a quick wait for food and drinks. The brown sugar bubble tea was perfect for a hot day and the gyoza was a good size for a snack or small meal. They have a great space next door to eat outside and enjoy the sunshine."
    },
    {
        "id": 32,
        "text": "Their black tea milk tea is delicious, more flavorful than other places I've tried. The outdoor seating area was lovely too. Recommend!"
    },
    {
        "id": 33,
        "text": "This bubble tea shop is so good! We usually go to the one in Manayunk, but there are a couple of other locations too. Their menu is big, so there are a lot of really good options to choose from. The best part about Tsaocaa is their bubbles, which are super fresh and delicious! They also have food options. This place is amazing, and I'd highly recommend for anyone who likes bubble tea!"
    },
    {
        "id": 34,
        "text": "This is my favorite place in Manayunk! It's right next to the Manayunk train stop so it's super convenient to visit on your way home from the city.\n\nBoba here is great, I've tried a lot of drinks from here and I liked them all. My favorite was one of their specials, the milk tea with crystal Pearl and grapefruit jelly. They recently switched the menu and unfortunately I don't see it listed anymore :(\nIt's okay though, all the drinks here are good!\n\nOh! And they also have froyo here! Its self serve so you can put as much or as little of each flavor into your yogurt cup. When I was last there, they had taro, lychee, blueberry (non dairy), plain tart, and a couple others. If you don't know what to get, you can ask the cashier for some sample cups.\n\nAnd their food is soo good too! I love their fried chicken wings. $11 for 10 wings!! What a great deal and they taste so crispy and delicious too! If you like waffles, they also have a Hong Kong style egg waffle / puffle, that's a great snack as well!"
    },
    {
        "id": 35,
        "text": "I just ordered bubble tea by delivery so I thought it was time I wrote a review.\n\nThe first time I came to Tsaocaa, we stopped in to get a warm drink to carry around while shopping but when my friends and I discovered they served food we decided to sit down and split an order of their soy garlic wings. We ended up staying there for hours playing games and kept ordering more food. I ended up not getting a warm drink. I had a taro mash bubble tea with grass jelly which was really good. It was actual taro and not the powder stuff. They seem to have a huge assortment of teas but I haven't tried any since I usually get milk-based drinks. But what really blew me away was the chicken sandwich. It was sooooo good. I also ended up getting the froyo egg waffle too because I love taro and couldn't help myself. \n\nSince then I've exerted better self control and just got drinks (actually I had the chicken sandwich again but I skipped the froyo this time!). I've had a warm milk tea and I'm currently drinking a strawberry milk tea because of all the reviews mentioning it here. Every single time the drinks and food have been great, the staff is super friendly and the ambiance is fun and chill. At this point, I'd say I'm a regular."
    },
    {
        "id": 36,
        "text": "I was visiting friends in Manayunk and came across this gem of a bubble tea place. I had such a great experience, I felt like I needed to share this review. I went in thinking I was just going to get a bubble tea, but boy was I wrong. I ordered the brown sugar milk tea which was great. But I spotted other people eating the fried chicken and wings and I had to try some. They definitely did not disappoint. Not only are the food and drinks great, I love the vibe in there. Everyone is super friendly and there's lots of games. You could spend hours in there (which we pretty much did).  Looking forward to coming back here!"
    },
    {
        "id": 37,
        "text": "Love coming here! Always quick service and the drinks are delicious. The mango yogurt drink tastes like an indulgent, more delightful version of a mango lassi. Have had many other drinks here too and have not yet been disappointed! Love the convenience of being able to pick up both drinks and a snack!"
    },
    {
        "id": 38,
        "text": "They use actual tea, they smash fresh taro and 30% sugar actually means 30% sugar. Staff is very friendly and atmosphere is good. We got rose milk oolong tea and cloud mist milk green tea. The taste is subtle but good. Haven't had the chicken or snacks but I'll be back one day to try it."
    },
    {
        "id": 39,
        "text": "Tsaocaa has been my go-to spot for bubble tea, especially during the pandemic this past year because their order and pick-up has been so safe and easy! \n\nTheir king of oolong tea is creamy and yummy, and their fruit teas are equally good. My favorite fruit tea has to be the peach green tea with natta jelly! There are real pieces of peach floating in the tea and it's delicious! I usually get it 50% sugar so I can taste more of the tea flavor.\n\nAlso, if you want a sweet snack their egg waffles are light, fluffy, and just right!"
    },
    {
        "id": 40,
        "text": "It lives up to the name, it kind of Tsaocs\n\nHad the mango summer drink and it was super sour and bitter despite being 70% sugar.  Wonder what that even means?\n\nAlso had the takoyaki.  Not close to the quality of Maido, but decent.  The highlight for sure.\n\nSplit a honey garlic and a soy garlic sammy, and both were mediocre.  Nowhere near BBQ chicken or Popeyes quality but way more expensive.\n\nWouldn't return, as it's pretty overpriced and the food isn't worth it."
    },
    {
        "id": 41,
        "text": "I know that this place is a bubble tea place, but try the fried chicken, ANY kind! You will not believe how good they are! Honestly, I think it's one of the best chicken I had in manayunk! \n\nPSA--hot means hot. if you are not feeling super adventurous, don't get the super spicy one. your rear end will thank you in the morning after :)"
    },
    {
        "id": 42,
        "text": "Cheated on my beloved Kung Fu Tea on Saturday and went to Tsaocaa only cuz Manayunk does not have a Kung Fu Tea.\n\nI have to say the Thai milk tea here is pretty great, and might I even say, better than Kung Fu Tea's Thai milk tea. This was my first time at Tsaocaa and price wise it's comparable to Kung Fu Tea, maybe a little more expensive, but barely. I like their tall plastic cups too. Probably not the most environmental friendly but they are just a little fancier than the other cups from the other Bubble Tea shops.\n\nI don't think they have an app where you can customize and order your drinks ahead of time, but the staff was quick, and I was in and out of there in 5 minutes."
    },
    {
        "id": 43,
        "text": "The bubble tea at Tsaocaa is amazing! I got the brown sugar and it was super yummy. I took my niece there and she loved it too! It was sweet and such a fun drink thanks to the chewy tapioca bubbles. You can get tired of the bubbles after a while, but the drink is still great and refreshing. \n\nWe also got honey garlic wings and fries. All was very good and fresh. Get the combo, it's a better deal than a la carte. I wish we did. Any who, check them out. They were friendly as well."
    },
    {
        "id": 44,
        "text": "I was looking for a good place to have bubble tea ever since I moved from NYC and this place hit the spot. \n\nI would suggest picking it up instead of having it delivered. My favorite is the iced black tea bubble tea. \n\nOh! Also! Try their chicken sandwiches!!! It's better than the other fast food restaurant chicken sandwiches I have ever had."
    },
    {
        "id": 45,
        "text": "From jazz hands to great chicken this place has it all.. Tsaocaa Manayunk is located in what use to be  the old Starbucks building.\n\nI found myself here on  a Monday night. While walk to my favorite burger place, a friendly guy at the counter (who I'd later find out was Andrew) greeted me with jazz hands while I stopped and read the sign on the door. I pointed him and the fact that they had Korean fried chicken out to my  boyfriend and we decided to made a quick change of  plans.\n\nSo get the special. It's worth it. It comes with some form of bubble tea and your meal. We order two meals from suggestions from Andrew who told me that they have the best chicken sandwich ever. He was not wrong. The sandwich is amazing. The fried chicken was dipped in a spicy sauce and served on a brioche bun. Some kind of mayo stuff was slathered on it as well with pickles. It just  worked. I also had sweet potato fries and some kind of milk tea with brown sugar jellies. They were both good BUT the sandwich. Get 4 when you go. We also had honey garlic wings and regular fries...and a second sandwich. \n\nServers were nice, place was clean, Andrew was awesome. Please do yourself a favor and get the chicken sandwich. \n\nI am sure I will be back."
    },
    {
        "id": 46,
        "text": "I love this place! The boba tea trend has caught on so there's a few to choose from within 5 mile radius of Manayunk, however Tsaocaa definitely stands out among them. For one, their owner is incredibly nice and funny! Secondly, their product is definitely tasty. They use different boba than other places, it's clear because they don't artificially color it but the taste is great. It's definitely a bit less sweeter and a bit chewier than most but it didn't bother me at all. Their menu is extensive and you can't quite go wrong. Wether you prefer more fruit based flavors or more traditional milk tea, they have something for everyone. If you love matcha like I do, I highly recommend the matcha tea WITH matcha foam at the top! The owner said it's a secret menu item ;-) another personal favorite of mine is their strawberry or mango milk teas."
    },
    {
        "id": 47,
        "text": "Tsaocaa in Roxborough is my friend's and my go-to boba place! I've had Tsaocaa in center city as well, but something about this Roxborough location is a lot better. Coming from the West Coast, I've had my fair share of boba and Tsaocaa in Roxborough is the only one that can compare. They have a great variety of drinks, their boba is soft and sweet. I tend to go for their brown sugar drink, but my friends also enjoy the peach oolong milk tea with boba too. Highly recommend Tsaocaa!\n\nParking is a bit difficult, entirely street parking, but not impossible."
    },
    {
        "id": 48,
        "text": "The tea is good, and their new Korean chicken sandwiches are fine, but it took really long to make. The tea was pretty quick and the workers are polite. Their COVID precautions are good too."
    },
    {
        "id": 49,
        "text": "Sometimes you don't fully appreciate how good a place is until you've been exposed to the bad. \nThat line fits perfectly for Tsaocaa, so this review is overdue. \n\nThe quality of their drinks and food is one of the best of all of Philly's bubble tea shops. (The only other one that I love just as much is Lulu Cafe in West Philly).\n\nNothing I've tried here has disappointed me. The price is a bit on the pricier end, but just like Lulu's, the quality shows. Bonus: They have a stamp card!\n\nThe staff members are incredibly friendly and helpful. When I sat down to study, the staff checked if I needed the WiFi password. When I got their Brown Sugar Milk Tea, but felt I needed to water the sweetness down a bit, they filled up the remainder of my cup with more tea and assured me that it was no problem for them at all. Small things like these add up and go a long way.\n\nIf there's anything I would recommend, it would be more outlets. Tsaocaa is located in a section of town teeming with students (from St Joes and PCOM); I think if they are able to cater more to the needs of students, they'll get even more attention and business loyalty."
    },
    {
        "id": 50,
        "text": "I'm not sure when this place opened but found a review on it on Facebook. After my first order I don't go anywhere else. In the first three days my girlfriend and I ordered 10 drinks. \nThe milk black tea with brown sugar is my personal favorite. But all the milk teas are great! The fruit teas are super refreshing. The extra hot wings are delicious, wish they were a little crispier though. We will def be coming back for more. I'm actually going to order after I post this review. Try it out you won't regret it."
    },
    {
        "id": 51,
        "text": "This place serves the MOST amazing chicken wings EVER! So flavorful and juicy with this enough heat. The honey garlic wings  and regular spicy wings  were juicy and fresh.\n\nDrinks here are delicious especially the Iced mango green tea slush; so refreshing and lightly sweetened.\n\nIf I could order here everyday I would but it's pretty expensive ,however it's still a solid place for delicious wings with wonderful customer service and one of my favorite places for takeout."
    },
    {
        "id": 52,
        "text": "I love boba and I love this place! Mainly because the costumer service is fantastic which makes me love this place even more. There's a lot of space to hang out or just study. There's no need for me to make boba trips to Chinatown anymore. Heads up, some drinks are one size only, so if you're as indecisive as me it will make your life easier."
    },
    {
        "id": 53,
        "text": "If you have never had bubble tea or milk tea before, try these guys out first and lose all hope of finding someplace better. They make everything to order, ingredients are always top notch, and they're more than capable of moving fast to get your stuff made. Give them a try - and if bubbles aren't your thing, their ice slushes are also crazy good."
    },
    {
        "id": 54,
        "text": "grapefruit ice tea slush is delicious. Fried Chicken sandwich is superb(better than chic fila) and it has different levels of spiciness. Also got the hong kong waffle...YUM. My boy accidentally got the boba tea instead of the ice tea slush but said the boba tea was poppin...unique and different with quality food"
    }
]