[
    {
        "id": 1,
        "text": "Food here is good, woman who answered phone was extremely rude to me...very unprofessional"
    },
    {
        "id": 2,
        "text": "1  Fried Meat Dumplings  $ 5.25\n1  General Tso's Dinner Box  $ 7.75\n\nI gave this a four stars but let me clarify. It is what it is. It's greasy unhealthy American-Chinese food thats cheap and has way too much salt. You know they don't serve general tso's in China right? But for what it is it's a cheap and solid dinner. The General Tso's Dinner box is is a typical combo of egg roll rice and the chicken. It's pretty good but I'd only say it's an average 3 stars, nothing sticks out. The real reason I order from Golden Chopsticks quite often is their fried meat dumplings. These are the thick heavy doughy dumplings, not the thin potstickers you might be used to and you get 8 with an order for less than 6 bucks. It's a lot of food and make sure you sleep with water next to your bed because it's very salty, in a good way. So again for what they are aiming for, they do a pretty decent job. Don't skip on the dumplings!"
    },
    {
        "id": 3,
        "text": "I'm not sure if it's 100% vegetarian, but their tofu and green beans is awesome."
    },
    {
        "id": 4,
        "text": "This place has the best chicken wings and shrimp fried rice.  I order it at least 2-3 times per month.  The wings are big and they cook them according to your request.  I also love their shrimp and broccoli.  The shrimp are always plump and juicy and the broccoli is crisp, never overcooked and mushy.  Also, the delivery staff are always prompt and courteous.  I recommend anyone to try this place."
    },
    {
        "id": 5,
        "text": "Great value for Chinese food! Was super happy with General Tso's chicken for $6.75.  I wish this place was closer to me so I could walk-in, but I got it because it was rated highly on Uber eats. Will definitely order again!"
    },
    {
        "id": 6,
        "text": "We order here with uber eats and the food is fantastic every time. not drowned in sauce, great flavor."
    },
    {
        "id": 7,
        "text": "Fast friendly service and speedy delivery when I'm starving at work! Ive only tried the Shrimp and Broccoli lunch special which comes with soup and a soda! My food is always delivered fast and very delicious! I will be trying other dishes from here!"
    },
    {
        "id": 8,
        "text": "After ordering here 7 times I can confirm. Golden Chopsticks is the king of delivery Chinese food. Cheap and delicious. General Tso and Captain Lo are my goーtos. I commend the staff for their consistency!  I have tried almost every chinese place on ubber eats....No place comes even close in its price bracet! ...always a good bet"
    },
    {
        "id": 9,
        "text": "Really cheap, and this is the biggest advantage of this restaurant. But the food tasted...not that good. We ordered chicken noodle soup, fried beed dish and wonton soup, and both of us think that they are not delicious enough. But considered the price... it worths."
    },
    {
        "id": 10,
        "text": "I order from here a lot. The food is typical \"American\" Chinese, but it's the best in this neighborhood, unless you go to Chinatown. The hot and sour soup is pretty decent.\n\nI do find it annoying that the delivery drivers always call me to say that they are at my door, and I go downstairs and wait outside another 5 minutes for them to actually show up. But I keep ordering from them so I guess it's worth it :/"
    },
    {
        "id": 11,
        "text": "Only gotten delivery, but this food is amazing! At least, the dumplings and spring rolls are. It's all I usually get since it's more than enough to fill me up. The dumplings especially are worth a try. Eight pieces and so large and delicious you'll be full after four. Just tried the chicken low mein and this dish was also tasty and filling."
    },
    {
        "id": 12,
        "text": "Pretty good food for the price. Probably not the best but you can get a lot just for under $10 Restaurant is located in the center city in very convenient area. Can recommend to others!"
    },
    {
        "id": 13,
        "text": "It is delicious number one all man you have to come in sit down and dine in because you just might want to order more that's how good it is you got buber eat coming in and out people ordering left and right is so much food coming out of this place it's delicious that's why I was one of the world's greatest restaurant"
    },
    {
        "id": 14,
        "text": "Mm yea GC is SUCKING these days. How complicated is it to make lo mein properly if you've been cooking it all day every day for... decades? Lo mein here has become consistently greasy & has a lovely burnt flavor. It's so oily that I leave the last few mouthfuls so I don't have a heart attack on the spot. The food here overall is overpriced and crappy. The one thing I order [shrimp w/broccoli] is really hard to F up, but eating with other folks has shown me how hit or miss GC is. For some reason it always takes 10 light years to get the food when I order in store for sit-down service. That gives me homicidal thoughts that I can't shake for days.\n\nThis place isn't even trying anymore. They know they don't have to because an entire neighborhood that's flush with cash thinks GC is the only viable option for Chinese. See all the reviews post 2008? They ain't lyin. Forget MY first review & get your Chinese somewhere else!"
    },
    {
        "id": 15,
        "text": "This place has become a part of my lunchtime hunt as well as the reason why my paychecks dwindle so quickly. A part of me wishes i worked nowhere near good lunch spots. The other part is thankful that if i do consider takeout lunch at a spot nearby, it's at least good. \n\nThat being said, this place is an ok chinese food spot. Depending on the food (lo mein) i might feel totally gross until the next day, like i ate a boatload of msg eventhough they say they use only vegetable oil. But other foods (fries and miso soup) are perfect cheap lunch go tos. Their miso soup gets an A+. The broth is delicious and theres an almost absurd amount of tofu and seaweed. Perfection. They're pretty cheap and that miso soup really does hit the spot after a long day of talking on the phone."
    },
    {
        "id": 16,
        "text": "Disrespectful & ungrateful managers. They gave me the wrong order (veg lomein; w/o tufu instead of w/), and I didn't notice until I got home. I called to tell them, and they made me bring the open, partially eaten, incorrect order back, and wouldn't let me keep it, even though it was THEIR mistake. The girl who said she was the manager was extremely rude to me, first saying that I couldn't have what I didn't pay for, (even though it was their mistake,) and kept making faces at me and treating me like I was a homeless person who was offending her, rather than a regular customer who lives in the building and regularly goes there. Well, never again. DO NOT GO if you prefer to get your food from people who treat you with respect."
    },
    {
        "id": 17,
        "text": "Delivery is my specialty. lol. I love ordering-out when I'm way too busy at work. Either late lunch or dinner. I have ordered the veggie dumplings fried and steam. It is really good. My fave is the Beef Cho Ho Fun extra spicy. They are just as good as Chinatown food. I've had many other menu items from here and have never been disappointed.\n\nFrom String Beans in Garlic sauce to Fried Chicken. The only thing is the delivery sur charge. lol. $1.50 is not much to ask but if your a good tipper then that just sucks.\n\nThis would be a highly recommend place to order take-out. I get my deliveries to Brewerytown and they are pretty quick."
    },
    {
        "id": 18,
        "text": "The chicken wings are good and everything i had was fresh. I like there bubble tea aswell overall nice spot"
    },
    {
        "id": 19,
        "text": "I had the worst chinese of my life here. That says a lot considering I have had chinese food in places like Utah and upstate New Hampshire. It was so greasy and foul I ended up throwing it out. I probably should have known better given the skeezy neon lights.\n\nThe eggrolls tasted like they had been fried, then thrown aside for 6 or so hours, and then refried in really dirty oil. So gross.\n\nThe chicken with broccoli was a greasy mess. It tasted like it had been reheated as well. The kung pow chicken was also swimming in old grease. \n\nI have heard other people say they like it, but I really don't think I am going to give them another chance. I'll stick with Chinatown."
    },
    {
        "id": 20,
        "text": "Tons of choices, great food. You get a good amt for the price! Food is fresh, wait is not long. I make frequent stops here and food has been fresh, crispy and hot and tastes great."
    },
    {
        "id": 21,
        "text": "I really do think that this is as good as American-Chinse gets. I live within a three minute walk between two different chinese restaurants though I always choose to order from here via Ubereats and have it delivered. It's inexpensive and they make surprisingly amazing bubble tea... who would have thought? just try it"
    },
    {
        "id": 22,
        "text": "The lunch specials are a well priced consistant portion, and the singapore mei-fun noodles are pretty good as well, a pretty standard local chinese take out spot, they deliver as well which is nice."
    },
    {
        "id": 23,
        "text": "Ordered on GrubHub. Picked up my order for 6 people 25 minutes later. Food was hot, fresh, delicious and inexpensive American-style Chinese food. Because I spent over $30, they gave me a free two-liter (pickup only).\n\nBetween this and the nearby Long River, Golden Chopstick has the superior takeout."
    },
    {
        "id": 24,
        "text": "Pretty good Chinese takeout. I order the same dish every time (general tso shrimp) and it's always delicious. I should probably branch out and try some of their other menu items but for now it's my go to place to satisfy that particular craving. \n\nMy boyfriend also enjoys the meals from here, but wasn't too happy with one recent order so I'm deducting a star based on that."
    },
    {
        "id": 25,
        "text": "This place is gross and the staff at the register are so rude.  The ladies up front won't even look you in the eye and are always making rude comments.  We have been ordering there for awhile because its close to our house but I'm done.  Also, they have this nasty fish tank in the front of the restaurant that looks like it has not been cleaned in a few years.  If they don't care to clean something that their customers can see, than how clean must it be in that kitchen?"
    },
    {
        "id": 26,
        "text": "Fast and convenient. Friendly staff and the food is great. I recommend take out after a few cocktails. We had egg too young, veggie fried rice and Ira he chicken. All worth returning for."
    },
    {
        "id": 27,
        "text": "I ordered take out from here last night, which apparently was a mistake. I was at a friend's house in NoLibs, which yes, is about 18ish blocks away, but still not that far.\n\nIt took close to 2 hours to get our food delivered. When the delivery guy finally arrived, he wouldn't hand me the bag, but kept showing me the receipt. I told him that I'd already paid because I ordered online. He then made me wait while he called his boss. During this process, he set the bag down on a step, only to have it topple over. Seriously, guy, you made us wait way too long, so just give me our food and beat it.\n\nThe food itself was whatever. Outside of Chinatown, all Chinese places taste relatively the same."
    },
    {
        "id": 28,
        "text": "Ordered for the second time in the last few months, got yelled at by the delivery guy for the second time in the last few months, so I think I'm done with Golden Chopstick. Not sure when this driver started but he calls you from his car and refuses to get out and bring you the food. Not much of a delivery service for a place that's sub-par to begin with."
    },
    {
        "id": 29,
        "text": "It's my go to Chinese take out place when I have a hankering for something different than what's offered on campus, and personally I really love their won ton soup, it's one of the best I've ever had. I'll definitely be frequenting here when I have my cravings!"
    },
    {
        "id": 30,
        "text": "I have eaten here three times! In the realm of cheap Chinese food, there is no contest to be had. \n\nFor $6/($8 during dinner hours) you can get a relatively generous portion of a main entree, rice, egg/spring roll and your choice of soup. \n\nThat's crazy!!! \n\nUnlike other cheap Chinese food places:\nThe meet is fresh , each piece is separate, the flavors are unhealthy, but accurate to what the dish is supposed to be. Rice is not dry; and the Wonton soup is surprisingly good.\n\nIn it's price bracket, this place is a clear winner."
    },
    {
        "id": 31,
        "text": "I get the same thing every time I go in there: General Tso's chicken with brown rice. I've also tried the fried rice and spare ribs and the taste has always been consistent. The meats tastes and feels like what it should but it is very slathered in whatever sauce it is supposed to be in. The broccoli that comes with General Tso's is always freshly steamed. The fried rice isn't really greasy. I also haven't had food poisoning yet... The food is typical American-Chinese takeout but that is what I came for.\nThe downside is ordering, a lot of times I get nervous about placing an order, I don't know why really. This place is mainly take out so eating there isn't really an experience. A lot of time if it is the employees on lunch break or groups of students, you can them talking. (On a tangent, I have seen a few employees make dumplings at a table and it was kind of nice to see a moment they weren't being business-like with a customer.)"
    },
    {
        "id": 32,
        "text": "The best American Chinese food I've ever had. I don't review on Chinese takeout but this place is on another level. When you walk in you immediately see that the place is busy with college students and other working people. So I wait in line just like the rest of the people waiting to order. So I get to the front and excepted a rude impatient female or male just like any other takeout place. But notice when I was talking that they was actually friendly and listening to my order. She repeated my order in a nicely calm person just to make sure that she had everything I said. For the people wondering what did I ordered. I got the general chicken lunch platter with wonton soup and egg roll and 4 chicken wings.  While I was waiting, on my right I seen that they won an award for best general chicken in Philadelphia. I forgot what year but it wasn't old. Being a \"food critic\" I wanted to see if it was really award type general chicken. So I went back to the front and waited. They call my number and I got my food then went to have a seat at one of the booths. When I sat down, I smelled the sauce and it smelled wonderful. When picked up the chicken, the sauce was coming down and I knew it was gonna be good. So tasted it and the chicken was steaming hot, fresh, big, moist, tender, and REAL. I can taste the hard work they put into it. I can see why they won an award, and the most important thing about it is that they are consistent. I can see why they're busy every single day. Not because most of their demographic is college students, it's because of consistently and freshness of it. My overall rating is 5/5 stars."
    },
    {
        "id": 33,
        "text": "OK, so I know you aren't expecting haute cuisine at place that looks so bland and has no atmosphere at all. This is a place for a quick lunch, nothing more. So none should be surprised to hear the food is just so-so. The wonton soup is the worst I've ever had, with wontons clearly made several days earlier, and too-salty broth. The noodles were just rubbery and filled with something reddish and nasty looking. And even though soup was the only thing I was ordering on 2 occasions, I still had to wait 10 minutes for them to ladle it out. So don't expect much from this place."
    },
    {
        "id": 34,
        "text": "Tried to give them yet another shot, but they are still really, really RUDE!!! And totally lack customer service skills all around! Their food is extremely subpar even though they seemingly get a lot of traffic.  We will not be going there ever again in this life!"
    },
    {
        "id": 35,
        "text": "Based on my delivery order tonight - FIVE STARS.  \n\nThe food was SUPER SUPER tasty.  There are options to have a small portion - much appreciated, so I don't have to have the same meal for 5 times in row.  They even called me after I placed my online order that they were out of something - and helped me pick something else out to eat.  FAST delivery - even on the day that had intense rain storms."
    },
    {
        "id": 36,
        "text": "I finally found something I liked to eat here!  I had to wait an extra 20 minutes and watch a bunch of other people after me order and get their food, but at least I know they made my dish fresh to order and that probably contributes to why it tasted so much better than food I've gotten here previously.\n\nI got the Beef Lo Mein and the noodles were tasty and the beef was tender.  Kind of a small portion for $5 but next time I'll get the Lunch special (75 cents more and it comes with rice and a drink or cup of soup). \n \nI also had an order of the Dumplings, which were tasty and you get eight large dumplings in an order.\n\nThe Cashew chicken has too much celery and is covered in some brown flavorless generic sauce.\n\nNext time I will call in or use grub hub for my order."
    },
    {
        "id": 37,
        "text": "This place has some lackluster reviews but I do have to say the food was really cheap and prettty damn good. Probably will be my new goto Chinese Food place in the area."
    },
    {
        "id": 38,
        "text": "I judge a Chinese food restaurant by the wonton soup and Golden Chopstick is A-OK in my book. The food isn't gourmet, but at the same time it's solid. After much local experimentation, I think it might have landed the spot of go-to for basic Chinese take-out and delivery.\n\nFor my most recently order, my husband and I ordered a ton of food including multiple pints of wonton soups, Singapore Mei Fun, \"diet\" chicken & veggies with garlic sauce and a side of rice. They clearly thought there were more than two people dining because we got 4 fortune cookies. I'm always amused by their analysis of the number of diners based on the fortune cookies given. \n\nIn any case, it was all tasty and stretched into two meals. Bottom line was that the food was flavorful and the dishes were prepared how they should be. I'll be ordering from them again."
    },
    {
        "id": 39,
        "text": "Decent food. Pretty quick service. But it's just pretty standard, so nothing to really write home about, but a good deal if you're just looking for some typical Chinese food."
    },
    {
        "id": 40,
        "text": "Delicious \"yellow sign\" Chinese food. Ordered online and food was ready in 15 mins. Ordered two dinner boxes - sesame chicken and boneless ribs. Both with fried rice, one with wonton soup (mediocre) and one with egg drop soup that was delicious. The food is exactly what you expect from a cheap hole in the wall Chinese food place - big portions and a little greasy but overall just what I was hoping for. We'll be coming back here frequently."
    },
    {
        "id": 41,
        "text": "I was looking for a new Chinese spot to eat at and I wanted some good. I heard about this restaurant and I went on Yelp to see pictures and read reviews by past customers. I decided to take a chance and I placed an order for my family through UberEATS. I am glad that I did.\n\nI got the a special. It came with bourbon chicken, vegetable fried rice, chicken with rice soup and an egg roll. The bourbon chicken was good. The sauce was a little thin but overall the dish was good. The fried rice was not greasy. That is a plus. The soup was ok, not alot of rice or chicken, it was mostly broth. My nephew had the Szechuan beef with brown rice, egg drop soup and an egg roll. He said it was good and spicy and very flavorful. My brother had the Chicken and broccoli with vegetable fried rice, wonton soup (don't think the wontons are homemade) and an egg roll. He also enjoyed his meal. I didn't eat my egg roll because I was full. The guys liked their egg rolls. I will order from this restaurant again."
    },
    {
        "id": 42,
        "text": "So let me start by saying this Chinese restaurant is splendiferous. It's probably one of the the better \"fast food\" Chinese restaurants I have ever been to. I usually have delivery for the $10 dinner special, but occasionally find myself sitting down and enjoying the neon-lighted atmosphere in the hours between 12-2am. Only minimal downside to this fine Asian syndicate is they don't really provide any duck sauce in the take-out bags. For an individual who enjoys some sauce of duck with his egg roll this can become very off putting. Other than that, it's basically the bees knees"
    },
    {
        "id": 43,
        "text": "Ok, I came here on the advice of co-workers who basically said \"Don't eat at Long River\" - which is across the street from my office.\n\nSo I trudged over the 2-3 blocks to Golden Chopstick, stood in a pretty long line and ordered a Chicken & Stringbean lunch special with brown rice to go. \"Light on the sauce\", I implored.\n\nService was friendly and the order took about 6-8 minutes to come out (not bad considering there were 7 people ahead of me.)\n\nWalked the take-out grub back to my desk and voila.  Tasteless - abut thankfully not greasy due to the lack of sauce.  Beans were the best part - crisp.  Chicken (thankfully white meat) was bone dry and flavorless.\n\nNot sure If I'd ever come back.\n\nNow I am really in fear of Long River.  This is supposed to be the \"good\" Chinese place near my office.\n\nOh well."
    },
    {
        "id": 44,
        "text": "Why the hell did it take me so long to review this place? GC is my faaavorite Chinese place ever. \n\nAs Jacquelin K. already pointed out, there's ample room to sit inside, but this place is mostly take-out. If you do happen to go in, check out the crazy fish tank in the back. The people at the counter are very gruff and business-like, but I think they secretly enjoy their clientele -- they always remember our usual order when my boyfriend and I go in. \n\nAs for the food, I love it. It just tastes... cleaner, less greasy, than other places. I can't really explain it, it's just less shady. The chicken looks like chicken. The veggies look like real, crisp, good veggies. And when you order a dish, they always PACK the extras on. You'll never have enough rice to eat all of the veggies and meat you get [and they have pretty nice take-out containers, too]. \n\nAs for delivery, they usually send a little guy on a motorbike. Just watch when using a credit card -- they often make the guy bring \"the machine\", which swipes your card and prints out a little receipt, but has been known to ghetto it up and not work on occasion. Sometimes they forget to tell the guy to bring the machine, too, so I've had to give the guy my cell phone to call the place before. So that's a little weird. Other than that, I have no qualms whatsoever with GC and will continue to fund their existence for the rest of my time in Philly. ^_^"
    },
    {
        "id": 45,
        "text": "I love the food here!  My favorite is the general tsos chicken & the steak rolls.  It is my favorite Chinese restaurant hands down!"
    },
    {
        "id": 46,
        "text": "The food is decent but do NOT do delivery. Ordered a few weeks ago, they said it'd be a half hour to 40 mins and it took over an hour. I figured everyone has an off night so tried again tonite. They said 45-an hour. I called after 1:20 they said he was on his way. He got here an hour and 35 mins after I placed the order. AND he refused to get out of his car and come up to my apt. Had to go downstairs and outside to meet him in his car. WTF?! Never ever has that happened in 8 years of living in this hi-rise building. Called to let them know of this awful service and the person on the phone was defensive. Ridiculous and we will not be returning."
    },
    {
        "id": 47,
        "text": "I live about two blocks away.  The food is pretty good, and minimally dodgy, but holy crap are they rude.  I went to pick up my little dinner, and the lady at the counter was beyond annoyed that I was there.  Additionally, they try to pull the $10 minimum on cards crap (which is actually not legal), but their ATM was broken.  She tried to make me buy more in order to use my debit card.  Sorry, no.  I was polite throughout the transaction and said \"thank you\" maybe three times throughout it, and she could barely be bothered to mumble out the bare minimum. (\"ten dollar minimum\" was about it.)  Even though this place is so close, I'll go out of my way to go to Sam at 5th and South instead."
    },
    {
        "id": 48,
        "text": "So, I order takeout from here pretty often.  It's fast, cheap, average Chinese food.  I've tried a variety of things from here and its all been very average.  I've never had anything to rave about.  It's pretty much what you would expect from a place like this and for the price."
    },
    {
        "id": 49,
        "text": "Finding a \"good\" Chinese take-out place has proven to be a hard task for HD and AP. Maybe HD and AP actually have no idea what \"good\" Chinese take-out is, but we have chosen to order from various places around the city. \n\nGolden Chopstick was recommended to us by a friend, so of course we gave it a try. Overall, we were satisfied with the pricing and the amount of food we received, but not as satisfied with the spice level of General Tso's sauce. HD ordered the General Tso's Shrimp and AP opted for the General Tso's Chicken. Both tasty, but in small amounts due to the spice level. (All personal preference here.) Delivery did take a little while longer than expected, but it was a Friday evening, so although one hour seemed like forever, it is expected. Although we may not order the same items from here again, overall we were satisfied and may venture to try other things on the menu. Check back in to see if we have an update!"
    },
    {
        "id": 50,
        "text": "$10 minimum or $1 up charge for using a debit/credit card. Lunch specials are $7.   Improve your business practices."
    },
    {
        "id": 51,
        "text": "Online order form made delivery super easy. I made a special note to make everything extra spicy... could have been hotter but still hit the spot. Will definitely be my go to Take Out Chinese spot.... delivery time was a little long... but worth the wait."
    },
    {
        "id": 52,
        "text": "Perfectly mediocre takeout Chinese.  I get the mixed veggies with tofu and yes, it does have too much oil in it but this isn't Chinatown."
    },
    {
        "id": 53,
        "text": "Dined in one night after some libations and although we couldn't figure why they didn't have won ton mein, the won ton soup hit the spot.  Had some won ton soup with noodles delivered and was satisfied once again.  Recommended after a night out on the town."
    },
    {
        "id": 54,
        "text": "While I won't be as harsh as Aaron, I have to agree with mostly everything he said. There was only one time when I actually enjoyed my food, but usually the chicken I order comes half-cold (like, half of the piece of chicken is freezing and the other half is blazing... very strange) and very rubbery, yet dry... kind of like it's not really chicken. The vegetarian spring rolls I have ordered have been decent-tasting, but very greasy. I've ordered Lo Mein a couple times, and it's all stuck together and half-cold. Do your digestive system a favor by not eating here. Ever."
    },
    {
        "id": 55,
        "text": "I agree with Scott F. This is our neighborhood Chinese spot and I have to say, the food is decent, CHEAP, and the service is great. We can order our food and have it delivered in 20 minutes. Plus, it's enough to feed the two of us for more than one meal. It's Chinese food. I have no complaints!"
    },
    {
        "id": 56,
        "text": "Good decent kinda crappy chinese food (and I mean that in a good way).  They have quick delivery, a n expansive menu and it's cheap (around $7for the combo)"
    },
    {
        "id": 57,
        "text": "I have gotten food from here over the past year.  I could have sworn I did a review of this place before, but I can't find it.\n\nThis place is within walking distance of my apartment. The food is delicious and reasonably priced.\n\nThis past Saturday I had occasion to order some takeout from here.  When I got home I noticed I had $8.00 too much change.  I took it back and they were happy to have it returned.\n\nhttp://youtu.be/-VtNivYQrVo?list=UUOwtwlsZ4FErLUQKRluyujQ"
    },
    {
        "id": 58,
        "text": "i eat here between classes a lot and their food is mostly alright, but their dinner combo (pick a protein + rice + soup) sounds awesome and cheap until you realize it's mostly onion with maybe an ounce of protein. i'm not a chicken when it comes to spicy foods but the spicy sauce is literally too hot to eat. i've been playing it safe with spring rolls and veggie lo mein recently which have both been really good, and i always wind up getting the same young woman making my green tea bubble tea and she makes it FANTASTIC. $10 card minimum"
    },
    {
        "id": 59,
        "text": "My new go-to Chinese delivery service.  I ordered from here last Sunday when I was way too lazy and tired to leave my couch.  The deal was outstanding.  I got the dinner combo of sweet and sour chicken and vegetable fried rice.  It came with an egg roll and won ton soup and was literally $10. \n\nThe delivery was prompt and they bring an iPad with them, so you can pay with your card.  I am happy to have found this spot and am v excited to continue ordering from here! \n\nDisclaimer: not luxurious or decadent Chinese, basically fast food type, so if you're into that like I am - this place is for you!"
    },
    {
        "id": 60,
        "text": "I bought off them a lot, then one day they were really rude to me because my delivery wasnt ten dollars \"the minimum\" for credit card payment. They also said they didn't deliver to the area I ordered to, even though they had before and it was close by.  Then I cancelled because they insisted I had to buy a soda to make the meal ten dollars. Sheesh you can't eat a credit card charge just once for a loyal customer? Enjoy the bad review"
    },
    {
        "id": 61,
        "text": "This place is such a ripoff. I ordered General Tso's chicken with extra staples, and all I got was one lousy staple. Never again.\n\n2 stars because the sauce was good."
    },
    {
        "id": 62,
        "text": "I ordered pork fried rice and small portion of pork spare ribs to go. \nThe pfr was so dry it was almost inedible to say the least. A surprise because most prfs' would be on the greasy side. I specifically asked if there would be egg and was told yes but I couldn't find any. \nVery disappointing. \nThe spare ribs I'd say were okay. But barely. A few of them had very little meat on them. They tasted like most quick Chinese places. \nIt's sad cause there are no decent Asian places to eat in Fairmount area."
    },
    {
        "id": 63,
        "text": "It's cheap. It's greasy. It's heavy. It's, at best, average. But it's Philly, where sub-par Chinese food is just about as good as it gets. Golden Chopstick, with its cheesy purple fluorescent lights isn't bad, but it'll never impress. \n\nIf you don't mind greasy, Americanized Chinese food, you shouldn't have any problems with GC. Most of the items I've had are okay, heaviness aside. One warning though: until they learn how to properly use a deep fryer (either by getting the oil up to the proper temperature or taking food out sooner), avoid the egg rolls, or expect a mouth full of grease with every bite."
    },
    {
        "id": 64,
        "text": "The dinner box special is a great deal... for just shy of 8 bucks you get a meal, rice, soup, and egg roll. was your run of the mill chinese food but towards the top end of that spectrum."
    },
    {
        "id": 65,
        "text": "awesome chinese food for the price you pay, love the lowmein and chicken corn soup...reminds me of Indo-chinese joints in Mumbai!"
    },
    {
        "id": 66,
        "text": "Today I ordered from here after a major snow storm. I've ordered from here countless times and normally pick the order up but because of a staff shortage needed to have the food delivered. The last time I had something delivered there was an issue with finding where to deliver the food even though I provided detailed instructions on where I'm located and furthermore I'm down the street. This time was no different. The delivery man went to the wrong location and when I told him what to do shouted at me to come outside. When he found me he screamed \"Give me the card\" and rushed me because as he explained he was busy. After paying, with no tip, I called the manager to complain and he did not apologize or say anything else other than ok. This will be the last time I order from here. If this is how you treat your customers you do not need my business and I will make sure everyone In my company knows not to give you any business!"
    },
    {
        "id": 67,
        "text": "Our go-to for delivery.  Steamed veggie or meat dumplings are super plump and packed inside - even though it's an appetizer it could easily be a meal for some.  The sauces are sweet and flavorful.  Always reliable delivery, good flavor, and almost always have leftovers for the next day's lunch."
    },
    {
        "id": 68,
        "text": "Delivery took 40 minutes and this place is 0.4 miles away...\n\nHot and sour soup is actually one of the better ones I've had\n\nBroccoli with shrimp and garlic sauce was just OK. \n\nAlso had quite the trip in the bathroom later that day... can't point fingers but I'm assuming..."
    },
    {
        "id": 69,
        "text": "This is the worst Chinese food I've ever eaten. I ordered the Bourbon chicken lunch special with fried rice and to be honest I don't even think I was eating chicken. The meat and a strange taste and the skin looked unusual for chicken. It was actually a bit disturbing and the fried rice was horrible so I just chucked the whole meal in the garbage and went to Wawa for a  hoagie."
    },
    {
        "id": 70,
        "text": "I'm upset that this restaurant changed the spring rolls.  They used to be so fantastic I'd order from here weekly.  Now they went from hand crafted to the frozen crap anyone can buy at an asian market.  No real reason to stop here anymore."
    },
    {
        "id": 71,
        "text": "So disgusted with this platter you have 65 people working in the store have one of them clean the shrimp it takes less than 2 mins if you can take the shell off you can clean the shrimp. Shrimp were over cooked as well way too crunchy no flavor just bad all around I only bit into one and I was done. Eat at your own risk this place loves refrying food instead of making it fresh."
    },
    {
        "id": 72,
        "text": "honestly an average chinese restaurant menu but had to actually post a yelp review to compliment the quality.  it was raining tonight and the restaurant along callowhill that i actually wanted to go to was closed so i figured what the heck and stopped into golden chopstick for dinner not expecting much.  the food was not super greasy and gross and i at least currently don't feel sick :)  i had vegetarian general tsos which was really great and a veg spring roll.  my meat eater friends had some chicken and broccoli dishes they liked as well.  after seeing the older reviews here about the food being gross i'm going to assume they've gotten their act together or i caught them on a good night"
    },
    {
        "id": 73,
        "text": "I think we can all agree that Fairmount is in dire need of a good Chinese restaurant.  That being said, what we're left with is Long River, the scary place on 29th (?) street whose name escapes me because I'm too scared to go in there, and Golden Chopstick.  Out of the three I take Golden Chopstick.  I've eaten both in the restaurant (only to check out where I was ordering from), and then mostly takeout.  The restaurant is clean, service is quick and the food is hot and tasty.  Plus, they never adhere to the \"$10 min\" delivery rule which is great for a single meal.  Groundbreaking, no.  The best choice in the area?  I'd say yes for now."
    },
    {
        "id": 74,
        "text": "For what it's worth, Golden Chopstick is a great place to go if you're in the Spring Garden area and are looking for well-priced yet delicious Chinese food.  Came here on a lunch break from a face painting class taught by a master artist from Vegas who was unfamiliar with the area, so everyone in the workshop decided to come here for lunch.  Thank goodness we were able to find a table big enough to seat everyone!  If I'm in the area again I will most definitely come back!"
    },
    {
        "id": 75,
        "text": "This place looks like something out of Blade Runner. Any minute I expect Edward James Olmos to come out and recruit me(Anyone remember what TV show he was on in the 80's). Sadly its not in 1982, but here in the present tense. Its dingy, its got weird/tacky neon in it. Ordering or picking up food you always feel like you better check to make sure they don't give you the wrong order. On top of that they'll make you wait while they take 5 orders on the phone. Meanwhile your stomach is grumbling and doing backflips. Unfortunately the food is bleck at best.\n\n I had bourbon chicken one time and it was more like chicken soup with bourbon flavoring and some pepper. Not to mention it was greasy. The egg rolls are extremely greasy and overcooked. The hot and sour soup is pretty much the only redeeming factor. And its really not that great, just better than the pile of greasy garbage they serve you.\n\nThere's better stuff elsewhere. You go to Chinatown, go now!"
    },
    {
        "id": 76,
        "text": "The shrimp mei fun and the teriyaki chicken on a stick is very good and the veggie spring rolls were tasty"
    },
    {
        "id": 77,
        "text": "Their dumplings and wonton soup were disgusting, thick and doughy, and the wontons weren't even fully cooked. I've made better dumplings in my own kitchen and I'm a white guy."
    },
    {
        "id": 78,
        "text": "Philly has a huge amount of Chinese places. But golden chopstick is the only restaurant I order delivery from. The soups are fantastic on days where I don't feel well or when it's gross out. Delivery is always on time or early. The fried foods, when I get them, are less soggy than others. I love the ability to order large garlic sauce on the side. Especially because I love getting the plain chicken with broccoli and using my own amount of sauce. This place is just a huge win in my book."
    },
    {
        "id": 79,
        "text": "Quality Chinese delivery. I was staying all the way in West Philly and unfortunately the restaurant couldn't deliver themselves. However, they told me to use Uber Eats and that worked. There was an expected 45-50 min wait time but it actually got here within 35 minutes. The shrimp lo mein was good, not dry. They actually had a lot of shrimp and they were big which isn't the case with take out lo mein. The size in the picture is a large, which was around ~$7. My boyfriend got the General Tso's combo which came with a side of rice (we had to specifically choose for it to be fried rice for $1 extra). We were able to choose how spicy we wanted the chicken, which was very nice. I definitely recommend this place. Food was delicious, it was hot when it was delivered, and everything was reasonably priced."
    },
    {
        "id": 80,
        "text": "I can't stand not having good delivery Chinese food in Fairmount. I was sick last night and decided that I would order Chinese. Why do people eat Chinese when they're sick? What a stupid idea. Anyway, I have only gotten china-food while living here from Mandarin Garden, which was the least terrible choice from what I had tried. I saw that Golden Chopsticks had a lot of mixed ratings, and hoped to catch them on a good day. \n\nI did not.\n\nThe Food:\n\n- Crab Rangoon: It was so overcooked it wasn't funny. I was afraid of breaking a tooth when I chomped into it. It also had that fishy smell that I HATE and makes it hard for me to order crab rangoon from anywhere else for a long time. I didn't finish it, bros. \n\n- Pork Fried Rice: Pork had a burnt taste and the rice was way way overdone. Also was made completely wrong, as I ordered it with no onion and carrot and it had copious amounts of both. Gross. How do you eff up rice, brohammers?\n\nThe Service:\n\n- Going to have to shed some blame on myself here. I had a feeling that, as most Chinese places in the city are staffed by people who speak very poor English, ordering via grubhub would be a bad idea. It was, and I won't do it again. Sorry, chinabroheim. \n\n- When the delivery guy got here, he was rude and short with me. He was knocking on my neighbors door, and called me gibbering about me not being home and wasting his time. Chill out, broseph! The delivery took way too long for Chinese food that simple. \n\nThe Rating:\n\nI give it two stars because I think I may have eaten more of the fried rice if it was made the way I wanted it to be made. I just hate onions. On the whole, though,I really do not recommend this place. Bad food, poor service. Yuck.  Why is it so freaking hard to find Chinese food that is consistently good in Fairmount!? Any hints for your bromeister general?"
    },
    {
        "id": 81,
        "text": "Hands down the best Chinese takeout since I moved to Philly. They deliver quickly and you can do it all online. The food is consistently good and always fresh. They will make it spicy to taste, and lt you ask for xtra veggies"
    },
    {
        "id": 82,
        "text": "I was just in this restaurant this weekend. I ordered food twice within 30 mins. Just chicken wings and they were DELICIOUS. HOWEVER, when I went in the second time to pick up my second order of wings, I witnessed one of the employees take a napkin to wipe her nose, took the same napkin she used to wipe her nose and used it to dry out a bowl and then put it away. And did it right out front in plain sight where the registers are. I will not be eating here ever again."
    },
    {
        "id": 83,
        "text": "Found hair in the lo mein twice. They do not wear hair nets in the kitchen. I had to stop ordering from them after finding hair in my food."
    },
    {
        "id": 84,
        "text": "Staying in on a Saturday night after some travel some Chinese delivery was in order. Of course Spring a Gardens gentrification has not progressed to the point where the neighborhood deserves gourmet Asian cousine so you get what you get. Found Golden Chopsticks and paced an order online (Removes the usual language issues.) arrived on time, as promised and ordered, and hot. Food was of good quantity and of appropriate quality for what it is. Steamed Dumplings serving was large and tasty. Fried Rice was among the best I have had in a while. Main entrees were enjoyed by both of us. \nCannot understand some of the caustic reviews, they really trivialize Yelp, but maybe I do. Giving outrageously low ratings to someone running a business because you have a self-entitled , First World Problem issue?  If you are charging less then $10 on a credit card you are actually costing them money each time they serve you. You are not a good customer. Pretty clear in their menu and adverts. Suck it up, ask Mommy and Daddy for some cash and grow up. Yelling? Have you been to China or even Chinatown? They all yell! That's how they roll. Pretty racist to expect them to act like your culture expects you hypocrite. As for delivery from a car? This area is still \"hood\" so the same rules should apply to all. Regardless, ever hear of the PPA. The revenue generators for the crooked politicians you elect. One ticket and there goes the profit for the night."
    },
    {
        "id": 85,
        "text": "Hooray for GC, which looks nicer than your average grimy Chinese take-out joint, but is your average grimy Chinese take-out joint at heart.  You can sit inside if you like and take in the ambiance of crazy purple neon lights along the windows.  They look radioactive.  I think there's a TV in there, too.\n\nHow's the food?  It tastes how the food always tastes at a Chinese place with industrial tile flooring and strange glowing photographs of anonymous plates of food above the counter.  I think they even sell those giant plastic containers of iced tea/lemonade.  That's just nasty, but their food is fine--you know how it is.  If have $5 and you want some, go get it!"
    },
    {
        "id": 86,
        "text": "I ordered from this place a few weeks ago and it was okay. Good soup and spring rolls, but my mongolian chicken was soooo salty, and I love salt. I reordered two hours ago from this place, deciding to try something new. I ordered delivery at 6:10, and it is STILL not here!!! I called 30 minutes ago asking what the deal was, and the lady said they left a while ago and it would arrive shortly. I just had to call again, and she repeated the same thing to me. I have never had to wait two hours for food before. I told her if it wasn't here in 20 minutes, I'd want a refund and she said there's nothing she could do because she doesn't know when the delivery guy would get here.\n\nThis is the worst service ever. \nYou'd think they'd try and make up for their shitty service"
    },
    {
        "id": 87,
        "text": "I'm upset that you changed the spring rolls.  They used to be so fantastic I'd order from here weekly.  Now they went from hand crafted to the frozen crap anyone can buy at an asian market.  No real reason to stop here anymore.\n\nUpdate:  I got the below note from management.  Thanks, but not a chance.  Your handcrafted spring rolls were the only thing unique.  I've tried most items on menu and just not special or worth a special trip.  BRING BACK YOUR OLD SPRING ROLLS!"
    },
    {
        "id": 88,
        "text": "Embarrassment of a establishment order chicken fried rice and general tso and was thoroughly disappointed told them to make my rice EXTRA EXTRA SPICY and there was barely any spice. Their general tso chicken was over cooked and crunchy not soft and tender. I should of known it would be a horrible experience after only receiving my food only 5-7 mins after placing my order. Very Flavorless food had to throw it away."
    },
    {
        "id": 89,
        "text": "Its 2019.\nIt's absolutely unacceptable that you cant go eat at this place for a party of 1. I attempted to order 4 chicken wings, fried rice, and homemade tea. Came up to 8.91, they require a $10 minimum to use a credit card. I order from here all the time but just happened to stop in for lunch. Never again."
    },
    {
        "id": 90,
        "text": "Hairs in my food. Awful. The food was also cold and took forever. The crab Rangoon was hard as a rock. Definitely would not go back."
    },
    {
        "id": 91,
        "text": "Our go to workplace Chinese lunch delivery and take out spot.  My fave is the Garlic sauce with vegetables and veggie fried rice, with no meat.  I find their meat to be rubbery so I only do vegetables here.  The wonton soup has a very dark meat inside also.  Lunch box deals come with in entree and soup or drink for about $6."
    },
    {
        "id": 92,
        "text": "Their dumplings and wonton soup were disgusting, thick and doughy, and the wontons weren't even fully cooked. I've made better dumplings in my own kitchen and I'm a white guy."
    },
    {
        "id": 93,
        "text": "Don't waste your time on this place. We ordered general tso and beef and broccoli dinner boxes. The general tso was more breading than chicken and the beef was flavorless. The fried rice was the only half decent thing. I wouldn't wish this place on my worst enemy. Go elsewhere and you won't regret it"
    },
    {
        "id": 94,
        "text": "Service was horrible. I called to order take out they told me due to the bad weather it might take up to a hour which was understandable I call a hour an half later and they hung up on my I called back again which now was two hours into my wait for food they said that they wouldn't be able to make it out at that time to wait another hour. Customer service sucks and the delivery driver always demands a tip!!"
    },
    {
        "id": 95,
        "text": "I've eaten here several times since it's close to my office, and it is really hit-or-miss.. (mostly miss).  The bourbon chicken is extremely dried out and chewy, not the succulent, tender dish it's meant to be.  The veggie dumplings were most likely frozen and were an off-putting green color.  The sesame chicken was not bad, and would probably be the only thing I would go back for if I am craving Chinese food.  The best thing I had there was the bubble tea, which comes in a variety of flavors.  Overall, a pretty underwhelming experience."
    },
    {
        "id": 96,
        "text": "Ehhhhhh....try to avoid at all costs.\n\nNever in my life have I had consistently bad food like this.  Dry Sesame Chicken, no flavor in the pork fried rice.\n\nWhat else can I say?"
    },
    {
        "id": 97,
        "text": "I was at this restaurant recently and was so unhappy. I purchased wonton soup. I was told the meat in the wonton soup was pork but looked uncooked and did not tasted like pork at all. I confronted the waiter but I was unsatisfied with the help I was given I wouldn't come here again."
    },
    {
        "id": 98,
        "text": "Not the best but the food is good and cheap. Can't ask for much more of a take out place."
    },
    {
        "id": 99,
        "text": "This is the best authentic place you can get dim sum. I likes it very much like San Francisco !"
    },
    {
        "id": 100,
        "text": "Lies all around. Ordered through Uber Eats, they marked the food as \"with delivery driver\" 40 minutes before it was ready (30 minutes after initial order). Never again!!"
    },
    {
        "id": 101,
        "text": "I've eaten here for years, as have the roaches that inhabit their kitchen. Good food, but the health department should make their findings of rodent fecal matter more public."
    },
    {
        "id": 102,
        "text": "Good food with really cheap price.\nIt's a nice and clean restaurant with refreshing sense. Will come back when next time visit Philly."
    },
    {
        "id": 103,
        "text": "Golden Chopstick Chinese Restaurant in the Spring Garden area should be shutdown permanently. I ate there once before I knew their history of filthy practices (see Clean Plates Philly for specific details). They were shut down for a few weeks again recently but has since reopened with business as usual. This restaurant has a great location but it is not a safe place to eat, BEWARE!"
    },
    {
        "id": 104,
        "text": "I used to love this restaurant, however recently it seems the food is not up to par. I had not had fried\nrice with shrimp in a while so decided to order some. It was the worse. The rice was horrible and the shrimp over cooked. Not sure if they got a new cook but it was not nice. Ended up throwing away."
    },
    {
        "id": 105,
        "text": "Disgusting. I found hair in my Lo Mein. I will not to ordering from this restaurant again. I question the cleanliness of this place."
    },
    {
        "id": 106,
        "text": "Not very fancy but good quality food, the orange Chicken is delicious.  Very cold place I think their heater is broken or something."
    },
    {
        "id": 107,
        "text": "Best deep fried veggie rolls & sautéed broccoli I've ever eaten! This place never disappoints."
    },
    {
        "id": 108,
        "text": "I used to love this restaurant, however recently it seems the food is not up to par. I had not had fried\nrice with shrimp in a while so decided to order some. It was the worse. The rice was horrible and the shrimp over cooked. Not sure if they got a new cook but it was not nice. Ended up throwing away.\n\nThought I would try this restaurant since my last review and the reading of other reviews. Thought they may have gotten better. NO they have not. Ordered Vegetable Fried Rice. Again the worst. The vegetables consisted of carrots, peas and onions. I could not believe it. I live too far to take back. Will never go there again and I wish the best for those who do."
    },
    {
        "id": 109,
        "text": "I used to love this restaurant, however recently it seems the food is not up to par. I had not had fried\nrice with shrimp in a while so decided to order some. It was the worse. The rice was horrible and the shrimp over cooked. Not sure if they got a new cook but it was not nice. Ended up throwing away."
    },
    {
        "id": 110,
        "text": "I wish I could give this place less than one star. Lemmie set the scene for you: it's Wednesday evening and my girlfriend and I have a midterm the next day. We look at each other and figure fine we'll get Chinese food so you know more time to study. We pull up Golden Chopstick and peep the review. Well it's meh reviews but we've been procrastinating all week so decide ok. All of the sudden one of the pictures has a staple in the food; this is red flag number 1. But you know we're poor dental students so we give it a pass. So we order the food and not only does it take an hour and 20 minutes to get to us, but they forgot her rice too. Red flag number 2. We got general tso's chicken and a veggie lo mein, you know a casual order. So I hit em up like fam, where is my girl's rice? Who the hell eats just the chicken. (My apologies if you eat just the chicken). They credit us for the rice and I'm like fine. So we eat the food and we're like ok it's what we expected. Fast forward to 2 hours later.... my guy when I tell you that there is no pain like the wrenching of your stomach and fever that comes along with it you gotta believe me. My girl dips into the bathroom faster than OJ on a publicity opportunity and locks up in there for the next 1.5 hours. My homie our toilet hasn't smelled the same since. I can't even put my cheeks down knowing what kind of fire and fury has gone into it. I'm chilling consoling my girl then all of the sudden it hits me harder than my african Mom after seeing me sit on the couch with shoes on... we need a new toilet. I had the veggie lo mein only with no meat and somehow still managed to get food poisoning just not as sever as my girl. So we lost 4 hours dying in the bathroom and probably failed our midterm. I would avoid this place at all costs fam, they need to have a health inspector come through and re-evaluate their cleanliness. \n\nTLDR: eats Chinese food, bland and not flavorful, gets food poisoning, fails exam. Avoid this place."
    },
    {
        "id": 111,
        "text": "Ordered dumplings and got loose noodles and meatballs. Somehow burnt but undercooked floppy noodles. In all honesty the person who served me this should be ashamed of themselves for taking 11 dollars from me. Nearly inedible."
    },
    {
        "id": 112,
        "text": "This place is great. Fast delivery and a great portion for the price. Food is delicious and in a convenient location. General tso chicken side of white rice and chicken steamed dumplings all for $15 !"
    },
    {
        "id": 113,
        "text": "They honesty never disappoint me. My food is always correct and warm for pickup.The food is actually very good and the staff is great. The place is pretty clean and well maintained."
    },
    {
        "id": 114,
        "text": "I've been coming to this place for about ten years now. Just as delicious as my first time. So many vegan options. I love the variety of the veggies. Zucchini, mushrooms and celery in my curry tofu yum! Make sure you check out the lunch and dinner specials! ..and the bubble tea!"
    },
    {
        "id": 115,
        "text": "Horrible place nasty food and bad service. Just because they are in a nice neighborhood does not give them the image of good place. Cheap awful food. Bathrooms are disgusting"
    },
    {
        "id": 116,
        "text": "I was recently vacationing in Philadelphia and stopped here on our way back to the hotel. The food was hot and fresh. We all enjoyed it."
    },
    {
        "id": 117,
        "text": "Good food for a good price. The only place around that actually had the right amount of heat on their general tso!"
    },
    {
        "id": 118,
        "text": "I ordered the Sichuan Tofu.  On the menu, it shows two hot peppers next to this item.  This lead me to believe it would be at least moderately spicy.  Unfortunately, there wasn't as much heat as I hoped.  The service was friendly.  But since I ordered with a group, our food took much longer to be served.  The food portions were generous considering the price.  And not surprising, the quality of food was sacrificed.\n\nIf you're in the mood for Chinese, not looking to spend much, and aren't ordering in a group, Golden Chopstick should work out."
    },
    {
        "id": 119,
        "text": "If you're looking for solid, budget-friendly takeout Chinese food, this is your spot. Especially during the current covid-19 crisis - they have takeout and delivery available with easy and safe pickup.\n\nOver the past few years, I have been there somewhere between 10 and 20 times, and I've always been happy with my order. The restaurant itself is not in the greatest condition, so I recommend takeout or delivery. They have a very user friendly website for ordering, which I appreciate for ease, especially right now.\n\nYes, this place isn't fancy, but the food is consistently good, they have great prices, and they are reliable in the sense that my orders are always correct and made on time.\n\nI recommend the wonton soup, chicken and broccoli, any of the lo mein, and the fried chicken wings. My boyfriend loves these even though they are most definitely not Chinese food :)\n\nI will keep supporting this business knowing they are working hard to make good, affordable food, especially during this time!"
    },
    {
        "id": 120,
        "text": "Definitely recommend sesame tofu for those that want something on the sweeter side. Fried rice on the side was amazing!"
    },
    {
        "id": 121,
        "text": "This is the best Chinese takeout in Philly, period. No one can compare to their classic Americanized Chinese food. General Tsos is always crispy and filled with white meat, pork fried rice always has that great Wok flavor to it, ignore the haters!!"
    },
    {
        "id": 122,
        "text": "If I could I would give this place ZERO stars. These people are very nasty. I do not eat onions I never have, never will, they made a mistake by putting onions in my food and got very upset when after the food was delivered to me I drove back to return it. The woman at the counter was very nasty and did not know that I was fluent in Chinese and called me an idiot. Cursed her completely and left the store, will never order from here again. Do not order,these people are so rude."
    },
    {
        "id": 123,
        "text": "PSA: METAL BOLTS FOUND INSIDE DUMPLINGS. BUYER BEWARE! Unless you enjoy hardware in your take-out. \n\nFormally complained to the manager, Anthony. He responded that owner would call us back but never did.\n\nThere's lots of Chinese places in the city. Not sure why you would ever order from this one.....ever."
    },
    {
        "id": 124,
        "text": "I'm normally please with Golden Chopsticks food but the customer service is worsening.Today I was told by delivery that they can not deliver to my office in Center City because the driver has never been in my building.. WHAT?? I order from this restaurant several times a month and I'm feeling a bit bitter because every time I order the driver gives me another reason why I can not get my food. This restaurant is only 5mins away driving.. unacceptable service!!1"
    },
    {
        "id": 125,
        "text": "Solid Chinese American food . Portions are large, cheese steak  egg roll was good. Would order again for bc sure!"
    },
    {
        "id": 126,
        "text": "FINALLY! Chinese food that isn't chewy and unidentifiable. I needed to cure my hangry lunch woes and decided to order from golden chopstick. So glad I did, ordered chicken and broccoli which did not disappoint one bit. Sexy chicken pieces, fresh and plentiful broccoli, and sauce that makes sense. Your usual chinese store prices. I'll be ordering from them in the future for sure."
    },
    {
        "id": 127,
        "text": "They've been our go to Chinese food place for the past couple years. Consistently good food. Their meat is always good clean cuts which is very important when it comes to Chinese food. They're fast, accommodate to custom orders such as extra spicy etc."
    },
    {
        "id": 128,
        "text": "Have been here a few times and always get super hot and fresh food. The restaurant is new and clean and man do they have an operation going on in the kitchen. Impressive to watch what they have going on when picking up my food. Love the portions and prices! Always feel like there is so much for leftovers!"
    },
    {
        "id": 129,
        "text": "One of my favorite places to get delivery in Philly. Portions are always good, food is always fresh. I highly recommend their pork fried rice, very tasty."
    },
    {
        "id": 130,
        "text": "Golden Chopsticks has okay Americanized Chinese food. I've definitely had better takeout Chinese. Every time I've ordered from here it seems like it's missing something compared to other Chinese takeout places. \n\nI ordered the Kung Pao Chicken spicy and it was pretty good. Everything was well cooked and perfectly spiced. There was too much sauce, but that's fine. \n\nGolden Chopsticks is able to modify the order as well. So you can add or remove any ingredients!"
    },
    {
        "id": 131,
        "text": "What you would expect. Nothing was really good and nobody wanted the leftovers. First and last time coming here. \n\nEverything tasted way too greasy or was just flavorless."
    },
    {
        "id": 132,
        "text": "The store has moved to 490 N broad street-Suite 3.\nThe food is still nauseating and horrible!!!!! The chief got the COVID but still work in the kitchen!!!!! So horrible restaurant!\nThe Hong Kong owner is against gay, often sneered LGBT and black people in chinese!!!!!!!!!!!!"
    },
    {
        "id": 133,
        "text": "Golden Chopsticks was my go-to Chinese place when I lived in the Art Museum area for five years. The staff is so friendly and efficient. I believe they are currently moving to or just moved to 490 Broad Street and their location on 18th and Spring Garden is no more. I am not sure if they are open yet, but I am counting the days until they are! I'm a huge fan of their vegetable lo-mein. Their portions are big and the prices are great. I always randomly crave Golden Chopsticks and I'm yet to find a Chinese American place I like getting for delivery more!"
    },
    {
        "id": 134,
        "text": "Good chinese for a great price! If your in the Spring Garden area I highly suggest to get your chinese craving fix from here. Got the Wonton Soup, Shrimo Lo Mein & Black Bean Chicken. Wonton soup meat could have been better but overall was a great take out meal!"
    },
    {
        "id": 135,
        "text": "An unsung hero among Chinese food in the Fairmount area. I think the average three star rating here is off. I am giving five stars for delivery only. This is some of the best Chinese takeout food I've ever had in the city.\n\nLet's start with the vegetable dumplings. Usually at a Chinese restaurant, vegetable dumplings are all dumpling and shreds of  cabbage stuffed inside. You can actually see and taste the vegetables in these dumplings.\n\nMain courses also deliver. I ask for a special order... Chicken with string beans in white sauce. Outstanding! A small portion is actually two meals for me.  And vegetable lo mein is great... Not too oily.\n\nI cannot speak for the ambience. I've never eaten in, I get the impression this is just a takeout and delivery place for the most part."
    },
    {
        "id": 136,
        "text": "Updated review. I wrote one a few months ago and got a response from Anthony Cheung, a manager. You can read his comment below. I'm not sure if he's the owner or the owner's son. But they should get someone else to handle Public relations. While theyre at it, they should hire someone to help oversee health and safety.  This A hole replies by apologizing for it not being up to my standards and and that it's just basically my own opinion. He ends by saying that reviews like mine make a difference on small businesses. And I agree, good and bad reviews SHOULD HAVE AN IMPACT. You really should VALUE your customers' opinions. You basically put it back on me and I've seen you do it with other negative reviews. How about instead of wasting everyone's time with your insincere comments, you spend the time cleaning up your place? Dude, your bathroom is still the bathroom straight out of trainspotting. I'm sure you still cook vegetables that have gone bad. Do you still have the fish tank that's half full and looks like the bottom of a swamp? Are your register clerks still rude as hell? Is your kitchen still gross with bugs on the backsplash? As I mentioned before, yes you should care about how these reviews affect your business. You should care about the community that you serve! And you should care about your place!!"
    },
    {
        "id": 137,
        "text": "I lived in the neighborhood for over ten years. It was good and it seemed pretty clean. As time went on, that seemed to change. Their prices went up. They have more restrictions like the atm minimum, the main space has gone downhill, they mainly deal with take out, and the young people they have dealing with the customers are just plain rude. All the while I'll see the the owner's son showing up to work in a nice Mercedes SUV. Clean the f-ing bathroom!? There bathroom is filthy. They have cockroach traps out in plain site in the bathroom. And they have an aquarium right inside the entry that has could give James Cameron's underwater explorations a run for his money. Not surprisingly they were closed down last year for health code violations. It wasn't long that they were back at it again. I'd stay away from this place if you want to maintain your health. It was alright while it lasted but the owner and his family needs to put some time and money back into this place and have some effing respect for their community and customers!"
    },
    {
        "id": 138,
        "text": "This is my favorite Chinese takeout in philly. Always on promo on Uber eats too. Saves me many nights when I have no groceries. Great prices good service. Yummy sticky rice. Wonton soup is super good too. Personal fave. We've tried a few places and this one is the best. We get lo mein and chicken fried rice. So good! And best value. Thank you!"
    },
    {
        "id": 139,
        "text": "This place is great for the value! It's classic Americanized Chinese food, which I tend to crave sometimes. I ordered the General Tsao's dinner box, which came with the vegetable fried rice, wonton soup, and a spring roll. The quantity was good for $9.50, and it was enough to make two meals out of it.\n\nThe spring roll, wonton soup, and rice were typical, not too special, but decent. The chicken was the best part, the perfect texture and with a lot of sauce. Would recommend for a quick meal or if you're craving american chinese food."
    },
    {
        "id": 140,
        "text": "I would rate 3.5 starts. I love that they have so many tofu options and the tofu is cooked well. I ordered mongolian tofu and it tasted good but way too many onions. I would definitely order again but ask them to go lighter on the onions."
    },
    {
        "id": 141,
        "text": "I haven't been here in years, but I'm glad they didn't lose their touch. I used to love their steamed vegetable dumplings, I ordered them a couple of days ago, and they tasted just as good as I remembered. This place, has always had some of the best fried rice, I ever had, (it's  not greasy), and the food is hot and fresh. This is not a high end Chinese restaurant, but for the price point, the food is hot and delicious. They deliver quickly."
    },
    {
        "id": 142,
        "text": "5 stars for the price and speed. 1 star for the quality. If you are a poor busy student who aren't picky about food then this is a place for you! I got a big portion of lo mein, fried crab cheese puff and hot sour soup all less than $15. But none of them tasted good lol... Im spoiled by Asian food growing up so this is a no...."
    },
    {
        "id": 143,
        "text": "They have chicken lo mein that's literally at the level of a habachi restaurant. Along with the best sweet and sour chicken I've ever had"
    },
    {
        "id": 144,
        "text": "I LOVE this place, I've lived in Philly for 5 years and it's by far the best chinese place I've gone to.  I don't remember a time when the food hasn't been good there, although I usually stick to a couple of favorites.  The lo mein (varying kinds) always tastes like it has been cooked and mixed up fresh, and the general tso's (which is my favorite chinese) is great....a little spicy, but not overboard, and the chicken is never overcooked.  I've ordered from here on multiple occasions and still haven't had a time when it's bad or even subpar.  Make it your new chinese spot!"
    },
    {
        "id": 145,
        "text": "I came out with two grocery sized bags of food for 54 dollars. Either the food was fantastic or I was starving. I would definitely eat there again."
    },
    {
        "id": 146,
        "text": "I don't know what kind of meat they use for the sichuan beef...but...eww. Definitely the last time I order any meat dish and probably any dish from them. The meat wasn't fully cooked and some had a certain tang like it was past the expiration date. The only way I can figured out the color and texture for this meet is if they boiled it and then added it to the wok/pan with the veggies. Otherwise...I'm at a loss as to how this is beef. \n\nNever again."
    },
    {
        "id": 147,
        "text": "I WAS the biggest fan of Golden Chopstick Chinese Restaurant, I Would promote it to everyone in the area. I haven't had it in a while but tonight I decided to stop and get myself and the kids some shrimp fried rice and shrimp rolls! The shrimp rolls were great! The rice was ok minus the shrimp they were all mushy and over cooked! I picked all of them out to enjoy the rice. Hope this one a one time failure because I love good Chinese food randomly."
    }
]