[
    {
        "id": 1,
        "text": "My first trip to Susanna Foo was at 6 months old when the restaurant was still a hole-in-the-wall takeout joint owned by Susanna's parents. My parents have been taking my brother and I ever since. I have many fond memories of Susanna fashioning dolls for us out of the linen napkins and preparing Chicken with Cashew Nuts when we refused to eat anything else. The food has always been reliable, but now that I am an adult, I find it lacking excitement. The service is always impeccable and I have never been disappointed by the overall decor or ambience. I'd like to see Susanna improve upon some of her traditional recipes by either adding new flavors or perhaps returning to her Chinese roots with a more ethnic menu. I'm hoping there will be a revitalization and that I will come to love Susanna Foo as much as I did as a child."
    },
    {
        "id": 2,
        "text": "Susanna Foo is a great upscale Chinese restaurant; this ain't your grandparent's chinese food.  The interior is a subdued contemporary design,  and great for romantic dinners or a family outing.  The food and service are excellent, many of the classic American-Chinese dishes but with superior ingredients.  There is also a great deal of innovative dishes (and cocktails) as well.  \n\nIf you want to have amazing Chinese cuisine, definitely check out Susanna Foo's."
    },
    {
        "id": 3,
        "text": "I really can't say enough about Susanna Foo. I had heard mediocre things but the place blew me away. Everything on the menu looked good and we licked every plate clean. Start with the dim sum style dumplings and don't skimp. We didn't have enough. The light, fresh, fusion twists on Chinese classics are amazing. We also downed the desserts which though not as good as the main course were pretty darn good."
    },
    {
        "id": 4,
        "text": "An exciting blend of Asian and Western cuisines, served in a stunning space featuring stone and glass, silk lanterns, arrangements of fresh orchids, and an impressive collection of Chinese art. Start with seafood wonton soup, a miso-like broth brimming with ginger-filled dumplings, or curried chicken ravioli with grilled eggplant. What seem to be odd combinations prove to be inventive, and delicious, creations - smoked duck with endive, spicy shrimp with sweet pear curry, sesame seed-encrusted halibut filet with crunchy French beans and tomatoes in a lemongrass sauce. Noodle dishes and stir-fries are impressive. One area where they really shine is one usually ignored by Asian eateries - dessert. Ginger creme with strawberries, hazelnut meringue with milk chocolate and champagne-poached kumquats, and fresh mango and blueberry cake are options that warrant serious consideration. As glamorous the decor and delectable the cuisine are, this loses a star for its far too small portions at much too high prices. Heaping more on the plate or lowering the tab probably would make this a more frequent destination instead of an occasional special event."
    },
    {
        "id": 5,
        "text": "I went here for a New Year's Even dinner.\r\n\r\nGood chinese/french fusion fare.  I'm not a fan of the stuffy atmosphere though and I probably won't go again because the food didn't wow me enough."
    },
    {
        "id": 6,
        "text": "I'm so sad this restaurant closed. It was really amazing. Thank you Susanna for many years of very fine meals."
    },
    {
        "id": 7,
        "text": "We attended a pharmaceutical dinner several months ago and the food was rather disappointing. Most of the dishes had a fusion of chinese and european styles. We were served a five course menu and all the dishes were quite small in portion and not too impressive to remember. I do have to say that decor was quite impressive and beautiful with the red silk lanterns hanging from the ceilings."
    },
    {
        "id": 8,
        "text": "Appetizer crab cake was not so good.  Huge and devoid of flavor.\n\nShrimp main course was delicious.\n\nService was good.\n\nPlease remodel, or at least turn off the music--it was like a gnat buzzing around our table."
    },
    {
        "id": 9,
        "text": "Wow - I coulda sworn i reviewed Susanna Foo a looooong time ago, but I guess not.  Anyhow - went there again (3rd time) last night and sat putside - which I usually never do.  It was a surprising lovely evening.  I had been here twice before for lunch - which was good but maybe only 3 or 4 stars.  \n\nLast nite's meal solidified the 4 stars.  Service was wonderful and attentive (maybe because they are slow in the summer??).  We stated with virgin Golden Pineapple Mojitos which were truly delish.  FRESH pineapple juice and mint - perfectly balanced.\n\nMy dining companion was a close friend from out of town who walked by and wanted to go here.  She is very health conscious and ordered the salmon in a light (not too salty) black bean sauce over a crsip tender bed of TERRIFIC baby bok choi.  It was accompanied by a Cocunt \"polenta\" that was so silken it tased and felt like coconut flan.  Almost dessert like.\n\nI had a started of an Ahi Tuna Sampler (which I have ordered before and I just love it.).  At $17 it is small and expensive - but the quality of the tuna tartare and the fabulous accompaniments make it somehow worth every delicious teeny morsel.\n\nInstead of an entree I had the COMPOSED  $12 salad with golden beets, candied Walnuts, sliced yellow tomatoes, microgreens in a delectable, sweet but not cloying , light vinagrette.  The salad came with 5 small goat-cheese wontons - that looked like over-stuffed tortellni.\n\nI ate 3 and gave 2 to my partner.  They really didn't do much for me.  The goat cheese inside was almost like a bleu?  Goat gorgonzola maybe?  Too strong.\n\nBut the salad and all the other compnents was terrific.\n\nIf you think Foo is past her prime or somehow not \"all that\" anymore - I urge you to give it another try.  At dinner.  (It was way better than the 2 lunches I had previously.)"
    },
    {
        "id": 10,
        "text": "Great place to take your Grandma to for Mother's day.  At least, mine liked and ate everything she got.\n\nFirst course Madame:\nPork Potstickers.  Tasty and a good portion of 6.  Ate some of gramps's goat cheese/scallop/fig wontons.  I liked those though you mainly taste the goat cheese, which is how goat cheese can be and I like it.  Just to warn anyone who is more interested in the scallop taste.  \n\nSecond course:\nMu Shu Pork with brandy hoison sauce.  Very good (I'm a sucker for those scallion pancakes), not anything you couldn't get up in china town but they don't even pretend and label it as Classic. \n\nDesert?  Why, yes of course.  I shared the chocolate sampler with my Aunt and Grandmother, which was perfect.  White chocolate soup for Grams (suprisingly she ate the whole little cup full), mini cake, truffle, and chocolate bites for me and Auntie.  Complimented by Oolong in my own little iron kettle.\n\nIf you want to go just to get Wow your Socks Off chinese food, Don't.  That's not what you pay for.  The true chinese dishes are good, but no better than a really good take out place.  This place is about putting a spin on Upscale dining but still having a staple like Grilled Filet Mignon on the menu to please everyone in your party.  Very attentive waiters (Augustine was so nice!) and big open rooms with nice decor.  \n\nI've eaten at better upscale places but it was good.  The menu does play it safe but I think it works for them and is needed to still lure regular upscale diners to a place that offers chinese food."
    },
    {
        "id": 11,
        "text": "Took my friend here to celebrate her birthday during a lunch break. They served fusion asian food, but I wasn't really impressed with it. I guess that given my experience with eating asian food, the food, for the most part, taste just like expensive chinese food that's decorated a little better. I don't recall anything that blew me away. But the food isn't bad either... just that I wouldn't spend the premium dollars on something that's slightly better than something I can get at Chinatown for a lot cheaper."
    },
    {
        "id": 12,
        "text": "We tried Susanna Foo this past weekend & after hearing the rave reviews, I thought we were in for a treat! There was a good-sized group of us, the waitstaff was indeed phenomenal. But, the venue was very loud and made it difficult to hold a conversation and the tables and patrons are crowded. Unfortunately by the time we sat down (we had a 7:30pm reservation on a Saturday) the chef was already out of the fish entree I wanted to order. I asked the waiter if I could substitute any other fish but keep the rest of the order (looking forward to the delicious-sounding sauce I'd chosen), and was informed that the chef would not do this. So, since I was holding up the rest of the table I made a quick decision to go with something completely different (scallops) and ended up giving about half of it away."
    },
    {
        "id": 13,
        "text": "You know what? I'm giving it five stars just because I liked it. A lot. And coming from a girl whose Chinese food interests start and end with \"sesame tofu from Lucky's takeout in West Philly,\" that's saying something.\n\nI came here for work for an event sort of thing, so we had a three course fixed menu.  The salad was deliiiicious.  The kung pao chicken and rice were SO YUMMY. The flavoring was perfect (perfect in a this-was-so-delicious way... I actually don't know what kung pao is supposed to taste like). And somehow I managed to eat the meal with chopsticks without dropping it all over myself. Points for me AND the food. \n\nI had raspberry and chocolate sorbet for dessert. It was as good as it probably sounds right now. Nothing overly decadent, but really good meal-ender nonetheless. I love the chocolate-dipped fortune cookies, as well. \n\nAnyways, if I didn't normally hate Chinese food, I would give this place four stars. But it deserves the extra star for how much I enjoyed something I generally don't like. The decor and atmosphere were very chill and airy. I would go back."
    },
    {
        "id": 14,
        "text": "Susanna Foo had been on my list of places to try for quite awhile but I never deemed it pricey enough to make it a good bargain to go for Restaurant Week. Overall, I felt that we had a positive experience with very good food but that it didn't live up to the hype that it gets. I will say that I found it far better than Buddhakan in both food and atmosphere. As far as the food goes, we had the Dumpling Sampler for 2 and Seafood Wonton Soup appetizers, the Szechwan Prawn and Scallops, Mongolian Lamb, and Pheasant entrees, and the Creme Brulee, Raspberry Caramel Tart, and Sorbet desserts. All dishes received positive reviews except for the Seafood Wonton soup which was deemed too salty. The service was friendly and professional but I found it to be fairly slow especially for a Tuesday night. The meal lasted about 1hr 45 minutes for a standard 3 courses. Also, Susanna Foo herself walked through the dining room while we were there but did not stop to greet any of the patrons, which I felt was a little unprofessional. In the end, I enjoyed the food enough that I would return in the future but with so many other good options to choose from in Philadelphia, I more than likely won't."
    },
    {
        "id": 15,
        "text": "Susanna Foo, I love you!  I went last night for Restaurant Week after having wanted to go to SF's for a long time now.  The decor is cool - very modern but still with a Chinese flair.  The staff is very nice, especially our waiter, Sun.  He was extremely friendly and helpful.  The service was also prompt.\n\nThe dinner was fantastic.  I got the pork ravioli appetizer, which was basically a bowl of mini pork wontons with some corn and cheese on top.  Yummy.  Then came the main course - braised short rib with Chinese five spice, zucchini, coconut polenta, and green beans.  This was FANTASTIC.  The beef melted in my mouth, and the five spice on it was perfect.  My only complaint was that the dish was supposed to have brussels sprouts instead of green beans, but they ran out of the sprouts (a man at the table next to ours was similarly disappointed).  However, the perfectly cooked, mouth-watering short rib more than made up for the lack of sprouts, and the coconut polenta was really good.  The dish was also beautifully plated.  \n\nFinally, came dessert: molten chocolate cake with vanilla ice cream.  It was sinfully decadent, and it was the perfect portion size.  Just enough to satisfy but not too much to overwhelm (or make your pants get tight).  Yum, yum, yum.\n\nMy boyfriend got the hot and sour soup and the kung pao chicken, both of which were delicious, and he got the sorbet, which came with mango sorbet, some sort of passionfruit/berry sorbet (hard to tell which, but very tasty), and coconut ice cream.  The hot and sour soup was perfect - spicy enough to leave heat in the back of the throat, but not so spicy that your mouth burns after you eat it.  My boyfriend's sister got the hot and sour soup with the jumbo shrimp and coconut rice (also very good) and the sorbet, while his sister's friend got the pork ravioli and the salmon main course (also delicious) with the chocolate cake.  Everyone loved their meal, and we were all very happy with the service.\n\nRestaurant week is great b/c we got to eat all of that food for only $35 per person.  Normally, the prices at Susanna Foo make the restaurant too expensive for us to go to.  In fact, as delicious as the food is, I probably wouldn't pay $20-29 per main dish for the food there.  It's good, but the ingredients don't cost them that much, so I think it's a huge mark-up.  Plus, the wine is $8-17 per glass (it'd probably be cheaper to just buy a bottle) and cocktails are $10.  I got a cocktail - the Empress, a mixture of orange-infused vodka, pomegranate juice, and jasmine.  It was very good, not too sweet, but I only got one because, well, $10 for a small mixed drink is what they charge in NYC for drinks, not what they should be charging here in Philly.  I would have gotten wine, but the cocktail was cheaper.  I also got jasmine tea with my dessert, which came out in its own individual teapot and which tasted great, but I was surprised when we got the bill that it cost $3.75.  I mean, seriously, almost $4 for tea?  \n\nAlso, don't expect traditional Chinese food here.  This is a fusion place, with food that is Chinese mixed with French techniques and Western ingredients.  It's definitely tasty, though.\n\nLong story short, the food here is absolutely fantastic, but I think it's a little over-priced.  If you have money to burn, though, by all means, you should try this place."
    },
    {
        "id": 16,
        "text": "The tables are covered in white linens and the waiters wear tuxes - this isn't the typical bar/restaurant I would go to, which is why I went for Center City Sips. I thoroughly enjoyed the vegetarian and pork dumplings and the red wine. They are apparently in the process of applying for outdoor seating."
    },
    {
        "id": 17,
        "text": "Just took advantage of the Philadelphia Restaurant Week Special to sample this restaurant again after a two year hiatus.  I must say I am still impressed, and would classify it as one of the top 10 restaurants in Philly, and certainly the most outstanding Asian (next to Buddakan, of course!).  The continental touch (delicate seasonings and sauces) only brings out the best in the quality and variety of the dishes on the menu.  Sweet potato Somozas were light, flavorful, and enhanced by a yogurt dipping sauce and a vinegary salad. A 10 vegetable hot and sour soup was substantial, yet light and tasty.  The crispy shrimp entree was a perfect blend of tempura and Thai sensibilities.  The hot chocolate cake dessert added a final flourish to an exceptional meal."
    },
    {
        "id": 18,
        "text": "I don't really have too much to say about this place. The service is excellent but the food was very unimpressive. I understand it's supposed to be fusion and not authentic Chinese food but fusion doesn't have to mean flavorless. Their hot and sour soup was beyond tasteless. My brother had the lamb and it tasted strange....like it's been frozen for a long time. I had the duck and it was the first time I didn't finish a duck dish and he didn't finish a lamb dish. \n\nFor good service, clean and classy atmosphere for the big bucks, this is the place. For good food for cheap....and if you're willing to sacrifice some of the other amenities, head to Chinatown."
    },
    {
        "id": 19,
        "text": "I took my fiancee here for her birthday. It was a weekday so no problems getting reservations. There were 2 other parties there when we got there. The server was excellent. He wasn't overbearing but was there when you needed something. I told him secretly that it was her birthday so they brought her cake with a candle on it and her name spelled out on the plate in chocolate syrup. Nice touch.\n\nFoodwise, I came in with high expectations, so I think I set myself up for disappointment. We got the dumpling sampler appetizer, who can resist dumplings? Those were excellent. Our entrees were good, but not worth the price we were paying. Overall a good experience for a special occasion, but would go here otherwise."
    },
    {
        "id": 20,
        "text": "Definitely upscale.  Doesn't taste all that Asian or Chinese, but good food nonetheless.  A more creative or tantalizing menu would earn it another star in my book.  I enjoy the decor and it seems decently managed.  High price is not that outrageous considering its prestigious Restaurant Row location, caliber, and lovely environment.  You can see the wine cellar downstairs on your way to the clean and WONDERFULLY appointed restrooms."
    },
    {
        "id": 21,
        "text": "I've been here a couple times and have been impressed on each occasion. The service was a little arrogant. \n\nThe tea smoked duck was unbelievable. So was the size and flavor of whole sweet and sour fish."
    },
    {
        "id": 22,
        "text": "Admittedly, I went in a little skeptical, as I am of all Chinese restaurants that accept credit cards and offer sparkling water.  I was pleasantly surprised with the appetizers.  We had a group of about 8 and they put a nice selection together of their dumplings - my favorite being the Chicken and Mushroom with truffle sauce.  My uncle, who is a connoisseur of hot and sour soup, said the flavor and consistency was right on but they were missing a few key ingredients ... black tree ear fungi, the golden needle, and the red pepper flakes.  My entree was unfortunately very disappointing.  It was a striped bass over a paperdelle pasta, which is my favorite pasta.  It was over cooked and salty, without much other flavor.  Thank goodness my father loves me too much to let me starve, and he gave me some of his rack of lamb, which was truly amazing.  I guess if you go here, just be prepared for some inconsistency in quality.  \n\nLastly, the china they set the table with was absolutely beautiful.  Might be what I liked best about this dining experience."
    },
    {
        "id": 23,
        "text": "We stopped by this place during the last restaurant week here in Philly and boy am I glad we did. The meal, from what I can remember, was whatever special they had for that week. The two dishes I recall the most were the soup which was a butternut squash with some chili oil and the entree was a pork tenderlion dish. I remember the pork being very good, but the soup was out of this world. Maybe it's because I've never had it before but wow I couldn't get enough of it. The better half got the fish special and the soup also. I remember he saying that it was incredible too. Now, keep in mind we've been together for the better part of 14 years and I have never heard her rave about fish. For that matter I've never seen her order a fish entree let alone gush about how great it tasted. My suggestion would be to check this place out during the next restaurant week since it can be on the pricey side. But, based on our experience we would definitely go back anytime."
    },
    {
        "id": 24,
        "text": "Excellent Chinese food.  Great Location."
    },
    {
        "id": 25,
        "text": "Susanna Foo has been called the greatest Chinese chef in America and her restaurant on Walnut Street in Philadelphia is certainly as chic, stylish, and sophisticated as her clientele. Thankfully we made a reservation because it was packed last night with suit-wearing gentlemen and nicely-dressed ladies. Frank, Sandy, and I got a table up front with a great view of the entire restaurant. Zagat reviewers always rave about Susanna Foo, but of the four times I've been there, I was the only Chinese person there! Even the servers weren't Chinese; I think they were Latin. Everyone seated was Caucasian and I'll bet many of them were Zagat reviewers. \"My rice dish said it was spicy, but this isn't spicy at all,\" Frank said. \"They tone down their spices a lot,\" I said, \"otherwise their clientele wouldn't like it. This is a gentle introduction to Chinese food.\" I've never had a bad meal at Susanna Foo, but this isn't Chinese food. It's more like Chinese-inspired food and I believe this is what steak and potatoes-eating America really wants in Chinese food, that is. Chinese food prepared French style with lovely sauces and beautiful platings. The Dumpling Sampler for Two is a must. You get two each of six different dumplings filled with pork, shrimp, chicken, lamb, mushrooms, or veggies. All of the dumpling varieties look very different from one another. Susanna Foo's Crab Cakes were very good, but not quite like the Thousand Corner Crab Cake I had in the past that was more Le Bec Fin-like with its moussed crab ball and jumbo lump core. My Raspberry Caramel Chocolate Truffle Tart complemented my glass of Lilly Pilly Noble Blend perfectly. In the end, I didn't care that this was not Chinese food. It was good food."
    },
    {
        "id": 26,
        "text": "My girlfriends and I went to Susanna Foo for Restaurant Week reservation #1. Decor is great, loved the beautiful plates that were on the table (even though they were cleared immediately). \n\nService was very disappointing. Our waiter took quite a while to come over to us at all. When he did, he took our wine order without giving us menus. By the time we got our wine and menus, we were starving. He was semi-present all night.\n\nFood was excellent. I had the butternut squash which was the best I've had. Entree was beef shortrib, which I could cut with a fork since it was so tender. For dessert I had the molten chocolate cake which was very good. Everyone else was happy with their food, but the only other thing I tried was the chicken dumplings, which were great.\n\nI'm not sure if I'd go back, because I definitely like Buddakan better for Asian fusion. It was a good, not great, experience overall."
    }
]