[
    {
        "id": 1,
        "text": "Fabulous meal! Tender beef, crunchy broccoli, zesty General Taos Chicken. Yummy pork dumplings served with a sprinkling of chopped green onions. A cool respite from the heat outside. Efficient and polite wait staff. Clean with ample seating. An undiscovered treasure near the 40th Street Field and University of Penn campus!"
    },
    {
        "id": 2,
        "text": "The dim sum menu items and soup dumplings are delicious. Very convenient location since it's close for students on campus, rather than chinatown. I would definitely recommend the Shanghai dumplings. Yum."
    },
    {
        "id": 3,
        "text": "So glad to have this new option in university city for Chinese food! (most other alternatives serve greasy, overly saucey Chinese food)\n\nShanghai Station's entrance is down a flight of stairs and the restaurant itself is situated under a hairdresser / subway. Nara used to be there, known for their sake bombs and drunken college nights (or so I've heard); Shanghai Station seems to want to keep up the drinking part of it, heavily advertising their drink specials and with a darkish interior decor interspersed with disco-y lights. Wasn't expecting too much of the food, especially since they seem to be, as a restaurant, more focused on their alcohol selection, but I was so pleasantly surprised with their food.\n\nTo preface my later comments about service of the restaurant and for context: we came in a huge group of 20 people. We ordered the pork soup dumplings (小籠包), the crab meat soup dumplings, Dan Dan noodles, Chinese broccoli, broccoli with beef, shrimp fried rice, scallion pancakes and crystal shrimp. \n\nHighlights: \nPork soup dumplings - they were absolutely delicious! Each order comes with 6 dumplings, and it came out steaming hot. My usual pet peeve with these kinds of dumplings (and I'm pretty picky with them because I was spoiled with good food in Hong Kong) is when they have super thick dumpling skins. It was not the case with these - the wrappers were delicate and thin, holding the hot, rich soup that spurts out when you bite into them. Would highly recommend! My only complaint would be that they didn't bring out the vinegar dipping sauce with this dish, but make sure you ask for it because a soup dumpling would not be complete without a dash of vinegar and thin ginger strands.\n\nCrab soup dumplings - basically same as above, but with a distinct crab flavor. \n\nDan Dan noodles - they used a softer type of noodle to make this dish compared to the usual type, and I have mixed feelings about it. Taste was solid though, but I'd suggest going to the Sichuan restaurants if you really crave the authentic type of Dan Dan noodles.\n\nChinese broccoli - this type of vegetable (芥蘭) is probably one of my favorite types of vegetables, and it bears little resemblance to broccoli, so the name might be confusing. It's lightly sautéed in garlic, nothing too fancy but really good. Serving size is a little small though! \n\nService - the soup dumplings came out pretty quickly, but we waited a long long time for the other dishes. We were in a huge group and they just opened, so I wouldn't hold it against them too much. Throughout the meal the servers were also pretty good at refilling water during the wait. \n\nAll in all, a good, affordable option for some good Chinese food! Definitely get the soup dumplings, the crystal shrimp / broccoli with beef were alright but I'd recommend trying other dishes since they have a pretty expansive menu!"
    },
    {
        "id": 4,
        "text": "I usually get take-out from here, and it's super quick! They'll let you know exactly how long it'll be ready in and the price is decent. I haven't tried out the karaoke system nor the bar here yet. The food is okay in my opinion."
    },
    {
        "id": 5,
        "text": "Visiting and exploring Philly with our son who will be attending Drexel in the fall. We will definitely eat here again. The soup filled dumplings are a special treat. The Generals Chicken was beautifully prepared and delicious. The beef with broccoli was great-  the meat was very tender and the flavors were all very good. \n\nThe service was also very good, attentive without hovering. The prices are very reasonable and it was pleasantly quiet. Looking forward to returning."
    },
    {
        "id": 6,
        "text": "Read the reviews and decided to try the restaurant.  The Double pork was excellent, the soup wontons were the best I tasted. So was the hot and sour soup, spicy and delicious.  The service is great and very accommodating .  We will be back."
    },
    {
        "id": 7,
        "text": "The best thing to get here are the soup dumplings. The service is friendly and fast. I have not tried that much of the entree menu, but the couple of entrees I tried were just okay, too oily."
    },
    {
        "id": 8,
        "text": "I hosted a birthday party in the karaoke room last night. The food and atmosphere were great, and the karaoke equipment was totally functional. This would have been a 5-star review if it had not been for how I was misled regarding the cost of the karaoke room.\n\nI made a reservation two weeks in advance over the phone. The rate is $150/hour, supposedly including unlimited food and drink off the menu. But when I got there, it turned out to not be a flat rate at all. There is no deal here -- my party's orders were taken, only for the wait staff to pull me aside and say that we exceeded a supposed $300 limit (since we had the room for two hours). We could pay the excess if we wanted, but I was blindsided by this and the wait staff helped me get it down to $300. I was very disappointed that the room policies were not better communicated to me, much less listed on the website or social media."
    },
    {
        "id": 9,
        "text": "What an amazing dining experience!  The layout is very modern and the private karaoke room looks like an awesome place to host a large party.  All of the servers were very attentive and checked up on us often.  We ordered a variety of appetizers and entrees, all of which were delicious.  My favorite was the double cooked pork which was perfectly spicy and flavorful.  I also liked the soup dumplings and can't wait to try the other varieties next time.  I will definitely be back again!"
    },
    {
        "id": 10,
        "text": "Ordered take-out. Great steamed chicken dumplings. Loved the Kung Pao chicken. The Dan Dan noodles with chicken were ok, but I will probably never order it again (not a big noodles fan). Overall, it was good experience."
    },
    {
        "id": 11,
        "text": "I'm honestly just incredibly excited that a \"real\" Chinese restaurant has opened in UCity, esp one that serves soup dumplings (!!!) It is slightly pricier than their Chinatown counterparts, but that's probably to be expected, given the location. \n\nTheir dan dan noodles were a little strange, as some other reviewers mention. The sauce was good, on par with Han Dynasty, but the noodles themselves seemed a little overcooked and oversoft. Probably not my favorite thing on the menu-the dumplings, however, were very solid."
    },
    {
        "id": 12,
        "text": "Delivery took nearly 2 hours and arrived with only two thirds of what we ordered. Food was good. Came hot despite the long wait time. Manager said she would refund us for the missing part of our order as we weren't going to wait another 2 hours for it to arrive. With so many other options for Chinese food, we don't plan to order from here again.\n\nBeware of a long wait time and potentially a messed up order."
    },
    {
        "id": 13,
        "text": "Steam soup dumpling tastes good！so juicy!\nNoodle is a little bit over cooked, but the soup was tasty~\nMeatball over rice was very flavorful~"
    },
    {
        "id": 14,
        "text": "Really good food -- really pushes their drinks, which I've heard are also good. Good pricing, probably the best Chinese food you can get in University City, if you like Shanghai food."
    },
    {
        "id": 15,
        "text": "Had a great dining experience here yesterday.  The place is newly renovated and equipped with both a bar and a karaoke room. \n\nDecided to go with the basics and got pork soup dumplings, dan dan noodles, and chicken fried rice.  Everything was delicious and it came out really quick too.  The dan dan noodles were even better than han dynastys in my opinion and the soup dumplings were oh so juicy.\n\nWill def coming here again."
    },
    {
        "id": 16,
        "text": "Went here on Monday with some friends and we all had a blast. The food was great and the atmosphere was awesome as well. We had AMAZING soup dumplings and then split 4 entrees, but ended up taking some home because we were stuffed. I had the jumbo shrimp with chili pepper. Will try to add a picture of it if I can figure out how to do it from my phone."
    },
    {
        "id": 17,
        "text": "Awesome new spot in the Upenn area. When you walk in, there's a nice bar with a good variety of drinks. To the right is the dining area which is nice and cozy which is where I sat. From there, there's also a karaoke room which had pretty up to date music when going through the music selection. \n\nThe food variety is a lot of Chinese food you'd typically expect but they also have some more Americanized appetizers and they also have Sczaun and Dim Sum as well. The good thing about this Dim Sum menu is they have 4 variations of Soup Dumplings which is everyone's favorite. I ended up getting the Shanghai Steamed Pork Soup Dumplings and Shanghai Crabmeat and Pork Soup Dumplings with a friend. \n\nWe ended up getting the Shrimp with Walnut and the Jumbo Shrimp with Chilli Pepper. The walnut shrimp is exactly what you'd expect which is one of my favorite things to order when available. The jumbo shrimps are pretty huge and are spicy but not to the point where you can't finish it because it's too hot. Food was presented well, tasted great and most importantly(for me) filled me up leaving me satisfied. I'll def be here again for Soup Dumplings and to try new things on the menu. Def worth coming through. Pics of the menu and the food I ordered posted in my pictures."
    },
    {
        "id": 18,
        "text": "Great environment and very friendly bartenders / wait staff. The food leaves a little to be desired, though. We had just eaten at Sang Kee a few days before, and by comparison all the food we ordered at Shanghai Station just didn't make the cut."
    },
    {
        "id": 19,
        "text": "Great place! The dumplings are a little salty but the Mapo tofu and the kung pao chicken are great."
    },
    {
        "id": 20,
        "text": "Definitely some of the best Chinese in University city. General Tso's chicken was fantastic and so was the crispy duck. Server was nice and the place was busy, so it was excellent service considering that drinks were filled up and food was brought out promptly."
    },
    {
        "id": 21,
        "text": "Love the food & bartender. Im really glad I stop in. A new Hot spot to come to. Luv it."
    },
    {
        "id": 22,
        "text": "Great! They fill a noticeable void in the West Philly scene, and they fill it well. The soup dumplings are amazing (they're close enough to the the city's best--  the consensus is that Dim Sum Garden has the best-- to justify NOT spending train fare to Chinatown), plus they serve reasonably priced draft beer and cocktails.\n\nAlelujah, good Chinese food AND I don't have to remember either a token or to hit up the beer store."
    },
    {
        "id": 23,
        "text": "The best thing to get here are the soup dumplings. If you live in university city, you definitely need to try them here! They are dumplings with soup filled on the inside. The service is friendly and fast. I have not tried that much of the entree menu, but the couple of entrees I tried were just okay, maybe too oily."
    },
    {
        "id": 24,
        "text": "Great atmosphere and friendly service. Their food is outstanding. As a Shanghainese, I would recommend this place for dining in."
    },
    {
        "id": 25,
        "text": "Shanghai Station is a popular University City Chinese restaurant. It is located right off of the Penn campus in Spruce Hill.  I occasionally use it for a quick meal.  I don't love this place but it is decent enough.  Last evening I had a function at International House and stopped in here beforehand for the Shanghai beef fried noodles. (This is a Shanghai food eatery!)  The dish was tasty if a slightly bit oilier than I like.  There are no condiments on the table so I had to ask for hot chili sauce which I always use with Shanghai noodles.  Also I was never offered tea here as in many Chinese restaurants and my water glass was not refilled.  It's a college Chinese restaurant."
    },
    {
        "id": 26,
        "text": "Just had a great experience at this new place. The staff was very friendly and attentive. The manager introduced himself right away and our main waiter gave great recommendations and was very considerate. The drinks that we tried were good (our favorites were the tropical mojito and ruby dragon). For food we tried pork and crabmeat dumplings, dan dan noodles, and walnut shrimp. All were delicious and came out quickly. We will definitely be coming back!"
    },
    {
        "id": 27,
        "text": "Came here twice since their opening. Our first visit we ordered the Shanghai Soup Dumplings / Xiao Long bao which were very good, no worse or better than the ones in Chinatown so it's kind of nice to be able to get this type of food without traveling all the way to C-town! I also got the crispy fried noodles with seafood which were good, very similar to how my dad used to make it.\n\nI ordered delivery the other day, and the delivery was timely, faster than Grubhub had anticipated -- but there was a minor error with my order. I had requested ho fun specifically and I got meifun -- I didn't receive a call or any info that it would be substituted.\n\nOutside of that issue, so far I've been enjoying the food items I've tried."
    },
    {
        "id": 28,
        "text": "The food was great, but the servings were slightly small. The spot was kind of hidden from the street. You'd have to go underground to find the place. But the food here definitely worth trying! Xiaolongbao are great :)"
    },
    {
        "id": 29,
        "text": "Don't even go here. They have an extremely disrespectful bartender that will tell you your money isn't enough and will threaten you and disrespect you. And then talk shit about you in front of your face... even though you tipped them. Then threatened us physically and kept making phone calls to \"get his brother on us.\" Then 2 of his female friends tried to start a physical fight and pursued us for a block as we attempted to leave the situation, as they kept egging on my bf to fight them. Very sad and unfortunate. Can't support a business that allows this kind of behavior. The owner shrugged it off as well. Very gross and it was very unnecessary. I have never been treated this way in my entire life. Not sure if the bartender was drunk, but that doesn't excuse this behavior. He was passing out free drinks to EVERYone in the bar right in front of us but had the audacity to be upset we didn't tip him more than a dollar for ONE drink and then try to get all patrons (his family and friends) to fight us while the owner hid somewhere (he didn't speak good english and seemed scared to intervene). It was pretty unbelievable."
    },
    {
        "id": 30,
        "text": "I went to Shanghai station on a Saturday evening with my girlfriend. It's an underground space which looks tiny from outside, but is deceptively bigger. We got seated right away since there weren't many people at the time. The waitress was very nice and prompt in taking our order. We ordered pork soup dumplings, kung pao chicken with hand drawn noodles, and chili cabbage shredded pork noodles. We were super hungry so were happy to see the food come quickly (under 10m). For some reason, all the dishes came in the noodle soup form. I'm not sure if that's how it was supposed to come or there was some miscommunication during ordering. The soup dumplings were super hot and a little difficult to eat, but I blame my lack of soup-dumpling-eating skills for that. They they were delicious. The same can be said about the cabbage dish though the soup broth was a little low on spice (but not flavor) for my taste. But then again, I like really spicy things. Kung pao was also very delicious and was spicy enough to bring me to tears (yes, that's the way I like it). The waitress was always around to ask if we needed anything. In the end, she brought us the check upon asking. We had some leftover kung pao which she very skillfully poured into a takeout container in front of us, without spilling even a drop of the delish soup. Upon being complimented for her superior pouring skills, she told us that she was trained to do this during  her job at a pho restaurant. Way to go! \n\nAnyway, the overall experience was great, food was cheap and delicious. Portions are decently sized. One appetizer and two entrees were more than enough food for two really hungry people. I would definitely recommend this place to people, specially living in university city, looking for good Chinese food. Soup dumplings are a must, so don't miss out on those."
    },
    {
        "id": 31,
        "text": "Nice atmosphere the service is great. I came with a large group and we had no problem getting a table. Food was excellent very large portions for the price. Differently will come back again."
    },
    {
        "id": 32,
        "text": "Came here for the first time since their new opening in University City a few days ago to celebrate a friend's birthday. I'm really happy there's a new option for Chinese food around University City, especially for soup dumplings!! Wasn't sure what to expect but left the place pleasantly surprised! The food was great, the service we generally good, and the owner of the place was extremely nice when we inquired about any birthday accommodations.\n\nThe entrance to the place is down some stairs next to a subway, but the interior of the restaurant was very nice and impressive. There was a bar near the entrance, followed by a dining area as well as a karaoke room next to the dining area. The menu comes with a lot of options similar to Dim Sum Garden in Philly's Chinatown, with some dim sum options and various rice/noodle, meat, and vegetable dishes. \n\nWe had a reservation for a party of seven, and we ordered four plates, with two orders of the pork soup dumplings (number 1). We had the fried rice cake, two of the beef with chili pepper, and a kung pao chicken. For dessert we ordered one of the rice ball in sweet soup. The flavors of all the dishes were great and all the meats were very tender. The soup dumplings were what you would expect from any Shanghai restaurant, so they were delicious and soupy. Finally the dessert was pleasant, though the portion was only enough to give everyone a small bowl of the rice balls.\n\nWe were seated right next to the karaoke room, so sometimes the atmosphere got really loud, but I didn't seem to mind it as much. The food came out really quick, and we were in and out of the restaurant within an hour or so. I should note that every meat dish ordered comes with a bowl of rice, and that any additional bowls of rice cost $1.50 extra. Finally, we asked about birthday accommodations, and the owner (I believe he was the owner) offered us some free drinks to celebrate the birthday, so they gave us some nice lychee cherry bombs, which I was really happy about.\n\nOverall, would definitely visit this place again for the food and the dining experience (even just for the soup dumplings). Glad they are now a part of the University City dining area."
    },
    {
        "id": 33,
        "text": "No better place to get dim sum in University City. My friends complain about the basement aesthetic, but I'm personally a fan. I'd definitely recommend going to Chinatown for dim sum if you have the chance, but if you're in the area and just want to chow down, this is the place to go."
    },
    {
        "id": 34,
        "text": "Great atmosphere and friendly service. Their food is outstanding. As a Shanghainese, I would recommend this place for dining in."
    },
    {
        "id": 35,
        "text": "Great food and great service!!  We came as a big group and there was good accommodations!"
    },
    {
        "id": 36,
        "text": "Nice for a light dinner \n\nI came here with my friend after work. I got the Dan Dan noodles and my friend got the garlic chicken. The noodles were not spicy enough for my liking and had too much cilantro sprinkled on top. The chicken was good, but the portion was a little small for what I am used to as far as Chinese food goes. \n\nThe price was reasonable, service was good. Atmosphere was alright, a little cramped and tucked away with no windows. They have done a lot with the space that they were given. All in all, slightly better than average Chinese food."
    },
    {
        "id": 37,
        "text": "Other than our waiter struggling a little.... This meal was great! Walnut shrimp was excellent! Kung Pao chicken was awesome. Ma PO tofu was very good, best I've had at a restaurant but still not as good as mom's .  Dan Dan noodles were very tasty. Soup dumplings were great particularly the crab. Only disappointment was that the bartender wasn't there \"yet\" Target arrival time was unknown, \"six, seven, eight\"?  She hadn't arrived by the time we were done with the meal."
    },
    {
        "id": 38,
        "text": "I was hungry for Asian noodles or Sushi and forgot about this restaurant. It is a hidden gem, next to subway sandwich shop, below. There is a small bar in front and the restaurant has around 8 booths. They do have a good selection for Vegetarians and will accommodate dietary needs or level of spiciness. They have a lunch special of dim sum and soup selection and noodles/rice dishes. I got a mild version of dan dan noodles and they added tofu. It was really delicious. They make their noodles. lo mein, ho fun or mei fun. The taste was so incredible. Noodles soft. I also tried  a dim sum selection Steamed Vegetable buns.Also very delicious  and homemade.  Comes with two buns. Waitress very nice. Food delicious. I will definitely come back and bring some friends."
    },
    {
        "id": 39,
        "text": "Great food and super nice staff! :) their soup dumplings and scallion pancakes are great. Also really liked the shanghai stir fried noodles. Theyre udon noodles so it was unexpected but really good!"
    },
    {
        "id": 40,
        "text": "Soup dumplings. That is what everyone should get here. They are possibly one of the best soup dumplings I have ever had. Went to a place in NY with a friend and waited an hour for what NY yelpers call the best soup dumplings. This place is very comparable. We also ordered Dan Dan noodles which were flavored well but the noodles were over cooked.  The summer drink specials were amazing! $3 drafts and bottle beers.  \n\nWent to the family arcade next door to digest and it took everything I had not to go back to get more soup dumplings. Yum!We"
    },
    {
        "id": 41,
        "text": "It was a cold night in Philly and we were craving for some nice hot Chinese food and glad we found one. Ordered drinks, dumplings, chives pancakes(felt they were frozen, didn't meet my expectation but it's okie). The appetizers and drinks kinda filled us and we decided to share one entrée, the portions are big however we didn't like what we ordered.. Not there fault but it was not meant for our taste... It was a vegetarian dish with pickled cabbage and string beans so please order it if you know how it is. I recommend this place and will definitely go back"
    },
    {
        "id": 42,
        "text": "Probably my new favorite spot in Philly. This place is a rare combination of modern Chinese restaurant and western style bar. \n\nI came here for a large celebration dinner and we booked the one (huge!) room they have for karaoke. The karaoke system is amazing--better than most in Chinatown. There is a huge selection of songs, and if the song you want isn't available, you can literally download it into the system, right then and there. This is next-gen karaoke, my friends. \n\nNext up, the food met my expectations. It's similar to the new Dim Sum Garden for those who have been there. Many people in my party were vegetarians and the restaurant staff were very helpful and accommodating to make sure there was something for everyone.\n\nFinally, the two young ladies who served us were amazing. They were very friendly, quick, and attentive. \nThe price for the karaoke room is quite steep, but it's definitely worth it, especially if you have a large party. \n\nI'd love to go back here just for a typical dinner/drinks sometime. Highly recommended."
    },
    {
        "id": 43,
        "text": "I've eaten at the restaurant a few times, but now mostly order takeout and eat at home; not very child friendly (e.g., no highchair) so better to just carry out. Their crispy noodle dishes are good and there was a very good duck dish that they unfortunately seemed to have taken off the menu. The soup dumplings are good, but I think it doesn't make sense to order soup dumplings for take out so I don't often have. For UC, I mostly randomly choose between this place, Chile Szechuan, and Han Dynasty, with Han Dynasty good but sometimes a last choice since my other two gotos are less expensive."
    },
    {
        "id": 44,
        "text": "Lived closeby to this new restaurant and was excited about new dimsum coming to town. Nothing here has disappointed thus far! Have tried a variety of dishes/drinks here and would definitely order them all again. Favorites include:\n\n-Vegetable dumplings\n-Veggie steamed buns\n-Kung Pao Chicken\n-Scallion Pancakes\n-General Tso Chicken\n\nService is great, and the ambiance is fun too (though a little on the tacky side, it perfectly fits the vibe of the neighborhood it is located in).\n\nHaven't tried the Karaoke part of the restaurant yet, but the food definitely is great!"
    },
    {
        "id": 45,
        "text": "Google map misled us two blocks from the actual location. We had a table close to the karaoke room, so it was very loud when the waiters opened the door to the room.\nThe Xiao long Bao is above average. The pan fried soup dumplings were average. The best dish was Dan Dan noodles."
    },
    {
        "id": 46,
        "text": "I had high expectations for this place after hearing many good things from friends, but across the board everything was just alright. I came here for lunch with my parents after moving my things into my room for the year. The menu is not super large but has a nice variety; lots of dim sum/appetizer options with all sorts of dumplings, rice plates, noodles, meats, and vegetable dishes. \n\nWe started with crab and pork soup dumplings. They were pretty yummy, but the soup filling was a little sour and could've been more flavorful, definitely a step down from Dim Sum Garden's soup dumplings. We got a large wonton soup, which was also just alright. For our entree we got dry pepper chicken, which tasted great, and had just the right amount of crispiness. However for what we paid, there definitely should've been more meat; about two thirds of the plate was just fried chinese peppers. We needed a little more so we got a plate of sauteed bok choy- pretty good but again, nothing to write home about.\n\nWas hungry a couple days ago so came back with a friend to get some takeout; we ordered hot and sour soup, scallion pancake, and shanghai stir-fried noodle with chicken. The hot and sour soup was a bit too vinegary, and the scallion pancake too oily. I thought the noodles were sort of generic-tasting; they tasted pretty good but in a hole-in-the-wall Chinese fast food way. \n\nI wouldn't mind coming back if I want quick, convenient food. Prices were quite fair and service was good. You can definitely find better options around campus, though."
    },
    {
        "id": 47,
        "text": "I've come here twice and both times Ive enjoyed the food! The scallion pancakes are a nice appetizer. Their Lo Mein is a bad cheat day because you literally want to finish it all. I've also had their vegetarian eggplant dish which was saturated with some type of Asian stir fry sauce. Could've used less sauce but, still, it was savory. Haven't had anything bad here yet. Nice booths inside for seating along with a good sized bar. Enjoy!"
    },
    {
        "id": 48,
        "text": "food sucked and got small portions when delivery came.pattaya grill is better on 40th and chestnut street.students in university city hype places up.I guess most of them never been anywhere and they always too broke to try different restaurants to give an honest review, LOL"
    }
]