[
    {
        "id": 1,
        "text": "I'm a big beef noodle soup lover. The soup base at Hakka is authentic. If you are looking for the best beef noodle soup in philly, Hakka is a must try.\n\nSide dishes are great and they are great matches for the beef noodle soup. Highly recommend!"
    },
    {
        "id": 2,
        "text": "Here is the only one Hakka beef noodle soup around this country.. the base soup is so delicious and tasty. Heard from waiters that they make soup with more than 10kinds of herbal medicine and beef bone to cook over 8hours.. I like so much and will come back again without doubts..."
    },
    {
        "id": 3,
        "text": "If you are a rice noodle fan you'd definitely visit here. They provide chewy rice noodle with beef or tripes. The soup base is also clean and tasty."
    },
    {
        "id": 4,
        "text": "Awesome noodle place~ really delicious! Nice staff, and they seem to be very passionate about what they make. Great southern China cuisine, will definitely come again."
    },
    {
        "id": 5,
        "text": "This is my favorite noodle place in town now. The place is simple, yet trendy,sweet , but still classy. The food is very very good. The herbal soup is highly recommended. Also the Hakka Beef brisket mood is fantastic too. You have to try it when you come in town."
    },
    {
        "id": 6,
        "text": "Most Chinatown restaurants are quick with their service, but one rarely gets a greeting or a smile from the staff.  Indeed, there are restaurants that I go often, that they remember my orders, and that I tips decently (20%) - and I still see frown faces.\n\nSo, this is a nice change in this restaurant - which the waitress was friendly and with a smile when taking order.  And also inquiring whether I want water or tea.\n\nThe beef noodle is good - with quite a bit of beef, brisket and meatball.  The beef is tender, and the meatball is al dente.  The broth and noodle are decent though not wow.\n\nThey do takeout, and like most if not all Chinatown noodle shop- they will separate the soup and noodle if requested (keeping the noodle al dente)\n\nOverall, it is a 3.5 but given that they were willing to accept $11 for a $11.34 bill - as they didn't realize that I have change.  That gives them a 4 star.\n\nOne thing that they may want to consider is to provide ice water versus lukewarm water."
    },
    {
        "id": 7,
        "text": "Good area, good food, special taste noodle soup. Good to try it。different noodle, different flavors,a lot of surprises on each side,unique soup base, will not let you down."
    },
    {
        "id": 8,
        "text": "Not very good. It's a pretty dead spot. I went there several weeks ago when it opened and was fairly disappointed with it. We got 2 soups, one with the Hakka noodles and the other with the rice noodles. The soups were a bit bland, the Hakka noodles weren't too good and most importantly the meat was chewy and tiny portions of meat for the price. My mom makes really good beef noodle soup, this was nowhere near it and the atmosphere was dead. Past it again last Friday, pretty much a dead spot when places nearby at happening. Sorry to say it but Hakka beef house was disappointing at best."
    },
    {
        "id": 9,
        "text": "Hakka beef house sells noodles and other braised meats.  Overall I was very happy with the meal. \n\nWhen I got into the restaurant I got this sweetish tea which was strong in a glass cup. Then I got the beef noodle soup. The portion size was medium large for 8 dollars. I thought that the soup was very well balanced, because it was flavorful without being too salty. The bok choy seemed to also have a good fresh flavor, not too raw-tasting too. The soy egg inside was good and you could tell they braised the egg in sauce for a long time. The noodles were chewy in a good way and the service was fast.\n\nOverall I would come again to try the other menu items. For some reason its very empty and quiet here. I came on a Thursday night and there was no one else there the whole time. Maybe because they just opened."
    },
    {
        "id": 10,
        "text": "I would recommend this restaurant for anyone who is a fan of good beef broth asian soups.  My experience was limited to the three beef (Flank, Beef balls, and beef) dish with noodles.  I would say it was solidly good.  Not the very best I've ever tried, but good+.  The young woman who waited on me was great.  Her enthusiasm and pride for the food there was so obvious.  She explained what was in my bowl.  Brought me some hot oil, and was extremely attentive, bringing me more napkins when she saw I needed them.  A solid addition the Philly's asian noodle scene!!"
    },
    {
        "id": 11,
        "text": "This may be my favorite beef noodle soup in town so far! I had ordered the beef brisket hakka noodle soup. The broth has a wonderful depth to it while not being heavy at all. It's a clean and flavorful soup that warms you up. I finished the whole bowl including the broth, something that I rarely do when eating noodle soups. Both the noodles and beef were tender and had nice consistency and texture. The portion size left me quite satisfied and was overall a wholesome meal. I will definitely be coming back again!"
    },
    {
        "id": 12,
        "text": "I walked in around lunchtime to find the restaurant empty. The restaurant looked a bit dim from the lack of sunlight coming in from the window. The person I came with immediately felt if it was a bad idea to remain but having had my eye on this place for a while, I chose to remain. Now, this place has pretty good reviews so I was especially interested in their Taiwanese Beef Noodle Soup. I got their tendon/tripe/omasum noodle soup and was not very impressed with the flavors. The soup was light but bland. Therefore, the tendon, tripe, and omasum was pretty bland as well. I would have preferred at least some soy sauce or sriracha on the side but they only had chili oil and vinegar. What saved the dish was the noodles. They were bouncy and chewy with the perfect amount of thickness. If you like something that's not too oily, light, and more subtly flavored, this would be the place for you. However, I prefer Spice C. \n\nThe person I went with got a rice dish and the meat was flavored pretty well. Maybe I should've gotten beef instead of the tendon/tripe/omasum but that's only if I come back next time."
    },
    {
        "id": 13,
        "text": "Lovely place, super affordable and the food it's tasty! Me and my friend spent $30 on 4 dishes. I love all of them."
    },
    {
        "id": 14,
        "text": "Great noodle soups, very different from others. Soup is traditional. Not very oily or salty. Looking for parking as usual is hard in Chinatown, but no other complaint."
    },
    {
        "id": 15,
        "text": "This is a really quiet place to eat and relax. Not a lot of people comes in. The food is really good and savory and the waitress was really nice."
    },
    {
        "id": 16,
        "text": "Philadelphia now has its own Hakka beef and noodle house.  This cuisine which is popular in parts of Southern China and especially in countries like Malaysia is widely known for its beef and noodle dishes.  This is an unassuming little space that the owners intend to improve upon in the coming weeks.  But they have already started to serve up the Hakkan food and I can tell you based on what I ate, it is tasty.  All the Hakka noodles are made in-house and they were perfectly cooked in my dish with a minced beef, bok choi, and bean curd.  The minced beef was extremely tender and flavorful. This is a dish where you mix everything together in the bowl, add some of their delicious housemade chili sauce and your mouth is full of different tastes with each bite.  A nice ten-herb soup began the meal.\n\nChinatown in Philly keeps evolving and it's nice now to welcome a Hakkan restaurant to its numbers.  And don't forget to try the Spicy Minced Beef w/ Hakka Noodles!"
    },
    {
        "id": 17,
        "text": "This is probably the best beef noodle soup I've had in a while and I will definitely cone back to try out other dishes in the menu. The fact that the broth has been simmering for eight hours, one can really taste the richness of the different spices in it."
    },
    {
        "id": 18,
        "text": "This place is really really good!  Small, clean, has sense of humor.  Service can be a bit slow.  But food is so good and worth the wait.  Order their signature dishes and u won't be disappointed"
    },
    {
        "id": 19,
        "text": "It was good, but I wasn't WOW-ed. To be fair, I was in the mood for a rice dish but ordered their Hakka Noodle with Beef on the recommendation of my friend who had been here several times. \n\nI actually thought their beef was quite tough unlike the other reviews here, but maybe I came on an \"off\" day as my friend also mentioned it usually was quite tender. The noodles were good but the broth was the clear standout winner. I've never had light broth so packed with flavor before, and it wasn't overly salty so quite drinkable. \n\nI ended up ordering the pig ear as well since I was still hungry after the noodles. It was covered with soy sauce, but I would much rather see that on the side! \n\nThere is stiff competition in the neighborhood for hand drawn noodle, so unfortunately I cannot declare Hakka as the top. However, the place is clean and modest, so you can't really go wrong."
    },
    {
        "id": 20,
        "text": "Another excellent restaurant in China Town!\n\nPros:\nSurprisingly brief menu, which was a nice change of pace from the usual restaurant whose menu rivals a phone directory (remember those?)\nThe hakka noodles and beef brisket was excellent! Perfect portion size, well worth the money, tasty broth without being overpowering, well cooked beef. \nNice staff\nQuick service\nSimple atmosphere inside\n\nCons:\nGot the crispy beef buns as an appetizer and the cucumber was the same size as the beef, which just seemed like the wrong ratio. That and the bun (which I assume was supposed to be a soft consistency?) was I think overcooked and actually cracker like around the folded edge. \n\nIf there weren't another 1923812 places in China town I want to try I would definitely be back to try the other dishes! My friend got one of the dry noodle dishes which looked even better than my soup."
    },
    {
        "id": 21,
        "text": "One of my favorite places in Chinatown. They're fairly new and off the main path so I try to support them as much as possible; which is easy because I could eat here weekly.\n\nI've never strayed away from the Hakka noodle but am tempted to because the rest of their menu looks quite good. I've gotten both beef and brisket and prefer the beef because it's a little firmer and less fatty. The noodles are perfectly chewy and bouncy. The broth is rich but not fatty or slick with oil. It's pretty mild in taste so I'll add chili oil if I want a kick.\n\nWe love the fried beef baos and spicy garlic cucumber with fungus. The cucumber and fungus (if you're familiar with wood-ear mushrooms in other Chinese cuisine or dim sum that's what they mean by fungus) is so so good. It's deceptively simple but a great balance of flavors along with a refreshing contrast to the hearty soup.\n\nThe atmosphere is nice and there is a good amount of seating (about 4-5 tables) and I've never had to wait. I love Hakka Beef House and hope they prosper!"
    },
    {
        "id": 22,
        "text": "This is going to be my new go to noodle fix. Better than spice C and nanzhou in my opinion.\n\nI got the beef tripe/tendon/omasun hakka noodle except I traded out the omasun for brisket. Next time I'm going to trade out the tripe for beef because damn that beef is BOMB. I got a piece of it in my noodle soup and it's just flavored so well. A hint of spice, perfectly tender, melts in your mouth, juicy from the broth. And the broth - it looks clear and unflavorful but it really delivers in flavor. It's a lighter broth but still very satisfying and it doesn't leave you feeling very heavy. I think it's quite healthy too. The noodles were something else - I loved the texture of them. I'm used to eating shaved noodles but I think Hakka noodles top them...and not only was the chewiness of the noodles spot on, the flavor was amazing too! Seldom do I notice the noodles themselves bursting with flavor but this restaurant really pulled it off well...the only thing I have to complain about is the tripe. Was not a fan of it - the texture was a bit off to me, almost a bit plastic-y in bite and chew, not like the tripe I'm used to eating in pho. The tendon was also a bit hard and not as melty and soft as I would like it so I would probably try a different noodle next time. \n\nOverall, really good place to go to. Portion size was very decent (left feeling absolutely stuffed) and the tea they serve is delicious (I asked what kind of tea it was and they said green but I don't believe them because I hate green tea and this stuff was heavenly. I think it was jasmine green tea maybe.) Can't wait to bring my parents here. Def would recommend visiting."
    },
    {
        "id": 23,
        "text": "I really love this place! Their noodles taste quite authentic and you can't beat the price. I always get the oily noodles with scallion and have enjoyed it every time. They have a few different dry and soup noodle dishes as well as dim sum. All the prices are very reasonable.\n\nThe restaurant is clean and usually not too busy so you can get a quick meal here. The wait staff are all super friendly and nice so it's always an enjoyable dining experience! Definitely recommend if you are in the area!"
    },
    {
        "id": 24,
        "text": "This is a great addition to Chinatown's noodle scene! If you like Non-spicy savory noodle soups, Hakka Beef House is for you.\n\nThe triple meat (i.e. beef, brisket, and beef meatball) noodle soup was very delicious and came in a generous portion. The beef triple soup (without noodle) was nice. I think their soup base is not as MSG-heavy as a few other noodle/ramen places nearby, which is good.\n\nThe only thing we didn't like was the oil seasoning vegetables on the appetizer menu. The server said the dish was a boiled vegetables in a light sauce, but it turned out greasy in a bad way. Also, It came in a very small portion size (slightly more than the amount of vegetables in the noodle soup) while priced at $5.\n\nBottom line, Hakka Beef House has good noodles (or rice noodles) with decent authentic beef dishes (tripe, tendon, braised beef) as noodle toppings. Service is average in Chinatown.They just need to pay more attention to other non-staple dishes."
    },
    {
        "id": 25,
        "text": "I really wanted to try this ever since it opened, I never had \"Hakka\" Noodle before. We went on a Sunday night. There were a couple of customers so we got in no problem, the waitress was pretty nice of explaining the menu. The broth was really good and the noodle definitely has a different flavor and texture to it I was really impressed! Will try again soon!"
    },
    {
        "id": 26,
        "text": "Atmosphere: Came here with my girlfriend on a Sunday night, not that many people, quick service. Pretty ideal for a quick meal. Was playing Tiesto UMF in the background hahaha I kind of digged it\n\nFood: We got the Minced Spicy Beef Sauce with Noodle and Beef Brisket with Hakka Noodle. The minced spicy beef sauce was super good and really flavorful. The Beef Brisket Hakka Noodle was also really good and herbal. I don't know how to really describe it but it's a good balance between like pho and beef noodle soup. The really short-changed me on the beef though as I felt like I got all fat and tendon instead of beef.\n\nOverall, I like the restaurant - don't think there's any other Hakka restaurants out there in Chinatown and I think it's a great addition."
    },
    {
        "id": 27,
        "text": "Vibes: simple, clean, and casual, best for groups of four or smaller\n\nTasting notes:\n-Beef/brisket/beef ball noodle soup: clear broth is sweet and aromatic with just a subtle touch of salt and onion, felt light but comforting; comes with half of a very thoroughly braised egg and bok choy, which gives the dish color and a grassy bite; thin slices of sweet, flavorful beef (shank I believe) melted in my mouth; brisket pieces were chunky and chewy; beef balls were the usual but glad to have three of them in an already topping-packed bowl; noodles were slightly wavy, springy with a tender chew\n\nOther thoughts:\n-Staff is very nice and attentive\n-I was served warm, very floral tea soon after sitting down\n-Menu is short with braised foods being the restaurant specialty"
    },
    {
        "id": 28,
        "text": "Finally a unique addition to Chinatown. I was starting to get sick of the same type of food. \n\nIf you love beef tripe, tendon or just some hearty soup, this place is for you. We got the minced beef with noodles, beef tripe noodle soup, mixed meat platter as appetizers and the infamous broth ( under soup of the day/ soup bowl category) that the cuisine is known for. \n\nThe mixed cold meat platter is definitely a must get. However if you're not feeling adventurous,  you should probably skip this because it does have beef stomach and pigs ear. Everything in platter was braised giving it beautiful flavors even without the sauce they provided.  \n\nThe noodles in the dishes were chewy and bouncy. The bone based broths were flavorful though it wasn't as hearty but I wouldn't call it a light broth as well. The triple beef broth had more tripes in it which was a bit too much for me since we already had something with tripe in it.\n\nOverall, would come back to try more dishes! Love the decor!"
    },
    {
        "id": 29,
        "text": "Got the triple meat soup dish. I forget what it was exactly called but it was incredible. The meat, noodles and herbal broth are all amazing!\n\nAtmosphere inside the restaurant is nice and relaxing too. Perfect place for a small group of friends to get together.\n\nI recommend this place and I also recommend the owner, Alina. She's sweet and very accommodating! Thank you for allowing us to enjoy your new restaurant!"
    },
    {
        "id": 30,
        "text": "This place just didn't WOW me. Service was seriously lacking especially considering we were the only ones in the restaurant at the time. And the food, it was just ok. I would have much preferred to have noodles elsewhere.\n\nI ordered just plain beef with noodles and my wife ordered the beef, brisket and beef ball. I felt like the broth was kinda lacking flavor and I needed to add additional sauces and spice to it. The beef was chewy and didn't really hit the spot for me. My wife seemed to have enjoyed hers though. I tried a piece of her meatball and it was not for me! It was soggy (if that's even possible) and just blah. I also even tried her brisket as well and felt it was quite tough. They needed to braise it a little longer.\n\nOverall: I'm not sure I'll be back (that's up to the wifey...lol)."
    },
    {
        "id": 31,
        "text": "Excellent service! The waitress was very welcoming and knowledgeable. She went over the background of\"Hakka\" and the popular traditional dishes on the menu. \n\nThe menu was simple and easy to read. For appetizer, we ordered the pan fried beef dumplings. They were okay, wasn't as fried or crispy as I would like.. For entrees, I had the beef brisket with Hakka noodles. The noodles, brisket, and broth were delicious. It also came with one meatball which I thought was odd. My boyfriend ordered the minced pork with egg over rice plus omasum. The omasum was beef tripe.. it wasn't what my boyfriend expected and he didn't mind eating it so we kept it plus he said it was good. I didn't think it was worth the extra $3 but I guess the organs are expensive. \n\nWe will come back next time for sure. We literally \"killed\" the meal lol. Prices are great and we were full."
    },
    {
        "id": 32,
        "text": "What an incredible experience. All of the staff was wonderful and helpful. We honestly didn't know what to expect, coming in only after reading Yelp reviews. The food was delicious, so unique. They make a completely different kind of noodle that you cannot get anywhere else in Chinatown. The broth for their soup is very flavorful and it is well apparent the care they take stewing it for 8 hours"
    },
    {
        "id": 33,
        "text": "I really don't understand the elite reviews.  We should have trusted out gut instinct and left when we saw an empty store for a sat lunch.  Second warning,  the chef was picking his teeth with his finger as he was preparing our food.  \n\nThe food itself was just okay.  More on par to what you would settle for in an airport food court.  The hakka noodle soup I got looked as if I was served only half of the bowl.  It could have used more than 1 bokchoy and the small portion of beef and noodles.  My husband ordered Braised chopped pork dried noodle.  Flavor was decent but the portion again was tiny.  Also the egg served in the dish was still cold. We were not at all satisfied with our meal and came home and comforted ourselves with left over pizza from the night before."
    }
]