[
    {
        "id": 1,
        "text": "Really solid place. Pretty good value, but not quite as good a value as Ting Wong, M Kee, Nan Zhou. \n\nSalt and pepper chicken wings- Very good, not quite as fried/crispy as other places' salt baked wings, but still good.\n\nScallion pancake- Very good. Fluffier than most places I usually have it. They serve it with a sweeter sauce. I think it tastes better with soy based sauces.\n\nTaiwanese beef noodle soup- Delicious. Very flavorful broth. Noodles are really good. My only complaint is that they should cut up the beef into smaller pieces. The beef portion in the soup is generous, but I'm trying to eat soup, not a steak.\n\nBeef chow fun- Pretty good, a little glutinous for my taste. I like the noodles a bit wetter in sauce. Beef portion is solid.\n\nService is fine and friendly. Their English isn't great, but it's fine. I did have to explain several times that I wanted the rest of my food wrapped up to go. This was a bit icky, but when they put my leftovers in, they included my chicken wing bones. I shouldn't have to specify that I dont want chewed chicken bones to go."
    },
    {
        "id": 2,
        "text": "We got the Taiwanese meat ball, beef chow fun, and a mango smoothie. \n\nThe meat ball was a little bit hard--I suspect they made them beforehand, refrigerated them, and then didn't heat them up as much as they needed to before they served them. There was not enough sauce on top of it for a Taiwanese meat ball.\n\nThe chow fun was good. No complaints there.\n\nThe smoothie was terrible. Either the mango that they used was not ripe or they used mango juice instead of real fruit. 0/10, would not recommend."
    },
    {
        "id": 3,
        "text": "Overall good food and an enjoyable dinner.  One of the few places I've come across that allows you to get fried rice along with lomein in their combo dinners.  Wonton soup and spring roll were just ok, but shrimp lomein, fried rice and general tso's chicken were all tasty."
    },
    {
        "id": 4,
        "text": "Just do some online browsing about this restaurant and found this link (for those who doesn't speak chinese). \n\nhttp://chowhound.chow.com/topics/430132\n\nit turns out that the chinese menu is different from the english menu.\n\nthe chicken in hot pot: c55\nshredded beef with tofu and bamboo shoot: c49"
    },
    {
        "id": 5,
        "text": "For appetizers, we had the scallion pancakes and the seafood soup. They were delicious.  I wanted the Peking Noodles, but the sauce contained meat, which I do not eat.  However, the owner was nice enough and made accommodations for me.  The lychee smoothie was yummy and actually tasted like lychee. They use real fruit here.  Everyone at our table was satisfied with the food and service."
    },
    {
        "id": 6,
        "text": "I absolutely love this place it's such a small quant place that you would walk by nine times out of ten. Ive had Taiwanese food at other places but none have been as good. It's just something I can't describe. When ever I go I have to get a order of wonton soup and the house special lo Mein. A must try."
    },
    {
        "id": 7,
        "text": "Delicious!  Came here with my family and they accommodated a large group of us last minute.  Great food, very authentic Taiwanese cuisine.  We had the 3 cup chicken, pan fried seafood noodles, soup dumplings, string beans, some sort of greens with garlic sauce which were outstanding, soup dumplings, scallion pancakes ... all were delicious and authentic according to my brothers Taiwanese girlfriend."
    },
    {
        "id": 8,
        "text": "Good, fresh, clean. Nice folks. Funny soundtrack playing, but despite the 90's pop it feels authentic."
    },
    {
        "id": 9,
        "text": "Oh my gosh! This place probably had some of THE best chinses food I have ever consumed. Upon visitng Philadelphia, my boyfriend and I decided to wander around Chinatown. Based on some of the reviews on here, I suggested we try Empress Garden for a late lunch. We were glad we did! We ordered the \"Family Dinner for 2\" with Hot and Sour soup; Sweet and Sour Chicken and Veggie Lo Mein. I am not a huge fan of Hot and Sour soup but my boyfriend is and he is very picky about it, but he loved it here! Even finished my bowl as well. The sweet and sour chicken was soooo good. Best I have ever had. It came with the sauce already on it and it was still nice and crispy. The lo mein was also above par and although we were too stuffed to finish it, the waitress gladly packed it up to go and we had a little snack for back at our hotel. If I am ever in Philly again, I will definitely be back to visit this restaurant."
    },
    {
        "id": 10,
        "text": "2nd time here. First time in Philly, we went to eat here. We loved the food and the price is reasonable. We ordered the same stuff, salt and pepper pork chop, sautéed string beans and vegetable fried rice. We recommend this place. Accepts credit cards for orders $20 and over."
    },
    {
        "id": 11,
        "text": "I first discovered this place by accident, being hungry and having only 30 minutes to find a place to eat before a meeting back at work. My first reaction was, \"whoa, did I just find a stand-out Chinese restaurant that doesn't flood their dishes with sauce?\" For weeks, it was Chinese bliss. Every time I ate there I felt like I was being transported from Americanized sauce-drenched Chinese food to a place far, far, away, where sauce was hard to come by, and food only survived by the cooking virtues of its skilled chef. I was even getting ready to write a glowing review to that effect.\n\nIt all changed a few weeks ago, however. Not sure if the chef is on vacation, gone for good, or they received an extra large shipment of sauce. But all the positives I mentioned above reversed. My dishes were more akin to soups, even though they clearly were not in the soup section. I went back three more times, hoping against hope that the sauce flood would recede, but there was no such luck. I'm back on the hunt for *dry* Chinese dishes, but will keep hoping that the Empress goes back to being less saucy."
    },
    {
        "id": 12,
        "text": "Price is very affordable with large portions of food. Food is just so so, really, from an authentic Chinese perspective... Cannot understand why people love here. Most of the food is too salty and oily."
    },
    {
        "id": 13,
        "text": "I came here with my partner for lunch and was pleasantly surprised. The menu options seemed ordinary but the taste & freshness were mind blowing. I had the Indonesian Lo Mein and he had the General Tso Chicken combo. We also shared the Scallion Pancake which was delicious. \n\nThe service wasn't amazing but that may be due to a language barrier. Other than that, the experience was great.\n\nOur bill was the icing on the cake. . .an appetizer, Thai Iced Tea, &  2 entrees all for under $30."
    },
    {
        "id": 14,
        "text": "Empress Garden has the most authentic Taiwanese food. Their beef noodle soup are painstakingly stewed for 5 hours the day before with various ingredients to get the rich flavor.  In fact I have recently given up vegetarianism for their beef noodle soup. I don't know how that happened but it did. This restaurant is run by the daughter of the owner of a chain of the same restaurants in Taiwan. All of the Taiwanese dishes are flavorful and truly unique to Taiwanese style of cooking. Highly recommend the scallion pancake, beef noodle soup, 3-cup/ flavor chicken, pot-stickers, Shanhaigh Won Ton Soup, and Taiwanese pork meat ball, and oyster pancake."
    },
    {
        "id": 15,
        "text": "This food was amazing.  It's a small quite spot that wasn't crowded.  Their prices are excellent and you get really big portions.  I love the fact that they have family styled dishes as well as individual combinations.  Very good staff.  I will definitely be back."
    },
    {
        "id": 16,
        "text": "We came last night and order three cup chicken and tofu hot pot and beef noodle and oyster pancake and scallion pancake . The foods was excellent. We will come back again."
    },
    {
        "id": 17,
        "text": "Ordered lamb stew noodles, Chinese hamburger, spicy cabbage, dumplings, and wontons. Lamb noodles were good (my opinion) or great (everyone else's opinion). Cabbage was really good, I could tell it was cooked on very high heat. Dumplings were awesome... Had a very crispy layer of crust covering it. Burger was very dry."
    },
    {
        "id": 18,
        "text": "very good chinese in the heart of Chinatown. Very friendly and quick service without being rushed.  Always a good sign to get a table in the middle of 4 tables of asian families and groups eating a plethora of dishes.  Our family of 4 started with scallion pancakes (only $4) and then each ordered the combo dinners ($10-11) which include soup, very good spring roll, white or fried rice and entree.\n\nWould definitely recommend.  Just remember to BYOB if you want a drink with your meal."
    },
    {
        "id": 19,
        "text": "Excellent experience! We came with a group of 10 at 9pm and they set the table for us in advance. It was our first time there and all of their food was good. Especially the salt and pepper pork, Mapo tofu, pork chop over rice, string bean. Everything was quite good!"
    },
    {
        "id": 20,
        "text": "Came here with a group of friends and sat down right away. It is a cute place, not big at all but very homey. The food was amazing. Steamed dumplings were fulfilling. Pork Lo mein and sesame chicken were both excellent. I recommend getting the hot tea to drink during the meal. Overall great place. Will come again!"
    },
    {
        "id": 21,
        "text": "Delicious, not too heavy and sauce-laden. Perfect choice in Philadelphia's Chinatown! Great for kids, too."
    },
    {
        "id": 22,
        "text": "Apparently the place was renovated before.. I'm glad it was since I thought the decor was adorable. The plates and everything were just really cute..\n\nThe food is pretty great. We ordered the Jjajjiangmyung, pork belly in hot sauce, pan fried noodles with shrimp, with some rice on the side. Everything was delicious and the only reason we had food left over was because we were so full.. I'll definitely come back to try their other menu items.\n\nI'm only going to take off a star since they brought out one of the dishes by the time we were almost done with our meal.. but other than that the service was pretty good."
    },
    {
        "id": 23,
        "text": "Great customer service. Awesome fried pork chop, it's a must order item in the menu. Food is served quickly and has a mix menu from Indonesian to taiwanese to chinese. A must recommended restaurant to eat at."
    },
    {
        "id": 24,
        "text": "A microcosm of Chinatown itself, Empress Garden is a staple for quick, quality Chinese food. Being that standard American only reaching so far within his comfort zone, I always go for the General Tso's, which is really great at Empress. The combination dinners on the back page offer this dish and many more with your choice of soup and rice for a very reasonable price (a little under $11). The Chicken and Broccoli and Sweet & Sour Chicken both look really good. As far as Wonton soup is concerned, it's the best I've ever had. \n\nDown 10th street just past the Friendship Arch sits Empress Garden, in all its simple glory, its dirty windows and plastic table covers - a recent addition that I think they should do away with. I'm sure it makes cleanup easier, but those thick plastic covers are a nuisance, in the way every time you cross your legs, sticky to the touch. Just take it from me, Empress, it's better without. \n\nThat note aside, Chinese food - as well all know - can be hit or miss. It's like Mexican restaurants that way: you'll eat it no matter what, but sometimes you raise an eyebrow as you do so. Also, it's a BYOB, which is a nice touch if you want to grab a bottle of wine or a couple beers beforehand. If you find yourself in Chinatown, find your way to Empress Garden, one of the gems of the area and maybe, just maybe, the best General Tso's I've ever tried."
    },
    {
        "id": 25,
        "text": "This is our first time in empress garden, Taiwanese food, we ordered pork belly tofu over rice, beef noodle soap, and three cup spice chicken, really good food! We will definitely return next time!"
    },
    {
        "id": 26,
        "text": "I've been going here since I was a kid. The same waitress that served me twenty years ago is still there. Fast, courteous, even too polite at times. Went today for lunch to get my favorite dish- Taiwanese beef noodle soup. This soup is the best; it certainly holds up against the stuff I've had in Taiwan. The noodles were a little thinner than I remember them, but they're fresh, and that really makes all the difference. For those who don't know Taiwanese beef noodle soup, the broth is supposed to be mildly spicy and salty, with a modest amount of chili oil and a hint of star-anise. The beef and tendons are pressure cooked to a nice tenderness, and absorb the broth well. The slight crunch of bean sprouts and sour of mustard greens fill out the texture and taste of the soup. My favorite."
    },
    {
        "id": 27,
        "text": "The prices are great, especially the lunch combos! I was quite disappointed in the wonton soup, though: the soup was basically salt and water, and the wonton skin was soooo thick. I felt like I was chewing on raw dough!\nI also had chow mein, with the bonus fried rice (literally fried rice... Like, nothing but rice and maybe a pinch of eggs for some reason). The chow mein was great. My dad ordered a bowl of beef noodle soup (forgot the exact name of everything, sorry) and it looked and tasted amazing.\nThe interior of the restaurant is quite small, but neatish (don't look at the kitchen area lol) and I liked the music they were playing. It is a good family restaurant to go to. I probably went during a quiet business time, though, because there weren't many other people. \nI will definitely come back here again! :)"
    },
    {
        "id": 28,
        "text": "New to the neighborhood and looking to try all of the Asian restaurants in Chinatown to determine the best out there.\n\nI went standard American Chinese food - General's Chicken and Beef and broccoli, with some egg rolls.  Good food - I'll be back again!"
    },
    {
        "id": 29,
        "text": "Went here for the first time recently. The Taiwanese beef noodle soup was amazing. Haven't had one this good in so long. The broth was rich and flavorful, the noodles were homemade and had a great chew and the bit of picked vegetables tied it together perfectly. Scallion pancakes were also excellent. Took some dumplings and 3 cups chicken home. Dumplings were so so. 3 cups chicken had a great sauce but be prepared for bones-it's basically thighs chopped into small pieces which Americans who are not used to chewing through things like us chinese may not be used to. Get the beef noodle soup, you will not be disappointed."
    },
    {
        "id": 30,
        "text": "I ordered the taiwan trio, a spring roll, and the peking noodles. The trio came with marinated tofu, pig ears and seaweed. the highlights were definitely the tofu and seaweed. the tofu had a fantastic savory marinade and was nice and firm. the seaweed was cut into ribbons and had an almost pasta like texture with a great salty briny flavor. I like pig ears but these were boring, and had nothing in the way of seasoning at all. I love the way Nan Zhou does pig ears, sliced super thin, marinated in sesame oil and chili, and served with pickled carrot and daikon. the peking noodles were a total home run however. a big bowl of noodles with a ground meat (pork I'm guessing) chili and tofu sauce. the noodles had a decent texture but were a little soft for my liking, however the meat sauce blew me away. it was filled with diced chilis which packed just enough heat to wake up your tastebuds but not destroy which is a good thing because there were so many of them that if they had been hot this dish would have been a nuclear bomb in your mouth. They were just right and cooked so they were still nice and crunchy and the flavor came through brilliantly in the sauce, which had a rich sweet gingery zing. This dish felt like a chinese version of spaghetti with meat sauce. Total comfort food. There was a good amount of sauce left over when I was finished with my noodles and I did not stop till my bowl was clean. The restaurant itself was nice and clean with friendly and fairly attentive staff, and even the americanized dishes looked well prepared and were not over priced. I will be returning soon, seriously I am thinking about those peking noodles right now."
    },
    {
        "id": 31,
        "text": "Reliable classics and good take-out service.    The only thing I had here that I didn't like was a watery wonton soup."
    },
    {
        "id": 32,
        "text": "Great spot in Chinatown. The food is excellent, and the prices are so cheap (especially if you order a bunch of plates as a group, rather than one meal per person). Definitely recommended."
    },
    {
        "id": 33,
        "text": "Scallion pancakes were quite good. Pork chop soup had great flavor and crunch. We also opted for one of the Indonesian curries, which had a nice mix of flavors. Courteous staff. When we asked for our leftovers to be packed to go, we didn't specify that the rice needed to be packed as well, and ended up with curry sans rice as leftovers. Worth trying once, not sure that this will go into my regular rotation."
    },
    {
        "id": 34,
        "text": "Top notch. The hot and sour soup was good, with some subtlety. The garlic sauce (I ordered chicken with garlic sauce) was the best I can remember eating, and the veggies with it were nice. I'm a tough customer and rarely wowed by Chinese food. The portions are a bit smaller than typical Chinese but I'll take quality over quantity all day , and I left full for $10."
    },
    {
        "id": 35,
        "text": "Came here last night for some delicious chinese food. Since we were short on cash we were looking for options and Empress garden came into mind.\nWe were seated immediately as soon as we walked in. They gave us water and came back to take our order. My friend got the pork belly and tofu on rice which also came with boy choy. I go the string beans with minced pork, extra spicy. Everything was hot and fresh. The pork belly was perfectly melt-in-your-mouth good and the string beans were crispy just the way I like them. The service was on point and everyone was kind to us.\n\nThanks again for another great experience!"
    },
    {
        "id": 36,
        "text": "Delicious! I order the chow fun noodles with beef! The service was well. The staff are friendly."
    },
    {
        "id": 37,
        "text": "As a student living far from home, this place hits the spot for me. Granted, I think you should realize that the authenticity of this place depends heavily on what you order. The authentic stuff are the jia jiang mian and the Taiwanese beef broth noodles. I've also had good sauteed vegetable dishes and green onion pancakes here. I recommend the dumplings if you like them big and thick-skinned. (And... that's what she said, eh?) Anyways, my friends and I always come back here for more when we need a cheap pick-me-up that hits close to home!"
    },
    {
        "id": 38,
        "text": "Empress Garden doesn't appear to be anything special from the outside, but if you know where to look you can find some truly amazing dishes here. You do need to order off the Chinese language side of the menu to take advantage of all Empress Garden has to offer, though; their English menu is typical anywheresville USA Beef n' Broccoli, General Tso's, etc. If you can't speak or read Chinese, bring a friend who does -- or perhaps, as someone below suggested, ask the waitress for some authentic recommendations -- and you're set for an amazing experience. The zha jiang mian (fried sauce noodles) and the beef noodle soup have really kept me coming back; no matter how long between visits, it seems the super-nice waitress still remembers my boyfriend and I and knows exactly what we want to order :) I really wish they'd offer a menu with a translation of the more authentic dishes though!"
    },
    {
        "id": 39,
        "text": "Ordered Pork Chop rice which is the typical, symbolic & easy cooked Taiwanese dish that any Taiwanese chef won't get it wrong, but the dish I got has no ground pork savory sauce on rice so the rice is very very dry. Pork (no pork chop shape, just pieces of fried pork), egg, and veggie taste ok. It's so sad, no savory sauce."
    },
    {
        "id": 40,
        "text": "My husband and I came here based on the Yelp reviews. I'm glad we did. I had General Tso Chicken, my husband had Hunan Chicken and we both had the best Hot and Sour Soup we've ever eaten! Right at the entrance of Chinatown. Very easy to find!"
    },
    {
        "id": 41,
        "text": "Met my friends for dinner by chance at this place. It was delicious!!! Try the scallion pancake! It is delicious!!  Not to missed!!!"
    },
    {
        "id": 42,
        "text": "Every dishes I've tried from Empress Garden has surprised me from the Beef Ho Fun to the Braised Pork Belly with Tofu. The Beef Ho Fun is by far the best in Chinatown with its unique taste and texture. The restaurant is very welcoming from their waitress to their decor. One of Chinatown's underrated restaurants."
    },
    {
        "id": 43,
        "text": "The food was so delicious!! I wish we could get Chinese food like this in my neighborhood.  I would have given them 5 stars but the service was not great ."
    },
    {
        "id": 44,
        "text": "Food is delicious, from appetizers to entrees, delicious.... Love the fresh mango smoothie =D i'll be returning with friends....\n\nI've been back a few times this past month, and tried some new dishes and I have to say, this is my second favorite restaurant in Philly's China Town...\n\nSalt & Pepper Pork Chop\nIndonesian Fried Rice\nPork Belly dish.. Yum...\n\nthis place is a must TRY!!"
    },
    {
        "id": 45,
        "text": "You know what fools?  You gotta get the 3 Cup Chicken.  You know why?  Cause it's good - it's real good.  It's a complicated sweet flavor with some unexpected seasoning and basil.  It's remarkable.\n\nThis dish is not on the english menu.  It's on the back - in Chinese, which I can't read but somebody was good enough to post a few things in English.  \n\nSo, last time we was there, it was out third time ordering it.  The waitress (who is so friendly and so happy to make recommendations) tells us that most Asian customers order the sauteed Chinese spinach  with this dish so thats what we did and it was terrific.  \n\nOh yeah, you  know why she recommended that?  Because she remembered us.  And, she said next time we come in she'll make other recommendations off the Chinese menu for us.  \n\nThis is a great little Philly treasure.  I have a Taiwanese relative who is translating the menu so we come off like we actually know some sh!t.  \n\nGo there and be happy."
    },
    {
        "id": 46,
        "text": "This place wasn't tso good. Their general tso's chicken was almost too salty, by which I mean that it was very salty. The portion sizes are also kind of small. Considering that the price was $15, I would say that this is a skip."
    },
    {
        "id": 47,
        "text": "Nice service and good food for traveling vacationers. Easy to find in the front of Chinatown near the Jefferson SEPTA stop."
    },
    {
        "id": 48,
        "text": "Small place. Okay food. Asked for spicy chicken chowfun. The food wasn't spicy at all. Had to ask for siracha on side. The fried rice was good though."
    },
    {
        "id": 49,
        "text": "Had a great experience. Came in on a hot, muggy day and the a/c was blasting. The dining area was pretty small, but there weren't many other people around. We ordered scallion pancakes for an appetizer, but it came in with the main dishes. Still, it was really hot and crispy. The dipping sauce it came with was some kind of tangy vinegar. \n\nMy entire table ordered Taiwanese Beef Noodles. The soup came in a flavorful, mildly spicy broth. The noodles were decent and a tad chewy; the meat was fatty but righteously tender. It was absolutely delicious and I was sad to finish because it was so good. One cannot experience this in take-out form (which I did many times before actually sitting in). I guess my only complaint would be the timing of the dishes. I couldn't stop eating the scallion pancakes when I was eating them, and I couldn't stop eating the noodles when I was...you know. O, 'tis ever thus the afflicted heart... Otherwise, service was friendly and the prices were reasonable."
    },
    {
        "id": 50,
        "text": "Came here just for their Taiwan beef noodle soup. Was spicier than expected but overall there was a lot of flavor in the broth. The best broth I think actually but could be due to the oil in it. Portions of beef was great since the price for a bowl was under $7. Would come back here again as the noodle soup was good and service was fine."
    },
    {
        "id": 51,
        "text": "One of the best spots in Chinatown. I've been going here for a long time and it is always consistent. The staff is great! It's byob and is a really good jump off point for a night out or birthday dinner. They will accommodate your party. They also deliver which is just as good and fast! Great place!"
    },
    {
        "id": 52,
        "text": "This is the only taiwanese restaurant in Philadelphia.The food is very authentic close to as if I was in Taiwan. I like three cup chicken, oysters pancake, minced pork with rice, taiwanese meatball, etc."
    },
    {
        "id": 53,
        "text": "Tried this place before a show at the Trocadero. I had General Tso Chicken and my friend had eggplant with garlic sauce. Both were really fresh and tasty. Huge portions and cheap Tsing Tao beer. Glad we went."
    },
    {
        "id": 54,
        "text": "Small place, cheap, not bad. They have Taiwanese cuisine! beef noodle soup!"
    },
    {
        "id": 55,
        "text": "Delicious!  Very good price and the food was delicious.  I would definitely get the shrimp walnut specialty dish and the Indonesian fried rice.  I didn't find the pork belly and tofu dish to be that good, but others at my table enjoyed it.  Also the eggplant was AMAZING.  Really, everything was great.  Would definitely come back here."
    },
    {
        "id": 56,
        "text": "I stopped here to have lunch with my family.  The waitress brought us room temp tap water in a cup with no ice & no straw.  I had to ask 3xs for a straw.  We ordered & I wanted pork fried rice instead of reg fried rice, the waitress took issue with that.  I told her I didn't care about an up-charge that was fine, I just wanted pork fried instead.  Then I requested my spring roll not to b Shrimp bc I'm allergic & she was strange about that.  We got our food n ate.  I was not impressed the food was ok.  The pork in my rice was fatty & just not good. My veg spring roll had nothing in it no veggies.  Everyone's food was mediocre.  Next thing we know a party of 10 walk in & guess what they get..... lunch special menus.  We were not given that menu or option to view it when we were seated.  Had I paid less for my mediocre food & service I might have not been so upset.  When we asked the waitress about why we were not given lunch menus she said \" you need to ask for it\".  Since when is it my job & not the waiters job to ask them about specials.  Any other place will inform you about special either for lunch or of that day.  I will not be going back here & I don't nor will I recommend it to anyone."
    },
    {
        "id": 57,
        "text": "First time at this cute place. The food was good! Not sure what the American menu is alll about but damn the chinese menu was great! I suggest the beef noodle soup(Tawainese style), da jian mien, pork chop over rice and the pork belly in hot sauce!! Also the watermelon shake was yummy!! I will be returning for sure!!"
    },
    {
        "id": 58,
        "text": "GOOD: Before I went to Empress Garden, I check yelp, to see which dishes are nice, I saw many people recommended Taiwanese Beef Soup Noodle and Scallion pancake, these reviews are true!!! They are DELICIOUS... We also have ordered the Meatball and Peking Noodle with Meat Sauce... I have to say the noodle is as good as the beef soup noodle.\n\nBut the meatball is not as good as we expected it to be (actually, it is not really a meatball, it is some minced meat in some sticky bun). And one more flaw, we asked for the wifi password, but the staff said she didn't know. Emm, you work here and you don't know the password?!!\n\nBut for sure we will come back to try again :D"
    },
    {
        "id": 59,
        "text": "I've enjoyed this place before and after new management. The food has remained the same, tasty. Not my go to place but one of the better restaurants in Chinatown. It's a small place with a very friendly staff. I don't think this is a Taiwanese restaurant but Szechuan which means things should be spicy. It's not that spicy in my opinion. \nI typically order the Ja Jiang Mien, Beef Noodle Soup and Ma Pao Tofu."
    },
    {
        "id": 60,
        "text": "Authentic Taiwanese food, thumbs up for oyster pancake and beef noodle soup!!! Efficient and friendly service."
    },
    {
        "id": 61,
        "text": "Came with my SO a few days ago and ordered the salt and pepper pork chops & the pork w/eggplant in garlic sauce over rice. The pork chops were good, albeit a bit undercooked, they also could have benefited from a bit more salt! The eggplant was great, and definitely a dish I'd order again. Great portion size for what you're paying as well. \n\nMajor plus: Free scallion pancake and soda with check in!"
    },
    {
        "id": 62,
        "text": "Place is small but food is delicious. Servers are friendly and helpful. Scallion pancakes are great here."
    },
    {
        "id": 63,
        "text": "PROS: Authentic Indo-Taiwanese food, good prices\n\nCONS: Small seating area, unappealing store front, need a Chinese-literate friend to fully enjoy the menu\n\nWHAT TO ORDER: \n-Taiwanese Oyster Pancake\n-Indonesian Fish Curry\n-Indonesian Fried Rice (Nasi Goreng)\n\nI love love love the food here! They have recently renovated the interior of the restaurant so it looks nicer and seats more people. If you can't read Chinese, your English menu options are terribly limited and contain only about 1/3 of the Chinese menu. I love the Indonesian-style cuisine here and have been here over 5 times this past year. I'd like to call it my secret happy place."
    },
    {
        "id": 64,
        "text": "A really cute litte spot for super authentic Chinese food. The salt & pepper sesame chicken wings are my new favorite. That and the steamed eggplant with roasted garlic & cilantro. Both are so good! But everything I've had has been delicious :) Definitely a great must try."
    },
    {
        "id": 65,
        "text": "Overpriced Chinese takeout food. \n\nThe food in the menu were exactly like the ones from a Chinese takeout menu. Definitely was not impressed especially with the fact that everything is about $2-5 more than regular price. My friend and I ordered soup, and while everyone else got their appetizers, the waiter seem to forgot our soup. I was a little annoyed that I had to remind him about it. The reason I gave it a 3 star instead of a 2 star is because I ordered the Indonesian stir fried noodle, it was actually really good. \n\nWill I come back? Possibly. I won't completely rule them out but definitely not liking their overly priced food."
    },
    {
        "id": 66,
        "text": "I'm not really looking for any kind of specific regional food, just something that's delicious. Which is something Empress Garden does. The hostess/waitress alone is a nice part of the restaurant, she remembered me and even that I was a vegetarian, and then helped dishes for me. Considering that it had been a month and a half since I last went there, it was a nice little extra. \n\nThe sweet and sour soup is absolutely delicious, very spicy, but the broth captures all the spices together. Mixed vegetables and rice were alright, but really how much of a twist can you take on that? They were fresh and the rice was fluffy, so there wasn't much to complain about. Also the free tea and water really helps with cutting the bill, so you don't really need a beverage. \n\nOverall, a cute little place. I recommend."
    },
    {
        "id": 67,
        "text": "Love this spot. Been here for years and their food is consistently the best. Very authentic seasoning and menu."
    },
    {
        "id": 68,
        "text": "Fast service, reasonable prices. The orange chicken was delicious- big actual pieces of chicken (not just breading) and great sauce. Pork soup dumplings also amazing"
    },
    {
        "id": 69,
        "text": "I just moved to Chinatown and being that this place is very close to my apt, my mom and I tried it for dinner one night. They give you a huge portion for the price of what you order and although we went for dinner, I'd like to go for lunch sometime because the lunch menu seems to be a great deal! The wonton soup was decent and we also had vegetable fried rice and chicken with broccoli. The chicken was a little bit chewy, but what can you expect from Chinese food? I would definitely go back and try other dishes now that I've tried the ones I typically like."
    },
    {
        "id": 70,
        "text": "Decent oyster pancake, scallion pancake, and ma po tofu (but very salty). Super clean and easy to find. Didn't have the zha jiang mien but will try next time."
    },
    {
        "id": 71,
        "text": "once in awhile a taiwanese food crave will creep up on me and engulf me until i am lumbering down chinatown looking for my childhood favorites.  a handwritten poster on the window reads \"taiwanese snacks\" in chinese, listing some taiwanese favorites which was enough for me to venture in.\n\nfor those that do not read chinese, unfortunately, the authentic dishes are only listed in chinese on the back of the menu.  some items will appear on the english pages but not much.\n\nhere is what we ordered:  \n\n1.  taiwanese oyster pancake ($6.95). it definitely did not come close nightmarket quality.  it was passable and more \"homestyle.\"  it seems like no one really knows the secret behind the red sauce so most places outside of taiwan use a ketchup/soy sauce mixture.  empress garden is no different.  the oysters i thought were non-existent.  but the starch mixture had a decent crisp.\n\n2.  taiwanese crystal meatball (ba wan) ($3.95).  the outershell was ok.  the meat filling could use bigger chunks of meat and some bamboo shoots.\n\n3.  scallion pancakes ($3.95).  one of the best scallion pancake i've ever had.  it's more deep-fried than pan-fried tasting.  i'm not sure why they bring out a vinegar dipping sauce with it though.\n\n3.  steamed rice with braised ground pork (lu rou fan) ($6.95).  eh...  it was okay.  really overpriced for a bowl of rice, even if it's a big bowl of rice.  don't get me wrong, it is quite tasty but just not authentic enough (meat is too lean and sauce is not greasy enough).\n\n4.  mango smoothie and red bean smoothie ($3 each).  both were delicious!  not too sweet and full of flavor.  i liked how they served the drink in a glass rather than a plastic cup.\n\noverall, i am only commenting on the dishes i tried.  i thought they tasted fine but were not quite authentic.  my friend who grew up in taiwan was pretty disappointed but comparing taiwan with empress garden is not really fair.  on its own, i think empress garden does a nice job offering something different in philadelphia.  \n\nbesides the food, service is really warming.  the owners are really attentive and like to chat with their customers.  they are enthusiastic about recommending dishes and keep the water coming."
    },
    {
        "id": 72,
        "text": "This is the first Chinese place we checked in to as new comers in Philly and everything looks awesome at this point! There portions are really large and good value for the money"
    },
    {
        "id": 73,
        "text": "Went to Philadelphia for a long weekend with my wife. We were hungry for Chinese food and went to Chinatown to try our luck, not being from this city and not familiar with the restaurants. Nothing in particular drew us into this particular restaurant, but we decided to try it...and we were not disappointed. Very friendly people who were willing to adjust to our Vegan pickiness. Really enjoyed the food. Not much on atmosphere but would visit again if we were ever in the neighborhood."
    },
    {
        "id": 74,
        "text": "Environment: Not the best environment but the food most certainly compensates for this.\n\nService: Comes out standard, pretty quickly. Again, the food is what makes this place great. \n\nFood: I've never been to Taiwain personally, but from what my friends say, the Taiwanese beef noodle soup is some of the most authentic you can get here. Compared to other places in Chinatown that offer hand-drawn noodles, the brother is thicker without compromising the taste. I WISH they used shaved noodles to maximize the authenticity of being back in Asia; however, they do an excellent job. Additionally, things like the scallion pancakes and oyster pancakes were ABSOLUTELY some of the BEST I've ever had in Chinatown, hands-down. Not the most flavorful overall with the soup; however, I completely understand that I have a very salty palate...\n\nRestrooms: Nothing extravagant. It's Chinatown.\n\nPrice: For $12 each between 4 people to have their own soup, share of scallion & oyster pancakes, easily a great deal."
    },
    {
        "id": 75,
        "text": "Good food! The service is pretty slow, but the food is more than enough to make up for it. It's a tight fit so don't bring too many people."
    },
    {
        "id": 76,
        "text": "Fantastic. The menu doesn't bode well with the promises of General Tso's, but it's typical Chinese done right. The Egg Foo Young is the best I've ever had by a longshot.\n \nService was impeccable."
    },
    {
        "id": 77,
        "text": "I'm usually not a fan of Taiwanese cuisine (been a Cantonese cuisine fan all my life) but the dumplings and great service won me over (plus, great Chinese food is slim pickings in Philly).  Keep up the good work!"
    },
    {
        "id": 78,
        "text": "Loved their spicy eggplant special!!! Great friendly service and its small and cozy! A++"
    },
    {
        "id": 79,
        "text": "Their scallion pancake is the best I have ever had. I am an American born Chinese whose family is the type to eat Chinese food in different Chinatowns when traveling. \n\nI also ordered the zan jiang mian (i think the translation is black bean noodle?) It was different than the usual zan jiang mian. Had more tofu, and cut green beans, and less meat, but it was still delicious."
    },
    {
        "id": 80,
        "text": "The worst beef noodle soup I have ever had. The beef was rough, dry, and cardboard like. The picked veggies was away too sweet. Soup was too salty and full of MSG. It is not Taiwan styles beef noodle soup! Very Misleading and disappointed. Taiwanese meatball supposed to be soft, it was crispy, and hard to chew in the middle. Definitely under cooked.\nOyster omelet was taste awful. The pork buns were terrible!!! \nIt is NOT Taiwanese food as it claimed. Don't waste your money!\n\nIn addition, the waitress was using her thumb and index fingers holding the water cup lid. Her thumb was soak in our water. That's disgusted! Stay away from this restaurant! It just Chinese takeout qualify. Not worthy to eat."
    },
    {
        "id": 81,
        "text": "The Empress is back! No more soggy/soupy food, as good as the original :)"
    },
    {
        "id": 82,
        "text": "My friend and I came here last night for an early dinner, and I'm definitely a fan!\n\nWe started out with shares of the fishball soup and the oyster pancake. The fishball soup was simple yet tasty, and consisted broth, fishballs, and bok choy. We could have done without the oyster pancake, though. It didn't taste at all of oyster, and instead of the thick, slightly sweet, sauce that topped it, itself a gooey mix of rice, egg, and whatever else was in it. But certainly not of oyster.\n\nWe then continued with a share of the three cup chicken as our main dish, which was delicious! It actually reminded me of a chicken dish that my mother made while I was growing up."
    },
    {
        "id": 83,
        "text": "good beef noodle and fresh soybean milk"
    },
    {
        "id": 84,
        "text": "Only been here once for a quick lunch. I was craving for some noodle soup, so I got the pork chop with noodle soup. It was pretty good, but since I was in a rush, I burt my tongue! The soup was extremely hot in temperature, which makes me think it may bit too oily. The fried pork chop was great because I love fried things. Nothing out of the ordinary for me here."
    },
    {
        "id": 85,
        "text": "A no-frills restaurant in Philadelphia's Chinatown serving authentic Taiwanese (and Chinese) dishes. They offer bubble tea as well as smoothies in a range of interesting flavors including avacado! Their service is uneven, however. One or our orders (three-cup chicken) simply got dropped. They totally forgot about it. They also forgot about 2 orders of smoothies. We are a table of 10. \n\nHighly recommended are their fried veggie with garlic, their whole fish, crispy tofu, and three-cup chicken."
    },
    {
        "id": 86,
        "text": "Came here just for their Taiwan beef noodle soup. Was spicier than expected but overall there was a lot of flavor in the broth. The best broth I think actually but could be due to the oil in it. Portions of beef was great since the price for a bowl was under $7. Would come back here again as the noodle soup was good and service was"
    },
    {
        "id": 87,
        "text": "A very small and quiet place to hang out with friends. Food was good. Ordered the scallion pancake, shrimp fried rice, seafood soup, and beef chow fun. Was very delicious. If you want a cozy and warm place to chill with friends. Totally come here. :) BTW staff was very polite."
    },
    {
        "id": 88,
        "text": "I came here on someone's recommendation. She was recently here for a Taiwanese program and really enjoyed it. Unfortunately I can't say I had the same experience. The service was good but everything else was not. The restaurant is very uninspiring, it looked and felt old. Food wise, it was some of the worst I've had. I ordered oyster pan cakes, braised pork belly with tofu, noodles with braised pork and chicken corn soup. The oyster pancake tasted under cooked. The oysters themselves were not fresh, it tasted very old and frozen. The braised pork belly with tofu over rice lacked presentation and mediocre in taste. The noodles was ok but again, not a big fan of the sauce. It wasn't bad, but it's not distinctive in any way. The soup was OK, but I could get that anywhere else. In all, I did not enjoy my meal here. I have heard that this place used to be really good until recently. Maybe one day I'll give it another try. For now though, I can't really recommend it."
    },
    {
        "id": 89,
        "text": "Can't get pork fried rice like that in Lancaster. Will be back again for sure. Really fast service too."
    },
    {
        "id": 90,
        "text": "Oh. My. Goodness. This is literally some of the best Asian food I have ever eaten. I highly suggest getting the Vegetable Fried Rice, Vegetable Dumplings, Orange Chicken, or Sesame Chicken. My family ordered these dishes and were delighted. We couldn't get enough of it! The dishes were large for a good price and we were amazed by the waitress's speed and charm. Awesome restaurant and highly recommend it!!"
    },
    {
        "id": 91,
        "text": "This place has everything I want for my dinner. The crispy pancake makes me feel at home. The sweet and sour pork is great, better than the one in Boston's Chinatown. The noodles come with large portion, and they are amazing!!!"
    },
    {
        "id": 92,
        "text": "great general tso chicken combo. served with wan ton soup or hot and sour soup and egg roll. well worth it."
    },
    {
        "id": 93,
        "text": "Over the past year my hubs and I have been exploring Chinatown restaurants and I have to say Empress Garden is one of my favorite! First of all the service is excellent and most of the time quick. As for the food, everything is great! The scallion pancakes are a must for an appetizer. The way they make them is so crispy and pretty lite. Their smoothies are delicious and nutritious. From observation, the way they make their mango smoothie is they cut mangoes, add ice, and blend them together. The texture is thick and the taste is sweet. As for the entrees, Empress Garden never disappoints. The Indonesian rice or lo mien is recommended. The flavor is spicy and rich. In addition, the beef soup is tasteful. Even the Americanized Chinese dishes like General Tso's chicken are delightful. One of the best General Tso's chicken is my opinion. Another plus is that the portion size is reasonable for the price. If your looking for a new place to try Empress garden is a must. It has a versatile menu for meat eaters and vegetarians, as well as those looking for a nutritious/healthy meal."
    },
    {
        "id": 94,
        "text": "The food was really good the service not so much. I asked the server four times for a straw. She finally gave it to me but seemed not too happy about it. She wasn't friendly and spent a lot of time sitting around on her phone"
    },
    {
        "id": 95,
        "text": "One of my favorite places in Chinatown!\n\nCheap prices, decent portions, English speaking and patient servers, complementary tea, AND real-fruit smoothies! Don't be fooled by the small location - i've gotten soups, noodles, and rice at this place, and have never been dispappointed."
    },
    {
        "id": 96,
        "text": "Probably the worst hot and sour soup I have ever eaten, and I didn't eat all of it, consistency of half set jello and no flavor, the main course was spicy tofu, it was bland like the waitress who was more interested in talking on her iPhone than talking to customers, not a place I would recommend or go back to"
    },
    {
        "id": 97,
        "text": "Wanted to try a Chinatown restaurant while in from Florida and there were definitely a lot to choose from.  Based on reviews, tried Empress Garden and had a great meal.  Started with Scallion Pancakes and Pan Fried Dumplings, the dumplings were hand made with lots of pork.  Didn't have anything fancy in Sweet and Sour Chicken, Szechuan Shrimp, Pork Fried Rice, and Sautéed Green Beens.  Everyone was friendly and they even moved over another table to put all the different dishes."
    },
    {
        "id": 98,
        "text": "A friend stopped by tonight with an order from Empress Garden. Wow! It was so delicious. I could seriously crave the Taiwanese noodles everyday. I've walked by here so many times and have never thought to stop on in. I guess I would always go to my safe spots. I have been missing out! I need to get back there asap!"
    },
    {
        "id": 99,
        "text": "Their food was really delicious!  I would definitely recommend the salt and pepper chicken wings, soup dumplings, and chicken with mixed vegetables.  I can't wait to go back to try even more of their selections.  Oh, and their watermelon drink is absolutely wonderful!!"
    },
    {
        "id": 100,
        "text": "Love this place! It's nice and small & the staff is always friendly. The food is very light and refreshing. We always get the chicken and broccoli combo with 2 shrimp rolls instead of the soup. The price is really good as well, our bill is never over $30."
    },
    {
        "id": 101,
        "text": "How is it possible that this restaurant has such high ratings???\n\nI ordered delivery, shrimp fried rice. Pretty difficult to mess up. Somehow, this restaurant managed to impress me by the level of which they could mess up fried rice. \n\nThe fried rice was white rice drenched in soy sauce with an overpowering flavor. There was nothing else in the large box except for rice and shrimp that were slimy, and had an off taste. I still feel like I might throw up after eating one. \n\nThe biggest crime here is that the platter was $7.95. Including costs of tax and delivery I paid $15 for a meal I threw away. If anything really grinds my gears it's throwing away money I could be eating somewhere else."
    },
    {
        "id": 102,
        "text": "Oyster pancake is quite authentic and delicious! I've never had it outside of Taiwan but I would definitely say it is yummy!"
    },
    {
        "id": 103,
        "text": "My absolute go-to spot in China town for years! Honestly, the woman who works here used to know mine and my freinds' orders for a while. I don't think you can go wrong whether you're looking for some Americanized Chinese or something more adventurous. \n\nScallion pancake and zha Jian mien are my FAVORITE. They also happen to make what I believe to be the best sweet and sour chicken ever. The tempura batter is always crispy and never gross/ soggy/ greasy like at a lot of places."
    },
    {
        "id": 104,
        "text": "I have had food from here more than 10 times. I don't eat at the restaurant because I don't like the interior (to sparse and sterile), but I do often get heir food to go (I pick up from the restaurant when in Chinatown). I very much like their 3 cup chicken and their mapo tofu. The prices are pretty reasonable and the portions fairly large. I usually order about $50 of take out food and that's enough to last 2 or 3 days."
    },
    {
        "id": 105,
        "text": "The restaurant decoration doesn't look attractive at all, but the food is definitely authentic and yummy! The waitress was very friendly. I liked the food so much that I even wanted to go again the next day!\n\nNotice that they close on Mondays."
    },
    {
        "id": 106,
        "text": "Trying their Taiwanese boot noodle soup and scallion pancake. They seems to offer authentic Taiwanese dishes here."
    },
    {
        "id": 107,
        "text": "Good scallion pancakes. Best part about the place is that you can access a Pokemon Go gym from the inside, ask for the wifi if it doesn't work."
    },
    {
        "id": 108,
        "text": "This may be Chinatown's only Taiwanese restaurant. I've now been here twice and tried the san bei ji (\"three cup chicken\" - it tastes a bit like bourbon chicken) and the zha jiang mian (\"fried sauce noodles\" - noodles with pork, cucumbers, and soy sauce). Both were great. The waitress was very helpful in providing suggestions. The place had a very friendly atmosphere, and at no time did I feel rushed out of the place. While the decor is basic and the prices are at the higher end of low (expect to spend $7-10 for an entree), the quality of the food was good enough that I feel the need to give this place five stars."
    },
    {
        "id": 109,
        "text": "Although I am a chinese, I definitely love this awesome taiwanese restaurant. Hakkan tofu casserole & Three cup chicken both being extremely delicious. In between Four rivers and here, the old owner at Empress Garden is so much more friendly. If you order take out, make sure that you try minced pork rice (lurou fan).  Highly recommened."
    },
    {
        "id": 110,
        "text": "In some other city or in some other location, I would be impressed with the food. It is good. But in the middle of Chinatown, with so may other restaurants, it is hard for this place to stand out.\n\nThe congee is okay, nothing special, pretty standard rice porridge. The fried dough goes nicely with it though. The noodle soups are good as well. The beef noodle soup is standard. If you've never had it before and you're feeling adventrous, the pork pickled turnip is tasty. I though it was a bit heavy on the pickled turnip, but take a few out, and its just right.\n\nSolid restaurant, in a area with a variety of lots of great chinese food options."
    },
    {
        "id": 111,
        "text": "This place was fantastic, and we will definitely be back next time we are in Philadelphia.  The restaurant is small and unassuming, hard to notice amongst all the other restaurants on the street by the gate.  We came in here on a cold winter morning for breakfast and were the only ones in the restaurant, other than the owner and what I can assume to be her family.\n\nWe proceeded to stuff ourselves silly.  The food is great, and cheap.  They serve huge noodle soups that are hot and filling and satisfying and also bring out a teakettle of delicious hot tea.  It was just what we needed.  What a great place!  It was also right in the middle of Chinatown, which was much more authentic than the one in DC."
    },
    {
        "id": 112,
        "text": "Empress Garden really hit home with it's authentic dishes. We ordered a beef noodle soup (Taiwanese specialty), Zha Jiang mien, and Indonesian chicken curry. All three dishes tasted very well done. The beef noodle soup had a lot of meat and the perfect amount of tendon, too. It was also cooked well so that the pieces weren't chewy at all. Broth was fragrant, not oily at all. Zha Jiang mien was good - although the pork seemed a bit salty (kind of the point, I know, but a bit too salty). The Indonesian Curry chicken was really, really good. Lots of chicken chunks, curry was nice and spicy, and took home the other half for dinner! Will definitely come again to try more of their other ethnic dishes!\n\nAlso, great service - did not mind that we brought in some bubble tea drinks."
    },
    {
        "id": 113,
        "text": "Amazing Taiwanese restaurant, often muddled and masked, between the plethora of other Asian cuisines. Don't miss out though! This place has been well established in Chinatown, with a great friendly owner. \n\nMust try:\n\n- Scallion Pancakes\nWarning: their sauce is a sweet vinegar base, not your typical soy sauce base. If you enjoy a zing and tangy flavor, this is up your alley) \n\n- Oyster Pancakes (topped with hoisin sauce) \nWarning: if you don't like the texture of oyster, don't get this. Why? Hm, what's a better way of saying this... the texture is \"slimy\". Yet, smooth and jello-like. Don't expect a typical pan-fried, crunchy, doughy scallion-like pancake. But if you enjoy oysters, this is to die for. \n \n- Taiwanese Beef Noodle: great for the price, large portion, and taste. A traditional favorite in Taiwan. \n\n- Braised Pork: pork belly. melt in your mouth. sweet soy sauce base. #whatishealthy?"
    },
    {
        "id": 114,
        "text": "Excellent Taiwanese food in a casual setting. We got the three cup chicken (chicken cooked in sesame oil, soy sauce and rice wine with basil and garlic), garlic chinese broccoli, and a classic Taiwanese dish of braised pork belly over rice. Each dish was juicy and savory, so good that we got an order of general tso's to go. Will be back again soon! Five yelp stars"
    },
    {
        "id": 115,
        "text": "I look at every restaurant in Chinatown. This is the one we went to. When we first walked in it wasn't exactly what we were expecting. Small and very plain, but very clean. The servers were very quick and extremely nice, and helpful. then the food started to come out and we were \"BLOWN WAY\"!!!!!!!! Very fresh and we could not decide what was better. This place is truly a diamond in the rough Ten star!!!!!!!"
    },
    {
        "id": 116,
        "text": "My daughters and I are in Philly to enjoy a few days. We looked up cheap eats on Yelp that were near us. All of our dishes were quickly served and delicious. Try the Beef and bok cho over rice!"
    },
    {
        "id": 117,
        "text": "The last time I had Taiwanese food was in Taipei a little over a year go. The weather was muggy when I was there, so I devoted my entire visit to experiencing the food culture. As expected, the dishes at Empress Garden are nowhere close to as good as the best spots in Taipei, but they at least have the right flavor profile.\n\nOyster pancake\nOut of all the dishes, this one was the best. The flavors, textures, and colors were on point. My one complaint is a big one: there weren't any whole oysters in the pancake.\n\nBeef noodle soup\nAlthough better than your standard Chinese beef noodle soup, the broth lacked depth. The beef was so tough I couldn't bring myself to eat it. The pickles were excellent. There were no tendons.\n\nWonton soup\nThe plump wontons were filled with pork, shrimp, and mushrooms. The wontons were served in a clear broth with seaweed and Chinese vegetables. Overall the dish was good, but the cook was a little heavy handed with the sesame oil. \n\nSpecial tofu and meatballs\nThis was on the Chinese side of the posted recommendations. The dish consists of tofu stuffed with meatballs and stewed. It looked and tasted very homemade in a bad way. The tofu had broken apart and the dish was overall bland.\n\nAlthough none of the dishes I had were perfect, I still have high hopes for my next visit. I plan on trying the pork chop rice and stewed trotters next!"
    },
    {
        "id": 118,
        "text": "I'm determined to find all the gems of Philly Chinatown.\n\nThis place is a solid 4. Efficient, spacious (relatively), food is mostly authentic and very reasonably priced.\n\nWe ordered beef noodle soup, shrimp w broccoli, and San Bei chicken (sorry, don't remember the English name). Although all the dishes were tasty, the chicken was the MVP.\n\nDon't forget to Yelp check in for your free onion pancakes!"
    },
    {
        "id": 119,
        "text": "After reading others' reviews, we selected Empress Garden. Clean, fast service, good food, reasonable prices. Our favorites were the pork and duck dishes. The vegetables were all fresh. Good choice."
    },
    {
        "id": 120,
        "text": "This is very genuine Taiwanese cuisine. Coming from the west coast and growing up with a lot of Taiwanese friends, I haven't seen many good Taiwanese restaurant in the east coast but this is one of the best ones in the east coast. It feels like going home."
    },
    {
        "id": 121,
        "text": "Chinatown at its finest...food was spot on.  Try the scallion pancakes...perfectly crisp and not greasy.  Service excellent..value excellent..wife had low mein..cooked perfect.  I had general tso shrimp..sauce was tasty and thick..very good.  Will be back..."
    },
    {
        "id": 122,
        "text": "We went here on Saturday night. The place only holds about 25-30 people tops so we had to wait maybe 15 minutes but it was well worth it. Not a fancy place but very clean and the people are friendly. The food was some of the best Asian I've had. We had the scallion pancakes which are amazing! The Salt and Pepper chicken wings are awesome too. Nice and crispy, not greasy at all, and are tossed in a vinaigrette with cilantro and pepper slices. We also had the fried pork chop with rice. The pork chop was super crispy, cooked perfectly and had a beautiful subtle spice too it and it was absolutely not greasy at all. The Peking Noodles with meat sauce was very good too. I have to say, this is the hottest food (temperature wise) I have ever had at a restaurant. As soon as the food is cooked it's in front of you in seconds. I really like that! You can tell that the chef knows what he is doing! And all this for $26. If I lived in Philly, I'd be here all the time."
    },
    {
        "id": 123,
        "text": "Best place for Taiwanese food in the area, in my opinion. I always stop by for a big bowl of the Taiwanese Beef Noodle soup, and treat myself to a freshly-made, real-fruit mango smoothy (watermelon in the late summers, too!).  Their three-meat dishes, Chinese watercress with garlic, and fish dishes are all delicious, and remind me of eating in Taiwan.\n\nHowever, there are also the generic dishes for those less adventurous or that cannot read the Chinese menus. Also, seating is tight, it's a small, but often busy space! We've also ordered larger dishes for catering (rolls, rice, noodles, and meat dishes), and they were swift, and gave us a discount!"
    },
    {
        "id": 124,
        "text": "Yeah, this place looks shady, dirty and dingy. But they have THE BEST Taiwanese Spicy Beef Noodle Soup and Jia Jiang Mein (noodles, no broth, mixed with a bunch of chopped beef, tofu, greens etc). Those are the only two things I've ever had from here and they're awesome. My family orders take out from here on those cold winter days when we need some hot soup to warm us up!\n\nStop by and try either, you won't be sorry."
    },
    {
        "id": 125,
        "text": "If you're too lazy to read the rest of the review just know:\n\nThis place has great food and decent prices! Try it out!\n\nFor those who like/don't mind reading my Yelp rant, here it goes!\n\nThis is the only Taiwanese restaurant in Philly, but its pretty good so I don't mind at all! The dishes here are a little salty for my own preference, but still very yummy.\n\nTip #1: price = portion size. \n\nI thought I might have need an extra appetizer, turns out I took half my meal home with me. I ordered the peking noodle with meat sauce for $6.75. It tastes a lot than it sounds. The portion size was bigger than my face. \n\nTip #2: Their Taiwanese meatball isn't the type of meatball you're use to. \n\nIt's actually a very tradition taiwanese dish, I was surprised to find it on the menu, I haven't been to many restaurants that sell it. Its sort of like a Chinese pork bun, except the outer layer is made up of tapioca flour and starch. It has interesting texture if you want to try it out. I for one thought it was pretty good.\n\nThe prices are actually a lot lower than I expected for a family style restaurant. Each large entree is around $10, at most $15. Noodles and rice dishes don't exceed $10. \n\nTo the point: I will definitely come here again!"
    },
    {
        "id": 126,
        "text": "Pretty decent deal on some pretty good Chinese food. Def would go back for other stuff. \n\nService can be slow tho just FYI"
    },
    {
        "id": 127,
        "text": "It's kind of hard to be impressed by a Taiwanese joint in America when you've had really good Taiwanese food in Taiwan.  Visiting Philly, I had to try Empress Garden.  It was very good.  The owner was very friendly and attentive.  The oyster omelet was good ... probably the best I've had in years but that only means the others have pretty much sucked.  If I ever went back to Philly, I'd probably visit Empress Garden again.  I wish they had the Taiwanese menu printed in English!!"
    },
    {
        "id": 128,
        "text": "Outstanding meal.\n\nI got into Philly late on a snowy evening. This restaurant was open so I stopped in. It was an outstanding meal. I had the onion pancake and then seafood hotpot which was perfect for the kind of evening it was. Good fish with a lot of scallops, shrimp and other goodies."
    },
    {
        "id": 129,
        "text": "Go Philly! Making excellent Taiwanese dishes. \n\nFamily and I took a day trip to Philly to check out their Chinatown. We found this restaurant through yelp and was not disappointed. \n\nTheir scallion pancakes were great and their beef noodle soup is worth getting. Would not recommend their Xiao long nap because I think it's from Wei Cheng (stuff you buy at the supermarket that is pretty good for frozen soup dumplings). Also their veggie dish is well seasoned. \n\nDefinitely a comfortable neighborhood sit down restaurant with no frills and good food."
    },
    {
        "id": 130,
        "text": "This is a small restaurant. When we visited, we were the only fork-using, Caucasian people in the place. Judging by the other diners, I'm guessing this is fairly authentic cuisine that may appeal more to those who are familiar with it. We got the scallion pancakes which were very good. I'd go back just to order those. My brother had the crispy duck which he and my sister enjoyed. However, my sister ordered the three cup chicken that everyone here seems to like. We each tried one bite and then didn't eat any more of it. The taste was similar to turkey and gravy for me, and I liked the flavor. The problem is that it's basically just a bowl of meat and... other parts of the chicken. In order to get a bite of chicken, you have to separate it from the heavy layers of fat and the (cut) bones that are attached. If you don't succeed, you basically end up with a sharp bone in your cheek or a mouth full of fat. I'm a fan of lean, boneless meat myself so this was not appetizing for me. I had the sweet and sour pork. The coating was crisp and not too bready, but the pork inside was a little too chewy. I probably should have ordered the S&S chicken instead. I also like pineapple with my sweet and sour, but my plate came with a grand total of ONE pineapple chunk. The women working there were nice. The place seemed clean, but it isn't somewhere I'd take a date (vinyl tablecloths for one thing)."
    },
    {
        "id": 131,
        "text": "I had not done any previous research about this place, but rather found myself in Chinatown with a hungry friend and wanting dinner. We poked our head in and it wasn't too crowded, which was nice because 15 minutes later it was packed out. \n\nIt's a small place, so I'm not surprised that it filled up quickly, but it doesn't feel cramped, and it is quite clean and well-lit, with cute and up-to-date furnishings and dishes. Small details, but some places in Chinatown can be a dodgy about these things. The service was quick, pleasant and helpful, the waitress serving us gave me her recommendation on which smoothie was the best. The mango smoothie definitely was a highlight of the meal, the lo mein I ordered was satisfactory but I was most impressed with the smoothie and frozen watermelon ice. $3 each, which I think was quite reasonable. The smoothie was served in a cute glass, and it was really quite good, and I'm a bit picky about smoothies. (It wasn't one of those depressing smoothies filled with ice and disappointments)\n\nYes, there are places in Chinatown you could get food a bit cheaper (but really, not by much, it's quite reasonable), but I was quite pleased with the meal and the feel of the place. It's the kind of place you can take people to enjoy a more non-chain-restaurant feel of Philly without sacrificing cleanliness or nice/comfortable ambiance. I'll definitely be going to Empress Garden again."
    },
    {
        "id": 132,
        "text": "We were visiting Philly with a very picky eater. My daughter will only eat Chicken and broccoli. Bad thing to order here. Chicken, broccoli, and carrots all had the texture of boiled food. She said the sauce was good and ate that on her rice. The pork with string beans and pork with garlic sauce were ok."
    },
    {
        "id": 133,
        "text": "The food is solid here but the service was below par, even for Chinatown. The food didn't come out at the same time, as well as items missing.  The oyster pancake was pretty good - close enough to authentic to make you miss it even more. The scallion pancake had an interesting presentation - it was cut into \"fingers' and had a vinegar based dipping sauce instead of the expected soy sauce. The crispy duck wasn't super crispy due to being on a bed of mixed vegetables soaked in brown sauce. The lion's head meatballs needed more ginger.  Overall it was adequate but certainly not $45 worth."
    },
    {
        "id": 134,
        "text": "We were giving a tour of china town to a friend, and suddenly we saw this place with lots of asian ppl..now I only try ethnic food that has native looking ppl from that taste..cuz i want the real deal and NOT the Americanized version..this place has the best sweet n sour soup..best noodles..best chicken dishes and pretty much best of everything..not to mention the FRESH MANGO smoothie they made right infront of our eyes..we have been back there 3 times in a month and every time they get A+..this place is soo AUTHENTIC and always flooded with native ppl..i love going there..its the real deal and the owner..or one of the ladies there is also SUPER SUPER nice and fast with her service..love going there!!"
    },
    {
        "id": 135,
        "text": "Taiwanese meatball in glutinous rice was unique and tasty. Came cut into quarters with sauce on top that I couldn't quite make out. Three cup chicken was great but be prepared to fish out bone pieces in the chicken. My favorite of the night had to have been the fried pork chops with meat perfectly cooked with a nice crisp thin crust with all the taste of salt and pepper without the filling of crumbs. Highly recommend! \n\np.s. Dining space is fairly tight. Four per table is very doable. Five is a bit tight."
    },
    {
        "id": 136,
        "text": "Food is consistently good! I love the scallion pancakes, eggplant with minced meat, and shanghai style rice cakes. I sometimes even will order takeout of the rice cakes because they are SO good. The scallion pancakes are crispy on the outside and fluffy on the inside. The restaurant is always clean, quiet, and the staff are nice."
    },
    {
        "id": 137,
        "text": "One of my favorite Chinese restaurants in Chinatown.\n\nDon't expect awesome service or the cleanest decor but don't forget you are in Chinatown.\n\nI don't usually like going back to the same restaurant multiple times because I like trying new spots but this is one of my go-to places. \n\nSome of my favorite dishes: Salt and Pepper Pork Chops, Indonesian Spicy Fried Rice, Jiajiamyung, and Eggplant dish."
    },
    {
        "id": 138,
        "text": "The food was REALLY good, had the eggplant and the scallion pancakes. Service was slow and the waitress may have been new, tea had to be asked for (unusual in china town imho) Need some spunk in this place somehow."
    },
    {
        "id": 139,
        "text": "Yummm! Some simple, tasty, Chinese food!  We had such great service here! The waitress kept telling us to let her know if we needed anything.\n\nWe ordered the wonton soup, house lo mein, spring rolls, and the steamed dumplings.  There won ton soup was very good. I love when the won ton soup has a dark broth. The spring rolls were very fresh.  The house lo mein and dumplings were very good.\n\nA nice teapot of jasmine tea is always a plus :)"
    },
    {
        "id": 140,
        "text": "Really big disappointment. \n\nI'm sick so I wanted to just order a soup and get it delivered. In order to get it delivered you have to order through yelp for a $5.99 service fee plus a mandatory 15-25% gratuity. Ridiculous but when you're sick and desperate for soup ($2) you'll do it.\n\nI asked the others in my household if they wanted to add to my order since it was a delivery charge 3 times the price of my soup. I felt like it would at least make it worth it. \n\nNope. Wrong. Called over an hour later, food still wasn't picked up by \"third party.\" Arrived an hour and a half later (4 blocks away) WITHOUT SOUP!! \n\nMy roommates keep spitting cartilage out from their general chicken and the three cup chicken is full of bones and looks like pigs feet. So the food that did come wasn't even worth waiting for.\n\nAs for my soup, I called the restaurant to ask them to send the soup and they said they were closing. Called the number given on the email to try to get money back and they said because it was ordered from yelp and not directly delivery.com they couldn't do anything. \n\nDO NOT ORDER FROM YELP. NO SOUP FOR YOU YELP, NO SOUP FOR YOU!!!!!!!!! \n\nNow I'm sick and hungry and trolling on yelp. Thanks to everyone who made this possible, including myself for being stupid, sick and lazy enough to not make .89 ramen soup which would have been a better idea than ordering delivery from Empress Garden through yelp. Going to go throw money out of a window."
    },
    {
        "id": 141,
        "text": "Stopped by the other night to escape the winter cold with some spicy Beef noodle soup.\nFound out that they're BYOB. =) AWESOME"
    },
    {
        "id": 142,
        "text": "I was visiting Philadelphia and was craving Sweet and Sour Chicken and Steamed Rice. We walked around Chinatown and found Empress Gardens. The Sweet and Sour was great although I'm used to a higher amount of chicken for the price. I wish the rice would have either come with the meal or I would have gotten more for the extra $0.50. \n\nThe restaurant was very small but the service was great. If I lived close enough, I would go back for the lunch price."
    },
    {
        "id": 143,
        "text": "The Taiwanese beef stew noodle soup is my favorite bowl of soup in Chinatown.\n\nThe beef is fatty and and the broth is so rich, but what makes it work is the pickled greens."
    },
    {
        "id": 144,
        "text": "The worst ever. If you can't make the three cup chicken right. How dare you call yourself a Taiwanese restaurant! Unbelievably terrible. Should rate Zero if I have that option.\n\nUpdates: Receive a very unprofessional and insulting personal message from the owner. He called me Crazy just because this honest negative review! Unbelievable!!!Please, it's not the right way to do business. Btw, is any way to escalate the personal insults to Yelp?"
    },
    {
        "id": 145,
        "text": "Not bad, but not great. The place is small so expect to be close to other guests. The food was just ok. Nothing really impressed."
    },
    {
        "id": 146,
        "text": "Just simple Chicken Chow Mein, fried rice and won ton soup.\nAmong the best I have ever had!\nService was super friendly , fast and the restaurant is clean\nI will be back"
    },
    {
        "id": 147,
        "text": "i was in the Chinatown area with my friends we couldn't decide what we want to eat  we were looking for something different  to eat. we came across empress garden  when we walk in the waitress was very nice first the waitress ask us what we want to drink i could decide she recommend us to try there mango smoothie told her sure i try it omg it so good she make it just right not to sweet and there ice coffee is  good too than we order Indonesia curry chicken and indonesia coconut shrimp OMG is so delicious than i when back couple time.oh forget to mention is BYOB, u could bring your own bottle.  highly recommend to everyone to try this restaurants."
    },
    {
        "id": 148,
        "text": "It was a nice day and my boyfriend and I were strolling through CT looking for a quick bite. Originally we were opting to eat at Pho Cali, which was only a block away, but we stumbled upon this small little hole in the wall. So happy we did! I didn't really expect much, and I honestly thought it was typical mediocre Chinese/American food you can find at your local take-out/delivery joints in close proximity to your home, but I was wrong! The service was excellent, our waitress was so sweet and she recommended the Indonesian fried rice and fried pork chops for us. So good, and super cheap."
    },
    {
        "id": 149,
        "text": "My Taiwanese friend took me here a few months ago to introduce me to the Taiwanese oyster pancake, and I have been continually craving it ever since. I returned again, ordering the same thing, so while I have not been able to explore the breadth of the menu I can assure that the few items I've tried are top-notch and very memorable. The oyster pancake is delicious, with interesting texture and flavor, and I'm told its taste is true to Taiwan. I also ordered the Taiwanese beef noodle soup, which was excellent and the perfect comfort food. Some pieces of beef are tough, but for the most part the beef was pretty tender. I believe we also got the Indonesian curry chicken, and we liked that a lot as well. The service is fantastic--the staff is very friendly and accommodating. Although the restaurant environment is pretty low-key and somewhat small, do not judge based on appearance because the flavors, portion size, and service is wonderful at a very affordable price!"
    },
    {
        "id": 150,
        "text": "Really rude service tonight at this restaurant. The waitress was about to seat us and then the manager decided that he wanted to seat a larger party instead so he told us that we couldn't be seated and told us to leave. I speak Chinese and there was no communication error here. No mention of how long to wait. The waitress said oh how about that table in the corner which was clearly not being used and he just waived his hand at us and gave us a really rude look. I was speechless. I am half Taiwanese and would have loved to try this food but to no avail. You have lost a customer. I do not recommend this place."
    },
    {
        "id": 151,
        "text": "I love the Niu Rou Mian (beef noodle) here! I'm craving some right now! The scallion pancake is pretty good too. The other food isn't that good. Stick with the Taiwanese dishes!"
    },
    {
        "id": 152,
        "text": "BEST FOOD EVER!!!!\n\nOMG, I wish I lived above this place so I could have it everyday. I had the pot stickers, noodles, sweet and sour pork and everything was soooooooo good. The location is very small, but when your food comes out nothing will matter. We got great service, and our food came out quickly. This is by far my favorite Chinese restaurant ever."
    },
    {
        "id": 153,
        "text": "I gotta say...i'm a huge fan of this place and will probably make a stop over every time i'm in philly.\n\n1) Clean spot, friendly waiters/waitresses\n2) I don't remember the name they give the dish here...but the \"zha jiang mian\"...which is essentially the meat sauce noodles. A bit of a kick, lots of flavor, huge portions. $6?\n3) Three cup chicken: Still solid, large portions. Lots of flavor. win as well\n\nSimple, flavorful, full of value. All traits of a winner in my book.."
    },
    {
        "id": 154,
        "text": "this is the absolute best. i have not been able to find anything remotely close to their taiwan beef noodle stew, and still dream of their fried string beans, scallion pancakes and chicken fried rice, chinese style. i've asked for fried rice chinese style other places and just get weird looks, they very well may be the only place that call it that, but damn, it's delicious. and cheeeeeap!"
    },
    {
        "id": 155,
        "text": "This place was awesome!  The service was great and everything we ordered was phenomenal.  The owners are newer and they recently renovated, so the entire experience from the food to the ambiance was so lovely.  This is a gem in the middle of Chinatown - come here for authentic Chinese food.  They have menus in English and in Chinese, but if you ask your server for recommendations, you can't go wrong.  The host spoke perfect English and one of the servers speaks pretty good English, so if you take the initiative, you can experience all of China - food from Taiwan, Hong Kong, Beijing, etc. all in one place.  Definitely worth a visit!"
    },
    {
        "id": 156,
        "text": "At this place right now! This place serves authentic Chinese/ Taiwanese food, instead of Americanized \"Chinese\" food. Highly recommend the noodles!"
    },
    {
        "id": 157,
        "text": "delicious chinese food! great service.  no complaints at all."
    },
    {
        "id": 158,
        "text": "Amazing food here at empress garden. Got the indo lo mein spicy and it was jug delicious. Must order! Best spot to eat at in chinatown philadelphia."
    },
    {
        "id": 159,
        "text": "This is our first stop over our labor day weekend food fest. Service seems prompt. However, for the free scallion pancake offer they want you to leave a review first before giving the order to you....so, official review to follow after I get my order.\n\nOk, so most of the food is decent, except the Taiwanese meatballs. Like another review said, gluten is too hard and the filling is not that authentic. Otherwise, this place is good for a quick eat."
    },
    {
        "id": 160,
        "text": "I didnt think much of what i ordered. Actually it was below aveage but not awful. The dumplings had the thickest dough i've ever encountered. The scallion pancake was thick and soggy. And the shrimp and broccoli wasnt as good as others i've had.\nNot terrible, not great. Gets two stars."
    },
    {
        "id": 161,
        "text": "Guys, I am in love with this place. It is unassuming and right around the corner (literally) from the Troc. You might have to wait a few minutes to sit, depending on the day and time. Who cares though? Ten minutes for mouthwatering awesome Chinese food? DO IT.\n\nIt's really not that small, folks. The restaurant can seat a good 34+ people comfortably. The tables do not feel smashed up against other diners. And mirrors along the walls helps open up the place even more. \n\nOh, also, Chinese-speaking people tend to eat here. I suspect that means something, like, oh, the food is Amazing. So let's get to it:\n\nEmpress Garden has thee best scallion pancakes I have had to date. They are not cake/bread-y or super greasy. They are thin and crispy and scallion-y. They come with a light tangy sauce... with more scallions in it. Scallions are so full of win!\n\nThe beef fried rice is pretty excellent, other than the complete lack of vegetables (sadface). \n\nI learned about this place when asked for a place with Chinese noodle soups. The broths in their soups is phenomenal. The shrimp with vegetables is perfection. The soup has shrimp of a good size, cooked right, and an assortment of veggies that are delightful. The beef broth is really great too. My only problem is an inability to finish it all. The guy and I have made it a habit to eat here before shows at the Troc, so I can never take a doggy bag. \n\nFood comes out to the table as it is prepared. Prices are completely reasonable. And credit cards are accepted."
    },
    {
        "id": 162,
        "text": "Came here last week with my pregnant girlfriend. Food was really great. Ordered take-out tonight and disgustingly found a cockroach in my noodles. We called the restaurant and they were kind enough to comp us our next meal. Sadly, I won't be back."
    },
    {
        "id": 163,
        "text": "We selected this place because of Yelp and we were not sorry. Very good authentic Chinese food. We had a fabulous delicate tofu dish with scallions and garlic sauce and the beef soup. Both were fantastic and tasted even better the next day. Highly recommend this place for great Chinese food."
    },
    {
        "id": 164,
        "text": "This is the place to go in ChinaTown! The food is fresh and hot. You could definitely do family style the plates are huge!"
    },
    {
        "id": 165,
        "text": "Im really glad i tried this place out, their beef noodle soup was yummy on flavor but was a bit too oily for my liking. They are quite generous with their portions at an exretemly great price."
    },
    {
        "id": 166,
        "text": "I received a really nice message from the owner explaining what might have been the cause for the food fiasco. After consideration, I decided to try again and was not disappointed."
    },
    {
        "id": 167,
        "text": "Dear people of Chinatown (and those who venture into it), Mandarin and Szechuan does not mean Taiwanese. I'm not even sure if the staff here is Taiwanese. I had asked them if they had \"Dan Bing\" and they looked at me like I wanted an enchilada. Back me up here, my fellow Taiwanese! But, they do have some dishes from Taiwan on the menu. With that settled, let's get to the good (and bad) stuff.\n\nDefinitely Order:\n+ Peking Noodle (Ja Jiang Mien) - This is the reason I love coming here. This is the Chinese version of Spaghetti alla Bolognese. Salty, sweet, spicy, crunchy bean sauce over thick Chinese noodles. The noodles are on the softer side (old school Asians don't believe in al dente) and mix very well with the sauce. \n+ Scallion Pancake - The best scallion pancake in the city. It's not thick like other places, and it's thin enough where it's not a cracker, either. The best part is the dipping sauce. Instead of the standard black vinegar mixture, the sauce is clear! I think it tastes better than its dark counterpart. \n+ Ma Po Tofu - I love ma po tofu. When I can't have my mom's, I come here for it.  \n\nMaybe Order:\n+ Taiwan Beef Noodle Soup - The noodle soup tastes pretty authentic, although it is on the blander side. \n+ Pai Goo Fan -  Fried pork chops w/ pickled veggies over rice. I like this one, but the pork chops need to be crispier.\n\nDon't Order:\n+ Soup Dumplings - Tastes like the frozen kind. There are other spots in town if you're craving these little exploding dumpling balls. \n+ Chinese-American Dishes - General Tso's chicken, beef and broccoli, orange chicken, and shrimp in lobster sauce? Umm... no. \n\nI just noticed that all of the dishes listed under \"Maybe\" are the Taiwanese dishes, weird. \n\nThe service, food, and prices at Empress Garden are great. Now if I can only find a place that makes Dan Bing...."
    },
    {
        "id": 168,
        "text": "Excellent service, very good food. Had the Hunan Chicken. Not the best I've had, but certainly top five ."
    },
    {
        "id": 169,
        "text": "What a literal nightmare. Ordered from them via grubhub many times and always loved the food. The last time I ordered, I became violently ill within 5 hours of eating.... I was unable to eat, couldn't keep down water, and was vomiting every 20 minutes. I was unable to work or leave the house for the next two days straight. I'll refrain from further detail, but it was not a good scene. I contacted grubhub for nothing more than a refund, and they contacted the manager. The manager told them that without a copy of a hospital bill they would not honor any type of refund request. I tried calling the restaurant multiple times and the manager refused to speak with me. I will never order from them again and I recommend that you don't either if you'd like to stay in good health. Terrible customer service and a complete unwillingness to accommodate a reasonable request from a previously loyal patron. Thumbs DOWN."
    },
    {
        "id": 170,
        "text": "5 stars. \nI did not try a lot of dish yet. \nThe Taiwaness pork rib rice dish was great!! just like what I had in Taiwan!\nI do not like their pickle veggie soup though."
    },
    {
        "id": 171,
        "text": "Empress Garden is one of my favorite spots in Chinatown. The pork chops in particular are a dish I always recommend to people looking for suggestions in that area of the city. As is the Taiwanese meatball. This is really unusual, and unlike any other meatball or  dumpling. For $3.50 you get a ball made with a rice flour outer layer stuffed with mushrooms and pork. This is definitely one of the least attractive plates ever. \n\nAlso, try their Zha jiang mian. The dish is listed as Peking Noodles with Meat Sauce under the \"Northern China Style Noodle\" section of the menu. I found the Chinese version to be less salty and lighter, the Korean versions I have tried have more of a dark, hoisin  flavor. I was pleasantly surprised that the squishy noodles were home-made. They don't cheap out on the meat sauce, there is tons of the good stuff, but it manages to never overpower those noodles."
    },
    {
        "id": 172,
        "text": "Found this place on yelp and went for dinner last night.  It's a fairly small restaurant with 30 some seats so expect to wait if you come on a busy day.  \n\nWe ordered beef noodle soup, scallion pancakes, beef chow fan, and mango smoothie.  We were pleasantly surprised that all the dishes and smoothie were delicious!!  We loved the smoothie and scallion pancakes so much that we ordered another to go.  We would definitely recommend it to anyone who goes to the Chinatown in Philly for good (Taiwanese) food."
    },
    {
        "id": 173,
        "text": "My parents are from Taiwan and they were pretty impressed with this restaurant. I always get the beef noodle soup and it never disappoints. My girlfriend gets the Indonesian lo mein (spicy) which is hella good. The service is great and you can't beat the price if you're in need of some Taiwanese food. This has been one of my regular spots I go to and I highly recommend it!"
    },
    {
        "id": 174,
        "text": "The service was terrible and the food was worse. It's seems are to believe that you could eat this bad of food in China town!!"
    },
    {
        "id": 175,
        "text": "Based on an adventurous kick my bf had and yelp reviews, I payed a visit to these friendly folks.\n\nOrder: scallion pancakes, chicken and cashew combo platter with wonton soup (mine), shrimp pan fried noodles (bfs order) \n\nPros:\n1. wonton soup was amazing! i looooove wonton soup! the broth was AMAZING! \n2. the spring roll that came with my meal was probably the best spring roll ive had in a long time! it even had whole shrimp!\n3. food came out so fast! i didnt even finish my first cup of tea\n4. staff is really nice, not annoying and bugging you every 2 minutes to check if youre ok. they alllll say bye when you leave, i feel like im leaving a friends house.\n5. cheap! our total was $24! we had so much food!\n6. the random one... i got a plate with compartments, you know like when youre 5 yrs old and everything is separated on your plate? yea one of those, i was waiting to see elmo on the bottom... \n\nCons:\n1. the dining area was small and kind of awkard... the table we got was uncomfortable. the man behind me kept moving back and forth on the booth i would get launched forward and back like every 15 seconds. it was so annoying\n2. it was so quiet, i felt like i had to whisper...\n3. we tried the pancakes bc everyone said they were amazing, all i have to say is ive had better. sorry.\n4. no elmo on my plate =("
    },
    {
        "id": 176,
        "text": "This place is a true gem in Philadelphia's China Town.  I ate here for the first time today and ordered the fish fillet in black bean sauce with a side of shrimp friend rice, and both were AMAZING! The portions are large and the prices are better than comparable places in China Town."
    },
    {
        "id": 177,
        "text": "They have gone done in the last few years.\n\nWe come in and they are initially attentive, but after ordering drinks and appetizers, they leave and never come back to take our order for entrees AND we were the only customers sitting in the restaurant at the time, Da FUQ.\n\nWe kindly paid left and we will probably not go again, I've told many people about this place over the years, I do not think I will ever recommend the Empress Garden again.\n\nI am really sad about that.\n\nP. S. The dirty mop smell does not help."
    },
    {
        "id": 178,
        "text": "My favorite dish is the eggplant! Beef noodles is pretty good as well :)\n\nCan't wait to try the scallion pancakes!"
    },
    {
        "id": 179,
        "text": "I came here with my parents during lunch hours on a weekday. It wasn't too busy, so we were seated right away. Wait time for the food wasn't long either, about 10 minutes. I ordered the tomatoes and beef over rice. I thought it would just be tomatoes and beef with rice, but it's actually eggs and tomatoes plus beef over rice. It was delicious! The portions are pretty generous, definitely enough to fill a person up. And it's pretty cheap too, only around $7. For the amount and quality of the food I got, I'd say it's definitely worth it. Would come back again and try some of the other dishes."
    },
    {
        "id": 180,
        "text": "Food was delicious server took a while to get to me. I ordered the shrimp with lobster sauce which was good. The portion was good as well. Was a bit disappointed because they were doing the lunch speacial."
    },
    {
        "id": 181,
        "text": "Let's start by saying Empress Garden doesn't impress me much. \nI was told by a lot of online review from Taiwanese that the food here is great and genuine Taiwanese food. I cannot comment on the genuineness since I'm not a Taiwanese. But based on the Taiwan style food I had before this is below my expectation. \nI had the beef noodle and fried dumplings. Beef noodle is of pretty good quality. The soup and the beef are tasty, but the noodle is not so good: it breaks easily and tastes too soft. The dumplings, well I can have dumplings of that quality at any food truck around Philly. \nMaybe there are other things I can order that taste better. I'll probably give it another try but I won't be inviting my friends and telling them this is a great restaurant."
    },
    {
        "id": 182,
        "text": "It was good with some things and others not so good.  My wife is a die hard Taiwanese food lover and she was scared to eat some of the things (oyster pancake).  Not to happy when stinky tofu was not on the menu, but that was a plus for me.  Chow fun was good, not the best.  Corn soup was just egg drop with some corn and chicken added to it.  Pan fried noodles was surprisingly a good pick for the kids.  Beef noodles was overcome by fillers, totally not necessary, it would have been better without the extra stuff.  Total hole in the wall, but if you want to go somewhere you wife will never find you with your girlfriend this is the place for you."
    },
    {
        "id": 183,
        "text": "Mind you, I haven't eaten Chinese food in years. I was in Philly and, on the spur of the moment, decided to pick some up; bad idea. I checked my cell for the best restaurants for egg too young; my favorite. By a process of elimination, I ended up here. I knew I'd made a big mistake as soon as I tried to spoon the sauce. It looked like plastic, flowed in globs, and tasted like something out of a rusty can. \nI really thought twice before giving it to my dog."
    },
    {
        "id": 184,
        "text": "Nice little place in Chinatown with good authentic food. The service is good, especially the one lady who is super cheerful and enthusiastic. If you don't know what to order, you can ask your waiter. I recommend what is popular there, which is the Taiwanese Beef Noodle Soup. Stay away from your typical takeout food and try other things on the menu that you you're not familiar with. Take some risk. :)"
    },
    {
        "id": 185,
        "text": "Empress Garden is my favorite Taiwanese restaurant in Philly and the cure for my perpetual homesickness. I order takeout here every week via the Yelp app and it's the most convenient thing ever. My order is ready for pick-up within 20-40 minutes (40 if I order the three-cup chicken) and it is always packed very neatly with ample utensils (food never spills on the ride home). I have also dined in at the restaurant and the customer service and waitstaff are really courteous. \n\nIn my humble Taiwanese American opinion, here's a list of the restaurant's best dishes: three cup chicken, Chinese broccoli, Taiwanese meatball, snow pea leaves, pork belly over rice, and oyster pancake."
    },
    {
        "id": 186,
        "text": "Thank you yelp for finding us a Taiwanese restaurant in Philadelphia.  Food was excellent.  Definitely not americanized, but we ordered off the chinese language menu.  We did takeout and a few days later ate there.  There are definitely some foods that won't travel well.  If you eat in, get the oyster pancake, scallion pancake, and pork ribs (dry rub deep fried).  Some of the other dishes are saucy - my favorite was the beef and chinese broccoli."
    },
    {
        "id": 187,
        "text": "After I gave it another try I feel this is only a place to grab lunch if you happen to be in front of it and don't wanna walk any further. I won't go again."
    },
    {
        "id": 188,
        "text": "I wanted to order something off the Chinese menu, but since I do not speak or read Chinese, the menu was of little help. I tried to explain the dish I was after, Chicken with dried tofu noodles and the waitress didn't understand what I was talking about, so I was forced to stick to the lunch specials. I saw the usual American fare, and so I chose the Chicken with Broccoli (7.50 with tax). It wasn't that tasty honestly. The hot and sour soup was okay, but the fried rice tasted like corn meal. \n\nThe waitress was really nice though.\n\nVisa accepted here. No minimums.\n\nFood Quality/Taste = 2 Stars\nPortion Size Given Price = 3 Stars\nPrice = 3 Stars\nService = 2 Stars (no water refills)\nExperience with Staff = 4 Stars"
    },
    {
        "id": 189,
        "text": "We have been trying out different spots around Chinatown to mix up our usual routine of constantly going to get pho or ramen. Their beef noodle soup definitely held up against our usual favorites! Nice broth, great chewy noodles, and hearty pieces of tender beef. It wasn't spicy really, but I thoroughly enjoyed it and drank every last drop.\n\nWe also got scallion pancakes, which were a great deal for $3.50. They came out hot and crispy with a vinegar based dripping sauce. The two entrees we went with were the three cup chicken and salt and pepper pork chops. The chicken was INSANELY flavorful and was probably our favorite thing. There are small bones so be careful, but the meat is so soft and full of savory, garlicky goodness it was hard to put down. Definitely get some white rice with it for all the sauce. The salt and pepper pork chops were crispy but moist on the inside, and topped off with sautéed garlic and peppers. We had already eaten half the portion by the time we had taken the picture!\n\nThe service was super fast, and the food came out quick as well. The interior is small but not cramped and we'll definitely be back!"
    },
    {
        "id": 190,
        "text": "I have been here several times and will recommend it to anyone looking for a place to eat authentic Taiwanese food. The scallion pancakes, indonesian chicken curry, beef noodle soup and ma po tofu are just some of the great dishes this place serves. Its one of my favorite places to eat in Chinatown!"
    },
    {
        "id": 191,
        "text": "Pretty good and authentic food.  We went with people who were able to read and order off of the Chinese menu so we had the \"good stuff\".  I saw some tourists ordering at the other table and they got the typical fried rice and egg roll combos, which did not look to exciting.  Our food included the fried oysters in a scrambled egg type form, Beef noodle soup, seafood soup of some sort and a fried sizzling tofu dish (which was super salty).  The place was kind of dirty inside and reminded me of China, but the waitress was really nice."
    },
    {
        "id": 192,
        "text": "The good: the pork fried rice is pretty good. \n\nThe bad: \n- This was a delivery order. They didn't seal or wrap our containers, so most of my soup was at the bottom of the bag, mixed with sloshing General Tso sauce from another container. All containers were soggy and breaking, my spring roll was soggy. \n- The spring roll is all cabbage, with two micro shrimp. \n- They mixed my chicken right with the sweet and sour sauce, so also soggy. \n- Not enough chicken in the General Tso order, not  even enough to cover the bottom of the container. \n- Very strange sauce with the dumplings, horrible after taste."
    },
    {
        "id": 193,
        "text": "Empress Garden is a nice little restaurant right next to the Chinatown arch, unassuming in the outside, and quaint once inside. The restaurant was clean and surprisingly busy for an early dinner. \n\nWe ordered the friend dumplings and the general tso's chicken, both of which were delicious and fried to perfection. We also ordered the bubble tea, which was excellent!! Much cheaper than the other bubble tea places nearby and the bubbles were soft and chewy.  \n\nWe recommend trying if you're in the area!"
    },
    {
        "id": 194,
        "text": "Been back multiple times. Always a good comfort Taiwanese meal with oyster pancakes, scallion pancakes, and san bei ji (3 cup chicken). \n\nConsistently good, flavorful food and service (err....not so flavorful but still good)\n\nAlthough the oyster pancake is more \"fried\" than would be on the streets/night markets in taiwan, it is still very close to the consistency/starchiness of what one could get there. \n\nAlso, the frequently have our favorite chinese veggies, dou miao (snow pea tips) and kong xing cai (open stem (\"heart\") greens), whether they're on the menu or not. :) This really is one of our go-to places in Chinatown."
    },
    {
        "id": 195,
        "text": "I've been wanting to eat here for awhile and so glad I finally got a chance.  The restaurant is small but clean with good service.\n\nWe ordered the following:\nsalt and pepper wings - pretty average\nTaiwanese meatballs - interesting. It's like a mochi type covering beef mix. Not a fan of the sauce.  \nscallion pancakes - really liked these. Nice and chewy and good dipping sauce\noyster pancakes - I enjoyed these but same sauce as the meatballs.  Will ask for the sauce on the side next time.\nPeking noodle (ja jian mien) - really liked this dish.  The noodles were cooked well and the sauce was really good\nMinced pork and eggplant dish was flavorful and delicious\n3 cup chicken - I wasn't expecting much but chicken was really tender and sauce was good - I didn't have a huge issue with bones as mentioned in other reviews\nSalt and pepper pork chops - one of the faves of the bunch.  This was so good. \n\nNext time, I'd like to try the Indonesian fried rice and mapotofu"
    },
    {
        "id": 196,
        "text": "I wish I had gotten a little minced pork on my pork chop rice platter, but otherwise it was tasty!"
    },
    {
        "id": 197,
        "text": "Why is it that the first time around the food is always good?? Went there again for dinner and to be honest, this place was gross!! They did,kt have the spicy pork belly, the pork chop noodle soup was very bland and also the oyster pancake was disgusting. All I tasted was cornstarch!"
    },
    {
        "id": 198,
        "text": "Empress Garden is a small shop on N. 10th Street in Chinatown, Philly, that changed hands about a year ago.  The original owner (the \"Empress\"), was a sterling hostess and stunning beauty who ran her house efficiently and with admirable warmth.  The food had a Taiwanese and Indonesian orientation, but also had the standard American/Chinese dishes for those who preferred them.  Their fruit drinks were freshly squeezed, and it had a strong following. \n\nI returned after an absence of a few years, and my first run with the new operation.  While the menu was basically the same as before, the actual plates coming from the kitchen seemed to have lost a bit of their edge.  We ordered Scallion Pancakes, Curry Chicken with Onions, Salt & Pepper Pork Chops, Orange Beef and Sautéed String Beans.  A lot for the three of us to consume, but we were looking forward to bring the balance home.  \n\nWhile the Scallion Pancakes were good, they are certainly returned to the norm, and were not as exceptional as remembered.  The Chicken dish had the right taste and fresh chicken, but the Onions were harder than desired, and thus tended to dominate the dish.  The S & P Pork Chops had been a wonderful platter in the past, but this day the breading and meat was over-deep fried, making it tougher in the bite, and less enjoyable in the chew.  Disappointing.  The Orange Beef was the best thing on our table, with a nice spicy, not overly gloopy, sauce.  It was fun to eat even with the orange peel in its soft non-burnt condition.  Finally, the Veggies were fine with a light Garlic finish.  \n\nThe meal was satisfactory, but not what I hoped for based on recollection.  Empress Garden was now just another Chinatown restaurant with a fair kitchen and price, but nothing to make it outstanding."
    },
    {
        "id": 199,
        "text": "I've been here MANY times.  As far as I know, it's the only place that offers decent Taiwanese dishes in Philly, though of course it doesn't compare to California.\n\nWhat's good here:\n\n*Scallion pancakes\n*3 Cups Chicken\n*Fried pork chop (pretty decent)\n\nAdditionally, I think their fried pot stickers are decent along with their beef noodle soup.  These aren't my favorite here but admittedly I have high standards since I grew up in LA."
    },
    {
        "id": 200,
        "text": "Horrible service, don't get what you order, and don't get a lot of food. Greasy and disgusting."
    },
    {
        "id": 201,
        "text": "Food was ok.  Smaller portions than I am used to. No tea brought out, no duck sauce or fortune cookies. Had to ask for silverware.\nTook a while to get someone to come and pack up some leftovers in our party of three. They don't come to refill or ask if you want anything else.  Found a long hair on a napkin which they are very skimpy with, the napkins not the hair."
    },
    {
        "id": 202,
        "text": "The five stars may seem generous but this place wins for simple dishes that are fresh and tasty, large portions enough for leftovers, and friendly service with no credit card minimum! Now that's a combination you rarely see in Chinatown. \n\nThere's one dish that I love here and it is the Peking noodles with meat sauce. I used to come and get it to go all the time. The to-go comes in two separate containers - one of just the noodles and one of the sauce (a sauce with diced meat, green beans, and tofu). This isn't the traditional zhajianmien from Beijing but it's so good! It sounds simple but each slurp is delicious and comforting. You're definitely carbaloading with this dish but it easily divides into 2 reasonably portioned meals. \n\nA couple other dishes we like are the Taiwanese noodle soup & beef chow fun. Again, the flavors aren't complex but are reminiscent of meals from a home kitchen. Cheers to the home comfort & simplicity."
    },
    {
        "id": 203,
        "text": "You'll not see the resto sign if you not really looking..\nSmall resto..sort of like cafe with only maybe 7-8 seat..\nBut they food are Awesomely Delicious!\nIf you guys like Spicy (like me Because i'm Asian ;))\nYou should try Nasi Goreng Indo/Indonesian Spicy Fried Rice and Bakmie Goreng indo/Indonesian Fried Noddle...Delish\nPrice Range around $8-$10 \nReasonable i guess for their portion is enough to share for 2!\nTwo Thumbs Up..if you go there..find the Indonesian Waitress name IDA..for that 3 the best Indonesian menu\nTheir Tahu Goreng/fried Tofu is delish too!"
    },
    {
        "id": 204,
        "text": "The worst ever. If you can't make the three cup chicken right. How dare you call yourself a Taiwanese restaurant! Unbelievably terrible. Should rate Zero if I have that option.\nUpdates: Receive a very unprofessional and insulting personal message from the owner. He called me Crazy just because this honest negative review! Unbelievable!!!Please, it's not the right way to do business. Btw, is any way to escalate the personal insults to Yelp?\n\nFurther Updates: Got more threatening messages from the owner. First, please get a basic understanding of the legal definition of rumor from your lawyer! If you are going to threaten and insult everyone who leave a honest negative review, I really question your professional ethics, if you have any. Second, People use Yelp as a platform to express their honest feelings about their consumer experiences. You have no right to insult and threaten customers because of criticism. I'm not afraid of your threats. Bring it on! Bro! Why are you so afraid that this review is going to affect your business? Let me guess, did I tell the truth so you got scared? If you got confidence in your cuisine, why are you acting like this?\nLast and not least, stop the harassment, or I will take all the necessary legal actions regarding your insults and threats.\nBTW, never thought that my first Yelp review will become this ridiculous drama. Share my experiences with all who yelp. Hope it gives you guys an opportunity to stay away from places those aren't worth your time.\n\nFINAL UPDATE: So sick of receiving another harassing messages from the owner. Never apologize for his inappropriate wording and insults. Will definitely bring legal actions. People should know how to behave!"
    },
    {
        "id": 205,
        "text": "Not bad, but not great. The place is small so expect to be close to other guests. The food was just ok. Nothing really impressed me."
    },
    {
        "id": 206,
        "text": "Look, I'm a Taiwanese and I don't think the entrees were very Taiwanese, but the food was still excellent!\n\nUnfortunately my family did not order any Taiwanese snacks and instead ordered two entree dishes: three cup chicken and Hakka-style tofu pot. While these were certainly Taiwanese dishes, the tastes were more like Chinese cuisine. That doesn't mean the food was bad though, but the three cup chicken was absolutely delicious!\n\nThe moment the large clay pot of three cup chicken arrived, our table was engulfed with its luring aroma. I could not stop myself from continuously taking pieces after pieces after the dish arrived! This mildly spicy entree was addictingly flavorful. So glad I had leftovers to relive the moment again later that night!\n\nGreat food, cheap options, large portions, friendly service, clean interior...If you are in the Philly Chinatown, Empress Garden should be your top choice!"
    },
    {
        "id": 207,
        "text": "Our meal was less than satisfactory. The tea was cold, my shrimp with walnuts was heavily breaded and partially cold, the rice was lukewarm with burned portions possibly from the bottom of the pot. My husband had pork with black bean sauce which was fine and warm. \nDuring the meal the staff stood just out of the main dining area and talked loudly the entire time we were eating. It was distracting, unpleasant and less than helpful. The restaurant was empty so it's not like they were overloaded with customers. Not sure where 4 stars came from but it does not reflect on our experience. It's been a long time since we've had such a poor meal."
    },
    {
        "id": 208,
        "text": "So... There's a big button on Empress Garden's page in the Yelp app that says \"Order Delivery\". DON'T DO THAT. The online ordering system itself is seamless, and supposedly your food gets delivered from some service called Dining In Philadelphia or delivery.com. Now I've never ordered food from this restaurant and this delivery service and its vague names seemed a little sketchy, but we were hungry.  We ordered ma po tofu and chicken for delivery at 6:45pm. At 8:00pm, I called the number in the email confirmation to check on the order. The number led to a voicemail system for the administrative office of the delivery service (under yet another vague name). Hmmm. So I called the restaurant and reached a lady who yelled, \"You pick up!!\" a bunch of times as I tried to inquire about our food order. Then she hung up on me. Then I called some other number in the confirmation email and reached an actually very nice lady who kept me on hold for a while as she tried to call the restaurant (probably got yelled at), and then finally returned to my call and cancelled the order. Fine. It was about 8:30 at this point. We made quesadillas and went to sleep. 9:30pm.... Phone rings repeatedly. It's the delivery guy! He's outside! Almost 3 hours after we ordered! I tell him we ordered hours ago and had since cancelled the order. He is dismayed and says no one told him. A few minutes later he calls back and says he talked to someone and we can have the food anyway. I said thanks but we ate already."
    },
    {
        "id": 209,
        "text": "Great food! Scallion pancakes for an app, very good. General Tso's chicken, chicken chow fun, 3 cup chicken- all solid options!"
    },
    {
        "id": 210,
        "text": "Love this place. It's my newfound favorite. \n\nFirst, my Taiwanese friend recommend it to me, then my HK friend also recommend this restaurant to me. So we thought, let's give it a shot. The place looks unappealing from outside but if you're looking for good authentic Chinese food, this is the place to be. It's clean and small, so large party is not recommended. \n\nWe are not sure what to order since we don't speak nor read Chinese at all. We also don't want to eat just an ordinary American Chinese food. The waitress: Ida is Indonesian. lucky me, so she recommend me the good authentic food over there. She's also great with my American friend and speak English very well. \n\nMy favorite so far is shredded beef with tofu and bamboo shoot, the fried noodle (there're many kinds of them, ask them to recommend you, all of them that i tried were good), the noodle like Dave H recommended (note: it's C62 in the menu not C71, although C71 is also good). We took home the Taiwanese beef noodle soup and wasn't too impressed, so we may have to eat there. The chicken in the hot pot is also delicious. \n\nIf you want authentic Chinese food, ask them to recommend you, don't go by the menu because the English menu is pretty much American standard Chinese food. \n\nThe price is also very good as it ranges from $6.95 to $8.95. I haven't tried their fish but I will next time I go there with more friends (not just the two of us). \n\nOoh and the fruit juice is to die for. It's very good,fresh and big tall glass only cost $2.95."
    },
    {
        "id": 211,
        "text": "We ordered 7 dishes, and was still hungry afterwards because the food wasn't very good, it was either too salty or bland. Since none of our food was good, we did not order more. \n\nHot & Sour Soup - 5\nI had always loooove hot & sour soup so it's not hard to make me happy with this soup. \n\nSpicy Beef Tenon - 1\nIt was nothing but salty. Waaaaay toooooo salty! Not spicy at all. It was inedible. It was \"house recommended\" but I wouldn't recommend this to anyone. \n\nFish ball soup - 3\nSmall boiled white fish balls. Compared to the other food I had here, this is edible. \n\nMa Po Tofu - 2\nThis dish was supposed to be \"house recommended\" and this restaurant's \"special\" dish as it is written up on their chalkboard but there was barely any taste to it. It wasn't spicy at all. \n\nBeef & Beans - 1 \nAwfully salty! It tastes like they soak them in salt and served it like that. \n\n3 Bui Gai (Chicken) - 1 \nThis is also \"house recommended,\" this restaurant's \"special\" dish, and a traditional Taiwanese dish. This is a Taiwanese cuisine restaurant so we expected it to be good. Not only did it not meet our expectation, it tasted awful! It was plain SALTY! So bad! It's like they didn't mix it well, one chicken was super sweet, the other was ridiculously salty. \n\nGon Chow Au Hor (Dry fried stirred flat noodles) - 2\nIt was bland. Didn't taste like anything but since we had so much salty food, this was saving my life. \n\nI feel bad but I wouldn't recommend this restaurant to anyone. If you are a tourist like me and you're wondering around Philadelphia's Chinatown looking for tasty food... There's no tasty food here."
    },
    {
        "id": 212,
        "text": "Best Taiwanese beef noodle soup in Philly Chinatown in my opinion given the quantity, quality, and price. One of the few Chinatown restaurants that also offers traditional Jia Jiang Mien, which is minced pork tofu and scallions over noodles, in generous portions.  The restaurant is small for large groups but a great place to eat for groups of 1-4.  Accepts cash and card (minimum $10 or $15) which is a plus if you are short on cash."
    },
    {
        "id": 213,
        "text": "This restaurant in simple terms is nothing out of the ordinary, it's similar to other Chinese style restaurants in the area. The staff that work there are average and the food is average. The portions are a good size both times I've been here.  We ordered the sweet and sour chicken and as an appetizer the scallion pancakes.\n\nThe scallion pancakes came out first so that was good, it comes with a sauce which compliments the dish. The sweet and sour chicken was average, nothing to rave out. They deep fry the chicken and the sauce is a little bit to thick for my own choosing but to each it's own.  They give you free tea and water which is cool. \n\nThe staff could've been a bit more attentive. They also seem disorganized a little bit. We had three different people come to our table to give us food or clean up our dishes. The gentlemen that works there I feel was the most professional out of the three. The prices for food is ok and I would come back here again in the future.\n\nThe dining area is a bit small but it works so not a deal breaker. There's only one bathroom I believe so that could be an issue for some. They greeted us upon walking in and we were seated immediately. Overall I gave it 3.0 stars out of 5.0. I think the service needs to improve for sure."
    },
    {
        "id": 214,
        "text": "I came here really excited to try one of the only Taiwanese restaurants in the Philly area. I'm Taiwanese and grew up eating my mom's Taiwanese cooking, and this place was kind of disappointing. I guess it's semi-authentic, but that doesn't mean it's GOOD. I don't really get these glowing reviews. \n\nThe beef noodle soup was fine but average. Nowhere near the best I've had. The pork chops over rice (pai gu fan) were also fine I suppose. The food in general was just okay. \n\nAlso, my dining companion swears he saw bugs. Plural. Like, on the table AND on the floor. I don't mind a little dirtiness in a Chinese restaurant, but multiple roach-like bugs in the dining area are unacceptable. \n\nIf you're looking for decent Taiwanese food around Philly, Han Dynasty is actually Taiwanese-owned and offers a selection of authentic Taiwanese dishes out at their suburban locations."
    },
    {
        "id": 215,
        "text": "Love this place foods good great price and the waitress is so friendly a definite place to eat and they got combo meals to"
    },
    {
        "id": 216,
        "text": "I just finished eating here for the first time.  I read about the raving reviews of their beef noodle soup, and being as a beef noodle soup connoisseur, i had to check it out.  So I get to the restaurant, its small like most other chinatown restaurants in philly, but luckily I didnt have to wait to get seated.  I ordered the Taiwanese beef noodle soup, (they have another item on the menu that is beef noodle soup with vegetables, which is not what i got ).  The bowl that it came in was decently sized, not too big, not too small.  The broth was smooth and not too salty.  I would have liked more star of anis flavor, but this satisfied my craving nonetheless.  The sour lettuce, was a bit much for me, maybe put in half the amount that was given to me.  There was also specks of other vegetables like ginger, onion, etc.  The noodles themselves were very good, chewy, soft, probably home made although i cant confirm that after only one visit.  \n\nOverall i would definitely return to this small joint, and order the same thing.  This is one of the better beef noodle soups Ive had and I'm lucky yelp pointed me in the right direction."
    },
    {
        "id": 217,
        "text": "Lunch special about $5.25, Fried Rice, Sauteed Vegetables and Shrimp. Quite Americanized food. very disappointed. owner is sczchuan provincial refugees from China then moved to Taiwan, then to Philly."
    },
    {
        "id": 218,
        "text": "Hands down the best overall experience I had in Philly Chinatown. Great food, great people and great service."
    },
    {
        "id": 219,
        "text": "The Taiwanese beef noodle soup is smelling quite aromatic! Upon checking in, the waitress already wanted me to write a review! Hey, please let me taste and eat your food first!  (Or perhaps something was lost in translation?)"
    },
    {
        "id": 220,
        "text": "I'm searching for a good lunchtime takeout place.  Empress Garden was a disappointment.  $7.60 for lunchtime special, but the portion was so skimpy that I was still hungry when finished.  I also ordered white rice and received fried rice.  I'm still searching."
    },
    {
        "id": 221,
        "text": "I went to this place afterwards and still their Taiwanese beef soups are the best, that I cannot deny so I upgrade the review. \n\nCheers! \n\n\nLet me tell you my story:\n\nI went for lunch alone in a hot Summer day. \nThere was a Yelp check-in drink popped up, one of those Use Now or Save Later thing. When I asked the young waitress, she said, \"you have to visit our website and put something there.\" Fine, I can live without free drink and a dumpling, whatever. \n\nBUT, I still did NOT get a water. I waited and waited.. no water. \nWaitress never came over until she brought noodle soup. \nStill NO water. \n\nThen, there were two white guys having lunch right beside me, like within 20 cms apart. Waitress came and REFILLED THEIR ICE WATER. Then just pass me by. HELLO? She gave every other customers a glass of ice water, except me till the end (yes, even when she brought me a check.)\n\nI left NO tip, possibly for the first time in last 17 years and explained why she did not get the tip. \n\nBye-bye-O!"
    },
    {
        "id": 222,
        "text": "Authentic Taiwanese food; good quantity, good quality, and quick service at a great price. I've tried their beef noodle soup, pork fried rice, scallion pancakes, and general tso's chicken -- all are solid options. This place is great if you're looking for a quick casual meal with good food or if you're looking for take-out! \n\nAlso, they take credit cards, so it's really convenient."
    },
    {
        "id": 223,
        "text": "The food is great but they have super rude employees.\n\nI have been there a lot of times but tonight the chef came out of the kitchen staring my friend and I down, looking around the room for other customers and waving for us to leave.\n\nWe left 45 minutes before closing time so we weren't there late and that guy is a dick."
    },
    {
        "id": 224,
        "text": "solid food here. enjoyed the taiwanese beef soup. the beef was very tender. would also recommend the garlic tofu appetizer--not very healthy, but was a very light tempura-style dish. prices are good and service was good."
    },
    {
        "id": 225,
        "text": "The Chinese menu and the English menu are NOT the same. If you want the best dishes, be sure to ask for Three Cup Chicken, the Braised Pork Chops, and the Beef Noodle Broth. The mango and the strawberry smoothies are excellent. Do not order the ice tea, or any of the Americanized dishes you would get at PF Chang's (General Tso's Chicken, Beef with Broccoli, etc.) Prices are very reasonable. Located just a few steps from the Friendship Arch in Chinatown"
    },
    {
        "id": 226,
        "text": "This is a 5-star restaurant, but you have to know what you're doing.  I was lucky enough to visit with my Taiwanese in-laws so they could talk to the owners and get the good stuff, but as far as I could tell, there were no Taiwanese items on the English menu.\n\nMy recommendation:  Ask the server to suggest authentically Taiwanese dishes and skip the things you've heard of.  The oyster pancakes were fantastic as were the hand made noodles cooked in a stir-fry.  We were able to try so many interesting flavors and textures, before this meal I had no idea how good Taiwanese food could be.  The owner told us that the family has owned restaurants in Taiwan for many years.  Everything was great, I can't wait to make it back."
    },
    {
        "id": 227,
        "text": "Great food, fast service, would absolutely come back!!  Loved my scallion pancake and chicken fried rice.  Great size of dish and good price!"
    },
    {
        "id": 228,
        "text": "This place knows Taiwanese Food!\n\nAmong the things of MUST GETs: \n- Taiwanese Beef Noodle Soup - as others have mentioned, not too salty, perfectly seasoned, tender meats, noodles with nice bite, lots of pickled mustard greens (my favorite).  Great portion, doesn't go overboard on the star anise.  Actually, the Beef Noodle Soup here is better than most I have tried in NYC's Chinatown. \n- Porkchops over rice (Paigu fan) - these porkchops are perfectly seasoned with that five spice powder and the juicy suckers are fried in a super crispy batter and fried to perfection. \n- Jia Jian Mien (the homestyle noodles with the black bean sauce) - what I love about these noodles here is that there are plenty of bits of meat and it is saucy.  I hate it when you go to places and there is not enough meat.  And it's got some sprouts in there to give it that nice wet crunch.\n- Mah Wan (massive Taiwanese vegetable dumpling?) I don't know what it is in english, but it is made of that glutinous rice and inside it is filled with assorted Taiwanese veggies and it has that pink/red sauce on it.  When I was growing up, I always called it a jellyfish, but it really has nothing to do with a jellyfish, it just kind of looks like one. The one here is GREAT.  No tuff spots in the dough.  The sauce is the perfect consistency and has great flavor and tang. Not overly sweet like some places.\n- Scallion pancakes:  the ones here are crisp and thin and comes with the seasoned dipping sauce.  Delicious!\n\nService is super friendly.  I'm a fan and can't wait to go back!"
    },
    {
        "id": 229,
        "text": "First off, we got seated then the waitress disappeared. A while later she brought water then took our order. There was someone helping her and I asked him if the tea was complimentary and he said no. I still ordered some and 20 minutes later he brings it and it's cold. Keep in mind the table next to us had tea brought to them the instant they sat down. So ten more minutes go by and he comes back to the table. I asked for hot tea... so you guessed it more waiting for the hot tea. The food was ok but not good enough to compensate for the bad service. I won't be returning."
    },
    {
        "id": 230,
        "text": "Beside Sang Kee Duck, this is my new favorite, go-to, Chinese/Taiwanese place in Philly! So not kidding, it's a at least once a week, will walk over half and hour through rain or snow, kind of place for me. \n\nBest dishes here that I stuff my face till I get food-coma are as follows: \n-chicken chow fun (no gravy. why is that even an option?) Lace it with Sriracha like you're supposed to. \n-Three Cup Chicken\n-string beans or watercress \n-fried pork chops\n-eggplant \n-egg drop soup\n\nOther pros: \n-clean\n-fast and friendly service\n-the prices are killer good\n-the fortune cookies there actually make sense\n-the portions are plentiful\n-the teapot of tea is fresh and good\n-they don't judge you when you keep coming back to eat alone because you can't stay away from their addictive food."
    },
    {
        "id": 231,
        "text": "I don't know how this food is rated even close to 4 stars. Unless your hammered drunk or have no tastebuds don't order. \"Fried rice\" isn't even friend Rice. It their regular rice with some soy sauce. General Tso is bland. I'm just really pissed order 70$ worth of food and it's just gross. Most is going to the dog or the garbage"
    },
    {
        "id": 232,
        "text": "Incredibly we can eat Taiwanese food when we travel in PA, we ask Days Inn hotel's desk what's his recommendation for restaurant, he recognized we are from Taiwan and tell us this restaurant.We ordered salt and pepper pork & beef noodle soup, they are delicious! I think I will go back to travel PA just for this restaurant!"
    },
    {
        "id": 233,
        "text": "This restaurant should be renamed because neither its quality nor service was fit for any royalty, let alone an empress. Although the restaurant was small and only three other tables were seated, we had to wait for nearly 1 hour to get our food (basically after all of the other tables have cleared out). The dishes were pretty pricey compared to some other options in this area but not very impressive tasting. Was definitely not worth the wait!"
    },
    {
        "id": 234,
        "text": "Okay here we go. This place isn't particularly expensive but it's not cheap. They skimped on the chicken in two orders, and gave one pint of rice for 2 entrees. Don't know if this was a skimp or an oversight.\n\nThats not enough for 1 stars....until we came across the endless hairs in our meals. Avoid this place."
    },
    {
        "id": 235,
        "text": "I've been looking for Taiwanese food in Philly for the longest time and was excited when I heard about Empress Garden.\n\nI've tried the Scallion Pancakes, Fried Pork Chop, and Taiwanese Stir-Fried Rice Cake. The food was good, but nothing that really impressed me. In general, I felt that the food was on the blander side. I pretty much dumped all the hot pepper oil in my dishes to make up for it. \n\nI heard a lot of people ordering Peking noodles for take-out. I'll try these next time."
    },
    {
        "id": 236,
        "text": "I've passed Empress Garden more than a dozen times. It's fairly nondescript from the outside but when I finally went in, I really enjoyed the meal I had here. This is one of the few Taiwanese restaurants in Chinatown.  It has a very clean feel and one of the walls is a huge glass window that looks out onto 10th street, so there's plenty of natural light and sunshine.\n\nI tried the Taiwanese beef noodle soup.  Just under 7 bucks, steaming hot, a very generous amount of beef, and very flavorful.  (Maybe a little too flavorful actually, I found the broth a teeny bit on the salty side)  I wouldn't have minded a little more of the veggies but still a great portion size for the price; I had leftovers for later.  My friend tried the Indonesian curry and really enjoyed it.  The curry itself was a little on the watery side, but we weren't sure if that's the nature of Indonesian curry itself or how it was prepared here.  \n\nBest to avoid ordering from the lunch special menu even though those items, like General Tsao's, may sound more familiar to those who don't know a whole lot about Taiwanese cuisine, b/c those are distinctly Americanized dishes. In fact, my friend was originally going to order the Hunan chicken lunch special and the waitress actually asked if she was sure, adding that those are Americanized dishes.  \n\nObviously if you know Chinese, now's the time to bust it out with the waitresses but they speak English really well too, at least from the exchange I heard between the waitress and an English-speaking patron.  \n\nI already have my eye on the pork chops with rice (sounds fatty but heavenly) for my next trip here, and sometime I'll try the oyster pancake appetizer too.\n\nThe only drawback, which is a minor one, is that there's only a single restroom and it looks like a broom closet converted to a bathroom b/c it's so narrow. Really, I don't know how people with a slightly larger body habitus would squeeze into this, and the sink is tiny. But hey, you'll be spending most of your visit here chowing down, not in the bathroom, so all's well."
    },
    {
        "id": 237,
        "text": "Post flower show lunch.  Ma Po Tofu, Scallion Pancakes, Soup Dumplings, and Stir Fried Eggplant were all delicious.  Come hungry as the portions are healthy and well priced.  Couldn't resist a Thai Iced Tea."
    },
    {
        "id": 238,
        "text": "I ordered through grub hub and waited over an hour for my food only to be told that the restaurant cancelled my order without informing me and closed for the day. Unbelievable."
    },
    {
        "id": 239,
        "text": "Excellent meal as usual, I had the chicken fried rice w/Mai Fun noodles. \nMeal was hot, chopsticks were clean, restaurant was nice and quiet even though it was full. \nDefinitely a great place to eat."
    },
    {
        "id": 240,
        "text": "The three cup chicken was fantastic. The noodle dish was a bit on the salty side.  Place was quiet and in a busy part of Chinatown. Scallion pancakes were good."
    },
    {
        "id": 241,
        "text": "Best Taiwan style beef noodle soup (niu rou mian) in Mid Atlantic!  I've searched up and down East Coast from Boston to NYC to Washington DC, only this place is authentic with the right flavor.  Other Taiwanese food items on the menu were also amazing, including scallion pan cake, stir fried bamboo, etc.  The Indonesian dishes are good as well.  \n\nThe staff is friendly and helpful, food comes out fast.  The interior deco has been renovated and looks inviting."
    },
    {
        "id": 242,
        "text": "I feel bad only giving this place 3 stars because the food was good, however I ordered the chicken chow mein, and there weren't any noodles at all. If they had just executed on that one particular item I would be on board all the way to give this place 4 stars.\n\nBut as I said, this place has it's pros for sure. A very extensive menu for a wide rage of tasty traditional Taiwanese foods, and what food I did get was well prepared, fresh, and very flavorful. But it's too much of an error for me to overlook unfortuantely."
    },
    {
        "id": 243,
        "text": "This restaurant is absolutely amazing! After 26 years in Chinatown, they truly have perfected their cuisine. Talking to the owners, Julie and Michael, is a real pleasure. I asked what they would recommend and everything they chose was delicious! The ingredients and flavors were so fresh. I thoroughly enjoyed the scallion pancakes, fried dumplings (they also would have been good steamed as the filling was the best part), and the three flavor chicken. Try the watermelon and mango smoothies...only fresh fruit, ice and a tiny bit of sugar...so refreshing!"
    },
    {
        "id": 244,
        "text": "I only went here originally because I saw mention of Taiwanese beef noodle soup and pork chop. \n\nFrom perusing the menu, it seemed much more like standard Chinese fare that could be read in English. There was a whole lot of other things in Chinese that I obviously could not order because they had no translation. \n\nAnyway, the owner/waitress is super nice and was surprised I knew they had these items on their menu. Both of these dishes were just okay. I personally think I make a better Taiwanese pork chop at home and the beef noodle soup just wasn't like the ones I've had and loved back in CA. I did also return at a different time to try some things of their normal menu and again, it just tasted pretty typical. The stand out dish I did like is chicken in the clay pot."
    },
    {
        "id": 245,
        "text": "The food was great, and the room was comfortable. We were the last group to leave and the owners were more than happy to wait for us to finish. The only downside is that the food was small portioned, especially for he price."
    },
    {
        "id": 246,
        "text": "Good food for a decent price.  I normally go to imperial or shan pan kung ibut i tried this little joint and was thrilled with the quality and amount of food i got.  I always get to much food in chinatown but seriously, one combo dish can feed 2 people..and i can eat."
    },
    {
        "id": 247,
        "text": "I was downtown and wanted some chinese food. i checked out several menus and nothing popped out at me. i was about to give up when i walked by empress garden. i ordered shrimp with chinese vegetables no water chestnuts as a take out. when i got home i was going to eat a lil bit and save some for later. well later never came. i ate the entire order. the food was soooo good i couldnt stop eating. the shrimp were a marvelous side. the vegetables melted in your mouth. the seasonings were on point. im going back and next time im eating in."
    },
    {
        "id": 248,
        "text": "I ordered take out from here, and it took 1 hour and 25 minutes for it to be delivered. The weather was nice, clear roads - there was no reason why it should be late."
    },
    {
        "id": 249,
        "text": "This is one of my favorite places to go eat in Philly Chinatown.  Even though I have eaten at this restaurant many times. I get the same thing every single time. \n\nShanghai Style Rice Cakes with a side of fried pork chops.\n\nIt is simply awesome and I never get tired of it. The fried pork chops tastes great and its tastes different from other places that sell fried pork chops. It has a great crunch along with a light sauce to season it. And the soy sauced based sauteed rice cakes with vegetables is pretty awesome as well. \n\nThe food may be a little greasy but a little grease is not a big deal to me. If you are one of those calorie counting salad munching health nazis, you might want to get something else."
    },
    {
        "id": 250,
        "text": "Not impressed , left after soup. The menu was too basic and uninteresting. Hot tea had no flavor. Will not return."
    },
    {
        "id": 251,
        "text": "On the window, I read: \"Authentic Mandarin and Szechuan\" and thought, \"why not?\" and walked in. It was around noon, and crowded.\n\nJulia, Empress Garden's friendly owner, greeted me. We had a conversation on what was tasty and she ultimately recommended a Taiwanese noodle dish (C71 on the menu) to me, which I ordered to go. I mentioned that I've never been in her restaurant before, so when she said it was 24 years old, I was floored!\n\nMy dish of \"spicy\" (they weren't really spicy), dry Taiwanese noodles set me back $6.75, but kept me fed for hours. It was a generous portion of shredded string beans, salty soybeans, tofu, pepper flakes, pork (meat), bean sprouts, and white noodles. Did I mention it came out right away? Worth a try, stop in!"
    },
    {
        "id": 252,
        "text": "After a long day of work all I could think about is where I could take care of my noodle craving. As soon as Empress Garden came into mind I put my mind to ordering the Taiwanese beef noodle soup. The beef broth with the pickled veggies is so delicious with soft noodles. I also love the zajiangmian (Peiking noodles with meat sauce) which comes with crunchy string beans and tofu and ground meat. It's a bit spicy too :)\nWe also got the string beans which is perfectly crunchy - not soggy or burnt.\nThe service is always good and ever since they changed owners they have remodeled the place so it's more spacious than before.\nI've also had their pork chops which are yummy. Their duck is decent too.\nAlso, come for their other taiwanese specialties such as the oyster pancake, yum!"
    },
    {
        "id": 253,
        "text": "I loved the scallion pancakes: super tasty, and in combo with sweet vinegar, it is fantastic! In addition, we ordered Jia Jia Mian (Peking Noodle with Meat Sauce), Braised Pork Feet over Rice and some Hunan Chicken. Each dish was yummy, dish sizes and prices are great. Plus, the kitchen works very fast.\n\nIn general, I have the feeling that this restaurant's dishes are a mixture of westernized Chinese and authentic Chinese cuisine which is not bad at all! :) Just don't be surprised of the food preparation/layout, as we were. Definitely worth a stop."
    },
    {
        "id": 254,
        "text": "Underrated! Food was gross and unedible. I ordered orange chicken. It tasted old and spicy. I asked for a mild version of this dish. Someone else at the  table had an allergy of a garnish of a soup dish, he asked the wait staff if they could make the dish without the garnish.they said yes, and the dish came out with the garnish on it. The restaurant itsself was small and dirty. I ate nothing, and went to mcdonalds across the street for my edible food. NEVER AGAIN!!"
    },
    {
        "id": 255,
        "text": "Get their specials! This was the first time I've eaten Taiwanese beef noodle soup, but it gave me the same feeling as a good bowl of pho. \n\nI've passed by Empress Garden so many times while in Chinatown, but I finally decided to try it one cold night. Inside, it looks and is small, and what you see in the window is basically it. \n\nThe Taiwanese beef noodle soup broth's was cloudy, the noodles were soft, and the beef was tender. The pickled collard greens was a surprising topping that added an interesting flavor to the savory soup. \n\nThe spice must have been an oil because only the first few bites from the top were spicy, so I added some of the chili oil from the table. This was a whole other flavor which if you decide to try out Empress Garden, definitely try the chili oil."
    },
    {
        "id": 256,
        "text": "Empress garden is one of the only (if not THE only) Taiwanese restaurant in the city.  They do have some more traditional Chinese entrees, as well, but I'd recommend trying some of the less common items if you go.  I've been several times, and have sampled the fried pork chop (really good), the meatball (a gelatinous rice ball with meat inside, and a tomato sauce on top) and a few of their soups and noodle dishes, which were all very good.  It's a nice place to go with an adventurous foodie group to try some new dishes that may be less common that what you'd find in Chinatown."
    },
    {
        "id": 257,
        "text": "I always get the Indonesian Fried Rice and General Tso's Chicken both extra spicy. That's comfort food for me. Even when I get the food to go, it's still delicious. My Indonesian friends all claim the Indo fried rice here is the best in the city. Their Taiwanese food is decent too and they have good lunch specials."
    },
    {
        "id": 258,
        "text": "We visited Empress Garden on spring Saturday afternoon around 18.00 Hrs. The place was clean and had a moderate crowd. We were quickly seated and our server brought out tea and iced water almost immediately. Our server then disappeared for 15-20 minutes before taking our order. We then waited ten minutes for our soups to arrive. I found the hot and sour soup to only match its name in one adjective: the temperature was hot. The soup had a very thick consistency and very oily. The soup was rather bland with no flavor. My dining companions agreed that their wonton soup also was oily and bland and one remarked he thought the meat in his was \"off\" which he did report to the server. We only consumed about half of our soups before pushing them away.\n\n   Our server removed the half consumed soup and listened to the report of bd meat in the wonton. Fifteen minutes later she brought out our main courses. I ordered the General Tso's chicken with a vegetable roll, our server said the substitution was no problem, as I have a seafood allergy. My companions also ordered a General Tso's and sweet and sour chicken, all with shrimp rolls. \n\n   I found my General Tso's also to be rather bland: the sauce was sweet but no \"kick\" or orange flavor to it. My companions stated the sweet and sour chicken was okay but nothing rave about. They also agreed that the General Tso's was bland and uninteresting. The final straw was when one of the companions consumed their shrimp roll only to find out it was my vegetable roll. I'm glad I didn't immediately bite in to my egg roll as I did not have my Epipen with me and spending a Saturday night in the emergency room is not fun.\n\n   We chose the Empress Garden based upon Yelp reviews so maybe we got an off night or the place is not consistent. Either way we won't be going back."
    },
    {
        "id": 259,
        "text": "I was in the mood for fried rice. There are many options in the area but I decided on Empress Garden based on reviewer comments and pictures.  \n\nThe store front was very hole-in-the-wall which is fine with me because I tend to have better experiences with small places as opposed to hyped-up elaborate establishments.\n\nI walked in and was greeted by an employee who offered me a table but I said I would like to make a to-go order and he quickly gave me a menu and asked if I had any questions.  I placed my to-go order of pork fried rice extra spicy with extra veggies.  The price was surprisingly low so I made sure to clarify that I was charged correctly for the full order and not half or lunch portion and he confirmed that the full order is correctly around $7.\n\nI helped myself to a seat as I waited.  The dining area is small, perhaps 10 to 12 tables and there were no other customers present but I was there in the middle afternoon on Tuesday.\n\nMy to-go order was ready in 5 minutes.  The rice was packed in a typical styrofoam food box put into a plastic shopping bag along with chopsticks and a plastic fork and spoon.  It did not include soy sauce, hot mustard, etc so keep that in mind if you like to put soy sauce on your food.\n\nThe fried rice was pretty good.  It was a bit dry but I contribute that to the fact that I took it to-go and reheated it.  There were hardly any veggies despite me asking for extra veggies but the meal was still good.  The flavor was good and the spice level was noticeable but not what I would consider hot.  I prefer the larger chunks of pork in fried rice but this one had those smaller bits of chewy pork that are perhaps the size of peas.  There was a generous portion of pork which was very satisfying.\n\nOverall, I rate this place as pretty good.  I am satisfied with my fried rice meal.  The menu had other dishes that looked very good so I would be happy to eat here again if I had the opportunity."
    },
    {
        "id": 260,
        "text": "Great rice dishes and Taiwanese favorites! The braised pork belly with tofu and the fried pork chops are some of the best quick meals around. Decent beef noodle soup as well, especially on a cold winter night. A chinatown staple that you should check out!\n\nEnjoy!"
    },
    {
        "id": 261,
        "text": "We went for diner with 5 persons. The food was good. The portions are pretty big. They don't serve the diners the same time. So one person was almost ready when the last person got her food. The waitress was not interested, and the menu could not be adjusted a little bit. Taste of the food is good and it looked fresh. That's why I give 3 stars."
    },
    {
        "id": 262,
        "text": "Not sure if they are/ have been under new management... I went in and the pictures that are usually hanging on the wall are no longer there... Customer service went downhill.\n\nOrdered my fried pork chop to go. The service over the phone is awful. It's not my fault you speak broken english missy! \n\nArrived home and opened the pork chop and could tell right away it wasn't fresh. It looked like it  was poorly over fried, tough and chewy. Could've possibly been leftovers from the looks of it. \n\nI've never been disappointed with my take outs here. Everything use to be fresh and delicious. But now i don't know if I'll ever come  back."
    },
    {
        "id": 263,
        "text": "I've been here a lot. I bring my family here. I bring my friends here. Being Taiwanese, I feel that real Taiwanese offerings are pretty scarce in Philadelphia (hint hint, someone open up a new Taiwanese joint already sheesh!). Sometimes I crave the food that you can just pick up from some random street cart in Taipei. Anyway, so I scoured the internet for Taiwanese places in Philadelphia, and if anyone has another suggestion for one, please let me know. That's how I stumbled across Empress Garden a couple years ago. I've been going fairly regularly since.\n\nThey've recently remodeled, and the restaurant actually looks much nicer (although I was sad when they were closed for remodeling). There are a few staples I always get:\n\n- Scallion pancakes - Even though the ones here aren't really super authentic, they're just really good! They're deep fried, and that fish and vinegar sauce it comes with is really good. I usually get two orders, and if I'm sharing with friends I secretly hog it. \n\n- 3 Cups Chicken - This dish should have the bone in (for flavor), basil, ginger, and that sweet sticky soy sauce. This is really quite addicting. The flavors are perfect in combination.\n\n- Fried pork chop - The ones here are very juicy and have a crispy outside. \n\n- Jah Jang Mein - It's Taiwanese style, so for the Koreans out there, don't expect zucchini and black tarry sauce. It's savory, meaty, flavorful, and really hits the spot. I'm not sure if the noodles are house made, but they definitely have that chewy spring to them (for those who know what I'm talking about, very \"Q\").\n\n- Beef noodle soup - This also has that authentic Taiwanese developed flavor. Again, the noodles are so good here.\n\nThey also do offer a lot of Taiwanese street foods including oyster pancake, Taiwanese meatball with glutinous rice wrap (\"bah wan\"), and other tasty offerings.\n\nFinally, if you don't speak Chinese, can't read it, or don't have a Chinese friend to bring with you to the restaurant, choose something off the above list. There are 2 menus here, the English menu and the Chinese menu (which has more of the authentic tasty food). I would hate for you to come here and end up with General Tso's chicken."
    },
    {
        "id": 264,
        "text": "So this is the place to go for Taiwanese food in Philly Chinatown. When I walked by the window, 2 dishes stood out to me. So of course, I ordered 3. This is the 3 cups chicken. I didn't know why this dish was called that and so I looked it up and apparently it's because you make it with 1 cup of rice wine, 1 cup of sesame oil and 1 cup of soy sauce. Out of the three dishes we had, this one was the most difficult to eat because of all the chicken bones.\n\nThis is one of my all time favorite dishes, eggplant with ground pork in garlic sauce.  Even when I got the to go bag, I could smell the eggplant dish beckoning me to the back seat. My boyfriend wasn't too pleased that I had killed the new car smell with Chinese food. Oh well!"
    },
    {
        "id": 265,
        "text": "This is one of my favorite spots in Chinatown that serves authentic Taiwanese cuisine. I took my family here recently when they were visiting and they were big fans. My parents grew up in Taiwan and even they commented on how impressed they were with every dish.\nWe ordered the Taiwanese beef noodle soup, oyster pancake, triple stir fried, salt and pepper pork chop, and beef chow fun. Highly recommend the beef noodle soup- so many tender chunks of meat, substantial noodles, and the broth was flavourful with the right amount of spicy. The salt and pepper pork chop was delicious, perfectly crispy and savoury. Beef chow fun was standard, and we also finished the triple stir fried and oyster pancake in no time.\nSide note: we were seated next to a table of foreigners that ordered fried rice and wonton/egg drop soup and it truly saddened my soul to know they were missing out on the real winning dishes. \nDefinitely stop by here next time you're in Chinatown!"
    },
    {
        "id": 266,
        "text": "This place is no longer good! They have new ownership and are no longer Taiwanese-owned. The Cantonese owners said they have the same cooks, but you could clearly taste the difference between the current and previous food. The oyster omlete was watery and had a strong fishy taste and the fried pork chop was battered diffently that left a bad taste in my mouth. Unfortunately, there aren't any Taiwanese restaurants in the region that serve this type of food."
    },
    {
        "id": 267,
        "text": "Appearances can be quite deceiving, as we know all too well from Macbeth. From the outside, this doesn't look like much but it is a treasure trove of authentic Taiwanese dishes that are simply too die for (or at least worth the Chinatown parking charge and rush hour traffic on the good ole I-76).  The Taiwanese beef noodle soup is the most popular dish, and is well deserving of its reputation.  Perfect on a cold day.  Also be sure to try the pork chops with the Shanghainese rice  cakes.  The basil/three cup chicken is pretty good.  Just stay away from takeout dishes because those tend to be well, takeout-like, for lack of a more precise description.  If you're in Chinatown, you need to stop by.  My family has been coming here for the past 17 years, and it is still one of our favorite restaurants.  I've brought friends from school here and even the Californians find this place to be authentic.  That, too me at least, says a lot."
    },
    {
        "id": 268,
        "text": "everything is good. but if I had a choice to order one dish and one dish only, it would be the braised pork with tofu. fatty pieces of pork belly braised in a sweet soy with fried tofu. it is that good people! ask for a few extra bowls of rice to finish the dish"
    },
    {
        "id": 269,
        "text": "Kind of a small place. Usually packed during peak hours, but has takeout. The waiters don't really speak Chinese, but the food is very authentic. Some items are Taiwanese but I think most are more a mix of different regions. I like the scallion pancakes and noodle soup. Probably one of the better places in Chinatown."
    },
    {
        "id": 270,
        "text": "Met a friend here for lunch today. It wasn't the restaurant she had in mind but it was crazy cold outside and we both were hungry. \n\nSerendipity. \n\nThe food was delicious and the staff was friendly. Prices were very reasonable and I'd definitely go back."
    },
    {
        "id": 271,
        "text": "I'm spoiled by the best Taiwanese food in Taiwan so there is just no comparison to the real thing.  even thou this place is suppose to be the philly branch of the original tawanese place in taiwan.\n\n- oyster omelet, a signature taiwanese food stand specialty.  it's comfort food for me, the only other place i've had it in the east coast is in maryland.   it's not too bad here.  One day I'll try nyc"
    },
    {
        "id": 272,
        "text": "We like this place.  The ingredients were fresh, dishes were well-prepared and the price was good."
    },
    {
        "id": 273,
        "text": "In continuing to check out the diversity of restaurants in Chinatown, decided that I was in the mood for Taiwanese food and came here around brunch time. The restaurant can be easy to miss as its surrounded by a plethora of bakeries and other restaurants in the heart of Chinatown but don't sleep on this place!\n\nGot the traditional Taiwanese pork chop, Taiwanese noodle, and the pork and mustard greens sour soup. As my friend pointed out, although the beef noodle soup is the most popular of Taiwanese dishes this sour mustard green pork soup is a little known traditional delight and actually sold at very few restaurants. However, it was delicious and a lot lighter than most beef based soups. Definitely great for a hot day add a huge portion for less than $7 per bowl. Same with the pork chop, which was tender in the center with a crispy, seasoned crust. \n\nFinally, the stereotype with a lot of cheap Chinese restaurants in Chinatown is the poor service but that couldn't be further from the case here! The lady who served us was so kind and warm and I liked that they played Chinese music in the background - really gave it that authentic feel haha. Would recommend, come and eat here!"
    },
    {
        "id": 274,
        "text": "Came on Wednesday night. Quick service. Good food. Hits the spot. The food is authentic and service is quick. They're one of the few places in Philly that serves oyster pancakes! \nSome of my go to dishes are:\nScallion Pancake, beef chow fun, beef noodle soup, pan fried noodles."
    }
]