[
    {
        "id": 1,
        "text": "This is the only take out place I've found in the area that offers tofu. They have a decent vegetarian menu and the food is always great.\n\nI just wish they did online ordering + delivery. Other than that, no complaints."
    },
    {
        "id": 2,
        "text": "Lucky wok best on 5th st."
    },
    {
        "id": 3,
        "text": "2nd time here to get their chicken on a stick and that was good. Just $1.25 never tried the other food."
    },
    {
        "id": 4,
        "text": "The wonton soup tasted weird. Not like all of the other wonton soups I've had before at other restaurants. A very different taste. The beef lo mein was okay. The beef was tender, but flavorless. My boyfriend got chicken fried rice and he has no complaints. He's not hard to please lol I specifically asked for fortune cookies instead I got a Mountain Dew can soda lol the prices were good but they ought to be for the quality of food I received. Delivery took about 30 minutes. The delivery guy called me to meet him at the door instead of just knocking on the door (security reasons idk ). Overall would I order from here again? Very likely I wouldn't order from here again."
    },
    {
        "id": 5,
        "text": "Nov. 2012\nUpon reading good online reviews, I decided to go out on a limb and try this local Chinese Take-out.\nWe ordered (2) Beef Fried Rice, (1) Fried Dumplings, (1) Pizza Roll.\n\nFood 1/5: \n\nBeef Fried Rice: Overcooked yellow rice, no flavor what so ever.\nBeef - no flavor, chewy - Nasty.\n\nFried Dumplings: Dumplings not completely fried - Meat & dough were still raw. Had to keep frying them. Afterwards the meat's stench kept me from eating any of them.\n\nPizza Roll: Fried incorrectly, raw dough on the inside. I felt like I was taking bites of Hunts Tomato Paste with a 1% hint of some for of cheese. Just nasty.\n\nBy far the worst Chinese Food I've ever tried ingesting in America.\n\n\nSerivce: 1/5\n\nETA: 30 Minutes - Driver arrives 45-60 minutes later. Calls us for no apparent reason, just to confirm the address I already provided the shop with."
    },
    {
        "id": 6,
        "text": "7/17/12 lunch=dinner size Shrimp Egg Foo Young w/ extra shrimp and shrimp w/ broccoli, mushrooms, and extra shrimp, 2 Arizona sweet teas, and watermelon.  Extra shrimp is the way to go.  The egg foo young is quite tasty and would be great even as a quasi-vegetarian dish.  I must say that the gravy was salty and the brown-gravy that is used with the shrimp and broccoli  is usually very thin and bland. This is the best Chinese restaurant I've found here in Philly so far; the prices are excellent, the food is tasty and the fruit is fresh!\n\nDelivery=Yes according to the menu but No since the driver is never available when I call to place an order.  If you order a dish from the lunch menu be sure to get your free canned soda.  \n\nI'm glad I did at least begin a draft review since my phone keeps crashing when I try to post"
    }
]