[
    {
        "id": 1,
        "text": "Now that me and my bf moved we cannot find Chinese food as good as this place. They have a buffet menu that you can sit and just keep ordering food and it comes out hot and fresh instead of it sitting in a tray for awhile. We've tried almost everything and haven't found something that we do not like"
    },
    {
        "id": 2,
        "text": "Aesthetically it is more than your corner American Chinese food restaurant but certainly not as classy as you'd see down town.  I was only one of two customers during my entire visit at around 1pm on a Friday but I'm glad I stayed.\n\nService was great.  Staff was friendly and everything came out in a timely manner.\n\nFood was very good.  Ingredients were fresh and it had the taste of something home cooked.  Wonton soup and beef with broccoli is what I ordered and was more than satisfied. \n\nCost is comparable to your corner Chinese food store with serving sizes to match.\n\nI've driven past this place many times before and I'll definitely be back to try more adventurous things on the menu."
    },
    {
        "id": 3,
        "text": "This place has delicious authentic Asian fare.\nI've tried every place in the neighborhood and I'm so thankful that I found this place since everywhere else serves American Asian food.\nI highly recommend their lo mein, mai fun, and ho fun.. soooo good!"
    },
    {
        "id": 4,
        "text": "I really don't like to give this restaurant 1 star but back in the day there were 2 previous owners they were the best the previous owner was super clean Sam the last owner he was so clean and the food was so amazing but the owner now sorry to say this there nice but they are so Dirty there new restaurant look nasty and it stink so bad its like they bought that place and didn't clean it its bad so sad there food use to be so good they should take time and clean up the place and not have there kids in and out the kitchen its not rite."
    },
    {
        "id": 5,
        "text": "I have been literally shocked at how good the food is in here!  Ordered from there now 3 times- they have the best Hot and Sour Soup- By now we've tried about six entrees and have been impressed with the freshness, the abundance of ingredients and the 'just right' cooking time. Since moving here- this has become our favorite restaurant!"
    },
    {
        "id": 6,
        "text": "Spice Grill is one of the best around. If I can't make it to Chinatown, Spice Grill is my go to place. Their wide noodle dishes are outstanding. Everything is fresh and cooked perfectly. The staff are nice people."
    },
    {
        "id": 7,
        "text": "Service was prompt, food was neatly packaged. I really liked the fried rice, little different than other places. Overall good place."
    },
    {
        "id": 8,
        "text": "Still the best Asian around!\nGeneral Tso's is delish! Not typical Chinese, its chunks of white meat. I ALWAYS order shrimp from here bc they're a good size and fresh.\nAlso, we have dined in a few times and it was very nice. They serve hard noodles and homemade duck sauce for dipping."
    },
    {
        "id": 9,
        "text": "Asian American cuisine. When I got here to pick up lunch, they opened late  (11:02 am). They were very prompt with taking my order. The place used to be a diner, and it looks like they're just getting started. My review is going to be incomplete until the kids and I sample the grub. To be continued..."
    },
    {
        "id": 10,
        "text": "Wish I could give this place zero stars. \n\nOrdered general Tsos and garlic veggies and they tasted sour, fermented and rancid. When I called to complain the man who answered at me shouted \" this is your first order you don't know how the food tastes\" \n\nI asked for our money back since the food was inedible and he shouted \"can't do that. You paid\" \n\nAfter looking up their health grades, they got docked for food born illness which is probably why it tasted so rancid. \n\nI would't order again, not just because the food was clearly old but more so because the man on the phone was a total asshole."
    },
    {
        "id": 11,
        "text": "Uninspired food served on styrofoam plates. Not professional at all."
    },
    {
        "id": 12,
        "text": "The General Tsos tasted like sour ketchup. It was also super dry and felt reheated . Also, it took way longer than Chinese food should take. I honestly wished I had gotten food from the place that I read has bugs-thats how bad this was ."
    },
    {
        "id": 13,
        "text": "Ordered dinner here for pick up a few weeks ago.  I went into get the order.  The delivery guy had a mask on his chin and another woman picking up had no mask on at all.  I stood there like I was in the twilight zone.  The woman working there had a mask on properly.\nMy hot and sour soup was good but my dinner, General Tso's Chicken, had zero flavor."
    }
]