[
    {
        "id": 1,
        "text": "My husband and I frequented *ndulge Cupcake Boutique at there State College location. The year we graduated, *ndulge closed its doors and relocated to the Philadelphia area. Upon moving to the area we were excited to come across the business and decided to take a visit. We were completely disappointed! The two female staff that were present were unfriendly and had awkward attitudes which created an extremely uncomfortable environment. One of the female staff did not even address me in conversation and was only speaking to and making eye contact with my husband.\n\nThe case had a very small selection of cupcakes that didn't look appealing in terms of display or design. They were sparsely frosted with no special garnishes. We bought four different kinds and they all lacked some sort of quality component. The only thing pistachio about the \"Chocolate Moussetachio\" was the pistachio on top of the cupcake. The other cupcakes were extremely dry and dense and either had sparse filling or were over filled to the point where we had to scoop dollops of filling out. The term BOUTIQUE implies sophistication and specialty. The cupcakes here are FAR FROM being boutique quality and aren't anything special.Save your time and your money and seek out another cupcake shop."
    },
    {
        "id": 2,
        "text": "I had a great experience here! The ladies were extremely friendly. The gelato was OUTSTANDING. I had plain vanilla but it was so delicious. The red velvet cake was also wonderful. Highly recommended!"
    },
    {
        "id": 3,
        "text": "Absolutely delicious!! I bought 4 cupcakes on my way home from work.. two for me, two for my fiance. So far, I've had the Realli Vanilli and I was in heaven. My fiance had the Amoretti for Cherry (i think that's what it's called) and he loved it. \n\nBasically, I'm excited to try my second cupcake tomorrow! YUM!"
    },
    {
        "id": 4,
        "text": "I walked in after grabbing some thai food to take a peek. I was greeted by the friendly lady behind the counter who offered gelato samples. We discussed all the cupcake options and I decided on the 2 most classic cupcakes: vanilla cake/pudding filling/frosting and yellow cake/vanilla pudding/chocolate ganache frosting.\n\nI shared with my BF, who thought the vanilla cupcake was delcious, just the type of perfect sweet icing he likes. The cake was good and small bit of pudding good as well. The chocolate ganache frosted cupcake was also yummy. \n\nThe gelatto was good, but not amazing...I think they could improve the texture. \n\nI heard they sometimes make gluten free baked goods, which is awesome because I have some friends who can't eat it.\n\nI'd definitely go back for more."
    },
    {
        "id": 5,
        "text": "I REALLY wanted to love these cupcakes (at the Ardmore, PA location) and still do... My kids could not wait to try out them out. \n\nIt's such a beautiful store, wonderful people who work there, but the cupcakes were just ok. \n\nGenerous size, lots of filling, neat flavors.. but the taste was just ok and the consistency of the vanilla cup cakes  ... not so great. In fact, they fell apart when the kids bit into them. Then they had a mess of cup cake pieces, much of which fell to the floor and ended up in their laps. \n\nThe chocolate was a better consistency, but the flavors were just off. The Orange chocolate icing tastes like children's aspirin, which made me so sad because the idea is perfect. The choc/peanutbutter was pretty good."
    },
    {
        "id": 6,
        "text": "Pretty good cupcakes, not too many flavor options but it changes regularly and you can get a few unique ones. The baked donut was really good and it isn't fried, so bonus for that!"
    },
    {
        "id": 7,
        "text": "4.5 stars, technically. \nFirst off, came in late, just before closing and were still served with a smile!  that goes a long way for me. there were also still a lot of cupcakes available (except chocolate which is apparently really amazing. will have to try next time). \nAmanda helped us, and she was super pleasant and friendly.  If she could get a rating on her own it would be a 5!!! \n\nnow, to the cupcakes!  they were large, and moist, with a LOT of frosting.  the one i had did have some kind of filling (i had PB cup, which is chocolate with PB frosting and a Reese cup on top). i prefer less frosting to cake ratio.  i dont really like eating just frosting and no cake. and it really didnt need the filling for my preference.  The PB frosting was light and fluffy- it may have had a trace of cream cheese which i normally dont like, but i thought it was subtle enough and i enjoyed it. \nThe cupcakes are baked in a paper wrap and they reallllly stick to the wrap. i had to eat with a fork (not that bad) but i kept thinking i wish i had more cake and it wasnt all stuck to the wrapper!  flavor overall was delicious, very sweet. \n\ni also tried the orange spice sorbetto, which was amazing!!! it was a perfect fall flavor, if you are into cold treats in the fall.  \n\nI would go back but i would try the mini cupcakes, hoping that i would have a better cake:frosting ratio."
    },
    {
        "id": 8,
        "text": "Two words: macaron Monday. They're not laduree, but they're the best I have had outside of manhattan. They're light and fluffy and the flavors are changed up every week which keeps it interesting. \n\nMy boyfriend has off every Monday morning and runs to Ndulge pretty early for macarons. A few weeks ago he arrived just before noon on a Monday and they were already sold out! I would recommend going as early as possible if you're trying to buy these cookies."
    },
    {
        "id": 9,
        "text": "While I cannot say that any of the cupcakes at *Ndulge are groundbreaking in their preparation, flavor pairings, or presentation, there are a few factors that make this shop deserving of praise. \n\n1. The hours of operation are impressive for a purveyor of baked goods. I love that I can have a few beers at Lucky's and roll over to *Ndulge around 9 and snag a cupcake to enjoy at home. I do not expect a bakery to be open late under any circumstances so this is a nice perk.\n2. The employees are always friendly, effervescent, and greet you promptly. They describe their products well and maintain a pleasant demeanor. I will always give my money to businesses that provide great service. \n3. The dining space is kept clean at all times. Nary a crumb to be seen.\n\nCan I, and my fellow baked good aficionados make cupcakes of equal or better quality at home? Yes. But I am a graduate student so I am lazy and usually fatigued. Sugary treats and stellar service from *Ndulge brighten my week."
    },
    {
        "id": 10,
        "text": "Perfect.\n\nVanilla cupcake with a Nilla wafer on top.  Amazing.\nCoconut cupcake with coconut filling.  Amazing.\nReally sweet woman working the desk.\n\nFive stars."
    },
    {
        "id": 11,
        "text": "Great homemade Gellato! Lots of different and unique flavors of both cupcakes and gelato.  Staff are very friendly!  Highly recommend."
    },
    {
        "id": 12,
        "text": "Had really high hopes for this place and was a little disappointed. I love icing so I was glad all the cupcakes are not only topped but filled with it.  Flavors are just ok and cupcake was a little dry. \n\nThat was closer to when they first opened though so maybe it's gotten better. \n\nPricey also."
    },
    {
        "id": 13,
        "text": "The cupcakes were all very pretty, and the flavors complex - both cake batter, frosting, and extras - but I wasn't a huge fan overall. Even with a pudding center the vanilla cupcake was dry. The buttercream icing wasn't too sweet, which is great, but it also tasted like it could have been more crisco than butter.\n\nAll in all the prices were fair and if presentation is important these will fit that bill, but it's not my favorite cupcake on Main St. Will be back to try the mini pies and tarts, those looked fantastic."
    },
    {
        "id": 14,
        "text": "This place was a huge disappointment.  It was quite an unwelcoming atmosphere and I swear on my life I am keeping my Manayunk/Roxborough businesses to other places that are not only more welcoming, but also just as good, it not better.\n\nMF and I walk in with Checkers, a caged small mammal.  We're by the door picking out a flavor for the three of us.  So we've decided that Florida key lime was the only one that looked appealing.  Well, the manager approaches us and the very first question she asks was, \"Is that a cat in there?\"  So we're standing there thinking to ourselves, \"Oh, is she severely allergic to cats?\"\n\nWell, it wasn't a cat.  I don't know if that's a good or bad thing.  If it were a cat, would we have been able to get a bloody key lime cupcake to go without having to be booted out to their stoop?\n\n1. She says it's the Philadelphia Health Department policy.  Fair enough, BUT then why did it matter if it was a cat or not?  It sure as hell was not a service animal.  If the first thing she said was, \"I apologize, but we don't allow animals,\" this place would be okay in my book. Nope, she wanted to know the species first.  So what pissed me off was the way she framed it.   She had a discriminatory tone.  That was the deal breaker.\n\n2.  She says we can wait outside (in the rain) and she'll bring the stuff out to us.  What is this, Lady and the Tramp?  A caged small mammal at outside seating is more sanitary than a dog sitting there with a leash, who is still free to defecate and urinate on the restaurant sidewalk.  \n\n3.  We went to two other food places prior and ordered stuff to go, and no one else had an issue.\n\nI understand that there are federal regulations one must be in compliance with.  It's the way I was approached.  I felt like my baby was bullied."
    },
    {
        "id": 15,
        "text": "Not anywhere close to as good as I wanted it to be.  In fact, not that good at all.  Two stars instead on one because the place is new looking and in good shape.  However, the staff was not super friendly, nor was the cupcake selection that good.  I'll have to try the gelato another occasion, so I can't judge that.\n\nI had a cream soda cupcake, that was really just a crappy cupcake with cream soda jelly beans on top.  A dry cake with an overly sweet frosting.  Honestly, it was borderline gross.   \n\nThere is a much better option for cupcakes and sweets in the area, so I think I'll stick to them.  Plus, the other place does cakes which ndulge does not.  I have family who lives in the area of their other location, and they too complained about the quality of the cupcakes.  \n\nI think competition is good for Manayunk, and two places to get cupcakes is good, however I can not vouch for the quality of this place.  I'll go else where for an all around great experience."
    },
    {
        "id": 16,
        "text": "Still excellent.\n\nI'm surprised that this cupcake spots gets worse reviews than Sweet Elizabeth's, which is a few doors down.  The general public does not seem to agree with Yelp, because I just stopped by both places today.  Sweet Elizabeth's was a ghost town.  Ndulge was busy with customers.\n\nMy grandmother used to make wonderful cakes and desserts, and the cupcakes here remind me a lot of hers.  I would say that these cupcakes have the texture and consistency of an actual slice of cake rather than the airiness of a typical cupcake.\n\nAnyhow, had another great visit.  Enjoyed the vanilla cupcake.  Yum yum."
    }
]