[
    {
        "id": 1,
        "text": "Had the lunch platters (curry chicken and goat) and the roti here - the platters were decently sized and the curry was flavorful. The Mac and cheese that came with the platter tasted a little stale though, but as a side dish it worked out okay. I would recommend getting the roti instead - it comes out hot, with a substantial filling, and is really satisfying to eat. \n\nWould love to come back to try the juices or pastries - they have a pretty big assortment on the menu!"
    },
    {
        "id": 2,
        "text": "This hidden gem is a real treat sometimes.  I especially like the wrapped beef and the peanut butter punch smoothie.  It was kind of hot the day I went in there as the air conditioning must not have been turned on.  However, the food was good and they have a wide variety of assorted breads and desserts available and on display which make for a delicious snack."
    },
    {
        "id": 3,
        "text": "Amazing curry goat roti and oxtail. They run out on weekend nights so make sure you get there early. I've been there on a Friday or Saturday when all they have left is stewed chicken. I drive from fishtown area and it's worth it!! If I could get delivery I'd probably eat these dishes way more than I should."
    },
    {
        "id": 4,
        "text": "Born n raised in Brooklyn so Roti and Caribbean food in general is a regular part of my diet.  The lack of good Caribbean restaurants in philly is a recurring disappointment.  that being said I was happy to find this place. The Roti skin is flavorful, not too doughy or chewy and just the right amount of flaky.  The chicken inside was well seasoned and for only $6 you definitely get a good amount for the price. I've had it twice so far and definitely plan on returning next time I get a hankering. \n\nHaven't tried their baked goods yet but I have my eye on their currant rolls. \n\nAlso, Roti is traditionally made with the meat left on the bone so please ignore other reviewers complaining about that. It adds to the experience as you also get to enjoy the sauces that the bones soak up."
    },
    {
        "id": 5,
        "text": "I need to go to this place a few more times to try their different stuff.. but the doubles (chickpea stew sandwiched between 2 puffy flatbreads) I had there were a great little afternoon snack.  $1.50 each and you could have 3 for a totally legit lunch.. maybe 2 if you are eating light.  They also have roti with all different meats including shrimp and \"soya\" and other standard West Indian fare like curry goat, collard greens, etc.  Plates of those things range in price and size from about $5 up.  I am giving 4 stars just because doubles I've had in the past were a little more substantial, and they could have been spicier (though they were well-spiced, just not hot). The thing I was most disappointed by was  the subpar ginger-pineapple juice I got for $3.  $3!?  But I think that was more my fault than theirs.\n\nbtw this is a storefront bakery setup with a window in the back with the hot dishes to order.  There are a couple of tables in there too but it's not a nice-lunch-out sort of place."
    },
    {
        "id": 6,
        "text": "Walnut Hill is clearly a neighborhood I need to spend more time in.\n\nI am having A Situation with my roommate, which has its benefits.  Namely, my friends are all throwing me a pity party, and J offered to take me out to lunch to this little cafe.  She promised me mind-blowing food.\n\nI had never had Trini cuisine before, so I didn't know what to expect, but I was excited.  We bounced through the modest front, past the pastry cases and tried to order doubles.\n\nWhat we quickly found out is that what food on the menu is available here varies a lot by time and day of the week.  Undaunted, we decided to wait a half hour for the rotis and ordered two vegetable pastries for 1.50$ each.  SCORE!  The dough was clearly baked in-house.  The vegetables were seasoned well and tasty, but I just can't get my mind off of that dough.\n\nAfter finding out all my carnivore options had bones, I chickened out and ordered a soya roti.\n\nHold the phones.\n\nThis sandwich?, which is deceptively tiny, is served in aluminum wrapper.  You split it open, stare longingly at it and dive right in, probably burning your mouth in the process.  BUT DEAR GOD.  This roti was popping with chickpeas and soya, which had the taste and texture of meat.  The spices!  I have no idea what they were!  They were great!  AND AGAIN THE DOUGH.  It was so filling and wonderful and delicious.  Ask for the yellow goopy hot sauce, and use it sparingly -- it has a great flavor too, but it has a slow, long, loooong burn.\n\nWe met the chef (she plopped down in the booth behind us with a Coke) and chattered about her cooking process, and everyone was patient with our fumbling and my baby \"wah wah bones\" shtick.\n\nBy the way, I was STUFFED, STUUUUUUFFED, like couldn't move stuffed.\n\nDropped a star only because of restricting what fudz we could get, which I totally understand as a logistical thing, but these are my reviews, and I get to be arbitrary and unfair.  Also, the prices of drinks are a leeeetle high."
    },
    {
        "id": 7,
        "text": "It is wonderful to be newly aware that something is possible. I had never conceived of salt fish, coconut, and a slightly sweet sandwich bun as a breakfast food. Brown Sugar made a compelling argument to me that not only is such a thing possible, but that is desirable. Similarly, I knew that in the Caribbean South Asian cuisine could mix with African and South American cuisines into something original and delightful. I had had chapatis. I had had thick African stews. I was familiar with jerk chicken. But a roti, a delightful, substantial combination of all three? Amazing! \n\nI have no real basis to compare Brown Sugar with other Trini food, but for 6 bucks you can do a lot worse than a chicken or goat roti."
    },
    {
        "id": 8,
        "text": "I love one block from here!!!!! All the food I have ever ordered is DELICIOUS and an incredible value. \n\nThe roti I ordered was good, but the oxtail blew my minnnnnddd. It was so savory and meaty and full of bones. \n\nI wish there was more room to sit down, but we went on a crowded Sunday. \n\nI have also tried the cranberry breakfast pastries and the coffee. They're delicious.\n\nI can't wait until I have some weird disease so I can go order their tailored juices!"
    },
    {
        "id": 9,
        "text": "This place is amazing!!!! The portions are huge for what you pay for the only reason I'm giving it 4 stars is because I called in to order and my food was not ready 30mins later but it was worth the wait though"
    },
    {
        "id": 10,
        "text": "The roti was great. The coconut bun was great. The provision with saltifsh was a little imbalanced, but in part that's my fault for getting provision when I know that's not my favorite dish. I feel confident enough that the roti and coconut bun are representative that I'm comfortable giving five stars."
    },
    {
        "id": 11,
        "text": "Delicious food, Trinidad and Tobago stylee.  They just added an amazing smoothie bar.  I recommend the peanut punch, with extra peanut butter."
    },
    {
        "id": 12,
        "text": "This is another great, hidden gem in Philadelphia.  This Trinidadian eatery is tucked away at on Baltimore Avenue near 53nd Street.  The oxtail platter cost no more than $6 and included a flavorful accompaniment of beans and rice and a cole slaw flavored with horseradish.  \n\nI highly recommend this place to any ventursome foodie who is looking for an inexpensive and exotic getaway for their palate."
    },
    {
        "id": 13,
        "text": "One my favorite places to grab take out. They have really good fruit smoothies, and the baked mac n cheese is one of a kind lol. The platters are always paked with delicious food, so I normally grab a mini unless I'm sharing with my lady. Hands down a true gem in the city of Philly!!! #currygoat #oxtails #beef/cickenpatties"
    },
    {
        "id": 14,
        "text": "First time I came here was yesterday based on the reviews and I was glad I went. The roti was great. Texture and freshness was the key and was even great heated up. My new spot for roti, definitely bc a lot of Jamaican or Caribbean spots in philly don't carry roti or they taste old. So again great spot, and they made me a new repeat customer."
    },
    {
        "id": 15,
        "text": "Trini transplant visiting from Michigan.  OMG!  This place had generous portions and lots of variety, including breakfast options.  Actually took home some baked goods for family & friends.  Oh!  And some doubles - yes they travel well when you're desperate. lol!  Their currants rolls are amazingly good!  Can't say enough good things about this place.\n\nFrom Center City take the Market-Frankford Line (Blue Line) towards 69th street.  Exit @ 52nd. From station head about 1/4 mile south on 52nd."
    },
    {
        "id": 16,
        "text": "Usually this is my go to place when craving Jamaican food .... But today was very disappointing.... I ordered stewed chicken with rice & beans/cabbage there was absolutely no gravy (STEWED chicken?) the food also taste different ... From the looks of it they switched cooks ... I really hope the normal cook just had today off"
    },
    {
        "id": 17,
        "text": "A great place to get fresh #veggie juice in west Philadelphia! Please read more below.\n\nA great mix of West Indian/Trinidadian food. Get there quick because the fish runs out early. Platters are plentiful and reasonably priced. Authentic food. I recommend the \"King Fish\" with macaroni & cheesecake."
    },
    {
        "id": 18,
        "text": "Curry chicken was delicious & the small platter was a huge portion! Was glad I went with small...it came with rice and choice of two sides. Very affordable. Everything was fresh and flavorful. Nice Jamaican spot with some unique beverages & bakery items too. Coworkers have raved about the bakery, I'll have to go for breakfast or dessert next time."
    },
    {
        "id": 19,
        "text": "Roti, yes! Beef patties! Yes. Call first, sometimes hours are erratic."
    },
    {
        "id": 20,
        "text": "I don't even want to tell you about this place. I don't want to tell you, because I don't want it to get crowded. I want to walk in the door and get my delicious double, or pattie, veggie roti, or coconut cake. But I'm going to tell you, because good people run this joint, and good people deserve good business. \n\n52nd St. is dotted with Caribbean joints - this one is Trinidad/Tobago. The food is authentic, down to the \"roots\" and Ting beverages in the cold case, is made quickly, and is inexpensive. Because a decent number of their customers are Rastafari, there are also tons of vegetarian options, which make me happy. If you want hot food, order at the window at the back, and for bakery items, order at the case. Watch out for the Black Cake, a specialty soaked in rum, that is only available during the Holidays. \n\nThis is a real neighborhood joint run be real folks celebrating their culture and their customers. Photos Calypso and Soca musicians line the walls, and you can pick up cds here, or informational publications about Haile Selassie, or a flyer for all the crazy Reggae shows you didn't know were going on in West Philly."
    },
    {
        "id": 21,
        "text": "Great Caribbean cuisine and good customer service brings us back to this West Philly nstitution everytime. We like the baker Joseph Clarke especially, he is the best and Reynaldo is great. Good food with a Trinidadian vibe and a West Indian irie !!!"
    },
    {
        "id": 22,
        "text": "The portion sizes are great, the Angostura Lemon & Lime Bitters soda is amazing, but the goat curry wasn't my favorite. The meat is plenty tender, but I'm not sure about the seasoning. Still, it's solid portions and they take credit cards with no minimum. I'll experiment with the menu and see if the next dish I try is tastier."
    },
    {
        "id": 23,
        "text": "All I can say is this: my favorite local snack is a chicken patty from Brown Sugar. It's $1.50. Delicious value. Go for it."
    },
    {
        "id": 24,
        "text": "Okay this is my first time trying this bc Gigi & big r sucks lmao! But man oh man the oxtail w the rice & peas along w the cabbage goes hard! Shits so good! The mac n cheese could use some work tho. My moms is much better , but hey everyone can't be like her. I was sick as shit y'all didn't have doubles or buss up shot but it's cool, the oxtails sufficed. Over all good, just try new mac recipes!"
    },
    {
        "id": 25,
        "text": "Best place to go and just point at an item on menu. Just go for it breakfast,lunch,dinner or a snack. I love this place. There deserts are even amazing."
    },
    {
        "id": 26,
        "text": "I've never seen a place have more than 5 reviews and none of them were less than 3 stars. That should speak for itself. This place is fantastic, and I'm lucky to have it in my 'hood, as I hear folks bike from all over town to sate their cravings for awesome West Indian food."
    },
    {
        "id": 27,
        "text": "I frequent Brown Sugar too many times to count. I usually get Cassave Pone, Currants Roll, Roti, Doubles, or Patties. The roti is great and I've had the freshest Roti on a Saturday morning. The doubles bara is a hit or miss sometimes but generally very good.\n\nThe actual restaurant is a bit small with the bakery counter and juice bar taking up much of the space.  There are two booths that you can sit at if you want to eat your food there. Then there are two windows. You order from the window on the right and pay at the window on left.\n\nThe roti prices are really good considering the amount of work that goes into preparing a roti. I highly recommend this place for take out roti or a quick snack on some doubles or patties.\n\nOh and they have a Mauby and Sorrel fountain.\n\nCall ahead to order on busy days!"
    },
    {
        "id": 28,
        "text": "Well established Trini spot on 52nd & Chancellor... half-way between the El and Malcolm X Park.\n\nThe food is solid and consistent. I usually stick to the oxtails or curry goat & doubles, but I've also had their snapper, jerk & various roti's as well. Everything is decent.\n\nPortions vs. price vs. quality make this place a win-win-win situation."
    },
    {
        "id": 29,
        "text": "Came here with a huge group of friends today for lunch. It's quite a walk from where we were, but it was well worth it :)\n\nThe place itself is fairly small, and so it was quite the effort for the 10+ of us to fit in the only two tables there. Service there was fast and no nonsense, but it is really the food that makes this place.\n\nI ordered the oxtail platter (small), which was a sizable portion for a greater price. The oxtail was delicious--flavorful and juicy. I only wished that they could have given more, especially because the bones were so large.\n\nI didn't get to order a smoothie, but I'm sure to try one next time!"
    },
    {
        "id": 30,
        "text": "shopping 52nd street??\nstop in for (soya) Roti and a cold Ting!\ndelicious, inexpensive & quick - portions are large enough to share, or save half for a snack later on."
    },
    {
        "id": 31,
        "text": "Delicious goat roti! Would prefer the goat to not have the bone in it though. Im coming back to this spot though in the near future!"
    },
    {
        "id": 32,
        "text": "The curry goat is the business. I like the veggie dishes but have not ordered in years. The cakes are great."
    },
    {
        "id": 33,
        "text": "I got takeout from this spot after some friends and I decided a night in was most appropriate. I hadn't had a curry goat roti in a while, so I was excited when given he recommendation that they sold rotis. It was ok at best, and the roti was a little doughy- is that a word?  I will admit that I am totally biased and live someplace with a billion delicious Caribbean takeout spots."
    },
    {
        "id": 34,
        "text": "I've been coming to Brown Sugar for years for their tasty and inexpensive rotis, veggie platters and cakes.  There is almost always two vegetarian proteins offered for the platters, one is typically soya chunks (which are not my preference) as well as burger, soya chicken or a tasty victual called \"dinner roll\".  In addition they have a rotating assortment of sides such as bean stews, steamed veg, cabbage, spinach etc..  Some meat and fish items are available as well.  I recommend asking what's available on the day you visit and selecting what sounds good.  \n\nThis is definitely more of a takeout place but there are a few tables where you can eat, listen to some Reggae or Soca, and soak up the nice Trini Rasta vibes."
    },
    {
        "id": 35,
        "text": "I've had their soya and potato rotis, and all I can say is that they're just so good! The roti wrap is chewy and the dough is a little flaky, just the way I like it. The potato filling is a bit on the salty side, but it balances out well with the curry and onion flavoring. It comes piping hot and is extremely filling--definitely worth the money. \n\nThe roti can be a bit messy to eat, so be prepared to dig in with a fork and knife. Overall a wonderful food experience from another hole-in-the-wall place that shouldn't be so easily overlooked."
    },
    {
        "id": 36,
        "text": "Hands down, this is the best Trini food you'll find in Philly! Service is excellent and the prices are unbelievable! You won't believe the portions!! They have a few booths to sit but it's a better take out option in my opinion. They serve all the Trini staples and have a new special almost daily! They also make fresh juices and baked goods. You will not be disappointed! How am I the first person to be reviewing them?"
    },
    {
        "id": 37,
        "text": "Best snacks and smoothies in Philly! Check out my full review!\n\nhttp://goodyummyeats.wordpress.com/2013/08/27/brown-sugar-best-snacks-and-smoothies-in-philly/"
    },
    {
        "id": 38,
        "text": "Had the oxtails, rice & peas, and cabbage. Overall, food was very good. However, I feel like I was skimped on the oxtails. As per my photo, for a large platter, I've gotten more oxtails at every other Jamaican spot I've ordered from. I'm used to an oxtail platter basically overflowing with juices and meat so much that I have a slight regret of greed, and feeling like I probably didn't need that much food. But when I opened the platter from here I was kinda disappointed. \n\n*Ok, I'll be honest, I started eating one oxtail on the bottom left of the plate, as you can see, before I took the pic. But still, I feel it's obvious there wasn't that much on the plate."
    },
    {
        "id": 39,
        "text": "The Good: Delicious food! Piping hot, delicious roti filed with fall-off-the-bone chicken and curried potatoes. Their patties are perfectly palm-sized pastries stuffed with meat, sort of like a South American hot pocket, only they actually taste good. Bakery items tasted fresh and weren't too sweet; I sampled the currant roll, coconut roll, and casava cake and all three were excellent.\n\nThe Bad: The chicken roti has bones -- chomp at your own risk. And don't plan on dining in, because they only have as many tables as two-face has faces.\n\nThe Ugly: Their smoothies are named after diseases they are intended to cure. You will find this either uniquely cute or strangely off-putting... Menstrual Cramp Smoothie, anyone?\n\nUltimately, a fantastic meal that will fill you up without making you feel like you just ingested a cinderblock! Totally worth trekking through the rain from Penn's campus to go. I'll definitely be back to try their breakfast items and smoothies."
    },
    {
        "id": 40,
        "text": "Another awesome hole-in-the-wall gem in West Philly.  Come with your pocket changes and an empty stomach and you will leave very satisfied.   The salt fish sandwich and chickpea sandwich were amazing!  I will have to come back for ox-tail.  The service is a bite slow,  but i think we just need to relax a bit."
    },
    {
        "id": 41,
        "text": "Some of the best grub on this planet! Seriously! Chunk Roti with some hot sauce. Some roots drink, maybe a bedroom bully! Some Mac n' Cheese. Super friendly n' quick!"
    },
    {
        "id": 42,
        "text": "I love Brown Sugar because the food is DELICIOUS! You get a good amount of food for the price and everything is prepared quickly.  Ive been eating here for about four years and 98% of the the time I order Oxtails, rice & beans, cabbage and mac & cheese. (I always get a ginger based drink from the fridge also.) The oxtails are succulent and their mac & cheese is very good!  I've tried a couple of other Jamaican restaurants and none even come close to Brown Sugar Bakery.  My first time in ever I got a slice of vegan cake which was the most moist delicious cake EVER.  The frosting was creamy and thick.  My only wish is that they had more space for seating because they are pretty small ohhhh and bring back that delicious vegan cake!"
    },
    {
        "id": 43,
        "text": "My absolute favorite place since I moved to the city. My jaw hit the floor when I saw they had doubles, and then again when I tasted how perfect they are! & Their oxtail is ON POINT! I don't have anything negative to say, this place is a true gem and the employees are so friendly. Their food brings back so many happy memories and I always leave with a smile on my face. I'd give 6 stars if I could"
    },
    {
        "id": 44,
        "text": "Great Trinidadian food. I used to go here for years when I lived down the road. Found them on Postmates and jumped at the chance to order some food. I only wish that they updated their Postmates menu because unless you've been here before in person, you're missing some food selections, like side orders and drink options. Go down there to 52nd Street, half a block from Walnut Street, and check out their bake goods and the juice bar is lit too.\n\nUpdated: Postmates is a terrible service, they complete their orders like 30% of the time. I think you guys should try UberEats for your restaurant's deliveries instead."
    },
    {
        "id": 45,
        "text": "Had goat with rice and peas and pumpkin as well as a roti with beef and potatoes. Everything was absolutely delicious. Surprisingly not very greasy. A myriad of different flavors with an excellent level of spiciness to the goat and beef but with a rather sweet taste to the potatoes and pumpkin. Great value for your money. Lots of great drink options (that I did not try unfortunately as I was too full from my main meal, and I got a \"mini platter\" mind you). Goat was excellent with the bones in and even with marrow in some of the bones which was delicious. \n\nNot much seating space. No knives and only plastic utensils which make eating some of the larger bits of meat ungainly. \n\nFound a new #1 place off the beaten path in philly for sure."
    },
    {
        "id": 46,
        "text": "Dear Always in search of Great Food,\n\nGEEZ!!!  Where were you all my life (in the U.S)? This is coming from a thoroughbred Trini and foodie.  Peeps. I AM BEGGING YOU TO EAT THIS! Brown Sugar Cafe, you are on de money, SUGAR!  Where do I start?  \n\nHere is what I ate; Doubles, Goat Roti, Currants Roll, Coconut Roll and Cassava Pone.  Remarks::) ;) ;) ;) : )! Your tastebuds will thank you with each bite.  Excellent! Highly Recommended!  I will be darkening the door of this place every chance I get (and I live in Connecticut).  \n\nSincerely,\nNo Excuses, Get There Fast! - RUN!"
    },
    {
        "id": 47,
        "text": "We tried some rotis from Brown Sugar.\n\nThe roti wrap itself was flaky & chewy.\n\nGoat curry roti: Goat was tender, and the sauce was flavourful. I wish it came with pumpkin or something less starchy than potato.\n\nChanna & potato roti: Unfortunately, there was not enough channa & it was mostly potato. Roti was soft & tasty but there was too much potato. It was a potato overload for this meal.\n\nService was fine.\n\n3+ stars"
    },
    {
        "id": 48,
        "text": "l ordered a curry goat roti and chicken patty from Uber eats on Tuesday May 5. The food arrived within the promised time frame however the meal was below standards. Coming from NYC where l can find a curry goat roti on any corner l expected so much more. The meat was not fresh (pre heated a couple of times), dry with no gravy. No evidence of chick peas was used. The potatoes where placed on the bottom, stale curry goat on top. To add insult to my order a vegetable patty was sent as oppose to chicken. l am willing to spend 20 dollars on a 6 dollar order but it must be worth it. Unfortunately this was not. Do better!"
    },
    {
        "id": 49,
        "text": "Love love love this place !!! I always order soy chunks with rice & greens ! Hot damn it's so good ! It has just the right amazing of spice & flavors bursting into your mouth! It's so filling and their portion sizes can truly feed two even with the small platter. \n\nMy rating below : Best out of 5...5 being the best! \n\nVegetarian/ Vegan Food options: 3\nParking availability: 2\nBusiness Energy Cleanliness : 4\nBathrooms: unknown\nStaff friendliness : 4\nSeating Space: unknown\nService: 5 \n\nI've never been inside the actual business because I ask my partner to pick up on his way home from work at least twice a week. I'm truly surprised it's taken me this long write a review on them. \n\nThis is definitely a hidden gem in west philly & I'm so glad they have vegan options for me & the the food is oh so yummy."
    },
    {
        "id": 50,
        "text": "Friendliness staff.  I got two large oxtail platters and a small curry goat platter. It's fresh and when they are out they are out. Next time I go I will have a fresh juice. They are very generous with the portions. As you can see in my picture."
    },
    {
        "id": 51,
        "text": "The food here is too notch, but the service can be slow at times, but not enough to deter a visit.  Their roti is there real deal, specially the goat roti.  They also make a good Curry chicken dish."
    },
    {
        "id": 52,
        "text": "The best place in Philly for roti, doubles, and chicken curry. They have great breads and healthy smoothies/shakes. The eat-in section is small so I usually take my food to go."
    },
    {
        "id": 53,
        "text": "Very very rude group of people. If you don't sound or look Caribbean they will ignore u most time or depending on the day u MIGHT get a what you want. There used to be a nice young guy but I can never catch him. My father is Trini and has been bringing me here since I was child. For the past 2 years it's sad to watch its decline. They rotate cooks in and out so the food is hit or miss. They never have any baked goods. In fact, the entire \"bakery\" area is deplorable and empty. I go specifically for Roti because this is the only place I know in philly that makes them well enough to eat. It's hard to bring myself to come here with such bad service!"
    },
    {
        "id": 54,
        "text": "A great variety of vegan options (both lunch and bakery items). Everything was delicious and they were super friendly."
    },
    {
        "id": 55,
        "text": "Good place to go for traditional West Indian pastries and decent rotis. Staff isn't overly friendly, but not particularly rude either, which is good enough. Saturdays they have shrimp rotis - really good, large and full of shrimp. I recommend calling ahead and making sure they're open. We recently visited at 1pm on a Sunday and the place was closed. Very frustrating because we made a 25 min drive there, but there may be covid hours we were not aware of."
    },
    {
        "id": 56,
        "text": "You want to try a Roti. I promise. Spicy potatoes and chickpeas, with your choice of protein, wrapped up in a delicious \"skin\" that's flaky and flavorful. Better than a flour tortilla, by far. \n\nI generally get either goat roti, or \"soya\" (imitation meat) roti. The goat roti HAS BONES IN IT, so be forewarned. That being said, it so very, very good. Marrowy and rich and spicy.\n\nThe \"soya\" is, quite simply the best imitation meat I've ever eaten. It comes in a number of varieties, all good. For the roti, i'd go with the chunks. However,  the \"chicken\" drumstick is jaw-droppingly good. My wife and I debated for a good 4-5 bites over whether it was meat or not. \n\nAlso, they sell tiny bottles of various Carribean wine drinks in their refrigerator case that I am too scarred to try, because of being lame.\n\nPatronize this establishment, or I will do it for you!"
    },
    {
        "id": 57,
        "text": "Fast friendly service. My only complaint is the confusion when ordering for a first-timer. It's a little confusing because you order at one window and pay at another, and if you want a beef patty,  cocoa bread, or any other baked item then you have to order at the front of the store.  Other than that, the food was delicious and affordable."
    },
    {
        "id": 58,
        "text": "Trinidad is an island off of South America in the Caribbean Sea with a diverse and fascinating cuisine.  Its best restaurant and bakery in Philadelphia is located on the 52nd Street shopping area of West Philadelphia.  This establishment called Brown Sugar Café & Bakery is the real deal.\n\nThere are so many choices here representing all the highlights of Trinidadian culinary traditions.  On a recent visit here I started with the famous Doubles and added on to that a Trinidadian beef patty and the well-known street food Pholourie served with tamarind chutney. All were excellent but the beef patty was exceptional.  I could have eaten a dozen of these.  For dessert I thoroughly enjoyed a moist and flavorful Guava Pone and a wonderful Currant Roll.\n\nThe staff here were friendly and helpful ... and I can't think of anything not to like about the fine Trinidadian eatery called Brown Sugar."
    },
    {
        "id": 59,
        "text": "This place has amazing patties!  Also, their pineapple upside down cake is my dresset go-to on any night!"
    },
    {
        "id": 60,
        "text": "I'm so in love being able to get the Trinny taste that I crave. I wish that they sold soubles and shark on more days but its worth the wait."
    },
    {
        "id": 61,
        "text": "Vegan options are on point! We ordered the soya platter, aloo pie and two different veggie patties. Everything was exceptional, I'll definitely be back."
    },
    {
        "id": 62,
        "text": "I finally found an authentic Trinidadian Roti place in Philly. \n\nAfter trying Roti for the first time in Toronto, I've been desperately craving it again. However, after asking my friends who are from the area-- no one seemed to know where I could satisfy this craving. \n\nAfter doing some research.... I found Brown Sugar, opened up the Yelp app and decided to give it a try. I'm very happy I did! \n\nI ordered the Curry Chicken Roti to-go. I watched as the lady behind the counter meticulously made my Roti. First the wrap, then the filling, followed by the Curry Chicken. \nAll for $7.50! \n\nIt was immaculately clean and the staff was friendly. Would definitely recommend you try it out!"
    },
    {
        "id": 63,
        "text": "Growing up in brooklyn, I've been eating roti most of my life. Use to go to this place a couple years back and the roti was ok. Went about a week ago, and they had no roti skins, so I settled for a small dinner. No peas and rice, so I got veggie, and no stew beef, so I got stew chicken. Rice was ok, chicken was rubbery, and the cabbage was pretty good. When I get a shrimp roti from there I'll update, but best shrimp roti is in BK."
    },
    {
        "id": 64,
        "text": "please taste your food or have someone to sample it before SELLING IT to the PUBLIC! \n\nin my experiences with brown sugar over the years, it has been quite hit OR miss!\n\nPicked up food from here a couple of weeks ago for the family and it was OK! just OK! I was very excited because they offer vegan desserts. And the cake really shocked us, it was quite moist and flavorful, more so than our dinner! we wished we had gotten another slice or two; but quite THANKFUL 4 what we had!\n\nOk, fast forward to today: the food was quite blah! tried the vegan carrot cake which tasted like someone poured their perfume in it. the plantain were not ripe and more like chips. the soya roti, well, it just  added disappointment to ourselves after traveling to 3 different festivals that weren't FESTIVE AT ALL with three hungry small children looking and hoping for good food and vibrations.... \n\npeace & libations"
    },
    {
        "id": 65,
        "text": "Eh...when I have a hankering for Caribbean, it'll do. But...it's definitely not the best, nor worst I've had."
    },
    {
        "id": 66,
        "text": "No frills really delicious Trini food that makes me miss my grandma every time. Love the goat roti and the curry chicken platter. The doubles are okay but I prefer their platter and roti dishes more. Make sure to get the pumpkin as a side so good! Good portion sizes too!"
    }
]