[
    {
        "id": 1,
        "text": "Stopped by this cute little cafe after I found it on Yelp. I was near the area and needed a quick place to relax before an event. The space is long and narrow but ample seating and bright and airy. The overall aesthetic is very pleasing. The pastry case by the late afternoon wasn't super filled but there were enough options to choose from like the lemon tarte which was delicious! The coffee menu itself is rather small. I ordered a mocha which was definitely a more bitter chocolate which I didn't mind, but if you're used to sweet like Starbucks this may be a pass for you. The people working here were nice. The prices were a tad expensive for coffee and pastries especially when the coffee isn't super elaborate. I also wish they would use real cups. They might have these but they didn't bother to ask if my order was to go or not. They offer bread for purchase as well. The staff was nice, the bathrooms clean. Overall a pretty great cafe in Philly perfect for an afternoon pick me up."
    },
    {
        "id": 2,
        "text": "Best Madeline I've ever had!!! Great decor as well. Got to meet the owner Bastian and he was fantastic as well!"
    },
    {
        "id": 3,
        "text": "Great staff and delicious pastries! This really is a professional bakery, with all sorts of French delicacies... you name it, they have it. The owner and staff are super friendly and helpful. Its a cool place to stop by any time of the day to meet up with friends, study, grab a quick snack or some good coffee. Try the quiche, highly recommended!"
    },
    {
        "id": 4,
        "text": "Adorable, sunny little place with the best pastries! The almond eclairs were especially great, and paired perfectly with the deliciously thick and unsweetened hot chocolate."
    },
    {
        "id": 5,
        "text": "Yo the croissants here are banging. Probably the best in Philly. Great coffee and solid spot to get some work done. They also accept credit card, and it's such a clean and modern looking bakery. Everyone here is so friendly. A real gem right here."
    },
    {
        "id": 6,
        "text": "I'm from out of town and stumbled upon this lovely France bakery. What a treat! It is exactly what it states it is. French. And a bakery. I went two days in a row for a slice of their delicious orange olive oil cake and a pot of English Breakfast tea. I loved the brand of tea so much ( Kusmi from Paris) that I bought a box when I saw it in a nearby shop. The atmosphere is relaxing and a delightful respite from a busy day. Oh, and the employees are helpful and so nice. Most highly recommended."
    },
    {
        "id": 7,
        "text": "We went to this cute little bakery & cafe serving French pastries, sandwiches, crepes & coffee for breakfast. We got there quite early in the morning, there were few people who were getting things to go, instead of dining in, which gave us all the seating options. They had some tables right at the entrance, and then more seating in the back.\n\nThe cafe is located on the corner lot, so it had lots of windows on the front and the side, bringing in bright natural light.\n\nRight at the entrance, they had some bread and baked goods, such as croissant, apple turnover, and raisin roll. On the side, they had lots of sweets such as macarons, tartlet, and éclairs. They also had some quiche as well. Since we were there super early, the pasty chef was still working on some items.\n\nWe started off with a couple of pastries and cups of coffee. I got a small Latte, and it was really small... They ground coffee beans at the time of order, which is great. The coffee was quite good, I wish if the mug was a bit bigger, even though I did order small. My hubby ordered a Cappuccino, they didn't have any choice of size, it came in a mug that is similar to the latte mug, but a bit shorter and wider. They were tasty coffees, again, just really small...\n\nWe had Sugared Chouquette, Napoleon, French Jam Crêpe and Paris Philadelphia. They were all very tasty, high quality and oh-so-satisfying. It was a fun and tasty visit. The service was ok, not overly friendly but efficient. Their sweets were elegant and sophisticated, we enjoyed them all."
    },
    {
        "id": 8,
        "text": "I have been looking for a good French Napoleon for a long time after Wegmans discontinued to bake Napoleon.  When I saw my FB showing a photo of Napoleon from J'aime, I can't wait to give it a try. \n\nWe went J'aime on Christmas Eve but they ran out of Napoleon so we ordered Chouquette which is very surprising good. The cream of Chouquette is very light without heavy sweet and last time I had such silky smooth cream with good/right puff is from beard papa(Japanese bakery).  \n\nSo, I decided to come back today in order to get in line for Napoleon. Like Chouquette, Napoleon also has a very velvet moisture cream and because J'aime doesn't glazed sugar or fondant on the top layer, it won't too sweet which I can even eat a whole without coffee or tea. We also ordered Quiché and I like pie crust of Quiché at J'aime is thinner than Le Pain Quotidien."
    },
    {
        "id": 9,
        "text": "The croissant was so delicious that it almost redefined croissant. The chocolate tart was delicious; crispy crust and velvety chocolate. Excellent service. Recommended greatly."
    },
    {
        "id": 10,
        "text": "Execellent bakery. We had cold coffee, fruit tarte, napoleon, and rasin roll. All were fanatasitic!!\n\nKind employer is another plus+"
    },
    {
        "id": 11,
        "text": "One of my favorite bakeries! The service is great and the pasteries/drinks are the best!! there's a lot of pastries to choose from.\n\nAlso, the aesthetics is to die for. The bakery is super cute and minimal. It's the perfect place to stay and hang out!"
    },
    {
        "id": 12,
        "text": "I love this real French bakery where everything is baked fresh from the day...Being a French native it is a little bit of my childhood just there! Especially the orange tart that my Mum was doing and the raisins rools!"
    },
    {
        "id": 13,
        "text": "Wonderful! I pass J'aime on my walk to the train each morning and had been eyeing the place up during construction. I finally made it in last week for a latte and some sweet treats - I will definitely be back! J'aime fits into the neighborhood perfectly and serves delicious baked goods for those days when you just need to satisfy your sweet tooth. Looking forward to more visits!"
    },
    {
        "id": 14,
        "text": "Yum! Enjoyed iced herbal tea and apple tart the other day while wondering around the city. I felt fortunate to find this little oasis on 12 street. My tea was both delicious and refreshing. The apple tart was a French work of art....tender juicy apples encapsulated in a light pastry, not too sweet, not too tart...perfect! I enjoyed relaxing at my table open to the outdoor elements and watching people walk on by. The bakery has huge windows which were open at this time of year and made one feel as though they were outside, but slightly protected from the sun. The decor of white and grey tones created a sophisticated backdrop where  the pastries and other delectable goodies take center stage. The staff behind the counter were authentic French, warm and friendly. They even provided me with a sample of tea to help me choose among the options. \n\nYes, it's a bit pricey. However, the food, charm and patisserie ambiance made me anxious for a return visit. Be sure to navigate your way to J'aime French Bakery in the near future. I highly recommend it. Bon appetit!"
    },
    {
        "id": 15,
        "text": "I am on a quest to find the best croissant in Philadelphia and so far J'aime's croissant is the best I had. All their patisseries are also excellent, my favorite being the \"Paris-Philadelphia\""
    },
    {
        "id": 16,
        "text": "Coffee was pretty standard. There is the usual offering of drinks and some French bakeries. The inside of the shop is very nice and clean, but there is no Wi-Fi which is a bummer for anyone trying to work. There are some French pastries and baked goods, but they are all a little expensive."
    },
    {
        "id": 17,
        "text": "Like stepping into Paris! I love (I mean LOVE) a croissant and these are hands-down the best in the city, maybe in America. The staff are French and give you a bonjour in the morning. Plus draft La Columb... this is an absolute jem. J'aime? Non. J'adore!"
    },
    {
        "id": 18,
        "text": "I am so happy J'aime has opened near us. It is by far the best pastries I've had in the states. It literally tastes as good as a chocolate croissant from France. It's beyond delicious and the place is so well decorated- the staff friendly- and the smells... out of this world. They are also super friendly and brought a little water bowl for my pup while we were sitting outside. LOVE. I can't say enough good things. Try them :)"
    },
    {
        "id": 19,
        "text": "While a midday break and walking around I came upon this new French bakery... literally just opened within 9 days of my discovery.\n\nSaw two coffee taps, inquired and learned it was to their on site cold brew.  One was American with milk, my go to.  The other espresso based. Upon the explanation and reco I had the suggested mix.  Best cold brew I've had.\n\nSince I'm a French bakery, how could I leave without bringing home sweets.  Selected two fruit tarts-- orange and pear.  The crust was light, flakey and delicate.\nWonderful taste and brought a smile to my honey.\n\nFinally found a go to bakery for special treats for the weekends."
    },
    {
        "id": 20,
        "text": "I found this minimalist comforting cafe just a few blocks from my hotel when I had to stop by from NYC. I called in to check if I could come by to take some photos of the interior and food to write about in my blog. Bastien O, the head chef/baker from France, picked up my phone call and gave me great advice on ideas of when's best to come and invited me over. He met me personally and told me of his whole routine from coming in as early as 4:30AM to start baking. Not sure how he makes everything seem so effortless, but his story is really impressive and work is magical.\n\nFor my brunch, I ordered the mushroom/spinach quiche that was accompanied with a side salad. As a sucker for citrus sweets, I ordered the orange tart in the display: the tantalizing orange tart was brushed with a syrup and crusted with sugar crystals. And because I was so sleep deprived, one nonfat latte. Bastien, one of the humblest chefs I've ever met, even came out to speak with me about his background and passion in baking and customer service.\n\nLoved the interior (the back also serves as a great spot for some to work) the attentive staff, cleanliness, quirky restroom with facts about toilets along the wall. Although I've left, part of my heart is still longing for that orange tart."
    },
    {
        "id": 21,
        "text": "Perfect place for a cup of tea or coffee with a friend to catch up.\nThe service was nice and friendly and their baked goods were on point.\nI would come back here again!"
    },
    {
        "id": 22,
        "text": "Love this new bakery! Light, flakey croissants. Delicious pastries. Friendly staff. Beautiful decor. And La Colombe pure black on draft. It's a great addition to the neighborhood!!"
    },
    {
        "id": 23,
        "text": "My new favorite spot! You can smell the fresh baked pastries as you walk by. When you walk in you are greeted by friendly staff who are eager to serve you. \n\nYou would not believe the amount of pastries to choose from. Starting with classic croissants and crepes all the way to specialty items I had never seen before! The server explained to me that everything is homemade and baked fresh daily. I tried the napoleon, Paris Philadelphia and lemon tart! Each item was beyond delicious and the customer service was outstanding! \n\nI also fell in love with the design. You can tell the owner spent a lot of time making it the perfect twist between modern and french without being too overwhelming. \n\nI no longer can walk by without stopping in and grabbing a sweet treat. Definitely will be visiting more in the future!"
    },
    {
        "id": 24,
        "text": "I came all the way from NYC to Philly just for J'aime and it was definitely worth it! My friend and I shared the special quiche, chocolate brioche, merveilleux (speculoos, cream, meringue goodness), and a croissant. Ah, AND draft lattes. We got a box to bring the leftovers back with us but ended up returning the box after polishing everything off in one sitting. The staff is SUPER friendly and attentive and the ambiance is bright, fresh, and cheerful. Would highly recommend to anyone coming to Philly for the first or 100th time."
    },
    {
        "id": 25,
        "text": "I am obsessed with J'aime. \n\nIt's the closest coffee shop to my apartment and I couldn't be more thankful. It's interior is the most aesthetically pleasing, bright place to sit and enjoy your coffee and get some work done. There are tons of tables to sit at too, which always seems to be an issue when looking for a place to get work done in the city. \n\nTheir coffee is amazing & they have a decent menu for different types you can get. They also have a few nondairy creamer options! My girlfriend raves about their pastries and says that she absolutely cannot her enough. She gets a chocolate croissant weekly!  \n\nIt's tough to find cute, cozy coffee shops in Philly but I promise you won't be disappointed. In nice weather there's outdoor seating out front and when there isn't, there's huge windows to people watch out of! Stop by here, I promise you'll love it."
    },
    {
        "id": 26,
        "text": "As French people we can say that this is the best place for French patisserie, bread, and other kind of vienoiseries!!!\nPerfect employees very friendly and respectful !!\nThanks a lot"
    },
    {
        "id": 27,
        "text": "Fresh French pastries and juice!\nVisited here for brunch this Spring\nGot orange mango juice and puff pastry"
    },
    {
        "id": 28,
        "text": "Yummy well-balanced (not too sweet) pastries. They have savory quiche as well. It's a pretty  open clean spacious comfortable locale to enjoy a good tasting laColumbe smooth caffeine & a bite of exquisitely made pastry. The Paris eclair is so good! Comfy seating. Pleasant informative counter help. Cool music. A taste of France in Philly: C'est tres bien!"
    },
    {
        "id": 29,
        "text": "Best croissant in Philly hands down. Excellent coffee and pastries. A nice slice of Europe here in Center City. check it out."
    },
    {
        "id": 30,
        "text": "Very quaint, peaceful, and bright environment perfect for morning or afternoon coffee. It was not too busy when we went around 11. We tried the sugared choquette was delicious (filled with Nutella cream that was extremely light). Anastasia tea that my friend had smelled so aromatic, and cappuccino  as also strong"
    },
    {
        "id": 31,
        "text": "This place is a lovely spot to have a latte and get some work done peacefully. Will be back again the food was fantastic I recommend the quiche Lorraine!"
    },
    {
        "id": 32,
        "text": "I was very excited to see that this place was opening in the neighborhood.  It's clean, beautiful, and unique.  I went there for the first time on Saturday at opening (8 a.m.).  There were 4 people behind the counter.  I wanted to treat my companion - but the service was very disorganized - each server was switching back and forth as to which one would ring up the bill.  There cream for the coffee was handed to my friend from a carton behind the counter.  There was no cutlery for the pastries.  HOWEVER - - - -I'm definitely going to give them a break, because I really WANT THIS PLACE TO SUCCEED!  Get the service act together - - the pastries and coffee are MAGNIFIQUE!"
    },
    {
        "id": 33,
        "text": "Went in to this cute little coffee shop for a quick bite and fell in love with their pastries! The croissant was so fresh and so flaky, and the napoleon has just the perfect sweetness to go with a cup of coffee or tea. Love love love!"
    },
    {
        "id": 34,
        "text": "What seems like a typical coffee shop is a transporting gem to the streets of Marseilles. The aromas of croissants, cafè, and bread warms the heart, the service only enhances the experience"
    },
    {
        "id": 35,
        "text": "Love the almond croissant - sooo soft and great tasting almond paste inside. Their mocha is great too - doesn't taste like hot chocolate like some other places. I like to taste the espresso in my mochas. Almond milk and soy offered as dairy alternative"
    },
    {
        "id": 36,
        "text": "Been here twice already and loved it both times. Got a regular croissant the 1st time and was not disappointed! Flaky slightly crunchy golden crust with soft chewy layers inside, just how like it should be. Got the pain au chocolat the 2nd time around and split an eclair with a friend, both of which were also delicious. The vibe in the small-ish cafe was also relaxing and minimalist with the white painted walls, clean decor and high ceilings. Also as an unexpected surprise, they have Whistle Pops for sale as well (nostalgia much?)."
    },
    {
        "id": 37,
        "text": "I was wandering around in the area in the afternoon and wanted a coffee so I walked in this shop! Yet it's such a hidden gem!\nI originally just wanted a coffee ended up getting an éclair with chocolate cream!with a coffee!\nThe pastries they sell look delicious yet very very affordable!\nThey also have quiches and sandwiches for lunch if you are interested!\nIt made my afternoon so pleasant!"
    },
    {
        "id": 38,
        "text": "Such a cute, quiet coffee shop with fresh pastries!\n \nFresh french baguette and wonderful Kusmi tea."
    },
    {
        "id": 39,
        "text": "Looking for a coffee and pastry? Want cheap and sugary? Uh oh, problem. This ain't the place.\n\nHOWEVER. Looking for a genuinely French experience? Light, not overly sweet, not huge globs of fried fat lathered with syrup? Well made espresso drinks in lovely chinaware? Clear, inviting place to just relaaaaax?\n\nWELL THEN, you've come to the right place. J'aime means \"I love\". And there's much to love here. We sampled a croissant, a madeleine, and an apple tart. Croissant flaky and light. Madeleine perfectly textured and subtly flavored. The apple tart was a bit too cool for my tastes - next time I'll ask for it to be warmed. \n\nLight jazz for your ears, light repast for your tumtum and coffee yum for your caffeine craving. Go for it! \n\n(I'd like to claim my pic of the partly eaten pastries and half drunk cap was for artistic effect but ... I was simply too hungry to wait!)\n\nOkay, couldn't leave w/o more. So ... a pic of their espresso (absolutely perfect - not bitter, not sour, just right), another cap and their version of doughnut holes (cream puff without the cream). \n\nAnd the heroes behind the wonder. The main man, Bastien, who dragged a bit of France with him to historic Philly. Barista in charge - Raphael. And Tessa ensuring you get your order with a complimentary smile!"
    },
    {
        "id": 40,
        "text": "This place is amazing. Simple, but lovely interior, and great atmosphere.\n\nPerfect spot for a little pastry indulgence."
    },
    {
        "id": 41,
        "text": "J'aime is a unique and in many ways a special cafe.  It is a place where you can go for some peace and quiet, or enjoy a delicious pastry and excellent beverage of your choice with a friend.  They also serve delicious crepes along with sandwiches and soup which are all excellent.  The staff are friendly and very attentive and the cafe environment is very inviting with a clean, crisp minimalist format.  It is a true French cafe not to be missed."
    },
    {
        "id": 42,
        "text": "I was in Philly for a day and stopped here to rest/for a bite. It is a very aesthetically pleasing place and I found myself ordering way more than I should have. The crepes were a bit too sweet for me but I also ordered this orange zest chia seed cake thing that was very good. Service was friendly and quick. I would totally stop by if in the area again because all of their pastries seemed so yummy."
    },
    {
        "id": 43,
        "text": "Finally!  I love French pâtisseries.  Love love love them and J'aime does not disappoint!  I've been twice, and both times, J'aime has overwhelmed me with the excellent quality of food and service.  First, I tried the croissant.  It's buttery, has that perfect golden crisp outter layer, and the airy and decadent inside that marks an excellent croissant- nothing gummy here!  The next time I stopped in was to pick up a little birthday treat for myself- I chose the sugared chuquette with whipped cream.  It was a delicate cloud of pastry with the perfect whipped cream- on the firmer side, and not too sweet.  I mentioned it was my birthday treat, and the pâtissier asked the counter woman to give me some madeleines on the house.  It made my birthday extra sweet!  It takes a good deal of willpower to not make my way to J'aime every week, but I will be back as often as I can!"
    },
    {
        "id": 44,
        "text": "A quaint little coffee shop with great prices! I loved the Parisian-vibe and the selection of pastries available. There was limited seating, with a couple of chairs outside. In the warmer weather, I will definitely take advantage of that!"
    },
    {
        "id": 45,
        "text": "I came over on Sunday an hour before closing so there're barely anything left on the counter. I got the olive oil orange cake and the chocolate croissant. The Olive oil orange cake is delicious! It's moist with full orange and and a perfect hint of olive oil flavor. The chocolate croissant is just ordinary. I like the flakiness of the croissant, but it lacks the buttery flavor. I'll visit again next time and hope they have more choices to try. I'd love to try their almond croissant and Brioches"
    },
    {
        "id": 46,
        "text": "Omg I LOVE their black iced coffee!! It is the best cold coffee in the city. You need to go here if you love iced coffee. Even if you don't you need to go for their croissants."
    },
    {
        "id": 47,
        "text": "Service was wonderful! Pastries were amazing and coffee was not overly sweet! Definitely coming back here the next time I'm in philly"
    },
    {
        "id": 48,
        "text": "My partner and I frequently stop here while walking around Center City on the weekend. It's a great place to just chill for a bit.. Service is always awesome, and the music played is always fun! If you are sick of the \"other\" chain coffee shops, give this one a try.. you won't be disappointed!"
    },
    {
        "id": 49,
        "text": "Love this place, it reminds me of Paris. I always get the latte with a pastry from here."
    },
    {
        "id": 50,
        "text": "Went in today for the first time and I want to move in.\nFriendliest staff, great coffee and treats.\nCertainly returning."
    },
    {
        "id": 51,
        "text": "Been there twice, and ordered the same thing. Quiche special with a drink and a pastry. Quiche was paired with a handful of spinach, a pinch of chopped tomatoes and drizzled with balsamic. It was fine, no complaints. My return was for that crazy eclair. It was the only reason any of this needed to be duplicated. Their eclairs are phenomenal. Possibly the best I've ever devoured. \n\nWho knew there was a pristine chocolate custard filling that would gush out the sides with each bite. Messy? Yes !!! But I was the happiest customer, trying my best to eat the dessert with some etiquette."
    },
    {
        "id": 52,
        "text": "Spinach and salmon quiche is a morning delight. Orange olive oil cake is amazing. Perfect compliment to a hot cappuccino. Friendly staff in a lovely little spot."
    },
    {
        "id": 53,
        "text": "So far I've been to this friendly cafe twice and both times I've been transported to Paris. When you walk in you are greeted with a Bonjour and allowed to select from their delicious savory and sweet offerings like quiche Lorraine with onions and bacon or their pan au chocolat (our favorites so far). P. And I have gotten both their cappuccinos and regular coffee and both were on point. You're never made to feel rushed as you sit at a table and relax, which feels oh so Parisian. I will definitely be back to try some more of their baked goods, particularly their fruit tart. Also they have freshly baked baguettes and bread for sale, which look just right."
    },
    {
        "id": 54,
        "text": "Croissant flakiness test: A+ ! Finding a reasonably sized (not the size of your head) and flaky as they should be, croissant in Philadelphia isn't easy. This is the second place in Philly that has passed the test. House coffee is excellent as well. \nWould give it 5 stars but find the ambience somewhat sterile."
    },
    {
        "id": 55,
        "text": "This is the closest thing I've eaten to a real almond croissant in France. I loved it. I would recommend the almond pastry again & again. The staff are super sweet, (they have the full French accent too!) and you really do get a taste of France when you're there!"
    },
    {
        "id": 56,
        "text": "Delicious, clean, and friendly.  So happy this bakery opened!  Very personable staff working there and the lunch items and pastries are fresh and taste just like they do in Paris.  :)  Can't beat the La Columbe on draft, either.  A great addition to the neighborhood."
    },
    {
        "id": 57,
        "text": "Great new Bakery & Café. I had the latte with almond milk & crepes with Nutella & bananas. Modern decor, outdoor seating, and overall a good place to get your cafe on !"
    },
    {
        "id": 58,
        "text": "A lovely space, we especially enjoyed sitting at the front with the windowed facade slid open. There are a few tables on the sidewalk, some counter seats, and bistro-size tables all the way back (it's quite a deep space).\n\nEarly afternoon on a Sunday, the pastry cases seemed a little empty; however, I appreciated the variety of the offerings, and the croissant I chose was flakey, buttery, and delicious (I always have to see how the croissants are as a threshold matter!). The mocha was good--could've been a little hotter. The mini meringue that came on the side tasted a bit chalky.\n\nI appreciated the baguettes (French and sour dough) available for sale along the wall and the gender-neutral (single) bathroom in the back."
    },
    {
        "id": 59,
        "text": "I've been on a quest for years to find the most authentic chocolate croissant in the United States. I was spoiled a few years ago in Paris and aside from one bakery in Seattle, no place has come close until...J'aime. We've stopped by in the morning, in the afternoon, and right before closing and have gotten consistently good product. It's especially great because they make the croissants on site. I honestly haven't tried anything else yet, but I know in my heart their other baked goods are just as delicious. This is my go-to place for french pastries."
    },
    {
        "id": 60,
        "text": "I've been meaning to check out this bakery since it opened and am so happy I got to stop by today! The ambiance is pleasant and we were able to snatch a pair of seats in a comfortable booth. I love the modern/minimalist chic look, though I was slightly disappointed that the selection of pastries was a bit minimalistic at the time I came in as well. (Sunday afternoon) I'll have to stop by earlier in the day next time! \n\nNevertheless, I got to try a selection of pastries and definitely think that whoever makes these pastries knows what they're doing. They completely nailed it in the taste and texture department. \n\nFirst, the Paris-Philadelphia - their take on the traditional Paris Brest. Instead of a ring of choux pastry, it is presented in an oblong shape filled with Nutella cream. I was a bit surprised to find that the cream was a bit more on the \"buttercreamy\" side, but the texture and flavors still worked. The toasted almond slivers on top added a nice touch!\n\nThe napoleon (what I grew up knowing as a mille-feuille) was right on in terms of texture and flavor. The puff pastry had the right level of crisp and flakiness, while the pastry cream was perfect. However, the version I bought was a bit too minimalist, especially when factoring in the price. It only consisted of 2 puff pastry layers instead of 3, and only had 1 layer of cream. It also did not come with any toppings. I also noticed that my piece was smaller compared to ones other reviewers posted in their photos on this site, and I don't think I paid a lower price for it. \n\nI also got to try the blueberry galette, which was like a mini blueberry pie. It may have looked simple, but had a nice touch of citrus flavoring in its filling! They were kind enough to warm it up for 30 seconds for us. \n\nThe staff was friendly and pleasant. Not convinced that they are knowledgeable of the products sold, but they definitely showed effort! My favorite thing about this place is that they serve Kusmi Tea, and I love the small piece of meringue they had included with my tea!"
    },
    {
        "id": 61,
        "text": "I've eaten many pastries in Paris and I think that the treats at J'aime are as good as the best that you can find there. J'aime is my goto patisserie in Philly. The staff is super friendly. It's also a fantastic place to hang and get your work done."
    },
    {
        "id": 62,
        "text": "Only came once but fully intend on coming again in the future. The ambience of the place really gets me - white everything, plenty of natural lighting, a lot of seating, and then the smells of a bakery permeating every corner. It brings you certain places.\n\nAs I cannot drink any caffeine, I opted to get a pastry. Did my research beforehand and got the orange olive oil cake and man did that live up to expectations. I wasn't really sure of what to expect because orange and olive oil are not flavors I'd put in a cake but they go so well together! It was maybe a touch too sweet for me but I also prefer things on the less sweet side. Texture was crunchy and soft at the same time (I know some people hate the word but it was hecka moist too) - there's little surprises in each bite when you crunch down. The slice was also huge so I felt like it was money well spent.\n\nI spent my time here reading (quiet enough that you won't get too distracted) and then catching up with a friend (so loud enough that you won't feel bad holding a conversation). \n\nOverall, great cute little shop. Visit if you can!"
    },
    {
        "id": 63,
        "text": "I'm a fan of this place, but I think I had unrealistic expectations after reading the reviews. The cappuccino is great. It was smooth, hit the spot, and powered me through an work session. The croissants were promised to be a bit of France here in Philadelphia. They were fantastic, crispy, subtle, with the perfect amount of chocolate. I think the key aspect for me was the customer service. They were incredible and gave me a Jefferson discount, even when I didn't have any ID on me, but came straight from work. By the way, Jefferson affiliates gets a discount! No reason not to come here!"
    },
    {
        "id": 64,
        "text": "Cute little coffee shop with a nice atmosphere for studying and they have free WiFi!  I only had hot tea which was kind of expensive and the food looked good but I didn't have any because I had just eaten before I got there. Would definitely come back!"
    },
    {
        "id": 65,
        "text": "J'aime is a charming bakery that offers delicious french pastries and snacks. The interior is bright and clean and there is outdoor seating for when the days are beautiful. \n\nI ordered a pain au chocolate, a cream puff, and a spinach and mushroom quiche as well as iced coffee (they offer la colombe, btw). The owner (I assumed, from the french accent), threw in a free croissant for my friend and I which was pleasant surprise. Everything was above my expectations and delicious. \n\nMy only gripe is the hours are a bit short-- but otherwise, I would highly recommend a visit."
    },
    {
        "id": 66,
        "text": "I've stopped in here a number of times on cold mornings before work for a pastry treat and have never been disappointed. I've been desperately craving French pastries since I visited Paris and this cafe really does the trick! Their almond and chocolate croissants are light and not too sweet (and they're often pretty large, which is always nice!). I recently picked up a slice of orange olive oil cake and am obsessed - I can't wait until they have it there again! I wasn't sure what to expect but the poppy seeds were a pleasant surprise and the orange was very present throughout. I always look forward to stopping in when I'm nearby!"
    },
    {
        "id": 67,
        "text": "Cute place, I really like the European types of dessert that they have. \nA very good place to go to hang out with friends and pastries to share."
    },
    {
        "id": 68,
        "text": "I really love the concept of this bakery! Very minimalist and modern decor. The pastries were delicious and high quality. The beverage choices were unique despite being your average coffee and tea options. \n\nI had the Paris Philadelphia which was a delicious crunchy pastry with a sort of hazelnut cream filling. The almond croissant was exquisite. There was a creamy and fragrant interior that made the croissant have a special taste I could not compare to any typical almond croissant I've had before. Overall, all the pastries, breads and baked goods were clearly made fresh and of quality touch. \n\nTheir tea choices are interesting. The basics like earl grey and hibiscus have hints of other flavors too, like lemon or mint! There's a little sign on the counter that describes all the flavors. Although they don't have iced tea as an option, I got a hot tea with ice on the side. The employees even gave instruction on the optimal time to seep the tea bags! It's these little details that made my visit to J'aime enjoyable. \n\nThe seating space was rather narrow in the back, but there was a range of window seating (square tables), small booth seatings (seats 2 people), and little tables in the back that had a long booth stretch back with chairs paired up with the booth seating. \n\nI loved the minimalistic touches. White marble tables, modernistic lighting, black/white wall art and simple little French-inspired paintings. Green plants livened up the space too! \n\nOverall, my entire experience at J'aime was a perfect coffee date. My only recommendation is that they play more music that fits the theme."
    },
    {
        "id": 69,
        "text": "Stopped in yesterday on their opening day. They've done a very nice job with the place and they've clearly made a major financial investment in it. It is bright and cheerful, with neutral tones of marble, off white paint and grey accents. The tables are nice, they have a mix of seating, including white painted metal industrial Tolix style chairs, a couple booth style seats and a longer bench running along one wall. The cafe is meticulously clean and the display cases and counter are well lit. They have modern payments methods available, including Apple Pay. The view of center city street life from the cafe is lively with many locals walking to and fro, making the front seats pleasant in this regard.  The pastries are beautiful and delicious. I had a raisin roll, which was custardy and addictive. There were apple turnovers in the display case that looked like pieces of art, as did all the other pastries. Also had a cappuccino, which was nice. All in all, for opening day, I think they hit a home run. It's so difficult starting a new cafe and it is inevitable that there will be kinks to work out, but these weren't apparent. These guys thought of nearly everything, and the staff was very friendly. I was impressed by how seamless the operation seemed, regardless of it being day one - so hats off to what must have been incredibly meticulous planning, training and organization. All said, nice new addition to the neighborhood; I wish them well and will be interested to see how things evolve there as the business matures and as locals begin to discover the new cafe. I know I'll stop by when I'm in the mood for a delicious pastry."
    },
    {
        "id": 70,
        "text": "Looking at te reviews my expectations were pretty high but I have to say that the pastries as well as the coffee (latte) were amazing. I've been told the pastries are made fresh every morning and you can tell the difference. Coffee is from la colombe !"
    },
    {
        "id": 71,
        "text": "We loved sipping on our draft lattes while getting some work done at this bakery! The decor is very chic and they offer free WiFi for patrons. I can't wait to return and try more of their pastries!"
    },
    {
        "id": 72,
        "text": "I tried three things here: eclair, chocolate croissant, and an iced latte. All three were delicious! I am going to come here again for sure. Cute place with a lot of options. I would try all of their baked items. The seating areas were clean and the ones by the window seat were nice today bc the sun was shining and it was a Friday. You could watch the people walking to work or wherever."
    },
    {
        "id": 73,
        "text": "Great little addition to center city!\n\nVery nice and inviting, clean, spacious interior\nLots of options of pastries and food\nVery nice staff\nPrices are pretty reasonable\nI had a chocolate croissant which was delicious!\n\nNo real downsides that I can think of? I suppose I don't know what some of the pastries are but that's my fault for not knowing French. \n\nGreat option for a quick bite or coffee!"
    },
    {
        "id": 74,
        "text": "I am so lucky to work right around the corner from this sweet little patisserie. I have had several pastries from here and they were all delicious. My fave is probably the almond croissant or the yummy citrus cake. They also save the day most days with great house coffee. Definitely worth a visit if your in the neighborhood!"
    },
    {
        "id": 75,
        "text": "No doubt the best French bakery in town. Croissant are to die for. And with amazing service."
    },
    {
        "id": 76,
        "text": "Delicious blueberry galette!   Sweet like a tart and somewhat runny like a blueberry pie.  Will definitely be back to try more pastries.  I also had a really good tangerine juice."
    },
    {
        "id": 77,
        "text": "I had high hopes based on the pictures and reviews but was left unfulfilled. Their menu is quite sparse, I wish they had more to offer. I got a mocha latte but it was quite bitter, more so compared to the other mocha lattes I've had at other cafes in the city. I got a brioche roll as well which was very dry and small for the price it was allocated. Last but not least, I was confused by the service. When I walked in, there were two people behind the counter, one was already helping another customer and another was talking to a friend. I was waiting for a good 5 minutes and there was no acknowledgement or anything. I will pass this next time around. Go down a few blocks to Bluestone, it's not worth it."
    },
    {
        "id": 78,
        "text": "Super cute place! No outlets or WiFi so bring a book or a friend and enjoy! My husband and I got the madeleines and the Black and Tan -both were great. Madeleines were soft and not too sweet while the coffee was refreshing."
    },
    {
        "id": 79,
        "text": "The baked goods are very good. But the staff doesn't know how to make a latte with la Colombe coffee which is always good except when I go here."
    },
    {
        "id": 80,
        "text": "Cheaper than a flight to Paris, with coffee and pastries that are just as good. Ive complained for years that you can't get good croissants in Philly. No more. This place, With the owner / pastry chef trained at Lenôtre, offers French pastries that tempt the eyes and tastebuds. Add to that the fantastic coffees and you have a true Philly gem. I can't get enough of this place."
    },
    {
        "id": 81,
        "text": "The croissants are crispy and fluffy, hot chocolate is rich and thick, and the baguette was crispy on the outside, soft on the inside. My favorite spot now. Also, they sell Natalie's juice!"
    },
    {
        "id": 82,
        "text": "An excellent bakery with a clean and refreshing atmosphere. I strolled in quickly to grab a latte and maybe a seat to relax for a short while before heading back to the convention that I was in the area for.\n\nThey have dairy-free options and I was able to substitute my milk for almond milk. One of my pet peeves about many coffee shops is that their nut milks tend to be sweetened (even if ever so slightly). So of course, I inquired and the barista reassured me that it was absolutely unsweetened since it was also something she was particular about too.\n\nWhile I didn't get a chance to try any of the pastries, there was a woman who had come in to purchase a slice of cake. She had raved about how she had the cake before and came back immediately to buy some more because of how delicious it was. Honestly, it almost convinced me to have some right then and there!\n\nThe cafe was rather quiet when I visited and only two other people were inside at the time, chatting and catching up. I would recommend it as a place to sit and sip on your beverage while snacking on some baked goods."
    },
    {
        "id": 83,
        "text": "Wow, j'aime J'aime. Awesome croissant! Best this side of the Atlantic, sans doute !"
    },
    {
        "id": 84,
        "text": "I heard about the lovely J'aime bakery and decided to stop by for a visit. The unique atmosphere provided such a homey french lux experience. Their staff were so friendly and warm. It was really touching when I noticed how one of them even helped an old man to his seat.\n\nWhen I tried the apple pastry I ordered, it tasted just right. It was freshly baked and the perfect compliment to some almond milk. I think this is now my favorite Bakery in Philadelphia, and I can't wait to try some more pastries. I highly recommend a visit."
    },
    {
        "id": 85,
        "text": "This is an authentic French bakery with a well-curated selection. I was pleased that the baguette was reasonably priced at $3; all of the ones I've seen at farmer's markets are $4+! If I lived in Philly, I'd come here for the bread every day. They also serve delicious La Colombe coffee. The barista was pleasant, & I even got to practice my French. This pâtisserie/boulangerie reminded me of my time studying in Paris."
    },
    {
        "id": 86,
        "text": "Beautiful interior and friendly staff. The pastries look delicious although I did not try any this time around. They serve La Colombo draft lattes along with other espresso drinks, hot chocolate, teas, juice. They also have a menu with more substantial options of quiche, salads, crepes. Great place to do some work in the middle of the city!"
    },
    {
        "id": 87,
        "text": "Authentic French breakfast/brunch in the heart of Philly, pastries are delicious and fresh. A little pricey but worth it, you can't get more tasty pastries in the city. If you're a pastry buff, this is the place to go."
    },
    {
        "id": 88,
        "text": "What the previous reviewer said: For a major city, Philly has a surprising lack of good patisseries. However, J'aime represents a strong step toward remedying that problem. It's the real deal (despite the cutesy name): Genuine world-class French-style pastries. It's not enormous, and their stock isn't either--they'll typically have around 6 or 8 items (weighted toward choux pastries & buttery tarts), plus some breakfast items (e.g., croissants). They also have a few breads that look outstanding. Everything I've tried has been stellar (all pastries). Service is pleasant and competent. Good job, mes amis!!! Keep it up--we need more of this!"
    },
    {
        "id": 89,
        "text": "Pretty cafe with gorgeous lighting, great service from the baristas, strong coffee and yummy parties that taste authentic to Parisian pastries...this new cafe is a gem! I'm so glad they opened since they are conveniently located next to my old gym. Now I look forward to going back to the gym so I can come here ;)"
    },
    {
        "id": 90,
        "text": "Today we ventured out to check J'aime, French bakery on 12th street between walnut and St. James Place.\nThis is a lovely addition to Philly, having lost two French bakeries in the past. The hot chocolate is the real thing. My husband had the flourless\nchocolate cake and La Columbe cappucino.  My twist with raisins was equally great.\nIf you ask, at lunch, you might even get a croc Madame or Messr.\nI think their business will break out once the news gets around."
    },
    {
        "id": 91,
        "text": "Love this place, marble everything so my aesthetic! This place reminds me of France once you step into this place, you won't regret it. The bakery is amazing! All the breads are super tasty and it's basically the same taste you get if you're in France."
    },
    {
        "id": 92,
        "text": "I went there many times and I never been disappointed ! It's true French recipes and it's DELICIOUS ! The place, staff, ambiance is very nice. I really love spend hours there !"
    },
    {
        "id": 93,
        "text": "Beautiful interior and friendly staff. The pastries look and taste delicious. They serve La Colombo draft lattes along with other espresso drinks, hot chocolate, teas, juice. They also have a menu with more substantial options of quiche, salads, crepes. Great place to do some work in the middle of the city and also a nice set for a date!"
    },
    {
        "id": 94,
        "text": "Just got back from Paris and this place opened up the next day. My go to Saturday post gym place. A bit pricey but the croissants are the same as Paris- and that's hard to find around here"
    },
    {
        "id": 95,
        "text": "Quaint, little French bakery. Interior painted white. Got the choquette, very nice."
    },
    {
        "id": 96,
        "text": "I was recently asked to transfer to the downtown office to be the full time nurse. I live in Philadelphia so it makes sense but the office is literally 150 feet away from J'aime so I am in trouble"
    },
    {
        "id": 97,
        "text": "This place is cute as heck. The owners (who were working the counter this morning) are friendly and have wonderful accents. I had the spinach and salmon quiche and it was superb. The selection of other pastries were equally fantastic. I am not a coffee drinker, so I can't comment on that, but they have a nice selection of bagged teas. The teas aren't anything special, but good. The seating is lovely with a big, 3-sided window area and large french doors (obviously) for when it's nice out (it wasn't today). The overall experience was wonderful.\n\nMy only suggestion comes from a seasoned tea drinker... they use the hot water straight from the coffee machine, which is too hot for green tea. Buy a $100 kettle for proper temperature tea brewing and this place gets a gazillion stars."
    },
    {
        "id": 98,
        "text": "Before J'aime, this location was Cafe Twelve, which always looked dark, grungy, and uninviting. J'aime is the polar opposite - it's bright, clean, and so very inviting! The front seating area is usually open to the outdoors, and there are plenty of places to sit even though the cafe is small. As a bonus, they serve La Colombe coffee, so you know it's going to be good! A bit on the pricey side, but not any more so than other small coffee shops. Their array of French pastries is excellent - they have both sweet and savory foods to satisfy either craving. The most unique thing about J'aime (in my opinion) is the little colorful meringues that you can purchase by the handful. Each color is a different flavor and they aren't overly sweet, making them a cute and fun snack! J'aime is the perfect place to catch up with friends over a cup of coffee, or to study/read. Love this new addition to the neighborhood, I think I've found my new go-to study spot!"
    },
    {
        "id": 99,
        "text": "15% discount if you made reviews on Yelp. \n\nFilled choquette: really disappointed. There's no flavor at all only whipped cream. It's super to be hazelnut flavor. However the pastry is very fresh and moist.\n\nFlourless chocolate cake: really good and not overly sweet. It has a brownie texture.\n\nOrange olive oil cake: really moist and it's sweet. You can't taste the olive oil. The poppy seed gives a crunchy texture. The outer part of the cake is addictive from the caramelization of the sugar."
    },
    {
        "id": 100,
        "text": "We got 2 salmon & spinach quiches and they were awesome. Cappuccinos were good as well.We will try their other pastry's and will update review shortly since they offer 15% of the order for yelp or google reviews ."
    },
    {
        "id": 101,
        "text": "Wow can this neopolitan get any tastier ?!! First of all the layers of puff pastry were incredible, and second the vanilla filling was so light and fresh, I would buy a container to eat with berries. Highly recommend people to go. \nI've also had an almond croissant and chocolate croissant. Both were amazing. The chocolate in the croissant was like a dark chocolate, which was great because it didn't make the pastry disgustingly sweet. \nUpdate:\nCame back, got a choquette. The chocolate cream was so light and perfect on a hot summer day. Hands down best pastry place I've gone to"
    },
    {
        "id": 102,
        "text": "Adorable little new Parisian bakery! \nClean, bright, and oh so welcoming! \n\nWith the bistro tables out front, the bicycle complete with a wire basket perfect for baguette carrying, and the selves shaped like The Eiffel Tower, I would say they carried out their concept quite flawlessly here. \n\nWhile they personally had me at just La Colombe, latte drafts, and a plethora of teas, their pastries glistening with butter, were mesmerizing. \n\nI stopped by way too quickly this visit (30 minute loading zone spot right out front) for a sweet treat to take home to my sweets. It was as chilly and raining and I couldn't help but wish I had more time and a good book with me because I just wanted to grab a table by the big windows up front and relax with some hot tea. I did NOT want to leave! \n\nTorn between one of the varieties of croissants, the chocolate bread pudding and the Philly Paris which looked like a custard filled eclair, I went with a heart shaped flaky pastry filled with beautifully and perfectly piped cream. It was said to be absolutely outrageous! Start to finish, no crumb left behind. It was a winner for sure! Thanks for making me look good you guys!\n\nI can't wait to bring the whole fam here earlier in the day when the choices seem to be more plentiful, although it doesn't seem you can go wrong here either way. \n\nIt's a great place to get some work done which many were doing, meet up with a friend and stay awhile, or grab a quick snack or caffeinated beverage to go! \n\nIn addition to their freshly made baked goods which aren't just sweets, but loaves, quiche and sammies too, they also sell jams and other pre packaged goodies. \n\nService was so friendly and the offer 10% discounts to Sweat members and Jefferson employees with badges. \n\nSee you soon, J'aime (which is actually pronounced simply \"Jem\" like \"...And The Holograms\")."
    },
    {
        "id": 103,
        "text": "I was looking for a place for a decent croissant in downtown Philly. This place emerged from my searches and therefore I gave it a try.\n\nThe quiches here are kind of amazing. They are a very different beast to the kind of quiche I am used to. They are much smaller and in this case small is beautiful. They are more like tartlets than anything else. However they are quite expensive.\n\nThe croissants were very good. They are also a little bit on the small side and quite expensive. The coffee here was more than acceptable. \n\nTherefore the overall impression is if you want to have a place to have a European style breakfast and you are in downtown Philadelphia on the weekend this is your one of your better options."
    },
    {
        "id": 104,
        "text": "Cute bakery with plenty of space to sit on weekends for breakfast/coffee. Delicious Quiches and croissants. Definitely recommend it."
    },
    {
        "id": 105,
        "text": "The quiche salmon spinach is delicate and just delicious (small but qualitative, excellent for people who like to eat well and stay fit), the croissant is also crispy and melting, they have good coffee and the place is pleasant, the service nice as well...a place to visit."
    },
    {
        "id": 106,
        "text": "I stumbled upon this pastry shop while wandering around the city and this place is adorable! Chic decor and friendly, prompt service. I sampled a croissant and it was quite tasty. It was a little over baked but the interior was definitely melt in your mouth buttery goodness. The beverages were beautifully crafted with attention to detail. There is ample seating and it's a nice quiet spot to catch up with a friend or get some work done. Looking forward to my next visit!"
    },
    {
        "id": 107,
        "text": "This bakery definitely has a cafe feel. There's a good amount of seating space and feels welcoming to hang out for a while. Though I should mention - there is NO WIFI, so it's more of a place to chat and maybe read than to get serious work done. \n\nThe latte I had was good, but the chocolate croissant really stole the show. It was flaky and delicious! They also had other food items - more baked goods but also sandwich options. Their baguette looked great, and I'm excited to try it. \n\nThe atmosphere and decor were well done. It has that trendy instagram look - modern and open with cool white and grey tones. There are large windows at the front so the inside is quite bright. It also looked like the windows would be able to be opened, so here's to hoping for some open-air seating by the window when the weather is nicer. \n\nIt would have been a 5-star experience but some of the details were off. There were used napkins on the floor, and the small table was really shaky and needed to be wiped down."
    },
    {
        "id": 108,
        "text": "Stopped in here for a late breakfast and presently surprised at how fancy the food was. Had the Lorraine Quiche and Chocolate Croissant. All Cooked perfectly."
    },
    {
        "id": 109,
        "text": "Absolutely worth stopping to visit, ideal for that mid-morning coffee and pastry craving. Feels like a bit of Paris right here in Philadelphia. Try the coffee without cream and sugar very flavorful."
    },
    {
        "id": 110,
        "text": "Great ambiance, cute place to study! Got an iced latte and spinach ricotta pastry and it was great :) will come again!"
    },
    {
        "id": 111,
        "text": "Delicious coffee and lattes on draft which I've wanted to try for awhile. I got the Black and Tan with half coffee and half latte which was a great afternoon pick me up. The girl working was also super helpful and patient with us having a hard time choosing the drinks we want."
    },
    {
        "id": 112,
        "text": "Asides from the desire I had to go in here based on how closely related the name is to J'amie Private School Girl...this place did it up right. Almond croissant was delicious and had the perfect consistency. Perfect sunlit location to enjoy a cappuccino and read a bit."
    },
    {
        "id": 113,
        "text": "Cute little French cafe! They have croissants, napoleons, fresh baguettes baked daily ($3!), decent coffee/lattes (kind of small), crepes (with different jams including lemon!! yum!!) and all sorts of other yummy baked goods. Enjoyed doing a day's worth of studying here and was sufficiently satisfied with my snacks and caffeine fix. Also observed a decent amount of French speakers that came in and out, so seems legit in terms of their \"French\" character. \n\nUnfortunately, there isn't wifi, but there is xfinity wifi accessible if you have that!\nEDIT: Owner informed me there is wifi and to ask for it at the counter! Thanks!"
    },
    {
        "id": 114,
        "text": "How wonderful is J'aime?!!! My daughter lives in the area and told me about it, declaring that they had the best French pastries outside of France. So naturally, I've been wanting to try it and today provided the perfect opportunity as I was in the city for the morning. \n\nLovely spot. Clean and fun and fresh and, fortunately, not too crowded later morning. My daughter and I enjoyed their Quiche Lorraine, as well as a Napoleon, and an almond croissant. The quiche was delicious, light and tasty, with a shortbread-like crust. The Napoleon...how can I describe it? It LOOKS like a heart-shaped shortbread cookie filled with buttercream. But when you bite into this pastry, it shatters and melts into a richly layered deliciousness. \n\nFriendly staff. What more could you ask for?"
    },
    {
        "id": 115,
        "text": "The review is for the canele. It's chewy with thick outer crust. It's not too sweet but it's missing the citrus and rum flavor.\n\nAs always service is great"
    },
    {
        "id": 116,
        "text": "Holy cow! These reviews don't lie do they? \n\nI decided to finally check this place out after my morning appointment in Center City. It's small and cute...I wanted to sit and enjoy my coffee and croissant there but they were super busy and all the seats were taken :( Maybe next time...\n\nSo as soon as you walk in, there are various pastries on display and all of them looked AMAZING. Since I wasn't going to be able to sit and enjoy my visit, I decided on a large coffee and croissant to go. The baristas/servers behind the counter were nice and friendly and I was able to peek in the kitchen to see the chef baking all their goodies. So fascinating and cool. \n\nI am a fan of dark roasts...prefer them over light, and I wasn't disappointed. On their window is a sticker that says they serve La Colombe coffee and I saw their draft lattes but not sure if the regular coffee is. Maybe it was just a different blend than I normally drink at home? By the time I got to 15th Street to catch my ride back home, I was done with my coffee haha (coffee feind). I waited to get home to enjoy my croissant and O.M.G! It is by far THE BEST croissant I've ever had! Too bad they're not close to where I live...or maybe that's a good thing. I'd probably be there too often. \n\nI will DEFINITELY go back the next time I'm around, and now I know to buy more of their baked goodies to enjoy at home... I'm looking at you baguettes :P"
    },
    {
        "id": 117,
        "text": "This a wonderful cafe with delicious croissants, crapes, sandwiches usually great coffee. I have been there several times and tried all three kinds of croissants. They are fresh and delicious. The quiche is excellent but very small, it comes with a side of spinach and a nice dressing. I would have preferred a lower price point than $12. The crapes are delicious and well price.\n\nThe employees are very friendly and welcoming and efficient. They always greet the customers with a smile and warm greeting. They deserve 5 stars. Thank you for your hard work.\n\nBut the reason for 4 rather than 5 stars, besides the expensive quiche, is that the bathroom didn't have a toilet paper holder. The toilet paper was placed on the toilet's tank and made it difficult to use."
    },
    {
        "id": 118,
        "text": "Super cute bakery with a large assortment of drinks and pastries! Very open inside which would be good for social distancing and two outdoor tables that have turned over quickly while we were here. They were also accommodating--they have crepes and were happy to customize one for me. There was a lot more available for food than I expected!"
    },
    {
        "id": 119,
        "text": "This place is very nice.  Always on the lookout for new french bakery.  This place has great croissants (will venture out to say best in philly to date?); my 2 yr old daughter loved their \"pain au chocolat\" mistakenly referred to as \"chocolate croissant\" :)\n\nThe only downside for me were:\n\n1) there is a lot of light (long windows) and was a bit disturbing on a sunny morning (more of a preference thing).\n\n2) they advertised \"fresh squeezed juice\" which i was excited about, however it was not freshly squeezed it was a local vendor who has juice in containers.\n\nBoth of these are not big enough to stop the experience but worth noting"
    },
    {
        "id": 120,
        "text": "My favorite philly bakery with the best napoleon pastry. Still drooling...... go try anything"
    },
    {
        "id": 121,
        "text": "As a several time visitor to Paris and France in general, I can say that the pastries here are the closest I have had to the real thing. It's nearly impossible to find a flaky croissant with the moist center, like Paris, but this place has it. Coffee is delicious as well being sourced from local roaster La Columbe - another cool coffeehouse over on Rittenhouse that sells beans as well. If you're longing for a French pastry, this is the place"
    },
    {
        "id": 122,
        "text": "Super cute place with amazing food. My favorite is the quiche Loraine. Staff is amazing too! Very sweet and informative about what they have. Took a friend who was visiting philly and she loved it as well!"
    },
    {
        "id": 123,
        "text": "Clean place, friendly service. The Paris Philadelphia is amazing. It's a must at this place. The coffee eclair is really good too. The Napolean has very thin and crispy layer. Very good. The sourdough baguette is ok. I wish the wrapping paper covers the whole bread. The croissants are very airy and light. I had the chocolate and the almond.  The chocolate brioche has a lot of chocolate chips. It's a place to treat yourself with good French pastries."
    },
    {
        "id": 124,
        "text": "This is my favorite bakery in philly! I always get the Napoleon in this place. The cream taste so fresh and they have have all the new bakery goods to try out! The staff are friendly. Highly recommend"
    },
    {
        "id": 125,
        "text": "Best chocolate pretzel ever. A must go when I'm in Philly. Don't get deterred by the long line. The staff moves quickly!"
    },
    {
        "id": 126,
        "text": "Friendly staff, and actually quite knowledgeable about French pastries. Pastries have all been awesome and it smells great. My only nag is the coffee mugs are square shape with a big lip on them and it makes it hard to not drip when you have a sip. Looks cool it's just not that functional"
    },
    {
        "id": 127,
        "text": "Very cute cafe. I like studying here. The staff are super sweet and their coffee and pastries are actually good. Its worth spending your money here."
    },
    {
        "id": 128,
        "text": "Sweet spot for a perfect pastry, crepe and coffee. I popped in after an anxious eye checkup. Whew! Just right! Here's Ben Vaughn to wrap it up-- https://www.youtube.com/watch?v=-f6SddGZlcI"
    },
    {
        "id": 129,
        "text": "Will go out of my way and pay whatever you want to get a sugared croquette from here.\nIt's sooo good.\nThat chocolate whipped cream is to die for. WOW.\n\nApple tart is also delicious. Crazy flakey.\n\nAmazing desserts."
    },
    {
        "id": 130,
        "text": "Wow can this neopolitan get any tastier ?!! First of all the layers of puff pastry were incredible, and second the vanilla filling was so light and fresh, I would buy a container to eat with berries. Highly recommend people to go. \nI've also had an almond croissant and chocolate croissant. Both were amazing. The chocolate in the croissant was like a dark chocolate, which was great because it didn't make the pastry disgustingly sweet. \nAlso, my friend got the orange cake. I tried it, and I'd eat it for breakfast everyday if I could!\nDefinitely coming again!!"
    },
    {
        "id": 131,
        "text": "The pastries I got were superb. The staff, not so much. When I paid, they slide my bag to me and turned around. I said thank you, and didn't receive a response. I felt uncomfortable. The pastries really were fantastic."
    },
    {
        "id": 132,
        "text": "Great desserts that will surprise you! We enjoyed the La Colombe coffee they serve along with some delicious bakery items. The layout is clean and the staff is super friendly. It would be even better if they had some charging stations. Definitely will come by again when we visit Philly next time!"
    },
    {
        "id": 133,
        "text": "Absolutely magnificent. Coffee and hot chocolate are great. Pastries are authentically French and always fresh. Atmosphere is wonderful."
    },
    {
        "id": 134,
        "text": "Just ate breakfast here, the sugar crepe and flan were delicious. Great vibes from this place."
    },
    {
        "id": 135,
        "text": "Nice space.. super nice staff ... one of the best plain and regular croissants in Philadelphia"
    },
    {
        "id": 136,
        "text": "Really chill place to eat your weight in delicious cake and croissants! Super friendly staff too! My friend and I both ordered draft lattes with whole milk despite both of us being super lactose intolerant and the nice person working the counter let us swap drinks at no additional cost :)"
    },
    {
        "id": 137,
        "text": "Adorable bakery that acted as a nice escape from the wintry streets of mid-February Philly! The interior is super bright and airy with cute decor and chipper music. Their selection of Kusmi tea was pretty expansive and their small latte was the perfect amount for a caffeine fix. I also ordered a flan to share, which was super custardy and fluffy yet not too sweet. The service is extremely friendly too!"
    },
    {
        "id": 138,
        "text": "I came here because my friends recommended their Napoleon. Ordered extra King's galette, and they are soooooo good!!!! I personally like the galette better than Napoleon, definitely will come back again"
    },
    {
        "id": 139,
        "text": "So fabulous you will want to go back way more often than your belt allows!!!!  We tried several things and one was more deli than the next."
    },
    {
        "id": 140,
        "text": "Great little spot for a nice coffee and a baked good that hits the spot. The chouquette was excellently tasty both in cream and buttery pastry. The almond croissant was also crisp and sweet."
    },
    {
        "id": 141,
        "text": "This is the cutest little bakery in such a great location! The inside has such a bright but cozy atmosphere! There is an array of delicious pastries and quiches to choose from and la Colombe on draft as well as canned. I tried an oat milk latte for the first time and it was so creamy and I would definitely recommend! The goat cheese and bechamel quiche and mushroom and spinach omelet were both awesome!!"
    },
    {
        "id": 142,
        "text": "we were trying to get out of the rain and stumbled upon this place. The first impression was, the decor is modern yet cozy, warm, and cute inside! My husband ordered latte. it was one of the smoothest latte I've ever had. and I ordered hot chocolate. it was different than most hot chocolate I've had in the past. it was on the thicker side but I really loved it!! it tasted very authentic and wasn't too sweet!"
    },
    {
        "id": 143,
        "text": "Amazing service and a pleasant ambiance. Located on a bustling block, this bakery offers a calm and upbeat place to enjoy some freshly baked goods."
    },
    {
        "id": 144,
        "text": "I love this place and am so glad it's joined our neighborhood! Their baked goods are delicious. Their tea is wonderful. The staff is friendly and helpful. And the atmosphere is to die for! Please stay in business forever! And welcome to the neighborhood. :)"
    },
    {
        "id": 145,
        "text": "Best Napoleon ever and the La Colombe draft latte was like drinking a cloud. Glorious  Owner was v sweet too"
    },
    {
        "id": 146,
        "text": "I've been wanting to get to this bakery since it opened but I'm not in the area early in the day. Finally got a chance to stop in and we tried multiple pastries. \n\nWe ate there , taking leftovers with us. The space is clean bright and airy. A nice spot to meet a friend to talk and catch up. I was there late morning and while there were customers, it wasn't over crowded. \nPastries were good with some clear favorites. I loved the heart shaped napoleon, it was perfect!"
    },
    {
        "id": 147,
        "text": "This place is wonderful! Tasty, authentic, with very kind staff! I have looked all over for a place that has Kusmi tea and J'aime has an assortment! Bravo!"
    },
    {
        "id": 148,
        "text": "Amazing croissants and lovely staff! They had an assortment of pastries and drinks. I was surprised that they were selling baguettes. I visited in the late afternoon with my friend and I bought a couple of plain croissants to take home for my siblings. The croissants were huge and flaky and delicious and my siblings were happy with them. The store itself is very pretty and cute, though very very small and full. After purchasing, my friend and I had to sit outside since the establishment was packed and no seats were available. But if you can find room, this would make a great spot to study at."
    },
    {
        "id": 149,
        "text": "Great coffee and day old treats freshly decadent none the less! Stop by for a warm pick me up it's blustery out there!!!"
    },
    {
        "id": 150,
        "text": "The place was very clean and the workers were very friendly. Because this is a French bakery, I was expecting that they had macaroons but they didn't. The pastry options were very limited. However, considering the fact that everything is made in the store, it makes sense that there there were only a few options."
    },
    {
        "id": 151,
        "text": "The Napoleon and Sugared Chouquette with Nutella Whipped Cream were AMAZING. My friend and I aren't even dessert people - we went here because we loved the bright and airy vibe from pictures we had seen online. The atmosphere was exactly that, and we pretty much inhaled the pastries in no time. I think that serving the pastries with real cutlery and actual china enhanced the experience. We had asked for a to-go box, thinking that there was no way we would finish the two desserts, but much to our pleasant surprise we had no need for the box after all. I have to mention that the bakers actually had French accents! We will definitely be back."
    },
    {
        "id": 152,
        "text": "it's the best bakery in philadelphia ... I'm French and it is like I'm in Paris!\nTrès bonne boulangerie mention spéciale pour la tartelette au chocolat"
    },
    {
        "id": 153,
        "text": "My wife had a Doctor's appointment around the corner so we stopped by for an AM pastry. The staff was so kind and friendly. The restaurant was spotless. We tried three types of croissants and took a french baguette to go. All three croissants were flakey and buttery. Everything you'd want in a croissant. The chocolate pretzel croissant was super yummy! Highly recommend. Can't wait to come back! \n\nAlso, I'm very COVID conscious and I felt very safe picking up food to go here. Big thanks to the staff!"
    },
    {
        "id": 154,
        "text": "Definitely the best croissant in Philly hands down. Metropolitan does not compare. They have captured the essence of the croissant which is the most important test of skill of any baker."
    },
    {
        "id": 155,
        "text": "Bar none, these folks make the best French pastry in the US. Light, buttery, flaky not chewy, and just plain ummmy!\nGreat job! Great place!"
    },
    {
        "id": 156,
        "text": "I'm a pretty good baker, like adults fight over my cheesecake and cookies good, and I've had plenty of pastries that were good, but I've never been obsessed until now. When I tell you I dreamt about the Napoleon from J'aime French Bakery I'm not kidding. I was super sad when I realized I had been dreaming and there wasn't one in my fridge; there's definitely one in my fridge right now! The Napoleon was hands down the best pastry I have ever eaten!"
    },
    {
        "id": 157,
        "text": "65 degrees in February is quite unexpected in Philly but the perfect opportunity to explore this city. Walking through Center City, I came across this unique French bakery offering a range of pastries from croissants to flourless chocolate cake. Being a pastry lover, it was difficult to resist adding another bakery to the list of places that I have been to but  I am glad I took the chance to try their pastries. The employees were very kind and helped me select a few pastries that met my dietary restrictions.\n\nThe taste of the pastries was between 3.5 or 4 out of 5 while the customer service was 5/5. I look forward to stopping by again to try other pastries from their selection."
    },
    {
        "id": 158,
        "text": "Very cute little French bakery.  That authentic pastry butter smell, just like in Paris, greets you as you walk in the door.  Pain au chocolats almost like in France.  Solid option, I would go back!"
    },
    {
        "id": 159,
        "text": "My husband is from Europe and a connoisseur of French pastries. He has sampled croissants from all over the world. We live north of Tampa and he feels that your croissants are vastly better than c'est la vie in Sarasota and would be happy to open a franchise."
    },
    {
        "id": 160,
        "text": "Delicious!! Friendly staff, affordable prices and lots of variety. We got a chocolate, almond, and regular croissant, as well as raspberry macarons. Open seating. My mom is still talking about their almond croissant!"
    },
    {
        "id": 161,
        "text": "Amazing French bakery in wash west. Friendly staff and great food. Will definitely be back!"
    },
    {
        "id": 162,
        "text": "Cute, clean cafe with a limited but well curated selection of sweets/snacks and drinks with good amount of seatings. \n\nOur table got a slice of orange olive oil poppy seed cake, chocolate pretzel, orange/pineapple juice, tangerine juice, and coffee. \n\nStaff who helped us was excellent! \n\nEverything we ordered was tasty but what really stole the show was the orange olive oil poppyseed cake: so moist and just sweet enough, generous portion. Lots of poppyseed. I only wish the olive oil taste was stronger but it was still very enjoyable. Get this!"
    },
    {
        "id": 163,
        "text": "This bakery has the freshest raspberry tea and best flourless chocolate cake in the city.  Simply outstanding!!"
    },
    {
        "id": 164,
        "text": "I love this place! Everything is good here. My favorites are the quiche, croissant, and apple tart. The staff are always so friendly and smiley too!"
    },
    {
        "id": 165,
        "text": "Cute place, nice staff, great pastries. It was my first name having a Napoleon (flaky with vanilla cream in the middle), and it was amazing. My standards for it are probably too high now. The seating areas are cute and comfortable. I got the 15% discount when I told the cashier I would write a Yelp review. My Napoleon and green tea ended up being $8ish total. Definitely recommend!"
    },
    {
        "id": 166,
        "text": "I am addicted to French bakeries!!! My personal believe is that nobody knows and does better in pastries than friench...it's in the blood!!!!\nJ'aime is a good bakery! Cannot give my five stars as they don't have big choice of bakeries I go but it's still on my list and I do occasionally go to this place for my favorite Orange olive oil cake - this is my all favorite!\nThey have a few pastries and they are good but nothing extraordinary. All in all nice place to visit"
    },
    {
        "id": 167,
        "text": "I know I've reviewed this bakery before, but I just want to reiterate that I LOVE, LOVE, LOVE this place! Come on, they even sell Bonne Maman jams - gotta love that even more. Thank you for coming to the neighborhood and please stay forever! :) And thank you to the lovely staff for always being awesome!"
    },
    {
        "id": 168,
        "text": "This place rocks. First the coffee was super good. I had a cold brew the wife had hot. Both very yummy. Tried the almond croissant. Crispy not too sweet. Very buttery. The lemon tart was stunning but mostly yummy. The best item was a chocolate olive oil orange cake. Holy crap Batman we need to go back for that alone. Crazy good!!! Run don't walk here!!!"
    },
    {
        "id": 169,
        "text": "We saw this was a couple blocks from our hotel and had to try it. It was delicious! We had a crepe with french jam and croissants and took a few things for our trip back home. Very nice atmosphere and they had the world cup finals playing so we got to hear some french singing."
    },
    {
        "id": 170,
        "text": "Some of the best French pastries around. Great ambiance and very friendly staff. Almond croissants  and olive oil cake are the bomb, but I honestly have not had anything here I did not like."
    },
    {
        "id": 171,
        "text": "Yummy pastries, nice atmosphere, kind and helpful staff. Very chill vibe for a coffee spot in the city and everything is fresh and pretty close to authentic- we brought our 1 year old here for her first taste of sugar- it was a hit! She recommends the hazelnut \"Philadelphia Opera\"!  Also at least one staff member speaks French - refreshing"
    },
    {
        "id": 172,
        "text": "Very cute bakery!! And it's the spelling of my name so even better. Friendly customer service. Great coffee and almond croissant! Recommend!!"
    },
    {
        "id": 173,
        "text": "The location is quite convenient, and the restaurant itself is beautiful, and the food is just delicious, totally worth the try."
    },
    {
        "id": 174,
        "text": "Overall Value:  The prices here are steep, and I was initially reluctant to get anything other than coffee because of it.  But the baked goods are amazing (made from scratch!) and totally worth it - the best I have had outside of Paris.  Nothing else in Philly comes close to the quality.  We still haven't tried the crepes or quiche (ugh, I just can't justify the $9 on such a small-looking quiche.  Maybe my mind will be changed once I finally try it), but the pastries are fantastic.  Definitely one of my favorite spots in Philly, and we return to it regularly. \n\nThe Food: We have had almost all of the pastries, including the croissants ($3), chocolate croissants ($3.25), napoleon ($5.50), eclair ($5.50), chocolate tartlet ($6), and paris philadelphia ($6).  They are all excellent - absolutely perfect, delicate textures with incredible flavor.  In my mind, the test for any french bakery is the humble croissant, and this one is so far above and beyond what you get anywhere else in Philly in terms of texture and flavor.  Super rich, buttery flavor and fluffy, pillowy goodness.  I had a croissant at Metropolitan Bakery (which - not to bad mouth them, I like a lot of their stuff) shortly afterwards, and the difference in quality is huge.   My personal favorite is the Paris Philadelphia, which has a lovely hazelnut cream filling that is just the perfect amount of sweetness.  Likewise, the eclair and chocolate tart have this subtle richness to them - so different than the overly cheap sweet stuff in other places.  Really can't go wrong with anything they have.\n\nThe Service:  Really friendly staff and good service.\n\nSpace and Pace: I love the interior of the cafe.  It's a lot of white colors mixed with a little bit of yuppie decor, and with a lot of window space, it's just very bright and positive energy.  It's different than a lot of other cafes, which often have a bit more of a darker industrial look (which looks cool too, but I think is better suited for a bar than a cafe).  It's just a great place to meet up or do some writing on the laptop, and usually not overly crowded."
    },
    {
        "id": 175,
        "text": "Cool lunch spot for exotic drinks and slice of Parisienne delight enjoyable lunch break!"
    },
    {
        "id": 176,
        "text": "Purchased some things from here in March before things got a bit crazy.   The best deal here are the croissants.   Would return just for that."
    },
    {
        "id": 177,
        "text": "I just came back from Paris and was craving a croissant. I stopped by this bakery during my lunch break and I am pleased to report that this is as good if not better than anything I had in Paris! The owner is french himself and trained. I only went for a croissant but came out with a baguette, blueberry pastry and coffee as well. All items were delicious. I bought from prosciutto and cheese from the supermarket and it paired beautifully with the baguette. It was chewy with a nice crust. I will be back for sure.."
    },
    {
        "id": 178,
        "text": "In my quest to try as many French pastries as I could in my short time in Philly, I dropped by J'aime as pictures and reviews made this place look amazing.\n\nJ'aime seems to be nestled in the middle of a Philly gaybourhood, which I always personally enjoy. Its a brightly lit space that is quiet enough to sit and chat with friends or even use as a study/work space. It is rather small though so I'm not sure whether or not it'd be conducive to a lot of people working.\n\nPastry wise the fare is pretty average. The 4 star rating includes the ambiance and location as otherwise, I'd probably rate closer to a 3.5 on food alone. I got a Paris Philadelphia, which to me is just a Paris-Brest with a strange name. Flavor-wise it was good, strong praline/hazelnut flavor in the cream. My friend thought the cream could be lighter but I've never had trouble downing just chunks of butter so personal preference. The choux pastry felt a bit soggy and not as light and crisp as I'd prefer, but this may just be because I got one towards the later afternoon so it was probably sitting out for some time. Overall, it was a good pastry, nothing standout and pretty one note.\n\nThe same could be said about the Lemon tart. Again, the flavor was strong of lemon and there was acidity but it was very one note. Nothing special or stand out with this pastry either. The tart base itself was pretty well made, held up to the custard well and kept its texture. My friend made a comment that the custard felt grainy but I don't think I noticed it as I attributed the graininess to the tart itself.\n\nOverall, its a nice place to sit and chill and get a craving out if you're looking for some pastries."
    },
    {
        "id": 179,
        "text": "I've noticed a serious lack of French café/bakeries in the city and the inner wannabe foodie in me craves French pastries so I decided to hit this place up. \n\nAmbience/decor are usually super important for me and I gotta day this place has a really cool, very bright interior with a lot of natural lighting which I appreciate. I got the americano and a chouquette, which, along with their heart shaped napoleon seem to be their best selling items. Starting with the chouquette, the inside had this super good chocolate cream that's cold, creamy, and not too sweet that was complimented well by the flaky pastry on the outside. The americano was really good as well! It had a good smoky dark flavor to it that I appreciate in my coffees. \n\nAnyways I appreciate that this place has provided the city, especially the midtown area with a much needed French café! Great place to come to catch up with friends or just read a book. Good coffee and good baked goods, not much more I could ask for."
    },
    {
        "id": 180,
        "text": "I had the Paris Philadelphia. It was good but a little rich.  All the pastries and bread looked fresh.  The counter staff were friendly and polite.\n\nEvery time a French bakery opens up in  the area, it's over precious and this is no exception.  What I mean by precious it is all white gleaming counter tops and 3 pastries.  I'd like to see a French bakery crowded with bread and pastries.  If you are a representative of Laduree or Dallyou reading this, open near Rittenhouse Square.  You will get business that now goes to New York.\n\nUpdate - after initially posting this review I continued on a quest for what I was looking for, trying four other French patisseries and found it at Le Petit Mitron in Narberth.  So if you are looking for a more traditional patisserie try that."
    },
    {
        "id": 181,
        "text": "I will admit, I did feel like I was swept back to Paris when I entered this bakery.  They had all the classics from croissants to crepes and baguettes.  After visiting Paris it is hard for us to order croissants from anywhere else (yes I am that kind of snob now) so we decided on a crepe and baguette with jam and butter.  A place that can make simple bread and butter tastes good always is an excellent mark for a place in my book.  I would eat that baguette everyday and be happy.  I think it is hard to mess up a crepe and this one hit the spot for us, went for a simple raspberry lemon one.  Think this a lovely spot if you want to hang out and enjoy your coffee and breakfast on the weekend."
    },
    {
        "id": 182,
        "text": "Charming little spot with friendly service. The Ham on Baguette with French butter is something I crave...it's simple & delicious. \nThis is a great place to relax with some good coffee and pastry too ! \nHighly recommend ...."
    },
    {
        "id": 183,
        "text": "Cute French cafe in center city! It's small, but airy and cozy. A good place to just hang out or study. They have a wide array of pastry selections too. I ordered the Paris Philadelphia and La Colombe draft latte and they're both good!"
    },
    {
        "id": 184,
        "text": "What a way to end a Cheat Friday. So after I leave Wills Eye I treated myself to a cheese steak from the food truck out front. Then my sweet tooth quicks in. I go on Yelp and look for the nearest bakery. I uncover this shop and the rest is history.\n\nI prayed to sweet baby Jesus that I wouldn't find anything to my liken. I took one bite into my apple tart and contemplated the meaning of life. I clearly need better friends and wished I discovered this bakery sooner. \n\nOne thing I appreciate about French pastries is the airy texture in my mouth with just the right amout of sweetness.I will definitely  be back to try the chocolate pretzel croissant. So much for my diet.\n\nThe decor of the bakery is cool and contemporary as well.\nThe staff is warm and inviting. I am a happy camper."
    },
    {
        "id": 185,
        "text": "Polite service, but baked goods and coffee were a bit of a let down. Baked goods tasted a bit stale and the selection was not huge."
    },
    {
        "id": 186,
        "text": "This place is so cute! A little French bakery. Really nice service and awesome options (non-dairy). Cozy atmosphere too"
    },
    {
        "id": 187,
        "text": "Oh my God, I am in Paris. Love this place. Everything is super scrumptious. I had the almond croissant and a breve latte.  Other were great. The croissant was super flaky. Will be back"
    },
    {
        "id": 188,
        "text": "I had the banana Nutella crepe. The crepe is perfect, soft with Nutella but unfortunately there are not much banana in it.\n\nI saw the eclairs but they were so much skinnier than the last time. Thus I decided not to get it.\n\nI got 15 percent off by showing my yelp reviews."
    },
    {
        "id": 189,
        "text": "Great coffee and day old treats freshly decadent none the less! Stop by for a warm pick me up it's blustery out there !!"
    },
    {
        "id": 190,
        "text": "I decided to stop here for a quick breakfast since I was craving somthing sweet. When I walked in the first thing I noticed was that the bakery was extremely cute and had a nice aesthetic to it. \n\nI ordered the nutella and banana crepe and a creme filled Chouquette. Both were just as good as I hoped they would be. There isnt much seating indoors but there is additional seating in a beautiful outside.\n\nThe only issue is that everything looks so good that you will have a difficult time deciding what you want."
    },
    {
        "id": 191,
        "text": "I had high expectations, considering the fact that this bakery receives rave reviews over their pastries and croissants. I've been looking for a decent French bakery in the area to hold a candle to my favorite place in Paris, so I ordered a pain au chocolat and an apple turnover. The bakery is very cute, offers a variety of desserts and serves La Columbe coffee. When I opened the bag to eat my pain au chocolat, I noticed that the bake was a little dark. The croissant was crisp with decent air pockets, but there was a bitter aftertaste that I didn't like, perhaps it was the chocolate, but I wasn't blown away. The apple turnover was soggy and filled with apple sauce. I was expecting the apple turnover to be filled with pieces of apple, but this was unappetizing and I could not finish it. This is a decent spot if you're looking for an \"ok\" pastry and some coffee, but this turned out to be a disappointment for me."
    },
    {
        "id": 192,
        "text": "Such an awesome addition to the neighborhood! It's so nice to have such a bright, clean space to visit when you're treating yourself. The raisin roll is my current favorite but I've tried nearly everything and it's all amazing. They also serve La Colombe and have draft lattes which is a bonus!"
    },
    {
        "id": 193,
        "text": "Awesome French bakery! My boyfriend and I stopped in to grab coffee and some treats (they have La Colombe on draft). The almond croissant was great, but the chocolate almond croissant pretzel thing was the absolute best - definitely get that. They also have a few tables outside."
    },
    {
        "id": 194,
        "text": "Really cute bakery and coffee shop. The staff is very friendly and the space itself is small, clean, and bright. I stopped in with see girlfriends to get some coffee and some dessert that we didn't need but couldn't resist ordering. \n\nThey have La Colombe coffee including the draft lattes. My friend got the draft latte but unfortunately it tasted off the day we went. She mentioned to staff and they immediately replaced it with a drink of her choice which I thought was a really nice touch. I had a latte with soy milk which was very tasty. \n\nThe desserts are all gorgeous. If I was hungrier I probably could have gotten everything there. \n\nWe ended up getting a Madeline (not pictured), the choquette (puff pastry with airy chocolate cream) and the Napoleon (the last two are pictured with this review). All were good but the Napoleon (the heart shaped dessert) was stand out. The cream was so friggin delicious I am still thinking about it days later. \n\nIf I'm in the neighborhood I would definitely stop by here for coffee and sweets."
    },
    {
        "id": 195,
        "text": "Great spot for a morning breakfast/brunch. Best Napoleon I've had in awhile. It consisted of light, flaky layers dusted with sugar and filled with delicious cream. I miss the pastries in Paris and this place definitely lives up to the expectations!"
    },
    {
        "id": 196,
        "text": "Such a cute little bakery!! I love the vibe here. Definitely gonna be a favorite place of mine!!!"
    },
    {
        "id": 197,
        "text": "This place stole our hearts as soon as we entered the first time, it's so romantic and French and it smells so good!! We tried different pastries and liked them all, but our favorite is the chocolate éclair, just like in Paris!"
    },
    {
        "id": 198,
        "text": "Close your eyes and you could be in France. Pastries are beautiful, lovely and so well done. I had been in nyc eating at bakeries the day before... this little gem blew them away. The space is so well done. I will be back often."
    },
    {
        "id": 199,
        "text": "Great coffee and day old treats freshly decadent none the less! Stop by for a warm pick me up it's blustery out there"
    },
    {
        "id": 200,
        "text": "Cute little french bakery, with a wide selection of pastries to eat. Also great ambiance to do some work as it wasn't too loud and wifi was speedily fast, and they make a wide selections of coffees. Baristas were really friendly and accomodating, and their coffees (got an Iced latte for ~$3) was surprisingly good and tasty. Lots of tables at back to do work and sit. The whole decor feels like your transported to a coffee shop in Paris, and a cool place to hangout with a friend or invite a date over. Would definitely come back here!"
    },
    {
        "id": 201,
        "text": "Waaaaaay too convenient to the PATCO stop at 12th and Locust.\n\nThis sleek, bright and airy coffee and pastry shop is adorable, with big open doors / windows that open up to the street when the weather is nice.\n\nIt's no Dunkin Donuts. You're going to pay a fairly expensive price for handmade pastries and strong coffee.\n\nPay up, pick a seat and relax. Pretend that instead of downtown Philly, you're at a French patisseries in Paris. Minus the smoking. And petite yappie dogs sitting beside you in a chair."
    },
    {
        "id": 202,
        "text": "Good pastries and coffee. Day old bag for $3 full of goodies. Would definitely recommend"
    },
    {
        "id": 203,
        "text": "J'aime is a solid go-to whenever we are craving some pastries. It's a popular spot on the weekends, so go early as they tend to sell out of items. \n\nI have been a fan of everything I've tried there so far. The sweet items are just the right amount of sweet and everything is baked to flaky perfection. I haven't tried any of their drinks, but it seems like a regular morning coffee spot for many.\n\nAs of right now there is limited indoor seating and a couple outdoor tables as well. Off the main street so it's nice and quiet, perfect for munching and people watching!"
    },
    {
        "id": 204,
        "text": "i love this place!! the bakery items are adorable and they have so many pastries!! the only downside is they don't have chai, which is the only thing i really drink since i'm not a coffee drinker! but the service is good and the ambience is stellar"
    },
    {
        "id": 205,
        "text": "Excellent croissants and tarts!  Yummy treat you should definitely walk to.  We were so happy with it we're going a second time this morning."
    },
    {
        "id": 206,
        "text": "I took my son here after I had an appointment nearby and it was amazing. He had crepes with a coffee and I had an almond croissant. We also got a Napoleon to go. The service was great and the employees were very friendly. I look forward to going again."
    },
    {
        "id": 207,
        "text": "Awesome pastry and coffee/tea shop in Center City. Great place to grab a latte and snack to do work or have a conversation. Beautiful and classy ambience. Very friendly staff and great customers. I would recommend checking out if you need somewhere to concentrate and do work. Many bakery selections and beverages to choose from."
    },
    {
        "id": 208,
        "text": "Nice apple tart. \nNice coffee (black coffee).\nGreat space to study or work.\nNo parking space but you can street parking."
    },
    {
        "id": 209,
        "text": "A rare find in Philadephia as this bakery truly stands above the competition and is, in my view, one of the best French patisserie in the entire US. The staff is very friendly and I make sure to vista every time I am in Philadelphia. Never been disappointed by any of the pastries and their coffee is delicious too. Highly recommended."
    },
    {
        "id": 210,
        "text": "Oh my goodness. Absolutely *the* cutest bakery I've ever been to. Everyone is so kind and have some of the best baked goods. I have a huge sweet tooth, so their apple turnovers and eclairs and pains au chocolate are some of my favorites. And they sell delish bottled fruit juices and other beverages, too. Oh, oh, oh! *And* they have Bonne Maman jellies and preserves! Absolutely *the* best you can buy. Occasionally they'll have the muscat grape jelly jam, which I cannot find *anywhere* else in the city.\n\nWhat actually inspired me to write a review, though, is their baguettes. They have both French and sourdough. I can't speak to the sourdough ones, but the traditional French bread baguettes are so, so good. I cannot get enough and made it a regular treat before the apocalypse. Now I know they're open again I'll be making regular stops for more baguettes. Bread is love, bread is life, and good bread is good life!\n\nPlus! The space is utterly charming and I feel like I could spend a day here. If only I had the time! I live just a block away and this adorable little spot has become a dear favorite of mine, a true staple of the community."
    },
    {
        "id": 211,
        "text": "C'est vrai: J'aime French Bakery! \n\nThe third time was the charm for me with this adorable new bakery. On my first attempt, I tried to meet Alisha S on a Monday, only to find that the shop is closed on Mondays. Alisha had arrived before me and walked in through the open doors. Though she was informed that they are not open on Mondays, the employees sent her away with some complimentary pastries - so nice! \n\nMy second attempt was for a savory breakfast. Alas, there was no quiche left by the time I arrived, and I needed something substantial before my long day. \n\nFinally, another meeting with Alisha was scheduled and the bakery was both open and stocked with several quiche options! I ordered the quiche lorraine which came with a small side salad. It was absolutely perfect - decadent and just the right size for lunch. I haven't tried the sweet pastries yet, but there will be many more visits in the future. \n\nI'd love to see an enhanced menu of savory items (perhaps some baguette sandwiches?). Also, I'd REALLY love some wifi (but understand if they don't want to be the type of place where people like me stick around too long). In any case, looking forward to my next visit! À la prochaine!"
    },
    {
        "id": 212,
        "text": "This is a clean, well-lit, upscale place that I would love to go on a date/hang out with girlfriends in. Unfortunately, I wasn't equally impressed by the pastries. Nothing was bad, but the quality/flavor just didn't match the atmosphere."
    },
    {
        "id": 213,
        "text": "The coffee's delicious, the pastries are delicious, and they have really nice deals like a sandwich and small drink for $9.95. Plus the staffs really friendly, great place!"
    },
    {
        "id": 214,
        "text": "Stumbled upon this place on a walk around philly musing over art murals on a rainy day and knew we had to pop in.\n\nLoved the French, minimalist decorations, and the strong lattes. \n\nI posted a photo of the coffee shop and the space was so beautiful that my friends kept asking me where I found this gem!"
    },
    {
        "id": 215,
        "text": "I come here when I need a calming place to sip tea, nibble on pastries, and get some work done. I also love sitting by the big windows (inside in the winter or out on the sidewalk in the summer) with a friend and watching all the neighborhood pups trot by. The staff is friendly, the pastries are scrumptious, and the ambiance is lovely. Also great for a quick but elegant European breakfast; if I'm in a rush, I'll grab a pastry and a latte on my way to work."
    },
    {
        "id": 216,
        "text": "Very cute place with a ton of options. Cold brew on tap, coffee, tea, food. \n\nImportant to note: their iced tea is only a hot water + teabag + ice. \n\nI ordered an iced tea (jasmine) and a Nutella and banana crepe. The tea was basic tea and the crepe was really good! A bit pricey at $7 but hot and melty. \n\nVery important: the crepe doesn't take good when it's not hot! Eat it quick. \n\nThe staff was incredibly friendly and the experience was overall a good one. \n\nThey have a customer limit of 7 and do enforce it. The baristas all wear masks."
    },
    {
        "id": 217,
        "text": "A cute little place to stop by and grab your iced coffee to go. They do seasonal decorations and is a great neighborhood location for your cup of joe. The staff is friendly, the pastries are good (chocolate croissant here was great!), and if we lived closer, I would definitely come here on the reg."
    },
    {
        "id": 218,
        "text": "My mother-in-Law is from France and she claims these are the best croissants she has had outside of France. And if you Know any French- you know that is not a statement they make lightly. This place can never ever close, it will break our hearts.  I hope this shop opens 20 more locations so more people can experience the joy of a warm flaky chocolate croissant."
    },
    {
        "id": 219,
        "text": "They don't have any variety on desserts. They are little and quite expensive. Their coffee, on the other hand, is very good, it was the only thing I really enjoy."
    },
    {
        "id": 220,
        "text": "Its clean, adorable decor caught my eye since its opening. The cafe serves La colombe coffee along with a wide variety of fresh pasties. I ordered a chocolate croissant (requested it to be warmed up) with a small cup of coffee.  Lots of cafes serve chocolate croissants but not many hit home like this one did - light and flakey with the perfect amount of chocolate. There are plenty of tables and windows, making it well lit and great spot to work. \n\nI live on the other side of Broad but I would make the walk again (and again) for more J'aime."
    },
    {
        "id": 221,
        "text": "Beat bakery in Philadelphia! Love all of their items and the staff are super friendly!"
    },
    {
        "id": 222,
        "text": "Nicest employees. Very clean and COVID friendly! 10/10 recommend. Coffee is soooo good."
    },
    {
        "id": 223,
        "text": "The cutest bakery and they sell my favorite lacolombe coffee and yummy pastries! definitely recommend"
    },
    {
        "id": 224,
        "text": "Came here a while back ago, and I have no idea where my review went, so I'm back again to do this place justice. Unfortunately no photos though for the previous time :(\n\nLast time I got the chouquette, which is a big, incredibly yummy cream puff. Highly recommend! Back again now and the apple tart is just as good!\n\nReally bright interior with lots of natural lighting. Definitely a great place to stop and have a nice chat."
    },
    {
        "id": 225,
        "text": "Lovely french café. Very simple and straightforward, which is great. Would definitely recommend to stop by on the way to one of the parks around. \n\nCovid: masks on, limited capacity to 2 people at a time"
    },
    {
        "id": 226,
        "text": "Very fast service. Cute coffee shop\nGood for a place to study or to come for a catch up/date - all the tables seem to fit two. \nThey offer an array of pastries for very decent prices like croissant for $3 - and your typical cafe drinks."
    },
    {
        "id": 227,
        "text": "I love this place. An authentic French bakery and coffee shop in the middle of Center City. Suffice to say, great croissants, good coffee and a wonderful atmosphere. My personal favorite is the smoked salmon on baguette with cream cheese and spinach. Love to sit outside and watch the world go by on a nice day. Très français!"
    },
    {
        "id": 228,
        "text": "J'aime kills it! Great pastries and awesome t-shirts! Will definitely go back anytime I'm in Philly."
    },
    {
        "id": 229,
        "text": "A great little spot for a proper coffee and pastry. The quiche lorraine was spot on, light and savory with a flaky crust and splitting a Nutella crepe topped it off nicely."
    },
    {
        "id": 230,
        "text": "Good spot for working. Wifi, reasonable plug situation, comfortable space, friendly staff."
    },
    {
        "id": 231,
        "text": "Came here with a friend at the time to get some pastries and coffee. The person working counter may have been new or was getting into the groove of things, but he mixed up a lot of our orders at first. My friend stated that she wanted our orders separate, but they were all included together. Then, the lemon tart I ordered was placed in her bag and not mine, so we ended up sorting that out ourselves. In fairness to him too, there seemed to be only two people working at the time.\n\nThe almond croissant was a-okay. Not the most amazing thing I've had, but certainly not the worst. Layers of butter and dough were there and the filling was quite nice, not sickly sweet. The lemon tart was also okay. Honestly I feel it's basically a lemon bar in a cute shape with some meringue piped in a circle that was torched on top. It was a scorcher of a day, and sounded the most refreshing at the time, but maybe I just ordered wrong.\n\nOverall, a nice little place to stop by if you're craving pastries, but I wouldn't say after my first visit it's a destination sort of place.\n\n3.5 stars"
    },
    {
        "id": 232,
        "text": "I really like Jaime, and I think it's the best bakery in town. Especially their almond croissant and chocolate puff are very delicious."
    },
    {
        "id": 233,
        "text": "When I had trouble choosing which pastries to share with a couple friends, I knew I'd be back at this elegant and quaint bakery shop. Even on a Sunday at 4pm, heart-shaped napoleons were just being placed onto the display case. The staff was friendly, and we were able to get refrigerated water in swing-top bottles, a nice touch. \n\nTasting notes:\nNapoleon-just enough custard cream in between lightly sugared, crisp puff pastry sheets\nParis Philadelphia-generous hazelnut cream that gushes upon first bite, with soft choux pastry topped with sliced almonds\nPain au chocolat-flaky and buttery with just enough chocolate folded in the layers to add flavor and texture\n\nTip: If you live in the area and find that you adore this place, definitely pick up a punch card-after 9 purchases, get a pastry, viennoiserie, or crepe for free!"
    },
    {
        "id": 234,
        "text": "Delicious pastries with great presentation, friendly service and cute interior! Have a variety of seasonal pastries as well. Would definitely recommend for a light breakfast place"
    },
    {
        "id": 235,
        "text": "The chocolate choquette is  a must have. Highly recommended! Also had the butter and ham sandwich. The baguette is of high quality!"
    },
    {
        "id": 236,
        "text": "Ambience. This is a bright cafe with huge windows, cute decor, and an open space. Sat down here on a Saturday to get some work and studying done, and I had the perfect table right by an outlet and next to a window. Was the perfect spot to spend a Saturday afternoon! \n\nThe latte I got was fantastic, and the barista was wonderful. I had originally asked for my drink in a mug, but he told me I could get an extra shot for the same price in a paper cup. I'm all for staff helping me get my extra caffeine boost. Definitely coming back soon try out some of their baked goods!"
    },
    {
        "id": 237,
        "text": "It's hard to write a review based on my one experience with a bakery. Ordered Buche de Noel desert for Christmas as Metropolitan bakery was sold out. Was really excited to order it and the owner was really nice. Cake was creamy and tasty but I was so underwhelmed with how unimpressively decorated the cake was ( my family was too). 6 measly cranberries which didn't even look like real sugared cranberries, no greenery etc. I've seen unprofessional cakes decorated better. When it's ordered for a holiday table it's especially disappointing. We got some croissants as well. They were pretty good but not as good as in the French bakery near me ( La Baguette Magique). I would be hesitant to order the cake for occasion again . However, I'd stop again for coffee and pastry if in the neighborhood and will update the review."
    },
    {
        "id": 238,
        "text": "Super cute place in Philadelphia. Picked up some pastries for breakfast. Place was very clean. Staff member was wearing a mask. Masks were not enforced for vaccinated customers. Croissants were $3/each which were amazingly delicious. So we're the raisin rolls. We also got the baguette which tasted gray as well. We literally wanted every item in there. I'm sure they also taste great!"
    },
    {
        "id": 239,
        "text": "Their bakeries are amazing not too sweet just nice. The atmosphere is pretty chill, suitable for people to do their work. The place is clean and neat. Workers are friendly and nice too. The price is reasonable not too pricey. First time coming here but I like it!"
    },
    {
        "id": 240,
        "text": "A very \"french-y\" bakery. Seems to be more emphasis on pastries than cakes since I didn't see many options on both days I had visited. Interesting comparison to Delice et Chocolat in Ardmore. Pastries seem delicate and elegantly made. I could only find such well made pastries mostly in Asian run/theme bakeries such as Paris Baguette or Hamada-ya. Pastries are flaky and yet not too greasy. Cream is velvety smooth and not too sweat. Savory quiche is creamy but not overwhelmingly heavy. Draft Lette has similar taste as cold brew and no sour after taste. Most people might find its deserts are on the \"lighter\" side, but it's a place I would love to visit again."
    },
    {
        "id": 241,
        "text": "Brilliant French pastries and excellent coffee! The modern, bright, cozy atmosphere offers a great place to work on your laptop. One of my favorite cafes in Philly. So glad it survived the quarantine. I only wish they would stay open later.\n\nOlive Oil Cake: 5/5\nAlmond Croissant: 5/5\nCaramel Crepe: 4/5\nFrench Jam Crepe: 3/5"
    },
    {
        "id": 242,
        "text": "I really enjoyed visiting this bakery! It was on a weekday, right before the store hours ended. It's a beautiful, quaint shop, with unique relaxing detail. The clerk was friendly and patient with me as I decided on what to get. Although the bakery was close to ending time, the pastries were still fresh and that makes all the difference! Happy to visit the bakery again!"
    },
    {
        "id": 243,
        "text": "This is honestly my favorite place in Philly. The pastries are TO. DIE. FOR. I lived in Paris for a short time and since then it's been so hard to find pastries that I'm not secretly judging but this place is the real deal !!! I've spent the last 5 years trying to find somewhere like this and it is amazing that I have just around the corner from where I work.\n\nThe atmosphere is so inviting, I want their designer to come decorate my house for me. A really beautiful place to sit and have a coffee. And it's always so clean which is important. \n\nThe staff is extremely professional and prompt. I have never had even the slightest issue, and I frequent this place throughout the week. The owner is so friendly - AND SUPER HOT. I mean he looks like he should be on The Bachelor or something. And his French accent doesn't hurt his case either. But besides that, he always makes time to speak with his customers and he's simply a ray of sunshine. \n\nOverall, 10/10 would recommend and do recommend to everyone I know. If you haven't been here yet, you are certainly missing out."
    },
    {
        "id": 244,
        "text": "I stopped in to get a couple of pastries as a treat for my family while I was visiting family in Philadelphia. \n\nThe girl at the counter accommodated my request for packing the pastries and was really friendly while ringing my purchases up. \n\nDefinitely going to bring my daughter next visit, she loved the desserts I brought home. Great cappuccino as well!"
    },
    {
        "id": 245,
        "text": "I was having French friends over for terrine de foie gras and cassoulet so I stopped at two Philly bakeries for pastry and baguettes. J'aime French Bakery has a great ambiance and the happy ghosts of the long gone Millenium Coffee (and Afterwords) that used to occupy the space.\nBright and cheerful, simple yet elegant - the visual appeal and feel is great.  I arrived early and my server was nice and cheerful, very helpful.  He seemed a bit chagrined when I purchased most of the stock that was set out - 3 each of: eclairs, pear tarts, orange tarts, blueberry tarts, 6 chocolate croissants, 4 sugar brioches, 3 chocolate brioches and two regular French baguettes.  It was too early for a few of the other items on the menu like the chocolate tartlet or the Paris Philadelphia.\nService was good and the pastries were overall pretty good and the baguettes were excellent.  One of our guests oversees the baking of croissants in France so he felt the chocolate croissant were a bit sloppy and as a baker of croissant and eclairs myself, I have to say I agreed.  They looked a bit hastily made but they tasted fine.  I still think that J'aime French Bakery was pretty good overall in spite of a few issues and so I still give them a 4."
    },
    {
        "id": 246,
        "text": "The whole thing is in the hands of amateurs. When I was in France, the pastries and coffee were totally heavenly. J'aime is not bad but not so different from any decent bakery in Philadelphia such as Metropolitan. There is a huge difference between the driven American artisans who tried so hard to master French baking vs. the French who are more exposed to its cuisine but not so well trained. \n\nIt's like I would rather drink technically well made Napa wine over mediocre French wine."
    },
    {
        "id": 247,
        "text": "Simply lovely.  Nice ambience, perfect pastries.  We visited every day of our 3 days in Philadelphia. Felt transported to France."
    },
    {
        "id": 248,
        "text": "I LOVE this place and have been here more than I should. Highly recommend the chocolate croissant (one of the best I've had outside of France), almond croissant, and the fruit tart. The madeleines are delicious as well. Everything is made fresh daily, and if you don't mind day-old pastries, you can buy a bag of yesterday's goodies for $3."
    },
    {
        "id": 249,
        "text": "The bakery is well-lit and decorated, a clean and feminine feel to the space. Great for working next to the windows, or for an afternoon get together with a friend. Not the place I would pick for high quality coffee, but their croque-en-bouche impressed me. Definitely an affordable French bakery!\n\nEspresso: on the bitter side, milk was oversteamed, chocolate seemed unsweetened (a nice change of pace from most mochas) \n\nMadeline: quite eggy and less buttery than I've had, but a nice homemade feel to it. \n\nCroque-en-bouche: light and fluffy, dough well cooked yet still moist, enjoyed the flaky sugar coating that nearly had a caramelized taste"
    },
    {
        "id": 250,
        "text": "Everything I have gotten here has been absolutely fantastic. It actually rivals some of the bakeries I visited in Montreal (maybe controversial words). I'm impressed that in a city not particularly known for its competitive viennoiserie, this place is French all around - from staff to its food, with attention to quality and executing the basics amazingly well.\n\nMy favorites have been the croissant and madeline, although it has been awhile since I have revisited. I'm glad I don't live nearby, because I'd make these items a daily part of my coffee routine. I think when they first opened, I filled an embarrassing number of punches in my punch card.\n\nThis place is worth supporting - you can see the hard work and thought put into executing their vision for a French bakery oasis, serving pastry striving to be as good as you'd get in French-speaking cities, among the hustle and bustle of Philly."
    },
    {
        "id": 251,
        "text": "As a french guy, this is my go to for french baked goods in Philly.\n\nClassic, and well executed paint au chocolat. \nLovely pastries all around.\n\nAnd some fun twist on some of the classics: Paris-Philadelphia (their version of the Paris-Brest)."
    },
    {
        "id": 252,
        "text": "yea this place is legit. would have to agree this is one of the best if not the best french bakery in the philly area. would venture to say quality-wise, on same level, probably better, than nyc commercialized french bakeries such as maison kayser. this is just a smaller operation with a personalized touch that you can taste and feel as soon as you step into this quaint bakery to the moment you devour all of the pastries they have to offer. you can even see the baker (himself?) in the back kitchen working diligently. \n\njust a glance at each of the individual pastries you can tell was conscientiously made and put together. it's the attention to detail on each piece, you can tell there is pride in the work, brings some nostalgia to how small patisseries used to operate. \n\na true gem, hidden to me until now. \n\nthings you have to try at least once- the apple croissant (best i've had) and the meringue fluffy dome thing (best i've had yet again, actually have never had anything like it but it is the perfect balance of fluff and crisp and chewy, you'll know what i mean on the first bite. my wife who doesn't really like meringue even was amazed. i guess it goes to show that sometimes you dont like a particular food until it's prepared the right way). \n\noh and the lemon meringue tart is delectable. of course the croissants are great. the fruit tart is perfectly balanced. all of their creams/fillings are perfectly on point. \n\nmy deepest compliments to the baker, and all the staff there including the  authentic french servers (always a good sign). \n\nper usual, i'm hesitant to post such reviews for fear that it will be discovered by the masses, but seems like they are already well on their way, and much deserved at that."
    },
    {
        "id": 253,
        "text": "This place was so aesthetically pleasing and bright and turned out to be a nice study spot for me and my friends. There are some tables but not too many so if you get lucky, grab a table and spend the afternoon there! \n\nI got a latte and a chocolate croissant which were both good but not spectacular. Overall I would come back and have an afternoon coffee and snack and get studying done or have a cute little coffee date here!"
    },
    {
        "id": 254,
        "text": "In my search for the best croissant in Philly, it was only natural for me to visit J'aime if not for the sole reason that it's exceptionally close to me. The shop is cute, bright, and has a good amount of indoor seating space, perfect for a coffee date or if you're looking for a place to study or get work done. For the budget conscious viennoiserie lover, they also sell bags of day old croissants (3 for $3).\nThe plain croissant is light, crisp, flaky, buttery, and has a decent crumb. The same can be said for the others. The almond croissant is interesting since it seems like the frangipane is rolled and baked in the croissant instead of being filled into a sliced open croissant, which gives it a different texture - not inherently a better or worse thing. The olive oil cake is rich and moist without reading as too dense on the palate (honestly surprised since it's pretty hefty and the oil seeps through the bag lol), though I'm not sure how I feel about the poppy seeds since they sometimes can be a little too crunchy/grainy.\nOverall, I think J'aime is worth checking out - the pastries are good, the decor is welcoming, and it's priced pretty on par with the other bakeries in the area."
    },
    {
        "id": 255,
        "text": "I had high hopes for this french bakery. It's cute for sure, but none of the pastries really moved me. I only tried the pastries and no coffee. I had the Lemon Pound Cake, Apple Turnover, Almond Croissant and Chocolate Croissant. \n\nThe pound cake was dry enough said. The Apple turnover was delicious, very good ratio of filling to pastry and the flakiness was outstanding. Both the chocolate and almond croissant were on the overcooked side and I've had much better. \n\nOverall:\nLemon Pound Cake 2/5\nApple Turnover 5/5\nChocolate Croissant 3/5\nAlmond Croissant 3/5"
    },
    {
        "id": 256,
        "text": "Amazing pastries and baked goods. Bought some to share with coworkers and we can't stop talking about their super freshly baked croissants!"
    },
    {
        "id": 257,
        "text": "This place is incredibly quaint, and the staff is super attentive and genuine. The food is fresh- I would recommend a crepe or an almond croissant!"
    },
    {
        "id": 258,
        "text": "Cute, quiet and quaint little bakery in Centre City.  Pastry nice and flaky, just wish they were bigger!  The blueberries were fresh and the coolness against the light pastry - devine!  Enjoy!"
    },
    {
        "id": 259,
        "text": "Super cute and chic ! I love the atmosphere! I've been here a couple of times and I've never been displeased ! Their coffee and little desserts and magnificent!"
    },
    {
        "id": 260,
        "text": "I had a complicated order.  :-) Since I live in Miami, I am used to drinking Cortaditos, which is no more than a double Espresso with a hint of milk. The barista was friendly enough to comply and my c coffee turn out great.  I pair my coffee with a a great tasting croissant. Can't ask for more!!!!"
    },
    {
        "id": 261,
        "text": "It was my first time trying this bakery and I loved the service I got. She was really thorough about explaining the most popular pastries and her own recommendations. I ended up getting the choux cream puff with nutella cream, and it was amazing! Definitely recommend."
    },
    {
        "id": 262,
        "text": "Was right around the corner from my hotel. Came for a quick pick me up drink in the morning before my exam prep class. Cappuccino was DELICIOUS. Came back later that day for another drink and the lemon tart because it was recommended by someone else. Haven't tried the tart yet (bringing it home to NJ!) but all of their pastries look fantastic!"
    },
    {
        "id": 263,
        "text": "Cute decor! We got the chocolate pretzel croissant, draft latte, and passion fruit iced tea"
    },
    {
        "id": 264,
        "text": "This place is so cute and the coffee tastes so good. It is very high quality coffee. I'd rate it a 6 out of 5 stars if I could. Very friendly atmosphere. Love it!"
    },
    {
        "id": 265,
        "text": "Love this place! I come here before work and everything is delicious!!! La Colombe coffee and fresh baguettes!! Yay!!"
    },
    {
        "id": 266,
        "text": "Super cute place, friendly staff and smells amazing! They offer dairy feee milks was well."
    },
    {
        "id": 267,
        "text": "We came here looking at the high ratings here on Yelp. The place is small with a few indoor tables, but it was super crowded. It seems the place is surely a local favorite. They offer a variety of croissants, pastries, and crepes. They offer nondairy milk with coffees, otherwise, I didn't find any vegan items here. We wanted to sit down but there were already people waiting in the line to grab a place, so we had to opt for take out. My family loved the pastries. Overall, it's a cool place, my bad, I totally forgot to click photos."
    },
    {
        "id": 268,
        "text": "A really good bakery! It has a nice and cozy, but modern atmosphere. The staff is also very friendly! When i went there I was pleasantly greeted w a display of desserts, and I would recommend the Paris Philadelphia! It's is good! It has almost a hazelnut taste while adorn w almonds!"
    },
    {
        "id": 269,
        "text": "Delicious croissants and sweets and good coffee. Pricey $$$. Wish there were croissant breakfast sandwiches."
    },
    {
        "id": 270,
        "text": "Great place to do work with outlets and good wifi. Good coffee from la Colombe and lots of pastry options. The staff are also very friendly and overall a great experience at the cafe"
    },
    {
        "id": 271,
        "text": "Best croissant in the US - plainly and simply true!!!\n\nNot only Philly is one of these US best kept secrets, now one may add this real French bakery, owned and run by a French national. \nAnd here is what you get - just the perfectly balanced croissant, which is even hard to find in Paris!!! Light and airy, super tasty. \nEverything else is equally great, not to mention the lovely personnel and the bright setting. \n\nPS: come and get your Bonne Maman jams over here too!!!"
    },
    {
        "id": 272,
        "text": "Great service and food. The wifi is fast for studying and has a lot of seating. The croissant was heated up and buttery. I also loved the draft latte"
    },
    {
        "id": 273,
        "text": "Delicious croissant and latte, my husband also really enjoyed his quiche and tea. The staff was friendly and the cafe looked comfortable to hang out in(after COVID of course) Would definitely return and recommend."
    },
    {
        "id": 274,
        "text": "I find this place as one of my favorite cafes in Philly with awesome latte and delicious croissants. I highly recommend coming to this place to work or study as well."
    },
    {
        "id": 275,
        "text": "My girlfriend and I stopped by J'aime the Saturday after it's opening. There was a short line formed which moved fairly quickly. The selection of parties are displayed on the counter, and it seemed as though some were starting to sell out (or at least another batch had to be baked). We ordered the Sugared Chouquette with Whipped Cream, Paris Philadelphia, a Mocha, and a Cappucino. The drinks were solid, and had a nice froth to them, but the real stars were the pastries. The texture of the cream was perfect, and both had just the right amount of sweetness.\n\nWhile the pastries are great, the prices can be a bit steep, especially for the chouquette. However, the service is friendly and the space is bright and clean.\n\nJ'aime is a well-executed French bakery with plenty of mouth-watering options, including some exceptional pastries."
    },
    {
        "id": 276,
        "text": "What an adorable bakery! I came here with a group of ladies after the 5k in Philly for Breast Cancer. We saw it from the outside and HAD to go in. There were so many appetizing options to chose from that were all french. \n\nWe were greeted by the baristas and they were delighted to help us out. Our order consisted of croissants, meringue cakes, apple turnovers, Madeline's,  and a few espressos. \n\nEverything was to die for and we will certainly be back. The employees were very helpful and they even encourage yelp discounts if you write a review."
    },
    {
        "id": 277,
        "text": "Fabulous bakery with kind and caring employees! I had pre-ordered a dozen chocolate croissants for Mother's Day and when I got to the bakery, they did not know what I was talking about. I was pretty upset, as I had specifically called before hand so I could be prepared. The employees apologized profusely and offered me a small box of free macaroons to enjoy while I waited the 20 minutes for the croissants to bake. The croissants were so delicious and the iced americano with oat milk was smooth and creamy, just the way I like it. I will definitely be back!"
    },
    {
        "id": 278,
        "text": "We found J'aime French Bakery by using the Yelp app, which guided us easily to their front door. My fiance and I stopped into J'aime French Bakery to grab a quick coffee. Boy, were we glad we did. The atmosphere was very inviting and the pastries looked delectable. There were many options to choose from in their pastry case. We tried the chocolate croissant, which was one of the best I have ever had. Just the right amount of flakiness and gooey chocolate. While I didn't try the coffee, my Fiance said it was tasty. Some of their pastries were on the pricer end ($10 for a sand dollar sized quiche) but I'm sure if it was as good as my croissant I wouldn't mind."
    },
    {
        "id": 279,
        "text": "This is a real gem in the neighborhood. Pastries and coffee are both spit on. Dining inside is super comfortable"
    },
    {
        "id": 280,
        "text": "What a lovely little place this is! The first thing we need to talk about is the decor of this place! It's cute and quaint and I could sit here all day. The lighting and airiness make it feel so cozy! Next, the iced Black and Tan is AH-MAZI G! Get the large because you'll be sad when the smaller one finishes! It's got a great consistency and really wakes you up! Finally, get one of their baked goods! There are tons of little treats to choose from and I aim to try them all at some point! The banana Nutella crepe is def a favorite for me and the tarts are fantastic! Get that bread literally!"
    },
    {
        "id": 281,
        "text": "Hubby and son wanted crepes for breakfast and when these two want something very specific, I have to oblige.  The crepes are amazing, I don't know how they can get them to be such an uniform color and texture, and make them so light!  We also tried the mushroom spinach quiche, pain au chocolat and some pastries.  The food is delightful and the coffee is awesome and strong.  I took off one star because of the fact that tables are not cleaned on a timely basis.  This is a high turnover place, with many customers choosing to stay and eat in, so someone really needs to keep an eye on the tables and as soon as one party leaves, wipe the table, especially these days.  Both mornings that we had breakfast here, I had to do so myself, thankfully, I always carry sanitizing wipes."
    },
    {
        "id": 282,
        "text": "I came here during outfest as I wanted coffee and this shop was in my face. When I walked in, the baristas were friendly. I ordered the Pure Black/Draft Latte mix which I was actually surprised that it tasted so good without the need to add any sugar or dairy. Bakery ambiance was nice too. Very cute"
    },
    {
        "id": 283,
        "text": "Cute store that is small dog friendly! Very chic interior with very friendly staff. They missed my sandwich order which was a bummer but other pastries were satisfying. The lemon tart was too sweet for me but the pastry on the Napoleon was super flaky and lovely and the blueberry galette was the perfect amount of sweet."
    },
    {
        "id": 284,
        "text": "Thinking about making J'aime my new spot for pastries in the morning whenever I need to stop by my office. Move over, Starbucks! \n\nThe entire place is appealing. I didn't really know what to expect when I got there, but I loved it. They had a sign displayed outside that stated only 2 customers were allowed in at a time and masks are required. \nInside, it was bright and airy, the music was soft and the pastries looked heavenly. J'aime also sells baguettes and other breads. The girls behind the counter who took care of us were such sweeties and offered to cut up a loaf of bread into slices for my friend who accompanied me. \n\nI got the lemon tartlet because for some odd reason I wasn't craving anything chocolatey. It sat in the refrigerator for most of the day because I wanted to ensure the merengue stayed in tact. When I got home, I cracked the box open and went to town! The lemon flavor was absolutely perfect. Not too tangy and not too sweet. The merengue was fluffy and melted in my mouth. Crust was buttery and flaky. There's no reason why someone would hate this thing. I noticed they have a berry tartlet available so that's next on my list to try. \n\nOverall, a VERY cute French bakery with several options for everyone! Definitely recommend J'aime for your morning cup of Joe and a delicious bakery item."
    },
    {
        "id": 285,
        "text": "Have you been looking for a fun place to enjoy a coffee and chat with a friend? Or a bright place to settle down and study or answer emails? Or even just a place to grab a quick pastry during those afternoon doldrums? Well look no further: J'aime French Bakery is the spot for you.\nThis small cafe/bakery on 12th street has some of the best french patisseries in town: ranging from fluffy and airy croissants, to perfectly filled eclairs, and buttery tartlets. I'm a sucker for chocolate croissants, and this place has the best ones I've found in Philadelphia. You can see and taste the separate layer of the pastry, and the outside has a perfect slightly crispy texture. The bittersweet chocolate inside is also delicious. If you're lucky enough to be at the bakery when they're baking a fresh batch, you can even score one hot out of the oven! I believe there are also some savory pastry options, but I have yet to try these. \nThey also have a variety of coffee options encompassing espresso drinks and la colombe drafts; you'll definitely find something to get your caffeine fix. \nThe ambiance is also something to note! The windows and white decor make the space very open and inviting. While some coffee shops feel cramped by copious tables and scarce light bulbs, this one feels comfortable and spacious. If you can get a table by the windows, you can even people-watch (one of my favorite activities)!\nOverall, going to J'aime is a delightful experience--both for the food and the atmosphere."
    },
    {
        "id": 286,
        "text": "I very much enjoyed this quaint place. It's very small and there are not a lot of seating options. If you're going to study or get work done, I'm not sure if they have outlets by the tables. But they are a great place to go to read a book or visit with friends. They have have wonderful coffee, macarons, and other sweet treats. It's very authentically French."
    },
    {
        "id": 287,
        "text": "This is one of my favorite spots in Philly now, purely because of the quality of the pastries. I ordered an almond croissant and small drip coffee, and my friend got the plain croissant and apple turnover. The almond croissant was amazing. At $3.25 it isn't cheap but certainly a good price for breakfast if you're a light eater. It is flaky on the outside, and on the inside it's so soft that it's difficult to discern one delicate layer from the next. It's also lined with a light almond paste and coated with roasted sliced almonds. Hands down the best croissant I've had outside of Europe. The drip coffee also wasn't bad, at $2.50 - I appreciated that they had almond milk in the sugar and creamers section."
    },
    {
        "id": 288,
        "text": "Highly recommend grabbing coffee and basically anything on the menu at this amazing bakery! The quiche Lorraine is addictive and I could've had a dozen chocolate croissants. Perfect place to stop for breakfast, a lunch meeting, an afternoon pick-me-up treat, or reconnecting with friends. I loved the atmosphere and the owner/pastry chef is incredibly talented!"
    },
    {
        "id": 289,
        "text": "I'd give this place 10 stars if I could. The customer service was over the top and the staff were so cheery and welcoming. You could tell they enjoy coming to work. The latte in the picture isn't from there but I got the smoked salmon with spinach on a baguette. The baguette itself was delicious, it felt like I was back in Paris all over again. I've been searching for smoked salmon on a baguette for years trying to recreate that experience when I was in Europe and this was by far the closest I've gotten. Everything was great quality.\nThe views are also great, it's nice having the buildings engulf your sight while you're eating. \nALSO! I left my drink there for some reason and I actually came back to get it and they had saved it for me!!! Like how sweet is that? And the owner was cracking jokes about it. Small stuff like that seems so insignificant but I swear it brightened up my day. Made my crazy life more bearable!! Best way to gain a returning customer. Be sure to check them our, you won't be disappointed!!"
    },
    {
        "id": 290,
        "text": "The prior reviews are right on. Absolutely one of the best croissants I've had. If you're a croissant lover, it's a must try."
    },
    {
        "id": 291,
        "text": "I went to get croissant for my son at 1:20pm and they were already out of almost everything. No plain croissant, no almond croissant, 4 or 5 other pastry pieces. Pathetic. Why were they even open?"
    },
    {
        "id": 292,
        "text": "Ve magnifique. Absolutely delightful. Chef brought out our food. Very authentic French pastries. Absolutely insane chocolate croissants. Awesome coffees. Great location. Eat in or on the go.love it and can't wait to go back."
    },
    {
        "id": 293,
        "text": "Absolutely Amazing!!! Although I was disappointed there wasn't any brioche prepared and available in the case - the Apple Tart and the Napoleon were outstanding! I expected the Apple pastry to be soft but it was actually sugared carmelized and it was so incredible! The Napoleon pastry was perfectly flaky with a beautiful creme! Finally - just a simple Caramel latte with added vanilla was FANTASTIC coffee! If I lived in Philly- I would be a regular no question! HIGHLY RECOMMEND!"
    },
    {
        "id": 294,
        "text": "Stopped by this cute bakery while in Philly. Pastries were delicious and the staff was helpful in finding me things that would stay good in a suitcase."
    },
    {
        "id": 295,
        "text": "I was walking down 12th St. and happened upon J'aime Bakery - I'd never been there before. I went in, and, since it was a French bakery, was going to have one of the croissants.  However, one pastry caught my attention - the chocolate pretzel. It's a croissant, shaped like a pretzel, with a smooth chocolate ganache running through it, and small baked almonds sprinkled on top. I bought one, left the store and began walking and eating the pastry. The light, buttery croissant, the velvety texture of the ganache and crunchy almond, stopped me in my tracks a few blocks away. I turned around.........and walked back for another (which I ate today)\nYou don't find pastry gems like this one very often...I'll be back soon!"
    },
    {
        "id": 296,
        "text": "This has been my favorite place to get coffee and pastry's in Philly since it opened 4 years ago. The staff is kind and welcoming (They go above and beyond). The owner is a brilliant pastry chief. The shop is beautiful, clean, and has wifi!\n\nThe pastry's are always fresh and the coffee is always hot. I cannot recommend J'aime enough!"
    },
    {
        "id": 297,
        "text": "This cafe has food options that are not listed but are on display, I tired to purchase a Quiche and an Iced Coffee and my total was mind blowingly $15... I had only brought $14 with me because no cafe I've ever been to for breakfast has cost close to that.  When I confessed I was a $1 short, they threw the quiche away... Over priced, I hope this place makes it.... no other coffee shop in this place has been able to."
    },
    {
        "id": 298,
        "text": "Recently discovered this bakery and it has the best pastries. Their chocolate pretzel is different from anything I've ever tried and in the best way! It is so so good! Their espresso drinks are also amazing. Make sure to come early before things start selling out!"
    },
    {
        "id": 299,
        "text": "Delicious pastries and coffee. Friendly service too! We visit whenever we are in town!"
    },
    {
        "id": 300,
        "text": "Located in the Gayborhood in Center City Philadelphia, J'aime French Bakery is a local joint that has some really delicious pastries! Here's what I got\n\nOrange Olive Bread: \nMoist and filled with delicious poppy seeds, this was the surprise of the trio of pastries we got. With a hint of citrus, it was balanced and delicious!\n\nLemon Tart: \nTopped with meringue peaks, the lemon tart was a little bit too sweet for my liking. The texture and presentation though were spot on!\n\nMerveilleux:\nCreamy, rich, and not too sweet, this meringue ball of joy was the highlight of our snack here. Yummy!\n\nI highly recommend coming here to check out this spot and experiencing the great vibes and pastries if you're ever in the area!"
    },
    {
        "id": 301,
        "text": "I returned and was less impressed. They seem to be running down their selection of very French Kusmi tea in favor of decidedly un-French Harney & Sons. I got a millefeuille, which they call also un-Frenchly call a Napoleon, and it had only one layer of custard between two thick layers of pastry sheets. In a true millefeuille, you are supposed to get a nice mixture of the pastry part and the custard part with each bite, but with this there was too much dry pastry in one part of my mouth while the custard was in another. For $5.50, it was a significant disappointment. I'll be sticking to Miel for my pastries from now on."
    },
    {
        "id": 302,
        "text": "Loved the service here! Best thing so far was the croissants! Cold brew was 7/10, but I would go back just because of the atmosphere!"
    },
    {
        "id": 303,
        "text": "Fresh, beautiful and delicious pastries! I bought a bunch of goodies for friends and I got a huge thumbs up and ear-to-ear grin from everyone!\n\nThe prices are very reasonable for the quality they offer. I bought 7 pastries (each of their croissants, a heart-shaped napoleon, an eclair and an orange tart) and a small latte for a little over $30.\n\nThe latte was good but nothing extraordinary compared to the bakery items.\n\nThe interior is honestly so beautiful. The simple yet sophisticated white-walled design is perfect. And they even put decorations for Christmas! A little effect place to catch up with friends! A nice place for brunch.\n\nWhy only 4 stars? Honestly the service wasn't amazing in my opinion. The cashier did her job but she wasn't that friendly. But she wasn't unfriendly either. No WiFi either :(\n\nWould come again!"
    },
    {
        "id": 304,
        "text": "Lovely! I love pastry shops in France! It is hard to find delicate pasties here. Ordered these through Uber Eats to serve on a private jet. Beautiful pastries that will please all! Each delicate pastry was as delicious as the next. Amazing flakey layers of delight! The cream filled items were a favorite, however, honestly everything was a favorite. If you can pick up a variety of the $6 pastries you won't be disappointed. If choosing only one, the light fluffy cream filled selections are extra special. \n\nI ordered one of just about everything on their \"pastry\" menu. Thank you so much for offering such a wide selection of beautiful French pastries."
    },
    {
        "id": 305,
        "text": "Great atmosphere! The pastries look delicious the second you walk in, really friendly staff :)"
    },
    {
        "id": 306,
        "text": "My favorite croissant in the city! Just perfectly executed, such a joy to eat. Everything I have had from Bastian's bakery is wonderful (although I don't have too much of a sweet tooth so I haven't tried the dessert-y sweet treats). Highly recommend the croissant, pain aux raisins, and almond croissant but I bet you can't go wrong across the board (the little quiches look particularly cute)."
    },
    {
        "id": 307,
        "text": "Oh.so.GOOD!! Everything about this place is fantastic. It's been on my list of places to visit and finally was able to stop it. \n\nChilly, rainy, fall day, what's not to like about a nice warm bakery? I got an almond cappuccino (soy & almond ate their dairy free options) and almond croissant. What really blew me away was that the filling WAS STILL WARM!! I debated buying more while we were sitting chatting in the bakery because it was SO GOOD! \n\nActually said to my friend, \"it's a good thing I don't live closer because I would be here way more often.\" So good. Will absolutely be back!"
    },
    {
        "id": 308,
        "text": "Super awesome and cute little shop. I appreciate they checked vaccinated status. The staff was extremely attentive and nice. They helped me pick out the right pastries for me. Would recommend and going back"
    },
    {
        "id": 309,
        "text": "I stopped by this lovely little bakery in Center City on my way to a friends house. I ordered an orange olive oil cake, chocolate pretzel croissant, and regular chocolate croissant. All were superb!! The olive oil cake was out of this world and I'm determined to try and recreate it in the near future. The pretzel croissant had an interesting crunchy topping and great texture in general. This place also serves La Colombe coffee which is my favorite coffee, as an avid tea drinker & occasional coffee drinker."
    },
    {
        "id": 310,
        "text": "Almond croissant, raisin pastry -so good - vanilla latte - delicious breakfast in a cute place. Quick and friendly service."
    },
    {
        "id": 311,
        "text": "Let me start this review off by saying, I'm still dreaming about the quiche I had for a late breakfast last week...\n\nI finally got a chance to check this place out and loved it! It is pretty darn cute! Very clean and chic, with floor to sealing windows at the front which bring in a lot of sunlight. \n\nAs soon as you walk in, you'll see some perfectly baked and beautifully arranged pastries - your eyes are sure to get a treat! Everything looks fantastic! I would normally go for a chocolatey pastry, but since it was my first bite of the day, I was feeling something savory... alas the quiche. I was informed that the quiche can go fast, so I wasn't going to risk not being able to try it!\n\nAfter one of the sweet staff members warmed it up for me like I asked, she brought it out to the table. Simply put: it was divine. The quiche was flakey and oh so tasty. It came with a side salad (fresh spinach and tomatoes with dressing), but to be honest, it was really hard to focus on the salad with that quiche on the side.\n\nI'm sure I'll be returning to J'aime again when I want to treat myself. I'm not sure what I'll get though. It would be difficult to pass up on that quiche, but I'm also very interested in trying one of their pastries. Perhaps I'll do a little indulging and get both? Who knows! All I know is, J'aime, I'm coming for ya!"
    },
    {
        "id": 312,
        "text": "Two words: lemon tart! Cannot say enough about this perfectly prepared treat. So yummy! As is all the pastries I've enjoyed at J'aime. Also the staff is fantastic. They know how to hustle and that is always appreciated. The place is very clean and staff always masked."
    },
    {
        "id": 313,
        "text": "Was looking for a treat and a good cup of coffee on a Sunday and was very excited to see that there's a new bakery in town. \n\nThe ambiance is very cute. Bright, clean, and new-- with a hint of industrial. Very inviting and nice to come in and sit. Airy and open. \n\nThe service was great- the barista was great about explaining different options and was extremely friendly. \n\nI enjoyed the 'black and tan' -- la Colombe iced black coffee with the la colombe draft latte (nitrogen foamed latte) on top -- makes for a very tasty, frothy drink. I also had the chouquette with Nutella cream -- YUM. Flaky, airy pastry with rich Nutella cream in the center. A perfect complement to the bitter coffee. \n\nOnly thing I can knock this place on is price-- two small coffees and the one pastry came out to $15, so it's more than I'd typically pay for something comparable. \n\nOverall, a great experience. Definitely recommend stopping in!"
    },
    {
        "id": 314,
        "text": "I'm so thrilled to discover this wonderful French  pastry!!!! As a dessert lover, I'm craving for a delicate pastry shop in Philly (where it is hard to find except the Korean Paris Baguette...). I'm soooooooo glad to discover this little place! The croissants are both crispy and soft at the same time. You can taste the delicate thoughts put into these bakery. Definitely will come more often!!"
    },
    {
        "id": 315,
        "text": "Came to Philly for the weekend, and stopped into this new French Bakery my friend told me about. Split a lemon tart and chocolate cream chouquette with my friend. We fought over the last piece of lemon tart, which had a ring of torched meringue around the edges. WOW! \n\nIt is styled after traditional French bakery, serving up delicious croissants and brioche with your coffee, tarts by 11am, and then quiches for lunch... I guess I'll have to stop by every hour, on the hour to try it ALL. Looking forward to this place blowing up!"
    },
    {
        "id": 316,
        "text": "Best croissants around! Truly authentic. Everything we have tried has been great.  Love this place!"
    },
    {
        "id": 317,
        "text": "I have to say, I'm not a fan of the decor. The clean white look can work in some situations, but I feel like it usually needs some warm wood tones to balance it out, and J'aime is lacking that. It's just pure white, and it seems very un-French and cold. However, the pastries are delicious and very French. I really wanted a millefeuille/Napoleon but they had none, so I tried a Paris Philadelphia, which was a rectangle of hazelnut chocolate delectability. I also had hot tea, but oddly, though they appear to sell loose-leaf, they served me a bag of not-whole-leaf tea. France was way ahead of the States with loose-leaf (it was where I learned to love it!), so I feel like J'aime should up their game. I also got a sourdough baguette to go; it was pretty good, but not worth going out of your way for. Come for the pâtisseries!"
    },
    {
        "id": 318,
        "text": "A slice of heaven! I couldn't believe this place was so close to my house and I've never been! Got the chocolate croissant, lemon tart, and eclair and they were all phenomenal!"
    },
    {
        "id": 319,
        "text": "Absolutely the place to go. Great coffee, wonderful quiches,  awesome lemon tart and all with great service and smiles."
    },
    {
        "id": 320,
        "text": "Authentic French bakery, a French owner & Baker, managed by an authentic stylish French lady with a French accent! It feels like France in there :) I love this place! \nThe space is an awesome transformation from the last cafe. All white, with a long white bar. Bold glass chandeliers, and lots of French charm.\nThe cases are filled with Nutella-whipped cream chouquettes, a Bouche de Noel, croissants, chausson au pommes (my fave) and pain Au chocolates. It's the real deal, authentic French pastries right here!!! The owner makes them all! \nI will be back very soon!"
    },
    {
        "id": 321,
        "text": "No idea how I'm the first to review this place. The pastries were delicious and they have draft La Colombo Coffee, what could be better? Not only was the food great, but it's also a beautiful space - from the high ceilings to the greenery. The only con is they ran out of croissants, but it only took waiting an extra 8 minutes for a hot one right from the oven. Definitely will be returning!"
    }
]