[
    {
        "id": 1,
        "text": "Most of these reviews are spot on- all except one, however. Wiccacco has been serving the locals for the past 15 + years, providing friendly and excellent service everytime I go. Their bbq chicken wrap, paninis, and breakfast platters are just some of the things that wawa does not have, setting itself apart from your typical convenience markets and other large chain food stores. Don't get me wrong, wawa is a solid choice, but stores like wiccacco help add flavor to our city!"
    },
    {
        "id": 2,
        "text": "Literally a few steps away from my house. Everything I need and more, plus friendly staff."
    },
    {
        "id": 3,
        "text": "I love Wiccaco market, especially Cecilia.  The TV showing neighborhood kids adds a wonderful touch and they always go the extra mile.  They special order items for me periodically and whenever I've asked if they could start carrying something, they always try.  They are so friendly, the place is clean and the selection is excellent.  Sunday hours would be great but not at the expense of the personalized feel to the place."
    },
    {
        "id": 4,
        "text": "What more could I ask for as my local convenience store?  The selection is amazing and the service is super friendly.  \n\nI do not agree with other reviews that this place should be the equivalent of wawa.  if you want wawa as your convenience store, then move to the suburbs where they are everywhere.  \n\ni do agree with 4 stars because they are closed on Sundays, although i do understand that they deserve a day off..."
    },
    {
        "id": 5,
        "text": "This stores prices are outrageous and extortionate! None of their items are priced and they just rip people off. Don't shop here unless you're absolutely desperate!!\nDreadful overpriced dump."
    },
    {
        "id": 6,
        "text": "Been here to this store few times.\nPlace very convenient, warm welcome, the store have a lot of stuff with a good price.\nThe deli is always fresh.\n\nLove this place.\n\nDefinitely coming back."
    },
    {
        "id": 7,
        "text": "It is so disappointing. It is so warm in there. The temperature is 80ﾟ and everything's going bad but you won't t know until you buy things and take them home they're already spoiled. The freezers are broken and smell. It could be so Much more in queen village"
    },
    {
        "id": 8,
        "text": "I love the Wiccaco Market.  I live around the corner and I think it deserves justice.  I will give it four, because it's not open on Sunday.  The hours are a little off, but coming from Las Vegas, where everything is open 24/7, I find that charming.\n\nThey have an incredible selection of groceries, deli meats and beverages.... the cheapest kombucha tea around!\n\nI love the owners... one day I came in, and they gave me some bananas for free! :)\n\nCecilia is great too..... she's so friendly and always has a nice little anecdote and a smile on her face.  Mom/Pop shops make the world go round."
    },
    {
        "id": 9,
        "text": "I go for the excellent breakfast sandwiches. They have a wide selection of bagels and will make your eggs to order. Day to day consistency is excellent. They also offer to receive UPS packages which is a great service to the neighborhood. Great store!"
    },
    {
        "id": 10,
        "text": "I am so glad to have discovered this store during the pandemic. I might have overlooked them otherwise. The store is well stocked with food and sundries. For example, have you been unable to get flour or yeast at the supermarket?  They're here. All the prices are quite reasonable (remember, this is a CONVENIENCE store,  so while prices could be higher for some items compared to the bigger stores, we find them reasonable). In some cases, their prices were LOWER than bigger stores (e.g. Progresso brand soups, oddly enough). \nThe store is very clean, so you feel safe going there in that regard.\nLet me say that when I discussed this review with my wife, she advised me that there was no reason NOT to give the store 5 stars. Price, cleanliness, selection, good hours... they hit all the right buttons. This is a local resource that should be patronized sufficiently ti keep them in business."
    },
    {
        "id": 11,
        "text": "I really love Wiccaco. I tend to stop in before work for a breakfast sandwich at least once a week. I love their snack and drink selection too. I like weird beverages and they have so many to try.  I've also had other sandwiches from the deli and they've all been really good. In a pinch, I can get just about anything I need there. (cat food, laundry detergent, fresh fruit, and so on)\n\nIt's a bit nicer and more well stocked than the average corner store without being like wawa, which is nice. Everyone that I've interacted with that works there has always always been really nice."
    },
    {
        "id": 12,
        "text": "It is convenient for me though it's a little on the pricey side. But i mainly give it only 3 stars is because I bought a lemonade in a glass bottle and they gave me a bag with a hole in it. As I was walking home, it fell out and shattered\nand yes, i tried to get a refund or another lemonade...\n they wouldn't give me either one,\nalso, i was out of money because i'm only 12"
    },
    {
        "id": 13,
        "text": "The place is really rather run down looking on the outside so I wasn't expecting much,  but on the inside they have actually a decent selection of products. As others have mentioned, it's a bit pricey but not more pricey than you get at any corner market to be perfectly frank. It's not where anyone would go to do their regular grocery shopping but if you need a snack or some quick items, it's a great option."
    },
    {
        "id": 14,
        "text": "Still a great store but note they have changed their name to Guavaberry Food + Drinks. Nothing else has changed."
    }
]