[
    {
        "id": 1,
        "text": "I honestly didn't know this place existed until my friend suggested it for brunch over the weekend. I can't believe I live four blocks away and haven't been here before! I ordered the honeybee crepe and an almond croissant. I'm one to typically bring leftovers home but the food was so delicious there was nothing left to take much to the surprise of my friends. There is a small seating area downstairs and some window seating on the first floor. I'd recommend getting there on the earlier side if you're with a group and want to sit. I'd also recommend this for smaller groups. Will definitely be going back."
    },
    {
        "id": 2,
        "text": "All the crepes I've tried are fantastic. The coffee is very good, though I wish they had larger sizes available. Looks tiny from the outside there is comfortable seating in the basement."
    },
    {
        "id": 3,
        "text": "I never knew this place was here.  \nA comfortable, clean environment with seating downstairs.\nI always prefer savory vs sweet so I ordered the Norwegian Crepe and it was so good and filling.  I would love to go back there and try all their other options... and maybe share a sweet one for dessert"
    },
    {
        "id": 4,
        "text": "Amazing new find! Small cute cafe with VERY reasonable prices for delicious food. I tried the egg on Gouda crepe with bacon which was delicious and well stuffed. I just wish the Gouda taste was a bit stronger and that there was some type of sauce to go with it. The caramel ricotta crepe was DELICIOUS and very well prepared. I'll definitely be coming back to try the rest of their menu!"
    },
    {
        "id": 5,
        "text": "This place is a favourite of mine in the Fairmount/Francisville/Temple area. Got the turkey goat cheese baguette sandwich and the lady had the Philly baguette sandwich (lox and cream cheese w/ tomato). Food was delicious. Iced tea and iced chai latte were both amazing as well. Cute outdoor seating. Everything was super clean and tidy and the staff was super friendly. Highly recommended for a late breakfast or light lunch"
    },
    {
        "id": 6,
        "text": "I love to explore local small businesses and this one was a great find. It's a very nice small cozy and super clean neighborhood coffee and crepe restaurant. Staff is very friendly and their crepes are amazing. I tried the Honey bee which was good with mochachino. The prices are pretty affordable. It wasn't super busy on a Saturday morning."
    },
    {
        "id": 7,
        "text": "Nice, small breakfast place run by a husband and wife who make tasty crepes for affordable prices. Pretty small menu but the crepes are worth a trip there."
    },
    {
        "id": 8,
        "text": "Again I can't say enough about this place. Just split the phili (salmon, cram cheese and spinich) and honeybee. And the mochacino. Food is so good here and staff are great as well. Can't wait to visit again."
    },
    {
        "id": 9,
        "text": "Crepes were fabulous! The location is slightly odd, but I guess that is the nature of Philly. Caramel Latte was delicious and a very good bang for your buck. They also serve juices from Rijuice which were very refreshing. I would recommend this to any Philly new comer."
    },
    {
        "id": 10,
        "text": "I love the atmosphere and set up, it is very modern and calming. I also thought the omelet was good value, large quantity and good quality."
    },
    {
        "id": 11,
        "text": "I don't know how it took me so long to visit this place. It's right in my neighborhood and it's AMAZING. I HIGHLY recommend to crepe lovers or newbies. They have so many options and everything we tried was delicious. I've been craving it since our last visit. And it's very affordable for a very large and filling crepe. Also they are great with customizing so really you can have whatever you want and it's delicious. Even if you're not in the area I would go! Heads up that there is seating downstairs but not a ton, so may not be great for large groups."
    },
    {
        "id": 12,
        "text": "My wife and I drive all the way from Germantown here. It's our favorite coffee spot in the city.  Coffee is good and the food is always great. (Honeybee is my favorite).  The staff is also welcoming and efficient."
    },
    {
        "id": 13,
        "text": "This place is amazing. Food is amazing. Decorations are amazing. Staff is very friendly.\nI ordered the Americano omelet and Nutella crepe. Both were crazy good."
    },
    {
        "id": 14,
        "text": "Came with a friend to do some studying on a Saturday morning. We ordered two chai lattes and sat right by the large window at the front, which lets in a lot of natural sunlight. There's seating at the front and also more downstairs so it's a great spot to bring a laptop and do some work (plus the staff were very sweet as well). \n\nThe latte was made from the purple Oregon liquid chai mix (which a ton of people use). It's a little too sweet for me so next time I'll probably just go with a tea."
    },
    {
        "id": 15,
        "text": "Amazing crepes!! Very thin so I wasn't expecting it to be filling but it was! The atmosphere is very casual, more like a coffee shop than a restaurant. You can see people studying on the bottom floor. I would recommend this place to everyone!!"
    },
    {
        "id": 16,
        "text": "Best coffee in the city! The staff is super friendly, the food is amazing! Great prices and relax environment!"
    },
    {
        "id": 17,
        "text": "Delicious food & coffee!!! Awesome selection. We had the Honey Bee Crepe & the Goat Bacon crepe to eat. I'd highly recommend both of them. I also got the Mochacchino (hot) and it did not disappoint.\n\nWe will definitely be back!"
    },
    {
        "id": 18,
        "text": "Pretty good breakfast/brunch place.  Honeybee Crepe was a great, balanced, sweet-savory treat -- if maybe a little too carb-y (crepe was pretty thick).  I also would have liked a side salad with that.  I stole my partner's and it was fresh and good.  I ordered a cortado and received something more similar to a latte -- espresso-milk ratio was too milk-heavy.  The space is nice, but was very smoky both upstairs and downstairs.  Don't come here if you have asthma?\n\nOverall, a friendly, cozy place with good food.  Crepes (and omelettes) are pretty massive, so if i come back i'll likely get something to split."
    },
    {
        "id": 19,
        "text": "I live around the corner from here and it has become my go to place for myself and guests.  I have had many of the items on the menu (both sweet and savory) and have not been disappointed.  The staff is friendly and the service is efficient.  The coffee is hot and specialty drinks are well made.  There is limited seating on the first floor and outside, and also seating upstairs.  I will continue to come here!"
    },
    {
        "id": 20,
        "text": "Delicious coffee and crepes for breakfast, brunch or lunch. I had the bacon goat cheese and tomato crepe and it was great. It's a nice quiet off the beaten path spot. Limited seating inside with a couple of tables outside. I Would definitely recommend."
    },
    {
        "id": 21,
        "text": "This place is the BEST coffee I've ever had (and it's so cheap!). They use La Colombe, a local Philly favorite. The experience is only heightened by the absolute adorable decor, spacious and welcoming downstairs, and beyond kind owners. The couple is so sincere and continually ask customers what they could do to improve. In my eyes, NOTHING! The coffee, the huge egg sandwiches, the crepes, everything.. pure perfection. Worth going to once and continually going to!"
    },
    {
        "id": 22,
        "text": "The best Macadamia nut latte I've ever had!!!  The cap on savory crepe is da bomb! Mushrooms, avocado, and spinach"
    },
    {
        "id": 23,
        "text": "Nice little cafe in an area that absolutely needed one. I had a honey ham sandwich on a bagette which came with a generous salad on the side. The iced coffee comes with a shot of espresso in it since the owner thinks iced coffee doesn't have enough flavor. Not gonna argue with more caffeine. Lunch came to about 10 bucks which was more than reasonable for what I got. The staff was friendly as well. Will be back for crepes next time."
    },
    {
        "id": 24,
        "text": "Good coffee, great atmosphere, excellent service, this place is a hidden gem. Found my new go to coffee shop."
    },
    {
        "id": 25,
        "text": "I almost hesitated to review this because I don't want it to become mainstream. Fortunately, it's out of the way enough so that it probably won't be.\n\nThis place is beautiful. Amazing coffee, really sweet owners, scandinavian aesthetic, small, quiet, and sort of an oasis in an otherwise coffee desert. Everything is super well-priced. A savory crepe and a massive cup of coffee and a nice place to read a book on a Saturday morning costs me about $10.\n\nI've gotten the honeybee crepe (mozzarella, spinach, egg, honey drizzled on top) and the goat bacon (goat cheese, bacon, mushrooms, tomato) and both were delicious and very fresh. Thanks for existing, guys."
    },
    {
        "id": 26,
        "text": "The barista accidentally poisoned me by putting milk instead of soy in my latte, but I've forgiven them. Really enjoyed my goat bacon crepe and my husband's omelet. Parking is easy. Will return (but won't order a latte)."
    },
    {
        "id": 27,
        "text": "The front of the business is barely noticeable, but it is worth finding. The iced coffee and giant chocolate chip cookie I got were amazing! The prices are very reasonable, and they take cards!\n\nThe basement has a very large seating area. It is easy to relax without feeling cramped like most cafes. The menu seems to have a good selection of sandwiches, cramped, and other items I hope to try soon!"
    },
    {
        "id": 28,
        "text": "The closest to a traditional French crepe I've had do far in Philly. We went there for brunch and ordered the Egg On crepe and Salmon crepe. The Egg On crepe was delicious. The salmon one on the other hand was a bit too heavy on the spinach, which made the crepe soggy. Their coffee is good if you like it strong and a bit bitter. The place is very cute. There's few extra sitting in the basement, if you want to dine in."
    },
    {
        "id": 29,
        "text": "What an amazing place.  The crepes are amazing and as was said by many reviewers, the honeybee crepe is something you must try.  The atmosphere is nice and relaxing with friendly staff.\nThis place is pretty hidden away and in a really random spot, but it's worth it no matter your travel.  If you're eating in be sure to check the downstairs to ensure there's room, it's small but very cozy.  I couldn't recommend this place more."
    },
    {
        "id": 30,
        "text": "I'm so happy I found this cafe near my new job. The coffee is always fresh and delicious, the crepes are just amazing, and the service is fast and friendly. I'm quickly becoming a regular. Iced hazelnut latte all day every day!"
    },
    {
        "id": 31,
        "text": "Very cute place. 3.5. Nice variety of sweet and savory crepes. If you eat in, you order upstairs and they bring you your food to your table at a more spacious downstairs eating area."
    },
    {
        "id": 32,
        "text": "I had the Nutella crepe with Strawberries and a Mochachinno. Both were fantastic! I will definitely come back next time I'm in Philly."
    },
    {
        "id": 33,
        "text": "A few weeks ago, I walked over to meet my wife at the school where she works for an after school event.  I walked past Vineyards Cafe and did a double-take at the inviting, Nordic-like interior.  But I was running late and did not get to try it.  Then, the holidays came and I had to file Vineyards Cafe away...until yesterday.\n\nThe interior is clean and beautifully lit.  It makes for an inviting space to enjoy breakfast.  The owners are welcoming and friendly.  The menu small but more than sufficient.  The coffee (La Coloumbe) was excellent, crisp and fresh.  I ordered an egg sandwich with cheese and opted for the French Baguette (you can have it on a bagel as well).\n\nMy breakfast was a fantastic start to 2016, particularly on this first, cold day of work of the year.  The bread was excellent.  My eggs were cooked to perfection.  The cheese was melty and plentiful (perhaps a little too much cheese but I'll never really utter those words again).  There is a water station that looked thirst-quenching and extremely well-kept.\n\nIf I could, I'd park myself in the beautiful downstairs every day to work and eat.  Thanks, Vineyards Cafe for making my day and getting my 2016 off to a smooth start.  Buen provecho, Yelpers."
    },
    {
        "id": 34,
        "text": "Everything here was perfect. The crepes were to die for and the iced latte was some of the best coffee I have had. Great seating area downstairs and extremely cozy. Will be coming back next time I am in Philadelphia."
    },
    {
        "id": 35,
        "text": "Visiting Philly with my daughter last week. Met her friend and family here for brunch. Delicious, fast, and cool ambience. Very reasonably priced for Philly too."
    },
    {
        "id": 36,
        "text": "I am a HUGE fan of this place.  Orest and his wife (the owners) are genuinely nice people and the other employees are fantastic. They accommodate any menu tweaks i've asked for and they do everything in their power to make sure you are satisfied. All of the food I have had is well worth the cost (fairly average prices in my opinion)- they serve very generous portions!  The location is great since there is not many other spots like this in the area and the layout and design of the cafe is awesome. I recommend this place for anyone looking for a new breakfast/brunch/coffee go-to!"
    },
    {
        "id": 37,
        "text": "Legendary crepes and quick service. I just wish there was a bit more seating and space, especially outdoors. My friends and I came for Sunday brunch and we huddled around a tiny table outside."
    },
    {
        "id": 38,
        "text": "Excellent mochaccino and cutest design! Peaceful here and great for a breakfast or beginning to your weekend morning! Great service as well- would definitely come back!"
    },
    {
        "id": 39,
        "text": "Love the food here, everything seems fresh and clean. Service is polite and friendly. Just everything you want in a little breakfast place."
    },
    {
        "id": 40,
        "text": "This place is very good - 4.5 stars if I could. The crepes are delicious and affordable and the shop is designed a way that just makes you want to spend time there. If you're in the neighborhood or are just craving some crepes, this is the place to go!"
    },
    {
        "id": 41,
        "text": "Best coffee and crepes in the area. I will often take a visiting friend here for breakfast, or come by myself on the weekends. Crepes are awesome, love the norwegian crepe. Also a fan of a baguette with jam and butter, they usually have a few jam selections that are interesting. Staff is really friendly, owner is usually there and he's nice. Also a highlight - they have a constant tap of infused water for customers!! Cute."
    },
    {
        "id": 42,
        "text": "Was looking for a place to grab breakfast and I knew this place was the one. Coming into the shop it was very clean and such a cute comfy spot! I ordered a latte and an American cheese omelette with spinach which came with a salad and a side of balsamic vinegar. I was super content with the whole plate. The omelette was well made and big and the salad was a very good portion. The latte was stronger than other lattes I usually have, but it was good! Overall I had a really experience here and left with a happy fully stomach!"
    },
    {
        "id": 43,
        "text": "A sweet little spot for brunch. Small but super clean. The seated area is downstairs. \n\nDelightful crepes.  Goat cheese and figs: one of my fav combinations. My husband loved his ham on a baguette. Hot chocolate  was JUST sweet enough, not sickeningly sweet. \n\nEfficient, friendly service. \n\nWe will be back!"
    },
    {
        "id": 44,
        "text": "Vineyards Cafe is a cute little place for breakfast or brunch.  There are seats downstairs to relax and hang out.  And very clean.  I ordered two crepes for myself to try a savory and sweet crepe.  The Norwegian crepe had a decent amount of salmon, avocado and goat cheese filling.  And was a good portion.  I would like to have it again.  The Au Sucre crepe was like my dessert.  Plain but pleasant as I got a good sense for the batter they use.  This dish would be good for the kids.  And the perfect price for what I ordered.  I would like to come again and try something new."
    },
    {
        "id": 45,
        "text": "Fantastic little cafe hidden in an upcoming neighborhood nice outdoor seating reminds me of a cafe on Montmartre in Paris a must visit there coffees are amazing and food just delicious"
    },
    {
        "id": 46,
        "text": "What an awesome place close to home friendly staff very comfortable the food was great 5 stars all the way."
    },
    {
        "id": 47,
        "text": "So happy I visited and I cannot wait to get back. Beautiful building inside and out, pleasant and kind staff, and delicious savory crepes! I can't recommend Vineyards highly enough."
    },
    {
        "id": 48,
        "text": "One of the best chai lattes (hot or iced). Innovative and basic crepes. Ninja fast service. Relaxing neighborhood atmosphere."
    },
    {
        "id": 49,
        "text": "Came up to Philly for the weekend and we wanted something quick to put in our bellies before the Sunday morning drive...also we love crepes. \n\nThis is a cute little unassuming place. (I would have missed it completely if it wasn't for the \"open\" sign.) When you enter, whether you want your meal to stay or go, you must order and pay upstairs. I went with the Norwegian (goat cheese, salmon and avocado) while my fiancé went with the Goat Turkey (goat cheese, turkey, fig spread). I also ordered the blood orange pear tea and he got the lime mint wellness. The prices were quite reasonable, even with 15% tip everything came up to~$25. \nYou have to wait upstairs for your tea as they will bring the food to where you are seated but not the tea. We waited then took our cups downstairs. \n\nThere aren't a ton of tables downstairs (or upstairs). About 2-3 two person tables and maybe 2 four person tables...were also 2 armchairs near a low table. It is quite intimate and closed in. There were a lot of what looked to be Temple college students and the place did seem to have that chill atmosphere that students would gravitate toward.  \n\nWe didn't have to wait too long for our crepes. They were QUITE filling, you only need one at a time! The Norwegian was ok, there was way too much goat cheese for me and it seemed to overpower everything. The Goat turkey was amazing, loved the fig spread, it added some balance. The herbal teas were also enjoyable (I recommend adding a sugar cube to the blood orange pear to really bring out the blood orange flavor). \n\nI enjoyed the nice touches like the lemon-cucumber ice water stations (one upstairs and one downstairs). Very refreshing. \nThere was single gender neutral, differently abled friendly bathroom upstairs. The staff was extremely friendly and helpful. I would definitely like to come back to try the sweet crepes."
    },
    {
        "id": 50,
        "text": "Cute find. Def a local spot the pricing is amazing ! The food is fresh and not processed. It looks kinda small from the front but go downstairs and there is room to accommodate a good sized group. This would also be a nice place to study or just stop and grab a coffee or smoothie"
    },
    {
        "id": 51,
        "text": "Wow I never knew crepes could taste sooo good! LOVE this place! new favorite!! The strawberry au sucre was absolutely on point. It melted in my mouth lol. Their savory crepes taste amazing and are quite filling as well."
    },
    {
        "id": 52,
        "text": "Delicious HUGE lattes, which is perfect if you're here to write a paper like I was. I had the Egg On crepe, which was delicious (add fig spread, just  FYI!) and fruit infused water. I noticed previous comments mentioned a lack of outlets, but there seem to be more now...some by the soft  chairs and some underneath the bench seating by the tables. I will definitely come here often!"
    },
    {
        "id": 53,
        "text": "Vineyards is my go-to cafe around N Broad/Fairmount. The owners are great people; kind and friendly. The food is excellent, especially the crepes.\n\nI also recommend the omelettes. They are HUGE, and come with greens on the side, a nice touch. The crepes are also stuffed with goodness.\n\nThe coffee's great too, as are the bagels. Their speciality drinks are also good. If it's a nice day the outdoor seating provides great views of the Center City skyline. It's affordable too! What's not to love?"
    },
    {
        "id": 54,
        "text": "Great little spot for coffee and breakfast. Bright and roomy, with a quaint feel. Bright pine everywhere, and a very welcoming downstairs seating area. The Americano Omlette was delicious and the owners are very friendly. Come in for coffee to go or food downstairs, but you'll enjoy it. \n\nThere are plenty of outlets downstairs with large tables to get your work done as well."
    },
    {
        "id": 55,
        "text": "This place has most delicious crepes in Philly!!! Love there Philly crepe, Caramel Ricotta crepe and La Colombe coffee!! Love love love!!!"
    },
    {
        "id": 56,
        "text": "Such a great, simple and delicious place! Definitely give this place a try, you won't be disappointed. La Colombe coffee and great food is a winning combination!"
    },
    {
        "id": 57,
        "text": "Unforgettable flavor combinations! Have visited at least 5 times so far and have tried the Honeybee and Nutella crepes as well. However, the GOAT BACON is king. I wasn't thrilled when my wife ordered a savory crepe (as I had previously associated crepes with dessert). One bite and my eyes were opened. Delicious thick cuts of bacon tossed with mushrooms, balanced with acidic grilled cherry tomatoes, melded with goat cheese. Not your average crepe ingredients, but this menu item has brought us back repeatedly. As a matter of fact, I could go for one right now..."
    },
    {
        "id": 58,
        "text": "What a pleasant treat! I picked my daughter up from Temple and took her here for brunch on a Sunday. Great menu for meat lovers like myself and vegetarians like my daughter. Would definitely go back here again and highly recommend."
    },
    {
        "id": 59,
        "text": "Terrific, cozy neighborhood cafe that looks very unassuming but has much to offer. The coffee is from la Colombe, so you know it's good, and the food is desirable as well. The menu is rather expansive for the size of the shop and they manage to do everything well from the sandwiches to the crepes. I highly recommend checking it out. Don't forget to check out the extra seating in the basement, but the outdoor seating is just perfect for the season!"
    },
    {
        "id": 60,
        "text": "Vineyard is by far our favorite café! My boyfriend and I go every single weekend. The staff is welcoming and friendly and the food is always great. Love love love the coffee as well. Our normal order is: the Americano omelette (goat cheese instead of Gouda and add avocado) and we get the omelette on an everything bagel... plus the Caramel Ricotta crepe with apples (or bananas). Splitting both gives us savory and sweet perfection. The best!!!"
    },
    {
        "id": 61,
        "text": "My husband and I LOVE going to Vineyards for breakfast or a quick coffee date. Anytime we have family in town, we take them here too. The couple that runs the cafe is wonderful and the coffee and food is phenomenal!!! Super relaxed atmosphere and prefect location!! So excited they're in our up and coming area!!!"
    },
    {
        "id": 62,
        "text": "Crepes!!! That's all i need to say but i'll say more. Nice little place. There is a down stairs so dont worry if you see that there might not be any room for you and your friends. The downstairs is really nice actually. Comfortable chairs and charming little set up. I had the Americano crepe. Gouda, eggs and bacon. Perfect! With some pellegrino to wash it down. Great breakfast for only $10! You can get a crepe for as low as $3:50! So if you're on a budget and want a nice meal. No question, Vineyards is the spot!"
    },
    {
        "id": 63,
        "text": "Excellent coffee, hot chocolates, and bagels!! Love this spot. The owners are so nice!! I can't wait to try their crepes!"
    },
    {
        "id": 64,
        "text": "This place is the best! Wonderful service, delicious food that's reasonably priced, great coffee and tea, and a lovely ambience (particularly relaxing music). These guys always think of the tiny details (cold fruit water, proper coffee cups instead of takeout, fresh decor and a warm welcome), and it makes lunch at the Vineyards a pleasure every time. Highly recommended."
    },
    {
        "id": 65,
        "text": "Good coffee and nice staff! The seating area for doing work is great."
    },
    {
        "id": 66,
        "text": "Vineyard café such a cute hole in the wall! We almost missed it driving by. We walked in and all the women behind the counter were very kind and welcoming. I ordered the maple ham which was delicious and the coffee (latte) on point  I'm not a fan of salad but I had a taste and it was so flavorful. There is a bar and stools entering the Café with seating downstairs. Such a cute and soothing vibe it gives. This would definitely be my spot if I lived in the area."
    },
    {
        "id": 67,
        "text": "This place is great. The coffee is great, the crepes with a large variety of savory and sweet are delicious and the service is sensational. The shop is very inviting; Orest and his wife (shop owners) are super friendly. We were very surprised to learn that there was additional seating in the basement area which was very comfortable and nicely decorated.  If you're in neighborhood stop by and if you live a distance away it is with the trip!"
    },
    {
        "id": 68,
        "text": "great coffee, great food, and a great staff. I usually get their lattes or cappucinos. Everything Bagel was also very good and huge!"
    },
    {
        "id": 69,
        "text": "Outstanding! where do I start..\nmochacino is tge best I ever had anywhere. the honeybee crepe was fantastic.one of the best I have ever had no kiding.  veggie omelet was fresh and tasty. next time I might switch the goat cheese with mozzarella or ricotta. strawberry nutella was also good, but honeybee was just anazing.  best of all price was very reasonable and service was excellent."
    },
    {
        "id": 70,
        "text": "Everyone one the menu is beautiful and delicious. The atmosphere of the cafe is wonderful. The earthy tones in the lower section is a hidden gem. Perfect place to relax and enjoy your meal. It's hard to leave once you get comfortable."
    },
    {
        "id": 71,
        "text": "A delightful place to eat lunch. The food and the hospitality were wonderful! Thank you Yelp for finding us a perfect place. =)"
    },
    {
        "id": 72,
        "text": "The crepes here are the best!!! The service however sucks!! I live down the block from the cafe and order here quite often. 4 out of 5 times the lady who answers the phone always picks up and hangs up on you. Once I didn't have a menu so asked what the bacon crepes were and she hung up on me mid order.\nA friend wanted to build her own crepe with \"Nutella and bacon\" and the lady at the counter looked at her like she had 2 heads."
    },
    {
        "id": 73,
        "text": "The crepes are amazing! Very fluffy and flavorful. They have really great iced coffee as well."
    },
    {
        "id": 74,
        "text": "Charming bright place, wonderful & attentive staff, & fabulous crepes & eggs. Great espresso drinks too! Excellent breakfast choice. So happy!"
    },
    {
        "id": 75,
        "text": "What a secret gem! Go here if you love crepes! I ordered two of them and ate both without regret :)"
    },
    {
        "id": 76,
        "text": "Dang yo this place is Poppin they have delicious treats and slamming coffee, do yourself a favor and go here"
    },
    {
        "id": 77,
        "text": "This place was the cutest find and the perfect way to start my day trip in Philly. The atmosphere is so cozy and inviting, and the staff was very friendly and helpful. Myself and one other person shared 2 crepes, an iced coffee, and a side of bacon, all DELICIOUS. We had the honeybee and the apricot comfiture. While I'm not a fan of cheese or eggs, the honeybee seemed to be such unique mix of tastes so we decided to try it, and I was pleasantly surprised. The apricot was also a delicious choice, and the mix of one savory and one sweet flavor were a nice blend. They also offer fruit infused water as a courtesy, which was a very sweet touch. Overall I was glad I found this gem, and I would certainly recommend it."
    },
    {
        "id": 78,
        "text": "Excellent food, atmosphere, and service.  The omelette on a baguette was AMAZING"
    },
    {
        "id": 79,
        "text": "Coffee and food were delicious. Pesto crepe and veg omelette were both awesome! A unique breakfast menu and a great little corner spot with friendly staff. Nicely decorated with indoor and outdoor seating. Walked a mile to get here after I saw the Yelp reviews- well worth it!"
    },
    {
        "id": 80,
        "text": "A great neighborhood cafe! I especially love the outdoor seating so I can hangout with my dog."
    },
    {
        "id": 81,
        "text": "Best cafe just opened up in the area. Crepes are the best of the best,  they have water filled with strawberry with mints inside which makes it really tasty for this hot summer. Downstairs sitting for those that need wifi to do business. Orest the owner with the stuff behind the kitchen are very accommodating on how u want ur crepes and coffee done. Try it this place you will not be disappointing. Highly recommend it."
    },
    {
        "id": 82,
        "text": "Went here today for a quick lunch. Place is bright with nice woodwork, service was friendly. I felt I had to get a crepe and glad I did. I had the Honeybee and it was delicious! Light and fluffy and not too sweet. Also had a latte that was tasty and oversized which I like. I highly recommend this place and hope to se more places pop up in Francisville."
    },
    {
        "id": 83,
        "text": "Great cafe in the growing Francisville neighborhood! Delicious food and coffees! The crepes are savory and sweet; in our two visits thus far, we have had the goat bacon, goat turkey, and strudel crepes. The honey ham sandwich and salad was a huge serving and leftovers  taken home for another meal.  The downstairs seating offers a comfortable, cozy environment. Staff are friendly. Glad to support a local, small business!"
    },
    {
        "id": 84,
        "text": "This place is AWESOME!  Pioneers in a developing neighborhood, I first went there to check it out and help support a new neighborhood business.  To my surprise, they are serving La Colombe coffee and are making Crapes and Bagel Sandwiches!  All the food I have tried has been great and the owners live in the neighborhood and really care about their customers.  I usually get a Crape on the weekend, when I have time to enjoy their downstairs dining area.  During the week I usually grab a Cappuccino and their \"Philly\" on a bagel.  I am there a few times a week."
    },
    {
        "id": 85,
        "text": "A pretty great cafe in the Francisville area.  Upon arrival I was a little bit wary because it looked pretty tiny with only one table and some high top seating. I was pleasantly surprised to find out there's a floor downstairs with some extra tables and even couches! The aesthetic does what it can to be hip/trendy. It is also very clean and bright which I love. \n\nVineyards seems to be known for their crepes, but I didn't get to try one during my first trip here. I got a hot latte. It was $6!!! That is v expensive for a cup of coffee and if I'm being honest it was not that good. That got me a bit turned off. My friend got a mocha chino which was just as expensive and a chocolate chip cookie.\n\nI don't wanna hate on a local small business, so even though I do think that this place is overpriced, I'm gonna back it.  I'll definitely be back to give a crepe a try and recommend it if you need a cup of coffee or a place to get some work done."
    },
    {
        "id": 86,
        "text": "Vineyards is AMAZING! Would highly recommend eating here. The food is amazing and the service is great!"
    },
    {
        "id": 87,
        "text": "This is my go-to spot for coffee. Great staff, great atmosphere, delicious coffee and AWESOME food. What are you waiting for? Get here!"
    },
    {
        "id": 88,
        "text": "Great coffee, and best crêpes in town!!!\nBeautiful interior, and owners and staffs are friendly.\nYou have to visit at least once, c'est magnifique!!!"
    },
    {
        "id": 89,
        "text": "REALLY wanted to love their crepes - but alas, it does not compare to other crepe places I've frequented. The little cafe is situated in a weird (but up and coming) neighborhood - super close to my boyfriend's house. I was so excited to try!\n\nTheir sandwiches are good. Their crepes (we ordered take-out) got soggy after the 4 minute walk home! It seems like they make their crepes a little watered down, so I noticed a lot of air bubbles when taking a bite of the crepe. It wasn't anything special and the ingredients were a little lacking. \n\nTheir drinks menu could be a little more creative, but for a small place like this, I think it's pretty good. I enjoy their iced lattes and their quiet and quaint little study area."
    },
    {
        "id": 90,
        "text": "Probably the best crepes I've ever had! Both sweet and savory are amazing, I cannot wait to try all the others! The staff is super sweet and friendly, which makes this place that much better. Wonderful spot for a quick visit or for a couple of hours to work/study."
    },
    {
        "id": 91,
        "text": "My Husband and I have been frequenting this wonderful, quaint little Cafe since we moved to the neighborhood 8 months ago. We have ordered the food and picked it up (the Crepes were delicious, hot, and not soggy), we have eaten in the Cafe, and we have simply ordered some beverages. Their coffee is the best tasting coffee my Husband and I have ever had, the Iced Soy Latte I get is out of this world (the craftsmanship that the Owner uses is fantastic), the atmosphere is warm and inviting and it is very visually appealing. They always have a dispenser of water with fresh berries or citrus which I love, and all of their pastries, pressed drinks and other foods are local. Overall the Owner knows his stuff, is very friendly, and his Wife is a lovely lady always smiling when someone new comes in. I highly recommend this place!"
    },
    {
        "id": 92,
        "text": "This place is so good the crepes aren't the cheap kind it's nice decent food their sandwiches are great and the bagels are really good the people are very nice and the place is clean"
    },
    {
        "id": 93,
        "text": "I don't yelp often these days but this little spot deserved more than just a click of the 5 star rating. This cozy spot is run by a pair of wonderful people, who each worked to make our crepe birthday breakfast something to remember. We'd read good things, so we ventured far from our usual haunts to give this delightful place a try. You should too."
    },
    {
        "id": 94,
        "text": "This is a tiny coffee shop that serves excellent crepes and nice breakfast . I had the vegetarian omelet in a baguette. My friend had a crepe which looked amazing. Ice coffee was outstanding as well as the hot coffee. The service is efficient and the place is pretty in an up and coming neighborhood. Worth the trip. Could use more inside tables ."
    },
    {
        "id": 95,
        "text": "Came here for a late breakfast. Everything was great. Tried the savory crepe with goat cheese, avocado and salmon, it was delicious. Also tasted the bacon and mushroom omelet on Baguette. Portions were huge and very satisfying. Had a drip coffee which I believe was La Colomb, it was brewed strong and I thought it was very good. I would definitely eat here again and try different variations of savory crepes. This cafe is kind of in a weird location, little hard to find as they are doing lots of construction in the area. Most seating is indoors with two small tables out front."
    },
    {
        "id": 96,
        "text": "Yes yes yes! What a gem this place is. It was so good, I came here 2 days in a row. First time I got a savory crepe with spinach, cheese and mushrooms. Second time around I got the sweet Nutella banana crepe. Not to mention, the cappuccino is amazing. I'll definitely be back for more!"
    },
    {
        "id": 97,
        "text": "The best creperie / cafe I have ever been to! I got the goat cheese & turkey crepe and it was beyond perfection! \n\nAnd their iced chai latte is to die for as well!"
    },
    {
        "id": 98,
        "text": "this place is so hipster! i ordered crepes which were delicious and also a smoothies which was also delicious. price wasn't too bad and the store was so cute. they also have a downstairs that you can eat and study there. it's super chill and laid back and the staff is very friendly and welcoming. love love love this place"
    },
    {
        "id": 99,
        "text": "Been here many times and absolutely LOVE this place. The omelettes are awesome, the sandwiches are awesome, the coffee is awesome! Everything is awesome! Please support the amazing couple that has this cafe. Great ambiance, friendly service and perfect for studying, or evening getting breakfast with friends!"
    },
    {
        "id": 100,
        "text": "You'd be hard pressed to find a better breakfast place in all of philly, great food, great atmosphere, quaint quiet with undertones of a French bistro. Serene does not even scratch the surface. There is something deeply divine about this place. From the music, to the delectable crepes (goat cheese mushroom bacon is to die for) and the down stairs seating area is cozy with tables whilst also having a couple lounge chairs, long story short go here, I guarantee you'll fall in love with it like I did."
    },
    {
        "id": 101,
        "text": "They gave us great service- such friendly and professional people. I love the atmosphere; it was very clean, comfortable, and charming. The food is delicious."
    },
    {
        "id": 102,
        "text": "This place is awesome! Everything we've have had from their menu is delicious... And my girlfriend is a very picky eater. Personal favorites are the Goat Turkey Crepe and the Honey Bee Crepe. They have great coffee, tea, sandwiches, baguettes and bagels as well. \n\nBoth the main floor and the basement seating are clean, well decorated and well lit. And I love that they have outdoor seating in warm weather. \n\nThe owners (a young couple) and their staff are all extremely friendly. You can tell they put some serious money, time and effort into this place. This is EXACTLY what Francisville needed, and they did it the right way!!"
    },
    {
        "id": 103,
        "text": "Quality food at great prices. Try their Crepes, they are awesome. They also serve La Columbe coffee which is my favorite."
    },
    {
        "id": 104,
        "text": "This is hands down my favorite spot in town, and it's hard to stop me from eating there at least once a week! The service is always a wonderful experience, and the food and coffee are amazing.\n\nAll of their sweet crepes are delicious, but I would recommend caramel ricotta, au sucre with strawberries, or apricot jam. Their savory crepes are lovely as well, however there are not many vegetarian options. However, their honeybee crepe is lovely! It's also worth noting that there are no vegan crepe options called out on the menu."
    },
    {
        "id": 105,
        "text": "What a gem of a place in the francisville neighborhood! I had a skim chai latte and a sucre crepe. The staff was very friendly and the downstairs dining area was very welcoming. We will be back."
    },
    {
        "id": 106,
        "text": "Good bagel and coffee.. but went at 11am on a Sunday morning and they didn't have eggs?? What kind of breakfast cafe doesn't have eggs when it's over half their menu? There was only one other customer in there and three people standing around \"working\"... send someone to the store?? Service wasn't overly welcoming."
    },
    {
        "id": 107,
        "text": "A cute little place on 16th street, nice and cozy! A group of us went here for breakfast and the food/service was delicious. I got the honey bee and my girlfriend got a sweet crepe and they were both awesome. The iced coffee was awesome too. I would come back here for sure, very awesome low key spot."
    },
    {
        "id": 108,
        "text": "Very very cute cafe! I think their crepes and teas are good. Not quite I-NEED-THIS-A-FEW-TIMES-A-WEEK good, but I'd-be-happy-to-come-back kinda good. My friend and I split a honey bee and the nutella strawberry one."
    },
    {
        "id": 109,
        "text": "Good price for good crepes. I had the savory Philly crepe. Came with smoked salmon, cream cheese, and spinach. Generous amount of smoked salmon evenly spread out in the crepe. Well worth the $9."
    },
    {
        "id": 110,
        "text": "I go to this place every time I'm in town (which is not enough). My favorite dish is the pesto sandwich. It's pesto, mozzarella, tomatoes, and avocado on a perfectly toasted baguette. It's served with a side salad drizzled with a balsamic vinaigrette that pairs so well with the sandwich. Reminds me of Italy!"
    },
    {
        "id": 111,
        "text": "This is the best pancake place in a city. Cozy atmosphere and incredibly friendly staff."
    },
    {
        "id": 112,
        "text": "This is my favorite café to go to whenever I'm in town. It's the perfect spot to grab a coffee and do some work in their downstairs lounge area. They have plenty of outlets, free WiFi, and a comfortable atmosphere. Definitely, worth a trip for a quick lunch as well!"
    },
    {
        "id": 113,
        "text": "This place was surprisingly good.  It's a mishmash of Italian and French inspired sandwiches and crepes.  The crepes were great -- not too sweet, which seems to be a common pitfall of American made crepes.  \n\nThe pesto sandwich with mozzarella was good as well."
    },
    {
        "id": 114,
        "text": "Such good iced coffee. Tastes like hot coffee tastes but actually is iced coffee. Some iced coffees are more bitter or not enough bitter but this one is the nice amount of bitter. And good ice to coffee ratio. Love the Halloween decorations too. Lovely."
    },
    {
        "id": 115,
        "text": "We came on a rainy morning not long after the cafe opened, and the cafe was understandably empty. Boyfriend and I grabbed the lone table upstairs. There were window bar seats though and a downstairs I didn't get a chance to check out. I ordered a caramel ricotta crepe and boyfriend got a smoked salmon avocado one. Service was super friendly and fast. My crepe came out larger than I'd anticipated, but I still managed to finish it; it was drizzled with diluted caramel syrup (so not overly sweet) and dusted with powdered sugar. I usually dislike smoked salmon and avocado, but I tried the Boyfriend's crepe, and I surprisingly really liked it. I liked it just as much as the crepe I ordered. This is a cafe I'd revisit if I were in the area again just to try their other creations."
    },
    {
        "id": 116,
        "text": "The food is delicious and for a very affordable price. The people are really nice and the place itself is very clean and well decorated. Had the eggs on bacon and the Nutella + strawberries crepes."
    },
    {
        "id": 117,
        "text": "Been dying to try and finally made it today! Amazing!! Crepes were perfect the sweat and the meaty ones! Goat turkey on the baguette was also amazing.. ice lattes on point! After 3 years I finally found my neighborhood spot 6 stars"
    },
    {
        "id": 118,
        "text": "I am a HUGE fan of Vineyards Cafe! The staff is all super friendly, and I am a big fan of how they do iced coffee (essentially a red eye, which is DELICIOUS!) And honestly, their pesto sandwich is one of my top favorite sandwiches. I love that they're right down the street from me, and I appreciate that they were able to open up again to do takeout service during the pandemic. Definitely check them out!!!"
    },
    {
        "id": 119,
        "text": "They're kind, hardworking people. The breakfast selection is large considering and the owner is so sweet. The coffee is very strong and you can tell it comes from a good source! An A+ place to grab a coffee, though, I wouldn't suggest eating in, its rather small."
    },
    {
        "id": 120,
        "text": "Great little breakfast spot! It's super quick and the basement eating area is cute without looking like a basement at all."
    },
    {
        "id": 121,
        "text": "Love this place! I live just right up the street on poplar. I come here at least 2-3 times a week for my morning coffee. Their customer service is great btw! I advise anyone who is in the area or even just visiting the city to take a visit. You won't be disappointed with their menu. Btw their lounge is a huge plus! Great place to study when trying to escape the noise of the city."
    },
    {
        "id": 122,
        "text": "Caramel ricotta crepe was amazing and so was my mochaccino but the Norwegian crepe was sadly not for me at all. I normally love goat cheese but this crepe was totally overpowered by the goat cheese which was slathered on very thick. Also I just felt like the goat cheese, avocado, and salmon were all way too similar with slimy texture. I would not recommend that crepe but their other stuff looked and tasted good. I want to come back and try other things."
    },
    {
        "id": 123,
        "text": "I'm late posting this Yelp review. I stayed for the weekend in Philly nearby this gem. Stopped in on a Sunday AM looking for a cup of good coffee and maybe just a quick bite. The menu is pretty varied (who knew there were so many choices for crepes?). I decided on the goat bacon and was not disappointed. \nThere was a small wait, but the ingredients are fresh, and made as ordered. Grabbed a great cup of coffee, sat down for a bit and took in the sights. It is located in a neighborhood that is undergoing a resonance. \nThe crepe was just scrumptious! Great way to start my day. \nHighly recommend."
    },
    {
        "id": 124,
        "text": "There aren't a lot of destination dining spots in Francisville...yet, but Vineyards is certainly an exception.  The owners took a bit of a gamble by opening this fantastic european style corner cafe at 16th and Ogden amidst a ton of residential development.  After watching the place fill up to the brim today, I think they made a smart move by fulfilling a need here in the Francisville community.  \n\nThe space is bright, clean and feels comfortable with all the reclaimed wood.  The upstairs doesn't have much space, but surprisingly, there's a cozy garden level seating area below.  The menu consists of savory and sweet crepes, sandwiches, salads and a few omelets.  The drink menu is diverse, and while we don't drink coffee, everyone else seemed to be enjoying it.  \n\nWe loved the ham, gouda and walnut with maple syrup crepe.  (It was a little bit better than the crepes we had in Paris.)  The Norwegian crepe was loaded with goat cheese, smoked salmon and avocado, and the ricotta/caramel variety had just the right amount of sweetness.  \n\nWe'll be back for sure and we wish them the best of luck as a cornerstone eatery in the neighborhood.  As the density continues to fill in, I'm certain they will be in good company."
    },
    {
        "id": 125,
        "text": "Absolutely the best crepes I have ever tasted. This place is a must go when you visit Philly. Btw, the crepes are HUGE. They also have delicious coffee and tea options. Highly recommend"
    },
    {
        "id": 126,
        "text": "The space looks small but downstairs says otherwise! Got some crepes to start off my morning."
    },
    {
        "id": 127,
        "text": "I really enjoyed my Sunday brunch at Vineyards cafe. A friend and I met for coffee and crepes and I really enjoyed myself. I ordered the \"American\" crepe and added spinach, and a hot latte. Our food and coffees were ready within minutes, and everything was very tasty. The seating inside is a bit limited, but there were tables outside. I also really liked the complimentary water with lemon and lime slices - very refreshing. I will definitely return!"
    },
    {
        "id": 128,
        "text": "Amazing breakfast!! Crepes are great!!!  Coffee is tasty!!! The atmosphere is beautiful!!!"
    },
    {
        "id": 129,
        "text": "I love this place!  Kinda off the beaten path on the eastern end of rapidly gentrifying Francisville, it is a beautiful space with the best crepes in town, period.  The Norwegian is my fave - goat cheese, lox, avocado, in perfectly done buckwheat crele. And La Colombe coffee."
    },
    {
        "id": 130,
        "text": "Read on Yelp about these amazing crepes, and they did not disappoint!  We sampled the Pesto and many savory ones including Strudel and Nutella.  All were made fresh to order and were fantastic.  Service was super friendly and quick. Seating is on short supply so we took them to go. We'll be back again and will try more flavors."
    },
    {
        "id": 131,
        "text": "Coffee is delicious! I ordered a pesto sandwich and it was very tasty, actually delicious. Bread was fresh and the other ingredients very good as well. They have a very cozy sitting area underground and very relaxing ambience. Place is very clean. And the girls are lovely. I am so glad I found it!"
    },
    {
        "id": 132,
        "text": "Amazing place!!! Cozy atmosphere!!!\nSuch a friendly stuff!!! Sooo delicious food and COFFEE"
    },
    {
        "id": 133,
        "text": "This coffee shop makes me so happy to have moved to the neighborhood. The staff are always very friendly, the crepes are out of this world (salmon, goat cheese, and avocado), and coffee is always tasty. The atmosphere is warm and welcoming. The perfect spot for lunch or a coffee date."
    },
    {
        "id": 134,
        "text": "Im glad I found this place because there is a lack of good coffee in the area and this place is good.\n\nI like the room downstairs because it's comfortable and a good layout.  They play chill music.\n\nGood Place."
    },
    {
        "id": 135,
        "text": "Truly the best coffee shop in Francisville. So happy they are able to be open during COVID through the mini window. My go to here is iced chi & their Maple Ham crepe  (best crepe EVER). I come here for a morning work drink or after a long night where I KNOW I need my crepe. Staff is so friendly, highly recommend if you are in the area!"
    },
    {
        "id": 136,
        "text": "Would go here all the time if I lived in Philly. Fresh and delicious flavors! I had the goat cheese, ham and fig sandwich and it was delicious!"
    },
    {
        "id": 137,
        "text": "I can not say enough about the Norwegian and Honey Bee crepes. The only thing better would be the cappuccino, easily one of the best I've ever enjoyed. \n\nThe staff is very friendly and though they said our food would take 15 to 20 minutes it seemed closer to 5. \n\nDefinitely on the short list for a return!"
    },
    {
        "id": 138,
        "text": "Such a cute little neighborhood cafe, I met with clients here and their basement space is perfect for a meeting or just a quiet breakfast/lunch. It makes you feel you are in your own leaving room.\n\nTea and coffee are very good and their crepes are delicious, although I am giving 4 stars because I ordered a Nutella crepe but it was not fully Nutella, it was more of a mix between Nutella and chocolate syrup, I was expecting pure Nutella filling (as the name says) and not a mix of chocolates so that was a bit disappointing."
    },
    {
        "id": 139,
        "text": "This little hidden cafe has AMAZING bagels. I think it's French owned. Their bagels are soft and tasty! They're pretty affordable too! I am putting them on my list of favorite cafe/coffee shops in Philly."
    },
    {
        "id": 140,
        "text": "Wow I never knew crepes could taste sooo good! LOVE this place! new favorite!! The strawberry au sucre was absolutely on point. It melted in my mouth lol. Their savory crepes taste amazing and are quite filling as well."
    },
    {
        "id": 141,
        "text": "We went to Vineyards Cafe for breakfast after reading about how delicious their crepes are. The inside is pretty small, but has a very warm and inviting atmosphere.  There's also more room downstairs but we never got a chance to check it out. Both servers were very friendly. This place really does feel like your neighborhood cafe, just like their sign says!\n\nI ordered the Norwegian crepe. These were really packed with salmon and avocado.  I never had this combination of foodstuffs together before, but it somehow works. Even my girlfriend who admittedly doesn't like goat cheese or avocados commented on how much she liked the dish. \n\nI was also able to try a bite or two of her caramel ricotta crepe. Also very delicious and not too sweet. Would be interested in coming back here to try more of their crepes and some of their coffee."
    },
    {
        "id": 142,
        "text": "Delicious crepes! Highly recommend the Philly--salmon cooked perfectly. Make sure you check out the super cozy downstairs seating area. Great place to work/study/have a meeting."
    },
    {
        "id": 143,
        "text": "Vineyards cafe is one of the coolest coffee shops I have visited in the US. Welcoming atmosphere, coffee and food are very delicious. The prices are great either, spend 10-12$ for the best in the city savory crepe(it tastes incredible) and cup of freshly brewed coffee. If you have some spare time, grab a good book and enjoy yourself in a cozy and comfortable setting. \nA truly great coffee shop has to feel special, THIS ONE DOES."
    },
    {
        "id": 144,
        "text": "This place lives up to the reviews. Wonderful coffee (my favortite latte place), nice music, friendly staff, cozy atmosphere to chat or study/work, fast internet, reasonable prices. What's not to like?  I'll be a regular here from here on out."
    },
    {
        "id": 145,
        "text": "Excellent place to start your day! The place was extremely clean and the employees were very polite.\n\nHighly recommended!"
    },
    {
        "id": 146,
        "text": "Best. Crepes. Ever. This is a little pricey but you really can't beat it. The employees were great too"
    },
    {
        "id": 147,
        "text": "This place is super cute. I came here for breakfast before work and ate in. I had a savory crepe, the Americano I believe, and a macchiato. It was ready pretty quickly, and was very good. The crepe is on the larger side; I managed to eat most of it but probably shouldn't have. The space is well-lit because of the windows, and on the smaller side. I'm not sure if there's another floor with more seating."
    },
    {
        "id": 148,
        "text": "Thank you for amazing spot in Philly. Cozy atmosphere, food is delicious, service is so good. All flavors of syrups for coffee that you ever wanted (thanks for the amazing pumpkin spice). Highly recommended! Unbelievably low prices!"
    },
    {
        "id": 149,
        "text": "This review is long overdue. Vineyards Cafe has swiftly become my home away from home. Perfect for studying or just enjoying a nice morning by myself. Super dog friendly, which I love because I can get my dogs out of the house while enjoying some perfectly crafted coffee. Interestingly, my fiancée and I frequent this place, so much so that they allowed me to host our engagement party there. Great staff, great food, and most importantly great coffee."
    },
    {
        "id": 150,
        "text": "I've given this place so many chances. The crepes are not good and they've messed up my order multiple times. They are also out of everything all the time and they take a very long time to get orders ready. The bagels are subpar as well and they are always either burnt or under toasted."
    },
    {
        "id": 151,
        "text": "Great little cafe. I had a goat cheese turkey and dog jam crepe and it was delicious. Good prices and good service."
    },
    {
        "id": 152,
        "text": "It almost hurts me to write this, but I think my days of patronizing this business have come to an end. Today my friend called me to tell me about his experience here with the young lady at the counter speaking rudely to him. Ironically, a few months ago I had a negative experience with this same young lady as well. I had ordered a Vanilla Iced Chai and was handed a warm chai (in the middle of the summer). When I told her that I wanted ice in it she told me that I didn't ask for ice. I know for sure that i asked for ice, I wouldn't drink a hot drink on a hot summer day. Anyhow, I assured her that I did ask for it and perhaps she did not hear me. She insisted that I did not ask for ice, I sensed her attitude and decided not to go any further because I did not feel like arguing about a drink. Today, he saw a notice that they were not serving eggs and asked her about it, she responded in a rude tone \"We just don't?\" It was unnecessary and unprofessional for her to give him attitude for asking a simple question. Well, this prompted us to find out on our own. Come to find out they were in violation of code and had to cease cooking eggs immediately. That was no big deal for me, but when I read that there was no backflow prevention on the sink water supply lines, that made the decision for me. I would think that a business who's been cited with various violations would be more humble when dealing with customers. It was a nice run while it lasted and it's sad to remove them from my list of favs but with the violations and the attitude, I'm good love, enjoy!"
    },
    {
        "id": 153,
        "text": "Yoooooo this place is scary as hell. You wanna feel uncomfortable??? Just make your way to Vineyards Cafe and make sure you are specifically non-caucasian!\nI am writing this review on behalf of a friend who felt so uncomfortable at this establishment. \nThe coffee she had was not made well at all. It tasted like soap. \nThe workers were unfriendly and felt hassled by my friend and even annoyed when she wanted to stay in the cafe to do her work like everyone else and have her nasty ass drink. They were unwelcoming."
    },
    {
        "id": 154,
        "text": "It's a deceptively small when you first walk in but there's more seating downstairs. Very chill and friendly environment. Super cute and aesthetic. Coffee is very authentic and staff is so helpful and attentive."
    },
    {
        "id": 155,
        "text": "Whenever my friends ask to meet up mid-afternoon for a snack, this spot comes to mind. The atmosphere is clean and calm so if you want a place to study with free WiFi, stop by! \n\nI'm partial to their sweet crepes. Personally I like the simplicity of their confiture crepe which offers your choice of jam and powdered sugar. I like the blackberry jam the best. Their savory crepes are good too, but if you're not a fan of cheese that is on the stronger side, you might not like their gouda crepes. I like them a lot, but I had one friend who didn't like it at all. It's up to your tastebuds I guess!"
    },
    {
        "id": 156,
        "text": "DAYUM that's a good crepe. I've had some good crepes in my day, but DAYUM. Got the Goat Bacon, amazing decision. Menu has savory crepes, sweet crepes, sandwiches and omlettes. The folks running the joint had a french accent which inspired great confidence in their crepe making ability and it lived up to the billing.\n\nThe crepe was huge and the goat cheese/mushroom/bacon filling was plentiful. Mark this on your GPS as a go-to spot in Philly."
    },
    {
        "id": 157,
        "text": "It's perfect for the neighborhood. It's very cute and quaint, the owners are nice and I love the simple yet contemporary decor. The basement lounge area is really cool and not too tight. The food is pretty good, I'm a fan of the tarts and the fresh squeezed orange juice is awesome. I had the vegetarian omelette and it comes with a side salad that is pretty tasty. My friend seems to love the Hazelnut latte. I am looking forward to trying a crepe and enjoying the pleasant service again very soon."
    },
    {
        "id": 158,
        "text": "This is a very cozy place and has really good coffee. The coffee here was so perfect, the bitterness of the coffee was not overpowred by the flavoring."
    },
    {
        "id": 159,
        "text": "Omg so good ! I got the Norwegian with smoked salmon goat cheese and aVocado .... sooo good I could eat another one ! Parking is a little rough , coffee is strong . I highly recommend !"
    },
    {
        "id": 160,
        "text": "This is my first review on Yelp. Vineyards cafe is such an amazing addition to my neighborhood. The food is delicious!!! The staff and atmosphere make eating here even more enjoyable. Another bonus is they are super kid friendly!!!!!"
    },
    {
        "id": 161,
        "text": "what a cafe should be by definition!!!\nAwsome food, great coffee prepared right, friendly service!"
    },
    {
        "id": 162,
        "text": "Edit: The owner (I think) responded, he explained they do not have direct contact with Postmates so the menu was not up-to-date; hence, items not being available. They also shared they typically do not recommend crepes for delivery, as they should be eaten within a few minutes of being prepared. All that said, I respect him reaching out and respectfully adding context. Kudos for good customer service. \n\nWe ordered delivery this morning, we are so so so disappointed. First, we found out they were out of 3 of the 6 items we ordered - blackberry jam for a crepe, fresh OJ, and one of the other crepes. In the end, we picked the sucre crepe, Norwegian crepe, crepe with apricot jam, everything bagel with fig jam, and an iced coffee drink. The only thing that was good was the bagel and coffee. I don't understand all the reviews praising these crepes as special. I know this will sound super pretentious, but I have had crepes in France and at many places in CA - none of them have tasted as poorly as these. All 3 were lacking flavor and the consistency/style of crepe was  not appetizing, plain, not crispy, more brown colored, and lacking. The Norwegian has salmon, goat cheese, and avocado - the salmon was overpowering, while a good quantity of protein is usually welcome, this was super fishy and with a lack of flavor/spices, it was as if rating straight salmon, not a crepe with other ingredients. The plain with apricot jam was like soaking up apricot syrup with a plain piece of bread and the sucre one didn't even taste of sugar, I couldn't even see the sugar inside.I dislike giving low reviews, but I am confused why this has high reviews which misled us and was why we ordered here. We all have different taste buds and preferences, this was our experience, hopefully others enjoy this place."
    },
    {
        "id": 163,
        "text": "Had lunch here with a friend. The crepe, potatoes, and coffee were perfect. The atmosphere is so elegant- I love their plants! I'll definitely come back."
    },
    {
        "id": 164,
        "text": "It's a cozy place with more room in the basement. \nTheir crepes menu is perfect, has sweet and savory options. Plus serve La Colombe Coffee. \n\nIs a great morning breakfast cafe. And the workers are also very nice and very helpful. \nComing back for sure!"
    },
    {
        "id": 165,
        "text": "Love it here. The crepes are absolutely perfect. I have the Philadelphia sandwich (lox) close to once a week. And they serve la colombe coffee.  Great space with outdoor seating and a dining area in the basement. Such a good spot."
    },
    {
        "id": 166,
        "text": "Great customer service the girls were really nice! the downstairs is the cutest seating ever. I got the honeybee crepe and my bf got the honey ham sandwich and both were amazing"
    },
    {
        "id": 167,
        "text": "I was in Philadelphia for a weekend with friends and after we toured the Eastern State Penitentiary I left it up to them to find a nearby lunch spot. I was pleasantly surprised at the variety of menu choices and quality of food - had the salmon/avocado/goat cheese crepe and an iced latte, and probably would have eaten there every day if we stayed in the area (the cafe is sort of hidden).\n\nNote: they have a nicely decorated lower level that offers more dining space."
    },
    {
        "id": 168,
        "text": "Phenomenal crepes, great coffee and an even greater ambiance to work or hangout in. The staff has always been nothing but friendly and accommodating. Glad they are a staple in this neighborhood!"
    },
    {
        "id": 169,
        "text": "I love this neighborhood cafe! The coffee is great and their crepes are delicious and hearty! I normally get the one with egg ham and cheese, and I've tried one with bacon that was tasty as well. I especially love the downstairs area; it is a great place to relax and read a book when there are not many customers. The staff is always friendly and the decor is beautiful, but I wish there were more vents because it can get smokey in there sometimes."
    },
    {
        "id": 170,
        "text": "This place has great coffee and great crepes! they are always a special mid-day treat. It is just a walk-up window, so do not plan on sitting down. Additionally, you can call and order ahead for pick-up."
    },
    {
        "id": 171,
        "text": "It's a deceptively small when you first walk in but there's more seating downstairs. Very chill and friendly environment. Super cute and aesthetic. Coffee is very authentic and staff is so helpful and attentive."
    },
    {
        "id": 172,
        "text": "Good crepes. GOOD coffee. Great atmosphere. The kind of place I'd spend an afternoon sipping coffee and getting some work done. 10:30am on a Sunday I was worried about getting a seat but it wasn't a problem at all. For sure my new spot. I can only say I wish they had MORE crepe options so I can try them all."
    },
    {
        "id": 173,
        "text": "Dessert crepe was great! The salty crepe had no sauce and was a pretty bland but the ingredients were very fresh"
    },
    {
        "id": 174,
        "text": "This will be my new breakfast spot! Just moved down the street and went to breakfast here! It is such a chill atmosphere and the crepes are delicious! Especially the caramel ricotta one!!! Delish!"
    },
    {
        "id": 175,
        "text": "Orist and Zoriana are sweet and hospitable owners. Their friendliness puts this place over-the-top for me. I was happy with the coffee and the service otherwise, and impressed with the hard work they've done to make their cafe beautifully lit and warm. Recommended. My favorite coffee shop in Francisville."
    },
    {
        "id": 176,
        "text": "Delicious Crepes! I got the Norwegian which had goat cheese avocado and Salmon. It was soft and delish. I wish they brought syrup out. Didn't see it on the counter until after.\n\nMy wife got the Strudel Crepe with apples and cinnamon. It was pretty basic.\n\nWould go back again. What a hidden gem!"
    },
    {
        "id": 177,
        "text": "The nicest and friendliest owners. Great food and great selections of cafe beverages."
    },
    {
        "id": 178,
        "text": "Was studying here with a friend a few weekends back. The café is a cozy little space located in a rapidly developing niche in Fairmount.\nI'm big on studying in cafés so ambience matters to me a lot. I wasn't a big fan of the interior space, it was rather lackluster, though it let in a lot of sunlight. There was seating out front and downstairs but the main area itself (which is where we were situated) was rather small and had one outlet on the other end of the room. If you're going to come here to work, I advise grabbing the one seat by the outlet or bringing a fully-charged laptop. \nThere's free wifi and it's pw-protected, which is great.\nVineyards offers lots of different beverages, baked goods, and sweet and savory crepes. My friend and I only ordered two chai lattes, which tasted like your typical coffeeshop chai latte, so nothing really mind-blowing. The owners were very polite, which was nice. Overall, a pretty ordinary café with crepes and nice people. I'd come here again, but mainly because my friend lives in the area and we'd most likely be doing our work here."
    },
    {
        "id": 179,
        "text": "I was very pleased with the menu. The crepes are delicious and the coffee is amazing. There is free WiFi too and it's a great place to study."
    },
    {
        "id": 180,
        "text": "Solid little cafe serving crepes and coffee \n\nCrepes were huge, with fresh fillings and a great batter. \n\nThe coffees looked great though I didn't have one."
    },
    {
        "id": 181,
        "text": "Only has coffee here, can't comment on the food! \n\nCoffee was very watery and not that flavourful"
    },
    {
        "id": 182,
        "text": "Cute little spot in francisville for delicious crepes! just a note though, there are some photos on this yelp page from a previous menu - they do not serve any eggs anymore. I love the nutella crepe, the philly crepe, and I've also had a few sandwiches that were good as well. \n\nMy favorite drink here is an iced mochaccino- it will keep you up to get work done. I wish they had oat milk as a non-dairy option though. \n\nPre-covid they were also pet friendly in the upstairs portion!"
    },
    {
        "id": 183,
        "text": "This place is a quaint breakfast place with a basement lounge perfect for any hipster. The one time I went they ran out of bagels, and I went at a normal breakfast time, but to be fair, you go for the crepes. These are BOMB. They have a lot of unique combinations but they also let you tweak them. This is a great local breakfast stop to pickup or to grab a bite and hang out."
    },
    {
        "id": 184,
        "text": "This place is very cute. The people who work here are always so nice. They have the best iced lattes with almond milk!"
    },
    {
        "id": 185,
        "text": "The crepes are always spot on. I normally get the Nutella crepe w/ strawberries & bananas, but last time I switched it up and got the Philly crepe. It was amazing!! This place is a gem!"
    },
    {
        "id": 186,
        "text": "I've been dying to try this place and am so glad I did. I pass by Vineyards Cafe during my commute to work in the morning. It's usually not open yet since I get in so early, but one day, I was running late and thought f*** it, I'm getting myself a cappuccino! \n\nSmall, quaint, and cozy, this little neighborhood cafe is such a treat. I'll definitely be back to try a crepe next time."
    },
    {
        "id": 187,
        "text": "Yelp suggested this cafe for me. So decided to try it! It was located on this cute little corner midst a residential area. The cafe has seating downstairs too. Though it looks super tiny, it can seat a lot of people.\n\nThe menu was huge- it was all squeezed onto a blackboard but surprisingly legible! They offered savory and sweet crepes, sandwiches and freshly baked choco-chip and oatmeal raisin cookies (which were not made in house).  They were ginormous and oh so soft!! \n\nCoffee was given to you plain, and you can walk up to the little coffee maker corner and add whatever you please.\n\nWe ordered-\nMaple Ham crepe: pretty large size, over-drizzled with syrup. It was pretty tasty if you like all sweet things. But half way in, it was a little too much of the same taste.\n\nPesto Sandwich: has pesto, mozzarella, tomatoes and avocado. The baguette was a little too hard for my taste. Was difficult to actually bite it.\n\nMaybe we just had bad selection of food this time, but it looked like a pretty busy little cafe on a saturday.  I would definitely return to give it another chance! But the cookies- yum yum for sure! I'd probably go back at least for one of those!"
    },
    {
        "id": 188,
        "text": "It's in the neighborhood and very easy to access even during COVID. I think they are opened from 8 am-1 pm but their window is opened and you can order, grab, and go. Contactless, of course."
    },
    {
        "id": 189,
        "text": "Chai tea latte had good flavor at first but very watery\nCinnamon raisin bagel has good flavor but it isn't a good bagel at all it's so thin and dense \nI like the location though and will try other things"
    },
    {
        "id": 190,
        "text": "Sunday brunch in the city... I find it almost impossible to find a place without a wait. Thank god for Vineyard!! \nWhen you enter it looks like a small coffee joint, but they have seating downstairs. I love the vibe that this place has. \nChai latte: being Indian, I'm picky about my chai. And this beats EVERYONES chai latte (even Starbucks). \nEggs, bacon, gouda on a baguette. Light savory dish , just enough to fill you up without that heavy brunch feeling. And the baguette is soft, so you're not tearing it apart like most places! \nNutella, strawberry crepe: one of the best crepes I've had in this city. \nThe owner even came down to check if everything was okay. The food is delicious, The place is clean And the staff is friendly. What a wonderful place in Philly to grab a bite!"
    },
    {
        "id": 191,
        "text": "Cute cafe in the Francisville/Fairmount area that provided an awesome place for me to hole up for several hours and have lunch, take a couple meetings, and get some work done. Seating is outside or downstairs, and on a Monday afternoon, I had my choice of tables as there was only one gentleman in the entire place (nice to meet you, Andre!). \n\nMy café au lait was perfect, and I love the help-yourself water station with large glasses. I was excited to see crêpes on the menu and went for the goat bacon with goat cheese, bacon, mushrooms, and tomatoes. The crêpe was good but I would have enjoyed it a lot more if the bacon inside was crunchy. My dining companion's pesto sandwich looked incredible and I had a bit of lunch envy. I'm definitely going to try a sandwich or omelet next time. \n\nThe staff was really friendly and the wifi was complimentary. Definitely adding Vineyards to my rotation of spots to get some work done, and looking forward to trying more from the menu."
    },
    {
        "id": 192,
        "text": "Best creperie I've come across in Philly. It's a small cafe, located on the ground floor in a new development. My first observations were that it's very clean, and that it has a neat wood decor.\n\nThey feature a tantalizing variety of savory and sweet crepes. I opted for the Honeybee\n(mozzarella, scrambled egg, and spinach - finished with a honey drizzle) and then took home a Nutella/banana for dessert. Both crepes were super appetizing, well portioned, and priced appropriately.\n\nI'll also mention the service was very friendly (two women behind the counter). And they offer free wifi!"
    },
    {
        "id": 193,
        "text": "Love this little neighborhood spot!  Food is great (good quality and prices), their outdoor area is so cute, and the staff are always extremely friendly.  Lucky to have them in the 'hood!"
    },
    {
        "id": 194,
        "text": "Worst coffee I ever tasted. The coffee tasted like dirt and she had an attitude and the inside is closed because of covid."
    },
    {
        "id": 195,
        "text": "Excellent coffee. The pastries are terrific and the owner is a joy to deal with. A truly neighborhood type of place. \n\nDid I mention the coffee was great! I'll be back. No pretense here."
    },
    {
        "id": 196,
        "text": "Terrific, cozy neighborhood cafe that looks very unassuming but has much to offer. The coffee is from la Colombe, so you know it's good, and the food is desirable as well. The menu is rather expansive for the size of the shop and they manage to do everything well from the sandwiches to the crepes. I highly recommend checking it out. Don't forget to check out the extra seating in the basement, but the outdoor seating is just perfect for the season!"
    },
    {
        "id": 197,
        "text": "The girls who work there started cleaning up well before the closing time turning chairs upside down on tables to be unwelcoming. We came in about 15-20 mins before closing and they declined us. Why? Because they already cleaned up. \nIt's bad business practice to clean up before the store is closed. To be open but appear completely closed. The owner should really reconsider who he hires."
    }
]