[
    {
        "id": 1,
        "text": "I guess it would be necessary to state that I am of Jamaican descent, and as many of us know it is very hard to find food comparable to back home or equivalent to mom's cooking. Its been some time since I have frequented this restaurant, I stopped going for sometime because the food became very inconsistent.\n\nFast forward to today, i decided to stop by since some years had passed.  I ordered the ox tail and jerk chicken wings...  I just have to say that i was VERY disappointed. The oxtail though tender was very small and full of fat... more fat than meat and small portions at that...the rice was stale.  But what was really disappointing was the jerk wings.. I took one bite and ended up spitting out the chicken..  I just couldn't believe that an establishment would serve this....i assume no one in the kitchen samples the food before it comes out... they just cant... there is no way someone could think its okay to serve such dry tasteless food.  I was right to stay away for years, and i will be doing so again..."
    },
    {
        "id": 2,
        "text": "I try to eat here every time I'm in Philly because it is some of the best Caribbean food I've ever had.\n\nI pretty much get the same thing every time (jerk chicken with cabbage, peas and rice and plantains), but EVERYTHING they serve is good, from the basa fish to the brown stew chicken to the oxtails to the... well, you get the picture. \n\nAnd the price-to-portion-size ratio is awesome.\nFor eight bucks I get a Styrofoam container with the meal I mentioned earlier that is so full it will barely close.  \nThe young lady who prepared our order on my most recent visit had to force the boxes closed and double bag them just so we could get them home without them bursting open.  And we ordered the SMALL portions.\n\nNow, as with any restaurant with good food it goes without saying that word travels.  As a result this place is always packed. ALWAYS. \nThe line remains at two lengths: at the door or out the door.  So if you're impatient or adhering to the \"fast food\" mentality when it comes to restaurants, you may want to go elsewhere. \n\nBut if you are willing to wait, it's oh so worth it."
    },
    {
        "id": 3,
        "text": "You can smell the deliciousness in the air as you approach Ron's Caribbean cuisine.Their platters are huge! I felt like I was in an episode of Man vs food.The chicken curry is slammin!"
    },
    {
        "id": 4,
        "text": "Was in Philly and saw this small spot, and decided to try it. Jerk chicken was great, but expect atleast a 15 minute wait"
    },
    {
        "id": 5,
        "text": "Ron's is the truth. You've got to get their basa. Omg, to die for.\nThey've got different types of gravies. I was impressed with that. \nI usually get beef patties when I go to Caribbean spots. Once they were out so I decided to get a chicken patty and it was off da chain.\nI will go here anytime and I recommend everyone check them out!"
    },
    {
        "id": 6,
        "text": "I dnt knw if there's a new cook but the ox tails had no flavor at all nothing like it use to b very upset the whole thing went in the trash"
    },
    {
        "id": 7,
        "text": "Good damn food the best in Philadelphia and I've tried them all west south west north Mt Airy, G-town, west oak lane and Ron's top them all that cabbage is the best it's worth the traveling let's not forget norristown come down Olney you'll get what you paid for and the extra $ you spent other places use for gas to come to Ron's"
    },
    {
        "id": 8,
        "text": "Chicken feet soup on Monday is amazing - always with a rich layer of yellow chicken fat on top, just the right amount of spiciness.  Love it.  Friday's fish soup is also wonderful."
    },
    {
        "id": 9,
        "text": "I have been to mostly all of the Caribbean restaurants in Philly and I have to say that Ron's is the best! Yesterday I visited for the first time and fell in love. There were about 5 people in line when I arrived and my order was taken within minutes. There were 3 people taking orders and the line moved very quickly. I loved the fact that they kept the food coming out. As I stood there, a new pan of mac and cheese and yams came out fresh and hot, not like some restaurants where they run out of food or make you wait forever for food to be made. The jerk chicken was well seasoned and moist, the oxtail was good, the mac and cheese was REAL mac and cheese and was delicious. The plantain was sweet, moist, perfectly ripe and the best I've had in the city so far. Candied yams are my favorite food so I am very picky and I must say that I was pleasantly surprised with the yams as well....fresh, sweet, real yams (not the canned stuff some restaurants give you). Ron's I will definitely be back even though I have to travel about 40 minutes to get there. Worth the trip! 5 stars!"
    },
    {
        "id": 10,
        "text": "I was visiting Philly from NYC and went to Ron's for the first time this Saturday around 3pm. The line was long but it was well worth the wait. Portion sizes are HUGE so if you order a large, know that it will fill two people, or last you for two meals  (I ate it for lunch and dinner). I ordered the ox tails with rice, Mac n cheese, yams, and a piece of cornbread all for JUST $16.50! It was the BEST I've had in a long time and this includes the Caribbean food I get in NYC. I highly recommend this place as the curry shrimp, jerk chicken, and all of their dishes look amazingly delicious! It is more of a takeout spot, though we did sit inside and eat. The tables just aren't kept very clean so you'd be better off to pick it up and eat at home."
    },
    {
        "id": 11,
        "text": "Very good Jamaican joint. Reasonably priced and definitely well portioned meals.i always enjoy the curry goat"
    },
    {
        "id": 12,
        "text": "Love love LOVE Ron's. Everything on the menu is delicious and authentic, and the platters are sized for multiple meals and perfect for sharing. My all-time favorite entrée is the curry shrimp, and my only complaint is that I can only get it on Friday and Saturday (it's a weekend only special)\n\nThey recently did some renovating so they've got more space for seating and eating. It is a must visit if you love Jamaican food!!"
    },
    {
        "id": 13,
        "text": "I always buy food here. The food is good the service could be better they always seem to be rude or have attitudes. Other than that it a good place to good Jamaican food."
    },
    {
        "id": 14,
        "text": "One of my favorite Jamaican spots here in Philly. Their Pepper steak is to DIE for! I love coming here because it's not only affordable but they bless your platter with plenty of food. I can say at time the steak can be though but usually it's perfect. Their cabbage is very flavorful and fresh. I love their Mac and cheese and their rice and beans are amazing. They add to your experience with amazing customer service as well. It's definitely worth it ! \n\nNow since it's a hot spot there can be a wait but it's WORTH IT! So don't let that stop you."
    },
    {
        "id": 15,
        "text": "I am a person of Jamaican descent and sometimes you can get good Jamaican food OUTSIDE of your own home. Not in this review. Ron's is cafeteria Jamaican food at best. Everything was super SALTY! I per chased ox tails, curried goat, and jerk chicken. PROS-OX TAILS were tender. CONS-they were very small. The very end of the tail. salty and the gravy tasted like a doctored version of the real thing. The best gravy however of the three. PROS- GOAT was tender. CONS- goat was SALTY. No other veggies in the pot. If they added a carrot or some potatoes it would have helped with the saltiness. Would have been the best gravy if it was not so salty and inedible. I threw it away. PROS- JERK CHICKEN was a good serving size. CONS-Not enough jerk flavor. They need to marinate the chicken in the jerk sauce. It was just plain bland. The worse part is they added some cheap barbeque sauce on the chicken and called it jerk sauce. HORRIBLE! Ruined the entire meal! If you get the jerk chicken DO NOT get the sauce! Cabbage was BLAND! Beans and rice a big disappointment. A poorly made version with poor ingredients. Tasted like minute rice. The give you a lot of rice and beans especially in the extra large serving of ox tails. The meat to rice ratio was just unfair. I felt cheated. I will not recommend!\n\n There was a short wait considering the place was crowded. It looked like organized chaos. The servers were clean, in uniform and their heads were netted. GOOD. They were pleasant also because the masses were kind of difficult. The cooks were dressed in chef whites. Nice touch. Well stocked variety of drinks and desserts. Very clean.  I left thinking I have found my new Jamaican cuisine home. NOT!  THE FOOD WAS JUST BAD. REALLY BAD! BAD!"
    },
    {
        "id": 16,
        "text": "Ron's is my family staple restaurant for Caribbean food. We absolutely love the place. The food is phenominal, the portions are HUGE and no matter how long the line, this is our place for the best Caribbean food. We have friends that are Ron's enthusiast and have made it their number one spot. I'm about to order some catering for an aunt in New Jersey cuz she can't stop thinking about the food she had months ago from Ron's."
    },
    {
        "id": 17,
        "text": "Found out about this place from a good friend. It's a very small place, there is ALWAYS a line but when I get my OXTAIL!!!!! All that fades away  \n\nThe best Caribbean food I've had so far. I order the same thing ALLLL the time. Oxtail with cabbage/corn and white with the sauce alllllll over my rice.. And my husband loves their Jerk Chicken... Portions served is worth every buck."
    },
    {
        "id": 18,
        "text": "DEFINITELY OVER RATED!!! Never really cared for their food. Definitely far from authentic Jamaican food. Ordered oxtails extremely tough needed a knife to get meet off of the bones. The meat is supposed to come off  the bone with ease by merely lightly sucking on it. Won't be going back there for a meal. Maybe a patty or quick wings. \n\nService was cool. They were moving rapidly!!\nPEACE"
    },
    {
        "id": 19,
        "text": "Friendly attentive staff and very patient with the crowd of people in line. I got the salmon with corn and rice n peas. Also roti skins were delicious and freshly made. Huge aloof food for a low price. I will be back"
    },
    {
        "id": 20,
        "text": "The food is really good but giving it 3stars because of the line average wait is about 30mins and when you call ahead of time they either do not pick up the phone or you still have to wait when you get in the restaurant. For a pretty busy place like this would think they can hire more people."
    },
    {
        "id": 21,
        "text": "This place is amazing! Such a hidden gem. My fave is the curry shrimp platter; it's huge and you get two sides included for $12, which to me is an excellent price. The fish platter and salmon platter are also great; ask for the fish gravy, yum! \n\nOne tip: there is ALWAYS a line practically to the door so expect to be waiting in line for at least 15 minutes; plan accordingly because it is SO worth the wait!"
    },
    {
        "id": 22,
        "text": "I usually get food from them atleast 3x's month so I was extremely disappointed when they gave me burnt salmon and the girl that served me put gravy on top so I wouldn't see that it was burnt. I don't even know if I would go back there now."
    },
    {
        "id": 23,
        "text": "I really like this place. As a first time visitor this past Sunday I can say I enjoyed my meal. The food was very fresh and the atmosphere is clean. I bought a large meal with Jerk Chicken, beans/rice and string beans. They have a variety of sauces you can add to put onto of your rice. I got the ox tail sauce. I also added some fried fish on the side for only $2.00. The meat was tender and fresh just like I expected. The only downside is that the meat is missing that special spice I was expecting to taste with Jamaican food. It taste great but not very Jamaican flavored. The fish was sooooooo good and crunchy. I could probably eat all day. It could of used a bit more spice but I'm not complaining for the price and quality.  I split my meal and side fish with a friend and we were both full. Next time I will probably get a small meal or large (if I'm greedy) for myself. I will visit this place often because food is great and the prices are amazing. I went on a Sunday at about 4:00 and they were really busy. I waited for maybe 15 - 20 or so min. in a line. The staff was nice from what I encountered as well."
    },
    {
        "id": 24,
        "text": "This is my favorite carribean spot!  All of their food is delicious. The only reason they don't get a 5 star review from me is because they run out of beef patties way too fast and the wait time is ungodly sometimes. But other than that the food is sooo delicious that I will wait for it. And the prices are great for the amount of food you get a small platter can easily feed 2 people or be used as two meals!"
    },
    {
        "id": 25,
        "text": "I was visiting Philadelphia for a week long training in King of Prussia. I visited Ron's last June and I have dreamt about it ever since! One knows that whenever the lines are long you k ow the food is worth it!  I'm a foodie and this place did not disappoint.  Freshness, good seasoning, and delicious. The worst thing is I live in Maryland."
    },
    {
        "id": 26,
        "text": "Very clean and professional place. I would recommend the oxtails they're the best. This has to be the best Caribbean restaurant in philly!"
    },
    {
        "id": 27,
        "text": "This was the worst !!!!! There was a long line don't know why!!!!!....sorry guys Ron is not even close to the real thing....u better off going to Golden Crust...."
    },
    {
        "id": 28,
        "text": "its good food, not authentic jamaican food-- (= big portions"
    },
    {
        "id": 29,
        "text": "Try the fish with the rice & beans with fish gravy...YUM!!! Everything that I tasted from here was very good"
    },
    {
        "id": 30,
        "text": "The salmon and cabbage was excellent the first time I went but the the second time, the salmon taste more burnt than of a grilled taste and the cabbage was hard and not as seasoned as the first time...I will return and if it's not to my liking 9/10 I won't return. The customer service is outstanding might I add and the establishment has a friendly atmosphere. I hope they don't disappoint me because I really like the place"
    },
    {
        "id": 31,
        "text": "Ewww!!!  I got attitude as soon as i placed my order.  Let's see if the food was worth the grief."
    },
    {
        "id": 32,
        "text": "I love Ron's..\n\nTheir food is delicious... \n\nI advise please dont come here on a short temper because the staff can be very rude...\n\nMy favorites are the stew chicken, curry shrimp, and jerk wings...."
    },
    {
        "id": 33,
        "text": "They have the best red velvet cake in town abd there beef party's are amazing there always nice hot Nd I like them spicy there always busy long lines but that's good because that means it's great food"
    },
    {
        "id": 34,
        "text": "I didn't eat Oxtails until I found Ron's. They're food is consistent ( I get this food often) and they give you more than enough. Sometimes the line comes out of the door, but it's worth the wait. They have seating but there's something that says \"to go\" about the place. I recommend."
    },
    {
        "id": 35,
        "text": "They have some of the best food I ever tasted !! And that's saying a lot coming from a foodie! YOU HAVE to try the fried fish Mac n cheese with yams or oxtails rice n peas with cabbage !!  only downside is it STAYS PACKED, long lines ALLL the time"
    },
    {
        "id": 36,
        "text": "I just went here an hour ago after many years. OMG things haven't changed expect for the renovations. Everything was top notch. Jerk Chicken, Rice and Peas, Cabbage, Oxtails, Beef Patties & Ginger Beer to wash it down. Only thing missing was the Coco Bread :-) Friendly Staff and well worth the wait."
    },
    {
        "id": 37,
        "text": "LOVE this spot. Everything on their menu is amazing. Love their Mac and cheese, jerk chicken wings, rice and peas, oxtail and curried goat. Be sure to ask for some oxtail gravy on your rice and peas mmmmm"
    },
    {
        "id": 38,
        "text": "Best Carribean food I've had. It gets extremely packed, so I'd strongly advise calling in your order. Then you can walk to the front of the long lines.\n\nI've had the curry chicken, and their ox tails, both are great. Beef patties are really good too, and so is the fried fish.\n\nIt isnt too expensive. I'd highly recommend this place. Dont let the area scare u away!"
    },
    {
        "id": 39,
        "text": "Ron's is a great place for Caribbean style cuisine! Their food is to die for! I normally get the ox tails with mac & cheese and their sweet potatoes (yams) are wonderful!\ni.e: you now have to pay $1.00 extra for the yams but they are worth the price believe me! They are yum & melt in your mouth.\nI would recommend this place to anyone. Ron's is located right on Broad Street so it is easy to find and get to from anywhere in the city. The trip to this place is worth the commute.\n\nPros: Wonderful food!\nCons: Be wary of the staff, most just take your order & they lack friendly customer service. Don't worry though, you won't have to put up with their behavior for long, it is a take-out place so it won't take more than 5-10min to receive your food & you are good to go!"
    },
    {
        "id": 40,
        "text": "Food is always delicious each and everytime. The oxtail, and jerk are amazing. Still havent tried the curry goat or chicken but will do soon. Thurs - Sat the lines are long and sometimes out the door/corner after 6pm but worth the wait. They also have all kinds of sodas that are hard to find. Will be back."
    },
    {
        "id": 41,
        "text": "I ordered salmon, peas and rice and cabbage today. I've always been a fan of Ron's but haven't been there in years since I've moved.  I was very disappointed in the seasonings and flavors of the food.  I was used to the food at Ron's being seasoned well with all of the authentic Jamaican spices and flavors.  What I received today was a watered down version of Jamaican cuisine.  The salmon portion was huge but lacked flavor.  The rice was bland and the cabbage tasted waterlogged.  I was beyond disappointed.  The best thing about my meal was the prepackaged cornbread.  I don't know if they reduced their seasonings to appeal to a broader base or if the cook was inexperienced but when people order Jamaican food they want all the flavors and spices that come along with it."
    },
    {
        "id": 42,
        "text": "#1 in Philadelphia the food is a mixed between Jamaican and soul food I go out of my way just to go there"
    },
    {
        "id": 43,
        "text": "If I can give zero stars I will. I'm from NYC so I was looking for a Jamaican restaurant to go to here in Philadelphia. Someone recommended here and after I read the reviews on yelp I decided to try it. BIG MISTAKE! The oxtails were beyond disgusting and the rice and peas did not taste good at all. If you're from NYC and you know how quality Caribbean food taste please do not go here."
    },
    {
        "id": 44,
        "text": "The line says it all. I've never been here at any point of the day and they don't have a line. And quite frankly, I will wait. The food is always good. Full of flavor. I have tried a couple of different food items from this eatery and have never had a bad experience. Today is no exception.  Went with the fried fish, mac n cheese and cabbage. And I'm going to tear this food up. So if your in the area stop by  and patronize."
    },
    {
        "id": 45,
        "text": "The absolute best hands down! I never knew about this spot until friends were on Facebook comparing Caribbean spots in Philadelphia. So I had to try Ron's! I was NOT disappointed at all. The fish is everything! Seasoned and tastes great! The cabbage and rice/peas were yummy as well. The ox-tail gravy was yummy!! I loved everything down to my ginger and pineapple Tropical Rhythm."
    },
    {
        "id": 46,
        "text": "Im from new york , i drive in philly for work nd this place is worth every mile it surpassed my favorite spot in new york. customer service is great can't really find anything bad to say about this place other then i have to drive an 1 and a half away to get there. There portion of food is like no other spot you would defiantly not be disappointed (oxtails rice and peas mac n cheese with candy yams extra gravy)"
    },
    {
        "id": 47,
        "text": "jerk chicken platter is huge! the prices may seem a bit more than you would want for the neighborhood, however you're guaranteed to get 2 meals out of the deal (big serving of chicken and 2 choice sides). the mac n cheese was pretty good, cant complain about the rice and beans either. give it a try if you're in the area."
    },
    {
        "id": 48,
        "text": "Best Caribbean food in Philly hand down and I've tried them all, jerk chicken is hands down the thing to get.  The fried fish (basa) is a must try (it goes quick).  Mac and cheese rice and beans and cabbage are all on point."
    },
    {
        "id": 49,
        "text": "I've visited Ron's over the years and one thing has remained consistent: the food is great. No matter what you get you'll be happy.\nSame can't be said about the time it takes to get your food. At first glance you might think the long lines you'll most likely encounter are due to the volume of business, owing to lots of people coming to get the great food. While standing in line you'll come to realize the lines are because the design of the traffic flow is horrific and waiting on each customer is a painfully slow process.  The redesign of the restaurant has made it worse which is the main reason there's always a line of faithful, patient customers.  \nThe new monitors that display the menu are pretty, but kind of far away from where you're standing in line so if you need glasses for distance don't forget to bring them. And frustratingly, once you've squinted enough to get a read on something, the screen \"refreshes\"; starts spinning around and a new image appears.  Because they don't have any written menus available to read while waiting in line, when you finally are served, you're faced with a lot of good food but uncertain of what goes together in the small or large dinner dishes, or the platter.  There's so many offerings you feel a bit silly asking the clerk to run down all that there is and end up just ordering anything so as not to aggravate the people waiting behind you.  The stations where you go for service don't make any sense and don't appear to have resulted from any meaningful planning; you can't see the full selection of offerings from most of them, so again, ordering is  guessing game.  My guess is most of the customers are regulars who end up ordering the same thing over and over without needing to see a menu.  The occasional or new customer will most likely be aggravated by the wait and the inability to figure out what's included with the combinations of offerings, or even what the sides are.  But the food is delicious!"
    },
    {
        "id": 50,
        "text": "So decided to try this place out bec a fellow classmate who lives in Philly said I had to try it....I was not disappointed at all.  Everything was authentic. The ox tails soooo good.  Jerk on point. And the 1st time I've had pepper steak yeah it was amazing.  Yes the long is line but it goes fast and the food is worth it. We just talked to the folks in line!"
    },
    {
        "id": 51,
        "text": "Food is very good but as usual in an African American establishment the lines are extremely long and they do not have enough workers to fulfill the demand especially on the weekend .  If Rom carted about the amount of business he receives the staffing will be increased to serve its customer in a timely manner ."
    },
    {
        "id": 52,
        "text": "This is a real comfort meal kind of place. We were on a Caribbean/Jamaican cuisine crave so this was truly a happy find. The interior was just remodeled so it's a lot newer than most take out spots. You immediately see those beautiful fried fish and jerk wings on display as you approach the counter. The other side of the counter is where all the sides are. \n\nThe ordering system is set up much like Boston market. You pick your protein and your sides. We got oxtails and stewed chicken, both with rice and beans and the sides were cabbage, okra and fried plantain.  The oxtails were good and clean in flavors, it wasn't oily, which is rare for this dish. It didn't exactly pop however, it was mild. The oxtails themselves were very tender. The chicken fell into the same category, food but missing something. The plantain were good, again, not oily. The okra is probably the only thing that was pretty generic, it was simply boiled.\n\nWe also ordered a side of fried fish. It was only $2 extra and it ate like a meal. The dish was very large and fried to a perfect crisp. The flavor was kind of flat however, I don't think they seasoned the flour enough. Over all though, it was a solid experience. Huge portions, friendly service, simple and easy to order menu. I wouldn't go here for special occasions but I would definitely stop by for casual lunches with friends, the place makes you feel really good!"
    },
    {
        "id": 53,
        "text": "Update:  I have been to Ron's several times since my initial post.  As stated before, the chicken is good, although it is more grilled chicken rather than jerk.  Jerk chicken has a little spicy flavor that is marinaded over some time, which Ron's does not.  It is simply tasty grilled chicken.  I always order my chicken with no sauce and I have noticed that most people order with no sauce as well.  The sauce is BBQ sauce! Still, their veggies are good and hubby likes the ox tails a lot.  I would love to see Ron implement a real jerk sauce.\nI have patronized this establishment four or five times over the past couple of months.  My first visit I enjoyed the jerk chicken, but HATED their so called jerk sauce.  Not a problem, I just ask for no sauce.  The sauce is more like a bland, tasteless BBQ sauce, not at all like the consistency of true jerk sauce.  However the chicken was good as was the vegetable medley - that was when I got my food early in the evening.  The cabbage was also very tasteless, not at all like true Caribbean food.  However, it was not so bad that I could not work with the product until today!  \n\nI typically pick up my food by 6pm after getting off work and have never had a complaint that encouraged me to post a review on Yelp.   Tonight I  worked late and did not have time to cook and did not want a fast food dinner, so Ron's came to mind.  Bad mistake!!!!  The platter was comprised of bits and pieces of what should have been a breast, wing, etc.  What really got my blood boiling was the so called vegetable medley.  It was obvious that the medley got low by the time I ordered so they dumped a bag of carrots in the pot.  Not at all what I got the last time because I can not eat carrots.  Secondly, the fragments of chicken was overlooked / dried out.  And what made the bird twice as bad was the fact that they nilly willy slathered that so called jerk sauce over the chicken AND the veggies.  Hubby wanted to take it back, but I convinced him that it was not worth going back out at that time of the evening.  I know.... That is what a lot of businesses count on.  \n\nIn summary, I have enjoyed a few platters from Ron's.  However, if you like the true Jerk sauce, a) order early and b) request no sauce and put your own sauce on at home."
    },
    {
        "id": 54,
        "text": "I ordered the ox tails too.\nIt was really tasty and salty and really great for young man as me.\n\nox tailという牛の尻尾？？を煮込んだようなものをいただきました。\n味付けが濃いのですが、若い私にとってはかなり美味しかったです。肉厚な牛の尻尾はとろけるくらいプルンプルンでまた来たいと思いました。"
    },
    {
        "id": 55,
        "text": "Very clean inside unlike other places in the area. The restaurant needs full menus because what is listed is incomplete and then when you get in line to order you have ask questions, this is one reason why it takes a long time to order. \n\nThe proportions were huge! The string beans were not seasoned which is odd because everything else was. Love the jerk wings!"
    },
    {
        "id": 56,
        "text": "Best Jamaican food in Philly.The jerk chicken is so moist and delicious it also has a great smokey flavor. The curry shrimp is a treat, not only are the shrimp big they are beautiful. The golden color of the curry sauce is mouthwatering.\n\nThe fried fish is perfectly cookef and flaky no hot sauce needed. The sides are all good. I just love this place.\n\nIt gets packed quickly so don't be surprised if the lines at the door."
    },
    {
        "id": 57,
        "text": "When I got here around lunch time, the line was pretty long but moved fairly quickly. The workers here are really nice, they really tried to explain the dishes to you and how everything works. After dishing your food they make sure to show it to you to make sure it is to your liking. I got ox tail with a side of rice and beans, and mac & cheese. I will say it is a little bit pricey for a Caribbean place, however it is nicer than most that I've been to and they're not stingy with the portions. The ox tail was really well flavored and fell right off the bone. The mac & cheese was just okay. Their beef patty is good too. I would come back though, maybe to try their jerk chicken or some of their other raved about meat dishes."
    },
    {
        "id": 58,
        "text": "Excellent ox tail and super fresh. The ladies were super nice on pointing out of what we should have. My wife had the fried fish. She said it was the best she has had in a long time."
    },
    {
        "id": 59,
        "text": "This place is all the way up!!!!  If you are looking for authentic, Caribbean, Island, Jamaican food, look no further, this place is it."
    },
    {
        "id": 60,
        "text": "Love the food curry shrimp is my absolute favorite the oxtails are so tender never have had a bad experience and the fried fish thank you Jesus hallelujah"
    },
    {
        "id": 61,
        "text": "I've been eating here for close to 20 years and have never reviewed it. However, I recently attended an event that used Ron's as their caterer and OMG! This food is so good, I had forgotten how good but was surely reminded with the first fork full. All this time and they did not disappoint then and definitely not now! The food was great, service was good, and you can't beat how reasonably priced everything was. I would give five stars if the payment process was more convenient. Everything had to be done in person as there were no electronic payment options (e.g. Pay Pal, Google Invoice, etc.) and there's no delivery service. But other than those easy to fix matters, everything was good!"
    },
    {
        "id": 62,
        "text": "Ron's was good. The line leading into the dinning room and ordering counter told me so. They are the hot spot at B&O. The Ox Tails were really good. Serving sizes suggest that you can have leftovers for dinner. If you can stand to not be greedy and eat it all as soon as you get into it. Which is very difficult. They have all the other delicacies of Jamaican food. Jerk this, Ackee Fish that, Curry goat, Plantains, Rice-n-Peas, cabbage, Beef Patties, Carrot Cake. Really you should just go down and get some of their great food for yourself . It's worth it."
    },
    {
        "id": 63,
        "text": "This place use to be my favorite .... unfortunately I can now do with out it . Went in for curry came out with jerk smh everyone rushing"
    },
    {
        "id": 64,
        "text": "I liked their food back in the day I'm not sure what happened. I came in last week 40 mins before closing. I had a small oxtail platter with rice and peas. The only sides left were string beans, mac and cheese and yams. I chose yams which were an additional $1.50. The oxtails were very fatty and i know it was a small platter but I literally had a large spoonful of oxtail and all rice and gravy. I was so dissatisfied with the taste I threw the entire platter away, waste of $12"
    },
    {
        "id": 65,
        "text": "Ran here for a quick bite &...it did its job. This isn't a place for ambiance & making it special. Ya wan fi eet, ya go n eet. Tiny place that you'd primarily do takeout for, but there are some tables to sit down & enjoy your food. A beef pattie is easier to screw up than it is to master, & they impressed. Not a great looking place or anything, some of the food looked greasy. That said though, it's promising for a good quick meal if you can ask the friendly-enough (not to be confused with friendly) servers to give you the pieces you want. Why not, give it a shot."
    },
    {
        "id": 66,
        "text": "Good... LOTS of food. And very SPICY. I'm from out out town, but I did enjoy my curry goat and daughter loved her oxtails."
    },
    {
        "id": 67,
        "text": "The phone service (for advance orders) & overall service has improved drastically based on recent visits, especially in terms of the wait times (no unnecessary long holds on the phone & slow lines). I even had multiple employees along with the owner asking if I received help after I already received assistance & was really impressed. Everytime the owner is there, he is always friendly, helpful & hands-on which is a great approach. The food is always delicious, hot & fresh..definitely worth the money & worth checking out!"
    },
    {
        "id": 68,
        "text": "This place is heaven sent! Their Curry Chicken is absolutely to die for! The size of their platters are so huge they will put you in a coma. Only complaint is how crowded it gets but then again that's how good they are. Broad & Olney ain't a great location but what can you do?"
    },
    {
        "id": 69,
        "text": "The service friendly and decent.  There was a line to get the food but it was moving (paid parking  meters outside..give yourself some time). I had brown stew chicken here and was not impressed at all though. I believe that this is a simple enough dish to get right.  I probably won't return unless it is an emergency. However, based on the line I'm guessing other items possibly taste better there."
    },
    {
        "id": 70,
        "text": "This food was really really good. I've been twice since I moved to Philly and every time it's delicious. Highly recommend!!!!! The is always a wait but they get you through quickly. They check and triple check your order. They even let you look at it before they charge you for it to make sure it's to your satisfaction. Definitely will be returning over and over again."
    },
    {
        "id": 71,
        "text": "I heard about this place from a couple of people. Needless to say, I had to try it. We placed 7 meal orders for pick up and it came out to less than $100. On top of that, the portions were large and absolutely delicious. And this is coming from my discerning Jamaican family. We had goat roti, curry shrimp, curry goat, stew chicken, oxtail, jerk chicken, and brown stew red snapper. My mother compared the Red snapper to one she had at the seaside in Jamaica. It was super fresh and tasty! The only thing I found fault with was the jerk sauce on the side. It needs to be tweaked, but that won't stop me. I've been looking forward to the next trip ever since."
    },
    {
        "id": 72,
        "text": "The food is ALWAYS FRESH! Portions are good. The lines are long, but they move fast. The people are very nice and accommodating. I go there very often. You should too"
    },
    {
        "id": 73,
        "text": "I was a patron at Ron's Caribbean Cuisine while in Philly with my boyfriend visiting relatives. We had a lackluster philly cheese steak experience so our hosts were determined to give us some good food. Well, they took us to the right place! You could smell the deliciousness as soon as you walked in the door. The line was long but that didn't bother me one bit! When people are willing to stand in line it's for a reason! This was actually my first time having Caribbean food and I was not disappointed. I had jerk chicken, Mac and cheese, and cabbage. The food was hot and flavorful and the customer service was on point. I would definitely recommend this place to anyone I know that is visiting Philly! Keep up the great work, guys!"
    },
    {
        "id": 74,
        "text": "I have been a patron of Ron's since I was a teenager. However, after my last two encounters I am not sure I will be returning. The food is always great, but there seems to be a new manager, Lou, there who has no customer service skills. The first time I realized there was someone new there was when I phoned in an order and the man on the telephone was extremely rude. I brushed it off and figured someone was having a bad day. Yesterday, I called in my order and did not have a problem until I arrived. Lou told me they did not have an order for me. I explained that I called and he should check with the employees. He just gave me a look as if I were not telling the truth. I asked if he wanted to see the call log on my phone. He then accused me of yelling, which was far from the truth. I explained the music is loud in there so I wanted to make sure he could hear me. He eventually found my order. An employee wrote Ce Ce instead of Stacey. She probably could not hear me when I called in because of the loud music. I did not receive so much as an apology or anything. He just went to the\nback of the restaurant. \n\nI understand that mistakes happen but Lou should have investigated a little more before alluding to there not being an order for me. In addition, he does not seem to have the patience necessary to deal with a high paced restaurant such as Ron's. Each time I placed an order and came across Lou, I felt like I was not a respected customer. Unfortunately, I would rather travel a little further to Jamaica D's or Moonlight Cuisine for Caribbean food rather than to deal with rude employees."
    },
    {
        "id": 75,
        "text": "I had this place bookmarked as a \"must try\" for Caribbean food in Philly. So, I knew I would give in to my oxtail desires this week and it just so happens I had time to stop by Ron's today. \n\nI placed an order over the phone for a small oxtail platter with rice, peas, and cabbage. I also ordered a small jerk chicken platter with rice, peas, and string beans. Upon completion of my order, I was given a number and asked for my name. Upon arriving to the restaurant I noticed people standing all over the place. There was a barrier where people were supposed to stand, but no one was behind the barrier. I spoke to a fellow customer and he told me I needed to go up to the window and see if my food was ready. I stood there watching a woman call out random names then people would walk up to the window. Wow, talk about unorganized. Approximately 10 mins later, the woman returned to the window and asked if people wanted to check and see if there orders were ready. I gave my name and number. She closed the window and then I stood there for another 15 mins. Mind you, I drove from Jersey, which took 45 mins. So, between the 45 min drive, standing in the sun to approach the window, and standing around to get my food, I was over the experience. I kept thinking, \"if I just get my food and it's good, I'll be ok.\" My name was finally called. I paid $26 and left. \n\nWell, I drove back to Jersey to try my food. The platters were heavy, so there was a lot of food. Everything looked good, so that was great. We tried items from both platters. My food review is below.\n\nThe good: Platters  were filled with food. There was lots of gravy for the oxtails, rice & peas. \n\nThe not so good: My jerk chicken tasted just like my oxtails. The jerk sauce didn't really taste like jerk sauce and the chicken wasn't spicy. I don't know if someone poured the same gravy over the meat on both platters, but I didn't enjoy the gravy at all. The oxtails were just ok. I have had much better in and out of Philly. The cabbage was ok and the string beans were tasteless. Overall, I would not return to Ron's Caribbean Cuisine bc Kingston Philly is a much better option. Guess, I will drive the extra 4 mins to go there next time."
    },
    {
        "id": 76,
        "text": "Underwhelmed and Overrated\n\nDecided to stop in here after being stopped by a patron raving about their food. I was originally only going to the Halal meat store next door, but decided to give this place a try.\nThe lady stated the place was very clean, and she was so surprised at how empty the place was because normally they are packed full.\n\nWhat did I order....\nGrilled salmon with rice and peas, and mac n cheese.\n\nNow I won't lie...the food had the car smelling delicious....but that's as far as delicious went. \n\nSo, you know how markets will sell marinated/pre-seasoned meat to cover up the fact that the meat is starting to go bad? Well the salmon tasted like they kept is a week too long. It had a weird taste to it. And it wasn't like it was a spice I wasn't used to eating...this was a taste of old fish that had been cooked and lightly seasoned. (P.S. I was a pescatarian for 10 yrs...I know what old fish taste like) Between the one bite I ate and the one bite my mother ate, just to make sure it was just me who thought it was bad, 4/5 of the salmon filet was trashed.\nThe mac and cheese looked so unappealing. It was dry and waaaaaaay overcooked. Same deal...one bite from me and one from my mother....the rest was trashed. \nNow, the rice and peas was better. And this was simply because the oxtail gravy that was put on top was very very good!! Once I ate through the \"layer\" of rice and peas with the gravy, the rest went back to being unappealing....and in the trash it went!!\n\nSo overall, I wouldn't go back...unless it was to buy a bottle of ginger beer. I love Ginger Beer!!"
    },
    {
        "id": 77,
        "text": "Everytime I ever got any food from Ron's it was ALWAYS satisfying. Amazing jerk chicken! I would give it 5 stars if it wasn't located at such a crazy intersection."
    },
    {
        "id": 78,
        "text": "I heard so much about this place for years. I decided to take the ride from Jersey. Once I got there I tried to use the bathroom and they didn't have one. The line is long but it moves fast. Overall the food was ok. I expected the food to be amazing and I was disappointed."
    },
    {
        "id": 79,
        "text": "Can I say oxtails! I never had oxtails\nbefore Ron's and I must say I was impressed and they give large portions!"
    },
    {
        "id": 80,
        "text": "I'd heard the food was good Rons and finally ate from here for the first time today. Everything about this place is top notch. I called just to make sure they were opened and found out I had to place my order over the phone which was fine with me. The lady I spoke with was very nice, polite and helpful. I ordered an oxtail platter with rice and peas and cabbage. I also ordered a side of Mac n cheese and plantains. My food was ready when I got there, no waiting at all. Everything was absolutely delicious. They gave me plenty of tender oxtails, plenty of rice n peas but not too too much like some places. The Mac n cheese tasted like good home baked, the cabbage was just right, tender but not soggy, the plantains were soft on the inside and almost a little crunchy on the outside. Everything was seasoned well and the gravy on the oxtails and rice and peas was a little spicy but not too much so. I'm really impressed with this place and hope the food is always this good. I'll definitely be back to try something different next time."
    },
    {
        "id": 81,
        "text": "My favorite Jamaican spot! I usually get the pepper steak with white rice, yams, veggies and cabbage and it's good every time. My husband gets the curry chicken, yams and rice and peas & loves it as well."
    },
    {
        "id": 82,
        "text": "This place is too overrated. The service is not good and their food compared to other places suck. I went here only 2 times and the second visit is my last. My first visit I had jerk chicken steam cabbage and rice and beans. The cabbage and rice and beans was very good but the chicken was alittle dry and the chicken was not fully covered with the sauce but I manage to finished it. My second visit was today and let me tell you something it wasn't pleasing. I ordered curry chicken with rice and beans cabbage and mac and cheese. It smelled good and I thought it was going to be a moment I will not forget but the taste was very salty the mac and cheese tasted like plastic but the rice and beans and mac and cabbage was good. I'm not coming here anymore I rather have Jamaican des with better food and better customization."
    },
    {
        "id": 83,
        "text": "I'm native West Indian and when I say Ron's is the REAL DEAL, please believe me!!! The gravy that is used to make their Roti is beyond luscious, the goat is fall apart tender, and the shell melts in your mouth. If you love authentic West Indian food you simply must try"
    },
    {
        "id": 84,
        "text": "Curry Chicken Rice and Peas and cabbage- they use parboiled rice and it is not good, it has an imitation coconut flavor and doesn't taste like real coconut flavor. The chicken is rubbery and the curry sauce is very thick and it taste like curry paste and water. \n\nBrown stew chicken is not cooked well looks like brown canned gravy thrown on top of undercooked chicken and it taste horrible don't eat from here!"
    },
    {
        "id": 85,
        "text": "Some of the best Caribbean food I have ever had. The portions are generous, service is great and the food is delicious. Our server made each plate and showed them to me to make sure I was satisfied with the meals before giving them to me. If you are looking for a place that serves great food at reasonable priced this is it. It is real gem that gets an incredible amount of business."
    },
    {
        "id": 86,
        "text": "While in Philly on business a local friend  recommended Ron's because they know I love authentic Jamaican food.  Since he swore by it I had to try it out.  I ordered a chicken patty, fried fish with rice and peas with fried plantains and a curry chicken roti.  Everything was delicious and the price was right.  Most places don't have roti and always sell out of patties early.  Ron's still had both.  You could tell by the line of regulars Ron's is the truth.  Go check it out."
    },
    {
        "id": 87,
        "text": "I think Ron's is the Best Caribbean in Philly. \nI've been to 90% of the others, skipping the really dirty looking ones. \n\nIt is always at least 15 people in line though. \nI hate that. Open up another store. \nFood is fresh. It has to be to feed the constant barrage of customers."
    },
    {
        "id": 88,
        "text": "The ox tail is to die for service is good try to get there is early as possible because the lines can get crazy"
    },
    {
        "id": 89,
        "text": "Food is good & they give big portions. I love the oxtails! Usually is a line, but worth the wait!"
    },
    {
        "id": 90,
        "text": "I had an oxtail platter with Mac n cheese and cabbage and a slice of chocolate cake today. The oxtails Mac n cheese and cabbage were delicious, the cabbage could be cooked more since I like mine tender and this wasn't. The chocolate cake gets 0 stars, it tasted like it had been in a smelly freezer and I couldn't eat more than 2 tiny tastes. I'll skip deserts from here from now on."
    },
    {
        "id": 91,
        "text": "If you drive by or walk by you would would think this is the place to go... The line is extremely long ... I haven't ever had to wait in line this long anyway for food unless it was red lobster on a Sunday. The display was nice.. Although the jerk wings didn't look jerk...the BBQ chicken didn't look like jamican B BQ ( color was off) looked more like american BBQ. Bass fish and plantains looked super good. My new friend suggested cabbage and oxtails. So that's what I got and plantains. Food smelled good seemed to be generous portions until I got home and opened it. They give you plenty of rice and peas...moist but too much. The oxtails DON'T have an AUTHENTIC JAMICAN TASTE AT ALL. They are cooked enough...they need to cook.at least another hour to be falling off the bone. The sauce is ok but it taste more like black peoples soul food oxtails not jamican at all. The cabbage was blanched  ...not cooked at all it was like hot cold slaw without any taste. they don't give you but about 4-5 oxtails on the platter. I gave it a 3 for effort...NEED to CoOK the OXTAILs longer and ADD JAMACIAN seasoning cause that is not jamican oxtails. May come back if he treats....My New Jersey spots are more authentic..."
    },
    {
        "id": 92,
        "text": "Grabbed some Togo during coronavirus while visiting a friend in Philly food was delicious. I had to call to place the order had to call a few times before they picked up but worth the wait"
    },
    {
        "id": 93,
        "text": "I have heard about Ron's for years so decided to go today for lunch since I was in the area.  I got there around 1:30, I was shocked to see a line.  After about 15 minutes it was my turn to be waited on. The young ladt was very courteous. I ordered oxtails with rice and cabbage, DELICIOUS!!!. \nThe portions were huge and the prices are great.  I saw all the various platters being made, yummy and big. I can't wait to try there fish. Worth the wait!"
    },
    {
        "id": 94,
        "text": "The food is good, the service is relatively ok, but the wait and long lines are ridiculous. By the time you actually get up to the front of the line, you are kinda not hungry anymore."
    },
    {
        "id": 95,
        "text": "This place always has a line no matter when you go. However, they alway keep the line moving. I love the oxtails, curry chicken roti, cabbage, rice and peas, dumplings, and plantains.  \n\nThey have 3 different platter sizes and the value for each is pretty good. I'd definitely recommend this place"
    },
    {
        "id": 96,
        "text": "Love they food,I'm always eating in therei always get\"Jerk chicken,Mac & yams\"it's kinda hard to get them on the phone sometimes but it's worth it"
    },
    {
        "id": 97,
        "text": "Had the pleasure of trying their food for the first time the other day and woowza! Pepper steak was absolutely delicious, tender and juicy! The \"Small Size\" is actually a huge portion and there are lots of options for a side. Hands down THE BEST and most different pepper steak Ive ever had. Also got 2 beef patties, nothing too special but still good! 10/10 would recommend to anyone looking for something different and cant wait to try other dishes from there!"
    },
    {
        "id": 98,
        "text": "I'm Jamaican so I can't eat anybody food. The service wasn't bad or anything but I ordered the stew chicken and it wasn't it. I couldn't finish it. And me is a person weh love nyam! Can't say I'll be back."
    },
    {
        "id": 99,
        "text": "This place is the worst,  during the pandemic they require that you call order in and stand in line for 30 min to pick-up your order. This line is moving so slow the person on the window must be smoking weed....i will never patronize again, old ass food."
    },
    {
        "id": 100,
        "text": "I spend atleast $100 when I travel from out of state to eat this Amazing food. Plus they have very good roti. All their food is bangin! If you haven't been yet you need to go right now. Beware there usually is a long line but it's worth it"
    },
    {
        "id": 101,
        "text": "I was extremely pleased with this food. The fried basa was off the chain the cabbage was good and the rice and peas were great. There was a super long line. But worth the wait."
    },
    {
        "id": 102,
        "text": "These place is very busy and they did a full total good renovation of this spot. Very clean inside, and food is hot and ready. Great food, and great prices."
    },
    {
        "id": 103,
        "text": "Ok, so this was my first time here. A few people have told me about it and I had even tasted the fish before. Let me tell you something. These folks are a class act. Professional, kind and the food was absolutely delicious. I brought my mother and father here with my best friend for dinner. The ox tail fell straight off the bone. The macaroni and cheese was actually macaroni AND cheese! The cabbage was good too. We had the fish and the plaintains too. I mean it was just delicious. I absolutely will be back again. Kudos to a well ran establishment."
    },
    {
        "id": 104,
        "text": "The BEST Jamaican spot in Philly. The food reminds me of my mom's cooking. However it sucks that every time I visit Philly there is a long line and COVID doesn't make it any better. Don't sleep on this place. The Mac & Cheese with the oxtails is to die for. The jerk chicken scrumptious and the beef patties melt in your mouth. Way better than Jamaican D's"
    },
    {
        "id": 105,
        "text": "So I got the pepper steak also ox tails both rice and beans. All I got to say is food amazing beautiful flavors tender steak n ox tails. Also this my first time trying the place best believe I'm coming back!"
    },
    {
        "id": 106,
        "text": "I eat there many time and the food is pretty good. Every so often the food taste different, they may have different Chefs.\nThey have big portion\nThey recently started charging extra if you pick mac n cheese, sweet potatoes as one of your side dishes I don't understand that logic. \nTheir ox tails, fried fish, curry shrimp and plantains are my favorite. \nI think the cabbage needs some seasoning. \nThey have great workers but every once in a while you see the attitudes come out.\n\nBe careful with parking, PPA always in the area looking to ticket your car."
    },
    {
        "id": 107,
        "text": "Horrible experience!!!! A piece of a plastic latex glove was in my food(pepper steak, rice and beans and cabbage. Once I returned back to the restaurant the owner and food server was beyond ignorant. They barely wanted to give me a refund."
    },
    {
        "id": 108,
        "text": "Chicken roti is pretty good here, as are the fried plantains and fried dumplings, but I'm disappointed by the overly salty mac and cheese. I've been a couple of times now and the food is good, but the whole experience usually isn't. That being said, it's a Black owned place, small business, and there are so few good Caribbean spots in Philly. \n\nDuring covid, you place orders over the phone for pickup, but for some reason still have to wait in a long line in the cold to pay for the order. I was told 15 min, arrived at about the 15 min min mark, then waited another 15 minutes to actually get my food. \n\nCheck your orders before you leave. I didn't, and of course I received the cheaper version of the item I ordered, confirmed over the phone,  and paid for :/"
    },
    {
        "id": 109,
        "text": "I've been here about 4 times and the food and portion size are amazing. It's 4 stars from that alone but the last time I was here there was a huge cockroach on the ceiling, the kind that can fly, and that's not even the reason for the two stars because I can understand a restaurant like that having roaches but the employee picked up a broom, knocked it down while people were standing directly under it and yelled stomp. There was also a homeless lady there on 3 out of the 4 visits who pesters you in line and will put her hands on you asking for food or money."
    },
    {
        "id": 110,
        "text": "I had the chicken with cabbage and mac n cheese. Everything was outstanding. Chicken was so most and great flavor. Mac n cheese was some of the best I've ever had!"
    },
    {
        "id": 111,
        "text": "Food is great here and that's what keeps me coming back.  I like that you can call ahead so your wait won't be long.  Only complaint is the person that answered the phone was impatient with me when I was ordering and had to choose a alternative side."
    },
    {
        "id": 112,
        "text": "Seasoned perfectly... Oxtails, cabbage and macaroni - all fabulous. I'm always worried about oxtail gravy being too thick and incorrectly seasoned. This was perfect. I wanted to savor every bite."
    },
    {
        "id": 113,
        "text": "Eh not impressed.   Won't be back for a second  go round. I could do the same home or stay in in the valley and get the same or better"
    },
    {
        "id": 114,
        "text": "There's always a line and now I know why. Holy crap their food is good and perfectly seasoned! I wanted to try everything so I ordered the goat Curry, oxtail, and jerk chicken with a bunch of sides. EVERYTHING was on point and delicious."
    },
    {
        "id": 115,
        "text": "I went a few times during covid when they started the out door only pick up situation and the wait was ridiculous. Not sure if they are only doing this method, but this place always had a long wait but the food is good."
    },
    {
        "id": 116,
        "text": "Normally, I am very pleased with the food here.  Unfortunately, my last visit on Tuesday was a disappointment.  I ordered the oxtails.  They were very small and lacked flavor.  I also ordered 2 pieces of fish.  I received 3 pieces the size of chicken tenders.  It seems since COVID-19, the portion sizes have gotten smaller and the prices higher.  I will give it one more try, but if I am disappointed again, I will have to find another place for Caribbean food."
    },
    {
        "id": 117,
        "text": "First time eating here... I had the Jerk chicken, Ox tail, and Fried fish... all were very good. The Mac & Cheese was grandma good!  Highly recommended."
    },
    {
        "id": 118,
        "text": "Good food but customer service is slow!!! You have to wait 30 mins to an hour in the line to pick up your food despite the fact that it's ready!"
    },
    {
        "id": 119,
        "text": "Great food went here today and it was the best. A mush stop by. You won't be disappointed"
    },
    {
        "id": 120,
        "text": "Good food but the wait is too long, especially if you call ahead. If I preorder my food, I shouldn't have to wait an additional 30-40 minutes to get my food which I arrive."
    },
    {
        "id": 121,
        "text": "The food here is so good. I get the oxtail everytime. It's reasonably priced and has a favorable ratio of oxtail to bone. The portions are generous and the food is consistently good. The service is pretty typical for a Caribbean restaurant. Not very warm and friendly but they got the job done.\n\nOnly big complaint is the long wait. You literally have to wait in line for 30 minutes to get your food. You can't order delivery or takeout so there's no way to get around this. No clue why it takes so long given that most people are probably getting oxtail or jerk chicken with rice and peas and cabbage. You'd think they would just cook more at a time to accommodate the long lines but no. Also, the area where this restaurant is located isn't the nicest.\n\nGood food, though, so definitely worth it!"
    },
    {
        "id": 122,
        "text": "Great food but very slow service. It's a pick up joint, so you serve yourself. That being said, it probably takes 15 minutes to get through the line (worth it) and another 15 for the staff to bag the food, no hyperbole there. \n\nCurry chicken does not taste authentic, their roti skins are not my favorite, and they don't have greens. But everything else I've had over the 20+ time I've been there is really really good."
    },
    {
        "id": 123,
        "text": "I absolutely love this place. I travel all the way from New Jersey for Ron's. They are the best Jamaican food I have ever tasted in a while and you can't beat their pricing! The only thing that needs improvement would be the staff. SOME of the staff can tend to be a bit rude but I can understand a little, they're dealing with hungry customers all day. But other than that, Ron's is the place to get the best food!"
    },
    {
        "id": 124,
        "text": "The only place to get oxtails in this area! South jersey has a limited number of Jamaican restaurants none of which I would order oxtails ft so it's over the bridge we go!"
    },
    {
        "id": 125,
        "text": "No other Caribbean place has my heart like Ron's. All though the line is usually out the door' it's worth the wait. \n\nParking: Street parking. Meter. \n\nService: the Servers are very tentative and accommodating. They make sure your special request are met: extra this or don't let this touch......\n\nAtmosphere: Ron's expanded the sitting area and added air conditioning. Glad to see the expansion.  There are about 4 to 5 servers, so although the line is long, it goes pretty fast. \n\nThere are many things to order from from Chicken to beef to seafood. I've never ordered anything from Ron's that I didn't like. I ordered for the first time the fried fish and omg!! Crispy and delicious!!! Fresh! I also ordered the green beans which were cooked just right! The mac & cheese was amazing. I ordered the plantains as a side and they were nice and sweet. \n\nOverall it's tasty Mon!!\n\nEnjoy!"
    },
    {
        "id": 126,
        "text": "Although Ron's food is pretty good, the staff is very rude and unorganized. I called to place my order. I was expecting to be able to pick my food up like other normal establishments.  I was never told when placing my order that the staff does not make your platter until you arriveand pay. I arrived with my co-worker 30 mins later looking to pay and recieve our platter;needless to say,  there weren't  any platters. Certain dishes were not available, so, we were asked to wait 10 mins. 20 mins later, no platters. Then I found out, because my complete order was not available, the staff sold food I had been waiting 40 mins for. On top of that, the young lady who was waiting on me was very rude. Finally,  I asked for a manager. Once I asked for my money back, the manager decided to try and hurry up my orders. My co-worker was able to get her platter. (only because she changed her platter to what they had available at the time.) While the food is good, the customer service was horrible. I will be continue to frequent Maxwell's instead of Ron's."
    },
    {
        "id": 127,
        "text": "Always, Always LOVE this place! \n\nRon's has serviced this community for years, and in a world of processed, microwaved entrees, Ron's staff actually COOKS REAL FOOD. \n\nFrom Basa fish, Red Snapper, plantains, cabbage, peas and rice, jerk Salmon, jerk chicken, curry everything...you can't go wrong! NEVER have I ordered anything that I didn't like!"
    },
    {
        "id": 128,
        "text": "I love their food everything tastes great! My favorites are Curry goat, oxtails, fried fish, jerk chicken & red snapper. Butt don't sleep on their soul food side, the Mac & cheese is  bomb !!"
    },
    {
        "id": 129,
        "text": "They went up on the ox tails but there still the best I've had from a Caribbean restaurant. The food is usually good I staff it's rude. Just wish the line would move faster."
    },
    {
        "id": 130,
        "text": "Ron's has good Jamaican food. I have been here many times but I never thought about doing a review because The spot is always crowded and I thought everyone knew about it.  When you enter the restaurant the food is situated at the back of the restaurant is warming trays. However you don't get to see the food right away because there is always a long line. The line moves rather quickly and before you know it you are in the food area.\n You get a look at all that colorful Jamaican food laid out before you. There's a jerk chicken, red snapper, curry goat curry chicken and curry shrimp, brown stew, peas and rice cabbage and all types of vegetables, everything so fresh and so colorful as so fragrant. \n You want to buy everything, but as usual I go directly to my favorite Jamaican dish-Oxtails with peas & rice,  sauteed.cabbage and a piece of festival bread. So ono!  I wanted to give them a 5 stars but the staff has no patience and no humor."
    },
    {
        "id": 131,
        "text": "I gave in last night after so many other disappointing Jamaican spots in Philly and I'm pleased to say it was really good. We ordered a Large oxtail and large fish platter both with white rice and corn. The oxtail was a little bit fatty but the flavor and spice was great. The fish had a weird chemical smell so we didn't eat the fish at all. The large oxtail was $17 the box looked more like a medium but thank goodness it actually taste good this time. Call ahead the line gets very long"
    },
    {
        "id": 132,
        "text": "By far have the best fish ever made secondly the Mac and cheese is the best side I ever tasted the curry shrimp is good but not the greatest but that pepper steak is a must have by far I need it once a week to at least keep my cravings up for it with out burning my self out the lines explains it all so order ahead to get yours"
    },
    {
        "id": 133,
        "text": "Ron's been a Philly staple for a while. Probably been coming here for over 10 years off and on. I was in the area so decided to get in on a piece of Jamaican nostalgia. I ordered the basa fish platter, really good price, love how quick and non-attitudey everyone is. BUT I received the smallest, itty, bitty pieces of fish for my platter. It probably seemed even smaller because I had like 50 scoops of rice and about 60 scoops of canned string beans on my platter. Don't over compensate my platter with an insane amount of sides. Either way, the fish was okay...they don't have collard greens so don't even ask. Just an all around disappointing meal. I probably won't be back."
    },
    {
        "id": 134,
        "text": "Ron's is soo good. Such reasonable prices for their options. This past trip I got the fish platter that came with two sides the cabbage and rice and beans. The fish is the best thing they sell is it perfectly seasoned and fried to perfection. They sell it individually or in a platter. I also got the BBQ wings, I do with they were cooked a little harder, but that's a personal preference so I wont complain much about that. The sauce was really good and the wings were covered in sauce which was nice since some places are extremely skimpy on the sauce. It is in a super busy area with businesses up and down the street and parking is pretty bad so be prepared to park on a side street or circle the block a few time or if you want to test your chances with PPA you can illegally park. \n\nDuring COVID they do have signs that promote social distancing but most people in line don't really adhere to it. I would just suggest they have someone out there directing patrons on where to stand and the line is always long. \n\nYou do have to call ahead right now to get your food and you cannot order at the window. This process was very easy and I had no difficulties. They even asked how far away I was when I ordered so that my food would be freshly prepared and packaged and not sitting there which I appreciated. \n\nOverall I think everyone should try this place and give the fish a try."
    },
    {
        "id": 135,
        "text": "Tried this place for first tine. Nasty ust nasty. Mac and cheese was old. I can tell. Curry chicken was awful. Fish was greasy and nasty. Lil delicious Woodland Ave is way better. Will not be back. Cooks can't cook.\nRice was awful. Candy yams were horrible."
    },
    {
        "id": 136,
        "text": "All I can say is \" Yum Yum Yum!\"\nLately, food everywhere, except home, has been like a crap game, whether it be bagels, chinese, hoagies, etc. But then I have my 1st Ron's experience...the large oxtail platter with rice & peas, mac & cheese, and yams! So much food, so tasty! I'm sure that I'll get 4 meals out of this, and I'm sure that a return trip isn't out of the question! So Satisfying!"
    },
    {
        "id": 137,
        "text": "If you live in Philly and love Caribbean cuisine, go to Ron's. Period. My friend who's lived in the area highly recommends this place and it didn't take any convincing for her to take me there when were in town. Caribbean spots can be hit or miss regardless of the city but I had high hopes since my friend raved about this place so much. She was not wrong whatsoever. Parking is tight where the restaurant is located but they do offer pickup just in case you need to double park and run in lol. There was a small line when we stopped by but the wait was not long. I went with a small order of chicken curry with cabbage and white rice. Portion size was definitely on point considering the price and the aroma was amazing. I also got a beef patty as well which was hot and delicious. The curry met my expectations and I was able to break that bad boy down into 3 separate meals lol. I will definitely be back to visit next time I'm in the city!"
    },
    {
        "id": 138,
        "text": "Very satisfying! The rice&peas are some of the best I've had. I think the sides could be a bit better (I wasn't a huge fan of the yams or cabbage). Overall this place isn't bad, but there are a few Jamaican restaurants in the area that I'd suggest over this place."
    },
    {
        "id": 139,
        "text": "Tasty, authentic Jamaican food. They are definitely making a killing during the pandemic. Apparently demand has always been high, but the wait right now is insane. You can only call in your order, but it seems they only have one line. It's nearly impossible to get through. After trying for an hour, I decided to just head over. Sure enough there was a line outside so I thought \"Great!! I can order at the window!!\" Nope! You still have to call it in. Luckily the guy behind me eventually got through and offered me the opportunity to put in my order as well. A lot of people standing on line were also having issues with getting their calls answered. The guy at the window advised them to \"keep trying\". Certainly frustrating to see patrons roll up after you but manage to get their call in ahead of you. From the moment I got there to the time I left was just under an hour. Not in a rush to do that again any time soon. Ron's needs a smoother system of taking orders."
    },
    {
        "id": 140,
        "text": "This place is amazing!!! Love the food here. They have amazing oxtail. If you are looking for a great place to eat. Check it out! You'll love it!"
    },
    {
        "id": 141,
        "text": "The best Caribbean food that I've had in Philly. The portions are huge. The food is always hot. Service is fast  the oxtail is hands down THE BEST."
    },
    {
        "id": 142,
        "text": "This place has it's ups and downs ok first thing it's always crowded sometimes line out the door. Second I finally had a chance to get the curry chicken with cabbage and yams which was so good. Even two days later it was still great, now the place isn't beautiful, the food runs out quick, prices are ok,  and lines are long but it's totally worth the reasonable prices and the portions are large. Don't go here if it's late in the day or if you are in a rush, and be prepared to stand in a long line."
    },
    {
        "id": 143,
        "text": "The food was delicious. This is my go to spot for Jamaican cuisine. I had the basa fish platter and an oxtail platter so good."
    },
    {
        "id": 144,
        "text": "Their horrrible phone service turned me off! I was put on hold at the beginning of the call after the person laughed and talked with ppl in the background then was on hold for 10 minute just to make an order for pick up & then was told an additional 15 to 20 minute wait would be required. The employees are very slow and unprofessional plus the long lines and wait times are ridiculous."
    },
    {
        "id": 145,
        "text": "i just grabbed some jerk wings they were the worst wings i ever tatsed never again they was not hot and they were chewy"
    },
    {
        "id": 146,
        "text": "I often get a taste for some salt fish, fried dumpling and calaloo - mostly on a Saturday morning (lol). I decided to check out Ron's as I've had the fish song with rice and beans some time ago. Food was good but I found it to be oily. I'd try some other menu items but probably will skip this meal since it was so oily."
    },
    {
        "id": 147,
        "text": "No other Caribbean place has my heart like Ron's. All though the line is usually out the door' it's worth the wait. \n\nParking: Street parking. Meter. \n\nService: the Servers are very tentative and accommodating. They make sure your special request are met: extra this or don't let this touch......\n\nAtmosphere: Ron's expanded the sitting area and added air conditioning. Glad to see the expansion.  There are about 4 to 5 servers, so although the line is long, it goes pretty fast. \n\nThere are many things to order from from Chicken to beef to seafood. I've never ordered anything from Ron's that I didn't like. I ordered for the first time the fried fish and omg!! Crispy and delicious!!! Fresh! I also ordered the green beans which were cooked just right! The mac & cheese was amazing. I ordered the plantains as a side and they were nice and sweet. \n\nAckee is salt fish is good but the amount for $13 is small. \n\nOverall it's tasty Mon!!\n\nEnjoy!"
    }
]