[
    {
        "id": 1,
        "text": "The workers here are really nice and friendly! The cafe is also really cute inside. The espresso is good and the coffee is strong here. A few things I would hope to change would be the size of the cups. It's relatively expensive for fishtown and the size of the cups are very small. Maybe 16 oz at most. When I ordered my first iced latte from here I was kind of shocked when they handed me the cup and they said that was the biggest size they had. It felt smaller than a grande at Starbucks for the same price. They also don't have almond milk which is fine for some people. I believe they have oat, pistachio and coconut. But I have a lot of friends who drink almond milk in their coffee. They also only had 1 flavor syrup (vanilla) which I was surprised about. I think adding a few more of the popular syrups is also necessary. So just those little things I would hope to see change! Cute cafe and really nice people overall!"
    },
    {
        "id": 2,
        "text": "Gotta love Forin Cafe \n\nThe coffee is strong, the WiFi is fast, and the vibe oozes creativity.\n\nWhile not a local cafe for the South Philly human that I am, I've found myself traveling up here a few times a month to take a meeting or find some creativity in the middle of my work day.\n\nWill see you all again soon : )"
    },
    {
        "id": 3,
        "text": "Stopped by today and had the pleasure of seeing that Forîn was open for business!\n\nEnded up getting two drinks, both of which were delicious:\n\n- house roast was smooth, flavorful, and non-acidic ($2.75)\n- pistachio latte (pistachio milk) was deliciously nutty and not overly sweet ($5.00)\n\nI also have to commend their attention to design detail - the industrial themed space has minimalist vibes yet is warm and inviting. Definitely could see myself plopping down for a couple of hours and getting some ~creative~ work done in the space. \n\nExcited to come back and see how it flourishes!"
    },
    {
        "id": 4,
        "text": "Great! Nice barista, took my feedback for their hours with a smile. Really like the fact that Forin opened, as it is closer to my apartment."
    },
    {
        "id": 5,
        "text": "Forin continues to be a regular stomping ground for me. I continue to wish their coffee portions were bigger. I usually order a coffee in their large size, often iced with oat-milk. I like their pastry selection. \n\nI notice that on occasion they work with local sellers to do pop ups or even outdoor fair style venues. Forin I think has evening events, but since I work, I either go there on Sunday or at least once this past week before work. \n\nI wished they'll have a more regular star reward program, since I think they ran out of the point card -free 10th coffee punch card and have yet to still have it back. Should they have a local customer base, this is something they should do, but that's my wish, they don't have to take it."
    },
    {
        "id": 6,
        "text": "Working in the area this week, I was so happy to pop coffee into Yelp and find this place only two blocks away. I have already tried a lot- Pistachio latte, chai, pour over, iced coffee, and espresso, as well as the delicious pastries from Au Fornil bakery. Love the blueberry tarte and coffee cake. The baristas are all super friendly, and when I came around closing time, they still helped me out, going above and beyond. \n\nWhen I look for a local coffee shop, I make a checklist of things I need, and this place checks off everything: \nFriendly staff, free water, comfy seating, good pastries, and proximity. They also have a lil merch section with prints, shirts, hats etc for local appeal. Love the addition to the area, and so happy to find my new favorite coffee shop!"
    },
    {
        "id": 7,
        "text": "Great new spot that just opened this week! Forin cafe is in the Milk Bottle apartment building, with its own entrance off Dreer Street. A relatively unmarked door, look for a symbol on the door. \n\nI am very impressed with the cafe. On a hot July day, I went straight for the cold brew. No kidding, it's the best cold brew I've ever had. Absolutely hit the spot. \n\nForin also has a limited selection of locally sourced pastries. Today, they had plain croissants, and ham and cheese croissant, brownies, cookies, and Kismet bagels. \n\nAnd the service! We came in to check it out since we live nearby, and it happens to be my daughters 1st birthday. As we were leaving, they brought her a cookie as a special birthday treat!\n\nWe're so happy to welcome Forin to the neighborhood and will be by a lot. I'm also excited for the upstairs seating area - it was spacious and quiet (great soundproofing from the counter) and looks like a great spot to get some work done."
    },
    {
        "id": 8,
        "text": "I had their marshmallow mocha latte and it was 1. super cute with the marshmallow skewer and 2. really fluffy and good! The staff here are really nice, good at stirring up conversation. It's a quaint cafe in the area that gives me vibes of a good community if that makes sense? Their little shop in the corner and the minimal vibe of the store make Forin a welcoming little place to study."
    },
    {
        "id": 9,
        "text": "My boyfriend took me to this café knowing I'd love the interior and boy was he right! Among the red brick and gray buildings in the area, the interior design of this place is such a different vibe! Sage green and crème color interior. I had the special pistachio latte and he had some pour over. He really liked his pour over whereas I wasn't sure what my latte was supposed to taste like. It just tasted like a bitter espresso drink with water and barely any milk. Maybe it was too strong for me, but I didn't taste the pistachio. The workers are really chill here. \n\nSome other fun things: they have a cute merch section, they have artsy books, and they have a restroom!"
    },
    {
        "id": 10,
        "text": "*management gave a kind and reasonable response to my review so I'm revising to give them 4 stars.\n\nI was so excited to see a cafe open up near me! There aren't too many good breakfast options near me. The coffee is good, but I've been 3 times and they never have bagels left by 8am. Croissants aren't a good breakfast option in my own opinion, but they sell a few kinds like ham and cheese, chocolate, etc (haven't tried them but they look delicious).\n\nI just wish it was a one stop shop for breakfast needs. I think if they figure out food I would make it a 5 star. They're really nice in there and it's a beautiful facility!"
    },
    {
        "id": 11,
        "text": "- Capp is small $4\n- Nice upstairs area to work. Small. Open space from downstairs so could get loud\n- Outdoor seating on a small street is nice cause there's not too much traffic\n- Free water\n- Clean bathroom"
    },
    {
        "id": 12,
        "text": "Such a beautiful space. It's located in the harbison dairy apartment building so can be a little confusing to find if you're not familiar with the area. \nThe coffee is incredible. I get the pistachio latte and normal vanilla latte and they are delicious. \nHaven't tried any of the pastries yet because they are usually sold out but that's a good sign!  \nThey have outdoor seating and indoor in a loft area."
    }
]