[
    {
        "id": 1,
        "text": "Panini's are terrible and overpriced. I tried the chicken parmesan and the Tuscan. The chicken was was very on the parmesan and bread was barley toasted. As for the Tuscan, it was $8 for unmelted cheese and a couple slices of tomato on Untoasted"
    },
    {
        "id": 2,
        "text": "This place is brand new, and my first experience was really enjoyable. The decorations set a good vibe; its calm and cool in there. Some of the art on the wall is for sale too. I was greeted by a cashier whose name I've unfortunately forgotten, but she was incredibly kind. She recommended the green oasis smoothie, and I took her advice. I did tell her that I am dairy free, and she said that wasnt a problem, they just didn't add the yogurt.\n\nThey also have breakfast sandwiches, pastries, and pre-made salads and sandwiches that will be great when I'm in a hurry to get to work.\n\nThe green oasis smoothie was so delicious that I stuck my head back in the door to tell the woman who I assume was the owner that it was delicious. Entire staff was pleasant, delicious first product, and enjoyed the atmosphere. I may become a regular."
    },
    {
        "id": 3,
        "text": "Ehhh. I mean it's convenient, but that's about it. We have no shortage of good coffee spots in the area so you really have to be either A. Nice and pleasant when customers say \" hello, or what's up?\" and/ or offer something amazing that justifies being so \" bothered\" by customers wanting to give you their money. I've been in here maybe 3 times and every time I've left feeling with something to be desired. The iced coffee was fine, smoothie was pure sugar water, and the iced matcha was was again fine, but sugary, and no question of \" what kind of milk would you like?\" as you will be asked at most other coffee shops. I tried to engage with the barista at the counter each time, but nothing. I get the whole \" I'm a barista not here to socialize thing\" but at least be courteous and greet us with a \"hello\" and some kinds of \" thank you/ your welcome\" peace offering.  When we grab our drink at the bar, maybe  a \"have a good one\" anything really to make us feel good about walking away with a mediocre drink and baristas who are probably talking about us the second we leave. With Alchemy and One shot less than a block away, I'd spend the extra dollar or 2 to feel good when leaving, it's that simple!"
    },
    {
        "id": 4,
        "text": "Happened by this place several times and never went in.  Decided to try it this morning for a quick bite to eat.   I was welcomed by an employee \" Z\". He provided service with a smile and was informative.  He recommended a great smoothie and an awesome wrap! Both of which were very satisfying and reasonably priced.   I will be going back as soon as possible!"
    },
    {
        "id": 5,
        "text": "I find Saige to be hit or miss - I've had good coffees and bad coffees. The last time I went, I got a medium iced coffee with sugar free vanilla and I'm pretty sure they forgot the syrup and the coffee cost $4+... I was very disappointed."
    },
    {
        "id": 6,
        "text": "Wow! Killer selection! Great coffee, delicious shakes, fresh pre-made foods for quick lunch or dinner, paninis, and a juice bar. All in a cozy environment with lots of seating. Nice addition to NoLibs! Glad we wandered in!"
    },
    {
        "id": 7,
        "text": "I really want to like this place and have given it so many opportunities, but other than the cool decor, I cannot find anything positive to say. \n\nThe coffee is weak. The service is slow, and there is usually one overwhelmed employee to handle a long line of customers. \n\nThe food is overpriced and underwhelming. Don't even think about ordering through Grubhub because if the place is out of something you ordered, you will not be notified. You'll just show up looking for your food, and a confused employee will fumble around for a while before you realize you're not getting that item after all. \n\nThis coffee shop replaced Epicurious, which was nothing fancy to look at, but they served La Colombe coffee, and the service was excellent. \n\nPlease get it together, Saige."
    },
    {
        "id": 8,
        "text": "Very very slow service. Waited 20+ minutes for one coffee and one chai tea latte and the line wasn't lone at all so not sure what the wait was about. The chai was mostly milk and coffee wasn't worth the money. Prob not coming back."
    },
    {
        "id": 9,
        "text": "Worked here on a rainy day so there were only one or two others who sat down for a bit and passed through. Haven't worked in a cafe in while! \nStayed for just over 2 hours, music was at a good\nlevel, bathroom is clean, and the almond milk iced chai tea latte was probably one of the better ones I've had. Usually places make chai taste like nothing, but here, there's a kick to it! Didn't have to add any pumps or anything to it which was cool. \n\nOther than the drink, nothing really stood out about the place. They have 5$ breakfast combos I'd like to try, so I hope to get that soon!"
    },
    {
        "id": 10,
        "text": "Update: I regretfully gave this place another chance and received an overpriced cup of lukewarm bland coffee with no lid (because they had run out of lids).  If you look forward to enjoying your morning coffee, don't go to this place."
    },
    {
        "id": 11,
        "text": "This is a basic coffee place that is part of a philly chain. Their coffee is pretty good and they have an extensive food and smoothie menu that I haven't yet got around to trying. \n\nI was disappointed that they didn't offer loose leaf iced tea and that there were only sugary syrup based Iced tea options. They only have 5 types of bagged tea, but the orange mint tea was very tasty. \n\nAnother thing is that they don't offer reusable cups or plate for people who want to enjoy their food and beverages within the cafe."
    },
    {
        "id": 12,
        "text": "I was looking for a study spot at 6pm on a Monday, when lots of cafes in the area are already closed. Saige is conveniently open until 8pm on weekdays and 9pm on the weekend.\n\nThe seating area, counters, and bathroom are all very clean. There are lots of wall outlets, but the only large table is in the center of the room, away from the walls.\n\nI appreciate the vibe with the incandescent lighting, but I had a hard time reading. It's probably bright enough during the day with the large windows, but I think it needs to be a bit brighter in the evening.\n\nThey have a large menu including paninis and smoothies. Although I didn't try it, they serve breakfast all day. \n\nThey also have a variety of pre-made salads and sandwiches. I had a pre-made chicken salad wrap, which tasted fresh."
    },
    {
        "id": 13,
        "text": "I ordered an iced coffee which was extremely expensive (over $4). I waited 5 minutes to even order though I was the only person in line and then waited another 15 minutes to actually get my iced coffee after ordering. Not worth it - wasted my time and paid way too much for a simple drink."
    },
    {
        "id": 14,
        "text": "This is THE review for a cafe with:\n\nQuality coffee\nFree WiFi\nRoom to work/lounge\nLong hours\n\nI'm always looking for a comfortable place to work and to be properly caffeinated throughout my stay.\n\nThe coffee is above average, not sure the brand or if they roast their own but it's decent.  Not La Colombe or Stumptown but also not diner crap(for lack of a better word). Sorry New Jersey;)\n\nI definitely would remove a star for not having a healthy sweetener option like Stevia or Erythritol, Monk fruit, Xylitol....to name a few.\n\nLucky, I always have some on me :)\nWhole Earth™ is a brand I prefer, hint hint and carried by my favorite ubiquitous cafe Starbucks ™.\n\nI also tried the blueberry scone wrapped in plastic. Never a good sign. Plastic to keep it fresh right??? \nWhile not terrible, I'd describe it as average and at least a day old:(\n\nAs far as wifi...it's free and it's slow....and not secured by any passwords. If you don't know what a VPN is, I would Google it and familiarize yourself quickly.  I'm posting screenshots of the speedtests in my pics for reference.\nOpera is a good browser to use on your phone and computer that has a free VPN rather than pay monthly.\n\nSaige cafe has a nice setup with copious tables for working individually and in small groups. \nOne of the tables even seats 8 people, wowsers.\n\nThere are 2 club style chairs that I so cherish that are quite comfortable.\n\nThere are also cute unicycle stools along the windows with ample outlets for plugging in.\n\nI noticed most tables and chairs have access to electricity besides the big table in the middle and the club seat I'm sitting in.  Plan accordingly people.\n\nIt's a little on the chillier side so might wanna bring a light jacket for long stays or drink a lot of hot beverages. \nSneaky....keep the temp down- sell more coffee....clever Saige clever.\nFeels like a casino move; keep the place frigid and keep taking my hard earned blackjack money lol\n\nI also like the fairly long hours....open till 9pm on a Saturday....cool....I have no life anyway;p\n\nMost cafes around here close on the early side.\n\n2 thumbs up for all the reasons I described earlier and I will definitely be back to enjoy the long hours of free and slow wifi :)\n\nRIP Euphoria Cafe!  Your pocket sandwiches and speedy WiFi will be missed!!!\n\nPS I love you"
    },
    {
        "id": 15,
        "text": "The food and coffee is good but the servers are a bit rude \n\nHad the cold brew coffee- pretty smooth\n\nAlso had the boss sandwich on the flatbread, was pretty good but feel like it needed a little something like a sauce"
    }
]