[
    {
        "id": 1,
        "text": "I have never written a yelp review until now but I had to do it. ABSOLUTELY DISGUSTING ESTABLISHMENT! I was in last night with a friend. The two young men behind the counter look absolutely miserable to be there but it gets so much worse. They ask what I want. I say burrito. They grab the burrito lay it down, scoop their hand into the rice and put it one the burrito and pat it down with their hands. Scoop into the beans, once again hands (they have plastic gloves on but this is still clearly unacceptable) I get pork, my friend chicken, all the meanwhile using no utensils. Straight hands all the way down the bar, even the vegetables. Same gloves!!!!!! \nI actually paid for my order, walked out and threw the burrito out. Why I didn't say anything or even paid for it, I have no idea. I think I was more so in shock and couldn't get a word out. \n\nLong story short: DISGUSTING. NEVER EATING AGAIN. These kids better not have jobs once someone sees this because this is so unacceptable. Does this place have training? Do they monitor their employees? Clearly not."
    },
    {
        "id": 2,
        "text": "I like this place.  The food is pretty good, and it's a lot healthier than some of the other taco/burrito places I've been to.  The prices are really good.  They mail out coupons all the time, and since I don't really eat out a lot unless I have coupons since I'm cheap, it makes it even better.\n\nThe people could be a bit friendlier though.  I've only been here three times in the past year or so, and it's been a different person each time, but they hardly make eye contact and/or speak to you other than when necessary.  I'm not sure why - they're not rude at all, just not very personable.\n\nIf you're looking for something kind of cheap, healthier, and a decent amount of food, this place is pretty good."
    },
    {
        "id": 3,
        "text": "This place is one of the best lunch options in the area. It's better than a Chipotle and about as good as a Qdoba, better if you're the kind of person who likes supporting local business. I recommend the pork. They've also got really good chocolate chip cookies."
    },
    {
        "id": 4,
        "text": "Fair at best, go if hungry and see no other options to eat. Have had a couple burritos from here. Nothing mind blowing but it cures hunger. Definitely are better Mexican options out there. Since my last visit I rarely ever see anyone in there, honestly I'm surprised it's still open."
    },
    {
        "id": 5,
        "text": "Does the trick. Baja Fresh still wins for best tex-mex chain though."
    },
    {
        "id": 6,
        "text": "Ate here twice. First time, I was pleasantly surprised with my chicken burrito on jalepeno cheddar tortilla. Second time I was grossed out by my steak burrito on honey wheat tortilla. A burrito should be consistent. So 2 stars is my review."
    },
    {
        "id": 7,
        "text": "Disgusting! Huge flies, undercooked meat. Uncooked hard rice. I am totally waiting for food poisoning to kick in."
    },
    {
        "id": 8,
        "text": "The food is heavily outclassed by chipotle and isnt wonderfully seasoned either especially not the guacamole. Atmosphere is below par the only leg up they have is their okay cookies you could get a much better cookie at a bakery thats cheaper too. Why would i want a cookie with mexican food by the way???"
    },
    {
        "id": 9,
        "text": "Let's take Machismo for what it is. It's a simple burrito joint. I've munched in countless chains alike. Machismo is just as tasty, speedy, and fairly priced as any other. The best thing about Machismo is the portion for the price. Me and my wife can easily split it. This is why I go here. In addition the seating is above average for the city, or suburb although it could be cozier."
    },
    {
        "id": 10,
        "text": "If I could rate this establishment less than 1 star I most certainly would! \n\nWhere do I start?! \nI have been to this store a handful of times in the past.\n\nHowever, I recently walked in an hour before they were closing..horrible mistake! \n\nThe guy used a utensil ...meaning 1 spoon! He used the same spoon for every topping on my burrito\n\nOut of hunger, I paid for my burrito. I turned around to walk towards the door and what do I see??!!\n \nA MOUSE!!! YES A MOUSE!\n\nJust scurrying from the drink fountain to the trash can. I immediately threw out my burrito and ran out of the store. I cannot imagine what the back of this establishment looks like if they have mice running around in the front of the store! \n \nI am disgusted"
    },
    {
        "id": 11,
        "text": "I do not know where all y'alls bad reviews are coming from. My girlfriend and I discovered Machismo because they're newly on GrubHub, and they delivered FRIGGIN HUGE burritos and bangin' queso to us in a v timely manner. Having a taco/burrito bar with vegetarian options that delivers to Manayunk and doesn't require me to make a phone call is A+ in my book."
    },
    {
        "id": 12,
        "text": "Menu and pricing are confusing, and my burrito was cold by the time I got home.  Salad nothing to write home about and wilted.  Guacamole is extra, even if it goes on your burrito.   Tasteless.  \n\nGuy making my food was nice and good customer service."
    },
    {
        "id": 13,
        "text": "Where to even begin with this place. You walk into an overwhelming, flamboyance of colors that is just way to shocking. The employees seemed like they were just rushing you to try and get you out of there. \n\nThough they have a wide selection of food that you can get, the food was not good in any way. The flour tortilla that I got for my chicken burrito was not heated up enough and just started cracking right as the employee was wrapping it up. The chicken itself was the most bland, dry chicken I have ever eaten. The chips that they offer are store bought, corn tortilla chips. I didn't even eat the chips, and only ate about half of my burrito because no amount of salsa or beverage could counteract the dryness of the chicken.\n\nThis was actually the second time I went here. The first time I went, it wasn't a great experience either but I had decided to give it another shot. Never again."
    },
    {
        "id": 14,
        "text": "Burrito was ok. Didn't hate it, didn't love it or really enjoy it. \n\nThere are better burritos out there..."
    },
    {
        "id": 15,
        "text": "I used to be a huge fan of Machismos for the Main Street location in Manayunk and recently discovered this location.\n\nMaybe the quality of both locations have gone down since it's been about 4 years since I've lived in that neighborhood, but I cant compare. I can say the steak was somewhat bland and chewy in the burrito I got. The flavors overall were lacking. The guacamole we ordered as a side was good, however, the chips tasted somewhat stale. \n\nOn the plus side, if you check in while there on Yelp, you will receive a free fountain drink!"
    },
    {
        "id": 16,
        "text": "I'm a Texan, and therefore I take my burrito bars seriously.  This means I'm probably a tougher critic than most.  Despite what are, to me, obvious issues at this chain, I keep revisiting and going back for more. Why?  Because I'll admit they do a few things right.\n\nI'm a huge sucker for menus with nutritional information readily available, and I love the fact that Machismo actually posts it in front of the bar.  To me, what sets it apart from other burrito bars is the brown rice.  I know I can go to Machismo right after my workout and not have to worry about the guilt that is usually associated with a typically heavy type of food.  This location also gives a discount if you happen to be a member of L.A. Fitness.  \n\nMachismo obviously has a great deal of potential in my book-- I really WANT to like it.  But aside from the aforementioned high points, it just falls short.  While I think it's great that they offer so many protein options (even Boca burger, which I had never seen before), they need to focus more on quality over quantity.  The chicken and steak are both horribly overcooked, almost to the point of being inedible.  And the vegetable toppings never appear to be fresh.  The guacamole is always slightly brown and the corn is a duller shade of yellow.  The most flavor I get out of the finished product comes from the Cholula hot sauce they offer to kick up the heat.  This always makes me think I would have been better off making a similar concoction in my own kitchen.\n\nThe service is never great either.  I think at a place where human interaction is integral to the food preparation, friendliness is paramount.  How about a smile or joke while making my burrito bowl?  Usually the employees avoid eye contact and any other type of pleasant exchanges.  \n\nAnd lastly, does the name bother anybody else?  Nachismo would be much more appropriate, just in my opinion."
    },
    {
        "id": 17,
        "text": "Food is decent; my biggest complaint is that I ordered my meal via grubhub; when I arrived to pick up the order it was ready.  Why I asked why is was no near complete since it wasn't started; the person working there said they don't have a computer so they can't take the order from the app.  Someone needs to look into that to either take yourself off the app or explain how to get the orders from grubhub."
    },
    {
        "id": 18,
        "text": "Always nice to find a burrito spot near by!  Been hear a few times now.  Not the best burritos I've ever had, but it gets the job done.  When you're craving a burrito and nothing else will satisfy that hunger, you don't really care where you get it from, ya know?  One of the coolest parts about Machismo, at least if you're from the area, there's always a ton of coupons in the mail.  I love that stuff.  Had one for 3 pounds of nachos for $9.99.  Nacho platters were enormous.  Way too much food, but in a good way.  Had more than my fair share and ended up calling out of work the next day though.  \n\nOverall, the food is good.  They have a few different items other than burritos.  Prices are mediocre, but with all the coupons they put in the mail they're great.  If you're longing for a burrito or some loaded nachos, swing by Machismo Burrito Bar and satisfy your need."
    },
    {
        "id": 19,
        "text": "Ummmm maybe as a south Texan I am spoiled on \"authentic\" mexican food but I kinda felt like this place wasn't even trying to do right by good food. Ordered and when I arrived after the time it was supposed to be ready, it hadn't even been started yet. There were not many options to choose from and the nachos were just sad. The taste was ok, but for what you are going to pay for a burrito at \"fast food\" esq establishment just go to chipotle."
    },
    {
        "id": 20,
        "text": "This restaurant is similar to a Chipotle/Qdoba\n\nPros: more topping selections\nSlightly Less expensive \nBigger portions \nFriendly Staff!\n\nCons: the food was not temperature hot. I enjoy my chicken warm and it seemed liked everything was just cold. \nEverything could have used a little more seasoning."
    },
    {
        "id": 21,
        "text": "I really like Machismo for its unique and fresh ingredients and generous portion sizes. It's definitely a go-to when I don't feel like cooking. \n\nI do find it funny though, that for the longest time the employees insisted on trying to fold my meal into a burrito, even though I ordered it as a quesadilla. We've seemed to get the communication down now though."
    },
    {
        "id": 22,
        "text": "Wow the reviews on this place is tough!  This may not be yelp approved but it's liana approved ha.  Came after my kickboxing class and this was the perfect post work out meal for me. Got a veggie salad with all yummy fixings. They had romaine and spinach lettuce and was able to mix it. The employees were nice and didn't make a big deal about how I wanted extra salsa in it. I liked my mexi salad here better than chipotle's! The interior was okay but good take out spot or quick lunch."
    },
    {
        "id": 23,
        "text": "When there on a whim one day. Tried to order online first, but their website only lets you order form their Manayunk location. Got a veggie burrito and chips & queso. The queso was REALLY BAD. I mean, it was worse than movie theater nachos, as those at least have a strange, chemically flavor to them. This queso was just a tasteless, warm, viscose substance. Chips were like crappy storebough ones, not like the warm, crispy thin ones you get at other mexican fast food locations. Burrito was Eh. Nothing special. Got the Saffron rice, but didn't care for it too much. All in all, I'd rather just stick with California Tortilla or Moe's."
    },
    {
        "id": 24,
        "text": "I stop here occasionally for lunch, and it's always good. \nOnly thing I would change is the ratio of filling on a burrito, less rice, more beans. Very good and nice staff."
    },
    {
        "id": 25,
        "text": "I'm definitely a fan of this burrito bar.  The very first time I went to Machismo's was a few years ago in Manayunk.  Sometime over the summer, this location opened and i'm quite satisfied with the quality and quantity of the food you get for such an affordable price.\n\nBest thing about this restaurant is their delivery service.  No need to make a phone call when you're a fewclicks away from placing an order online.  Only takes a few minutes!"
    },
    {
        "id": 26,
        "text": "Our favorite quick lunch spot! A wide range of ingredients to customize your experience, which makes it difficult to go back to Chipotle or Qdoba (our old mainstays). \n\nThe staff is somewhat hit or miss, but most of them are efficient and friendly! Some even remember your order if you come in enough (like we do...)."
    },
    {
        "id": 27,
        "text": "I have been here a lot and am finally getting around to writing a review to let you know just how great it is! \n\nI have tried a few different items on the menu - burritos, burrito bowls and quesadillas. Get the quesadillas! They are so much better than the burritos. And by better I really mean cheesier. \n\nAll of the toppings are fresh and the service here is usually very fast! I have only tried the pork or chicken and both are very good. The chicken is cubed and pork is shredded. Both are marinated in a seasoning that is very flavorful. Guacamole on the side with chips is a great way to finish off the meal. Their guac is very creamy and tasty."
    },
    {
        "id": 28,
        "text": "Maybe I went into things the wrong way. With a craving for chipotle, and wanting delivery. I thought I had found the solution to my Sunday afternoon craving. \n\nI sat waiting at my window, watching for the delivery guy to pull up, for my steak burrito, with queso, and quac added. What it was- fatty pieces of meat ( I'm talking every bite spitting the meat out), queso sauce (that was actually shredded Monterey Jack, served cold and shredded), and the after taste of cumin. I ate half, which was purely out of hunger."
    },
    {
        "id": 29,
        "text": "The set up here is akin to a cafeteria lunch line: you walk the counter and give commands from behind the sneeze barrier about how your food is to be prepared: first you pick the \"container\" (bowl, burrito, taco, etc.), then all the ingredients as you progress, and finally at the end you receive the finished product and pay. For those who have been to Chipotle it is very much similar, only there are more choices.  Not that either is the shinning example of what a burrito should be, but I have been to chipotle and like machismo a lot more. A whole lot more. \n\nAs mentioned, this place has more of a variety, but not mentioned was that they also have daily specials to help offset what feels like an expensive, albeit filling, meal (again, on par with chipotle, but both spots run about $9 for a burrito). A favorite special of mine is El Gringo Gordo, which appeals to everything that is wrong with me. The Gringo is more of a challenge than a deal, but it works like this: spend $20, get a 5lb. burrito (they use three wraps if that helps) and a soft drink, and try to finish eating within an hour because then you get a refund, a t-shirt, and your Polaroid on the wall. I wanted to step up to the plate for Valentine's day last year but the lady felt watching me overeat a tad more than usual would steal the romance from the day; go figure.\n\nThe 19128 is for all intents a Mexican food desert, so perhaps that's why I enjoy Machismo so much, because the flavors taste far from \"authentic\" and I never feel like ate Mexican when I finish. All I know is that when I am done eating Machismo's brick of a meal, I always contemplate seconds and smartly decline as their belly filling log stays with me the rest of the day.\n\nP.s. They will crunch up chips and put them in your behemoth burrito with no extra charge; that other place makes you order a crappy brown bag to get the same."
    },
    {
        "id": 30,
        "text": "This kind of place can be slightly overwhelming for a newcomer, as there are so many ways to customize a fairly simple menu. Burritos, bowls, nachos, quesadillas. But throw in a half dozen types of tortillas, multiple kinds of sauces/meats, more than one kind of rice and bean, and over a dozen cold toppings.. and it can take a minute to decide which direction to go! \n\nIt seems as if many people's disappointment comes from lukewarm food and some blandness. I can imagine this can easily happen to most people, especially people like me, who like creativity and veggies and can maybe go overboard on the cold toppings they have. You can add lots of anything you want, including green and hot peppers, corn, lettuce, olives, sour cream, guacamole, etc. While these sound good in theory, they can easily turn your whole meal cold and cover up the flavor of things like the interesting sounding chipotle queso. Maybe one day I'll go back and try a burrito with only hot items, and one or two choice cold items. \n\nIn my experience, the food and service have always been a-okay. Not great, but certainly not terrible. I like the variety at machismo, and I like that some locations (Manayunk) are open late. I went to this location because I was in the area and they have a check in offer. I appreciated that neither cashier had heard of the check in offer, but were immediately willing to accept it without giving me any hassle. They were pretty nice. I ordered the nachos. It was a huge portion, but the chips were standard out of a bag tortillas, and the order was cold by the time I got in my car. All in all, I'm not planning on going back, but I don't regret going either."
    }
]