[
    {
        "id": 1,
        "text": "The gentleman in the truck was very nice so he accepted making a fish quesadilla for me although it's not on the menu. It was the best quesadilla I had till this moment to be honest"
    },
    {
        "id": 2,
        "text": "These guys are awesome. Solid food and great personality from both of them. Always a joy to stop by to say hi and grab some good food. I usually get the burrito or quesadilla. Both have never disappointed."
    },
    {
        "id": 3,
        "text": "Been here a couple times. Until this time, I've only ever had the tacos. They are all fantastic. The fish is really good, the chicken is well seasoned, and the pork tacos are incredible. Unfortunately, I just ordered a Carne Asada Burrito and it was not great. The seasoning, sauce, and filling of the burrito was fantastic but the meat itself was really quite bad. The Carne Asada was chewy to the point where I could not actually eat half of meat inside. \n\nBut, Im not one to let one bad experience distract me from an otherwise quality food truck. The tacos are fantastic and I have no doubt most of the other items on the menu would be good. The service is always quick, friendly, and very polite. I have on more than one occasion noticed that the staff greets regulars with an extra smile which is always a good sign. This place a little expensive for a food truck but I'd say its worth it. Its definitely one of the better food trucks in the area. Also, it takes credit cards!"
    },
    {
        "id": 4,
        "text": "I've eaten from here twice - once for al pastor tacos and once for a burrito. I was underwhelmed each time and I don't plan to ever go back. Both the tacos and the burrito were very dry, the meat was minimal and overcooked. \n\nThe staff is friendly and helpful, but the food is just not up to par when there are usually other taco trucks nearby that are far superior, IMHO."
    },
    {
        "id": 5,
        "text": "Los Compadres has a truck on the 3300 Block of Market Street. I highly recommend their food. My favorites are their flank steak tacos and burritos al pastor. This is the best food truck on Drexel University Campus, and their owners have a great personality."
    },
    {
        "id": 6,
        "text": "I stopped by Los Compadres today for a quick lunch. I got three tacos- chorizo, steak, and al pastor- topped with lettuce, tomato, sour cream, and cheese. The steak taco was ok, but the texture was too chewey and it was not very flavorful. The chorizo was quite good, and was nicely spicy without being overbearing. However, the real winner was the al pastor. It was fantastic! It was juicy and extremely flavorful. I won't be getting steak again, but I will definitely be getting al pastor and chorizo on my next visit here! The price was also a pretty good deal at $7-$7.50 for three tacos that definitely filled me up."
    },
    {
        "id": 7,
        "text": "Delicious!!! We got al pastor pork burrito (mild) and chicken burrito (hot), we opted out of sour cream."
    },
    {
        "id": 8,
        "text": "I was walking by this morning and had the thought that I should have a breakfast burrito and right in front of me it was. I was recommended the chorizo, egg and cheese breakfast burrito. I asked for them to add some pico de gallo and they gladly did. The two men working in the food truck were very friendly. The chorizo had a nice level of spiciness to it and the egg was freshly made. With the addition of the pico de gallo there was a lot of flavor in the simplicity of this breakfast burrito. For 5 bucks, this breakfast burrito packs a tasty and wholesome punch. I will definitely be back the next time a craving calls."
    },
    {
        "id": 9,
        "text": "The worst quesadilla I have ever had .  Sadly $8 I won't be getting back . The cheese had the texture of sand and overall there was these weird after taste . Think spoiled milk and hot plastic . I literally took one bite and threw the rest in the garbage.\n\nI didn't know you could mess up a quesadilla . I mean it's literally some cheese placed in a folded tortilla which you then melt on a griddle .\n\nI think they either used cheese that was going bad \nOr imitation cheese .\n\nNot too mention the chicken inside . Couldn't really tell you if it made the quesadilla bad or worse .\n\nThe sad thing is I was initially wanted a quesadilla from Dos Hermanos but they weren't parked in the line of food trucks today. \n\nGo there instead . Learn from my mistakes ."
    },
    {
        "id": 10,
        "text": "This review is for the Fish Tacos. But considering everything else other than the \"meat\" would be the same for all tacos, this review can be applicable for all tacos.\n\nThe tacos were very dry, I had the sauce but it wasn't saucy enough! The fish although grilled (which is a healthier option from the usual breaded) was scantily portioned, making the tacos feel like plain tortillas.\n\nMy friend had the veggie burrito (well they did not have any veggie burrito, so she requested them to replace the meat with veggies), but there wasn't any ceggie in there except for the usual lettuce which is present in every burrito.\n\nBottomline: University City has many decent foodtrucks, it's better to give this one a miss!"
    },
    {
        "id": 11,
        "text": "I wanted to try this as an alternative to Chipotle, and I was definitely pleased! Very authentic Mexican food, and very well done"
    },
    {
        "id": 12,
        "text": "I have always loved los compadres. The men who own the truck are so incredibly friendly, always remember me and my order. Their burrito with their hot sauce is the best in the city - never had another like it. It was my #1 craving when I was pregnant. Since leaving law school I have missed the truck so much. Looking forward to seeing them again!"
    }
]