[
    {
        "id": 1,
        "text": "I was very excited about their brunch as i saw many good reviews. But my chicken and waffle was a little bit disappointing to me. Chicken is just deep fried wings and drumsticks with no flavors. Waffles taste very dense and dry. The condensed milk is not enough at all. In all, the whole dish is very dry. It was also a long wait for food. My husband and I waited for around 40 mins to get our food."
    },
    {
        "id": 2,
        "text": "This is a great dining experience, especially during the pandemic. They have a variety of seating with heat, as well as indoors. The food tastes better than it looks. The wait (wasn't terribly long) for the food was worth it. They have fun drinks, like the mimosa tower, which is huge enough to share between 4 people. Brunch was a great experience will be back for dinner."
    },
    {
        "id": 3,
        "text": "I visited during happy hour with my boyfriend and we got 2 frozen margaritas and the SET Loaded Tots.\n\nThe drink menu here is decent, and the frozen margaritas were definitely super strong! While I do love getting my bang for my buck for drinks, all I could taste was straight dark liquor in every sip. The waitress kindly added more juice mix for me to make it a little more fruity for me! So appreciative of that. \n\nThe loaded tots hit the spot for us! I'm a huge fan of fusion food because of how flavorful it is and the loaded tots are the epitome of that! The cheese, meat, onions - literally everything in that appetizer was a beautiful blend of flavors in every bite! I highly recommend if you're a fan of your savory snacks!\n\nMy one and only complaint about this establishment is simply a side note: The parking situation is horrendous here! During happy hour especially -- the northern liberties area is a huge mix of establishments and residential townhouses so it's incredibly difficult to find parking during peak hours! I had to circle around the neighborhood for roughly 30 minutes before finding a spot!"
    },
    {
        "id": 4,
        "text": "Me and my boyfriend went here for Sunday brunch from our friends' overflowing recommendations. Everything was fine, we ordered our food, an iced tea & a single mojito to share (one of us was driving & we're super lightweight at that lol.) Initially, i ordered the chicken and waffles, but changed my mind to the breakfast tacos whereas my boyfriend ordered their burger. From here things get crappy:\n\n1. Mojito tasted virgin (emphasis again that we are lightweight, meaning with two sips one of us was going to be slightly red - asian glow baby ! But nope. It just tasted like club soda, mint and fruit flavoring) \n\n2. Boyfriends burger buns were burnt\n\n3. They gave me the chicken and waffles even though i told the waitress in the beginning i wanted the breakfast tacos instead . \n\n4. Both the chicken and waffles were BURNT and flavorless. \n\n5. Never got my iced tea.\n\nI didnt voice anything out because i was already so agitated with this first time experience. Maybe night staff has their system together opposed to their daytime/brunch staff because a lot of my friends talk big about this place & theyve only gone during the evening. Ill pass."
    },
    {
        "id": 5,
        "text": "This place is so cute in NoLibs! Outdoor seating is spacious with picnic tables under big umbrellas. We went for brunch on a Saturday. The brunch menu is awesome and you have the option for $15 plates! My favorite part is that you have the option for waffle fries, breakfast potatoes or tots.  Potato lovers rejoice! My only complaint was that there was no coffee or brunch cocktails, but I am sure that will change in the future. Looking forward to having dinner and drinks the next time we visit!"
    },
    {
        "id": 6,
        "text": "Amazing food. All the staff were so friendly and helpful. Would definitely recommend for a fun night out with great drinks to go with it. Megan, Kat, Nick and Johnny the manager are amazing people who always go the extra mile."
    },
    {
        "id": 7,
        "text": "The brunch was amazing! Def worth your buck. The steak was so well seasoned and tasty!"
    },
    {
        "id": 8,
        "text": "This place has fish and shrimp tacos that will leave you wanting more tacos. The frozen margs are the best you'll find this summer! If you're looking for a frose, Set's is perfect - not too sweet and the right amount of tart. The outside seating to accommodate COVID regulations is charming with enough space to fit your group while still social distancing. The service is phenomenal - the staff is friendly, helpful, and make the dining experience a 10/10. You're gonna wanna hit up this joint."
    },
    {
        "id": 9,
        "text": "Wanted to love this place as the photos of food + drinks looked appetizing. Unfortunately, we were asked by the hostess to wrap up dinner before our food even came to the table as they had a reservation who needed this specific table. Very unorganized. I ordered clams and received oysters. We didn't receive utensils until an hour after we were seated. Drink glasses remained empty for quite a while. Server was not attentive. This establishment has a lot of potential but unfortunately, I will not be back."
    },
    {
        "id": 10,
        "text": "*WOULD RECOMMEND*\n\nIf you're looking for a nice, casual brunch with good food and drinks, definitely check out this place. The restaurant is located at the heart of Northern Liberties with both indoor and outdoor dining. They did a good job of separating tables with wall shield in between. Their brunch menu has a good amount of brunch classics as well as unique Asian, Mexican inspired dishes. They have quite an extensive drinks menu if you want to have a good time. The food were well presented and well portioned for the price. I ordered the SET STEAK & EGGS SKILLET which was Asian inspired and it was well seasoned and not too chewy. I also had their mango bellini which was a nice light drink for the afternoon.\n\n*VERDICT*\nYes, I would go back again. Want to try their champagne tower"
    },
    {
        "id": 11,
        "text": "Set has been and continues to be an incredible addition to the neighborhood. The service is always awesome and I can always expect to be happy and satisfied when I leave. I always say to my wife that I'm happy to have a place like Set in the neighborhood and she and I will continue to eat here and recommend Set to our friends across the city. 5 stars!"
    },
    {
        "id": 12,
        "text": "The hubby and I went here for our pre Valentines brunch. We had made reservations several weeks ago which I highly suggest. The line was pretty steady with a 6 hour wait. They have a cute set up for outside dining with little Fire pit type heating on the tables it was very cute. We however dined inside. They had each table spaced a good distance apart with plastic dividers which is good for covid safety precautions..KUDOS!!!!! The front end staff as well as our waitress Nadia was very nice and friendly. She helped with any questions we had, considering it was our first time dining and it was her first day. She did a great job! The atmosphere was chill with good music and cool scenery on the walls. We ordered our meals. We both got the Set 4 -bulgogi burger with home fries and the breakfast wonton appetizer! I also ordered a Mango frozen margarita. Both the meal and app were absolutely amazing!!! We highly recommend. My drink was delicious! They offer a mimosa tower. I WILL get that the next time. We had a good time chatting across the dividers with other couples and diners and had an enjoyable experience! I highly recommend checking this place out!"
    },
    {
        "id": 13,
        "text": "Great service & experience!! Ciara was an exceptional server that took great care of us and ensured that we had a wonderful time. And the mimosa tower is a must!!! We had an awesome brunch!"
    },
    {
        "id": 14,
        "text": "This is one of my favorite spots for brunch. Their food and drinks are delicious. And the server Emily is sweet and super attentive. You have to come here!"
    },
    {
        "id": 15,
        "text": "Amazing service! Our server Kiara (apologize if I misspelled) was amazing, they were so kind and attentive to my friend and I while dining. I got the steak and eggs--really tasteful, the steak literally melts in your mouth and the home fries were so flavorful. The entire dish was honestly. Highly recommend!"
    },
    {
        "id": 16,
        "text": "Came during Happy Hour and it was definitely a Vibe! You have to book your spot for them online w/Open Table, but it's worth it so you don't have a crazy wait time. The people were out this particular day I went and they still handled it well, having me seated in 2 mins if that. Now them drinks! Yup, I kept the frozen margaritas coming. Next time I will try the margarita tower they offer. The wings and fries are very good to. Happy hour specials are really good. Definitely coming here more often."
    },
    {
        "id": 17,
        "text": "Came here on a Saturday evening and it was crowded. We hot seated immediately and were informed that in future reservations are preferred. Due to Covid, seatingbwas outside and the place was well lit.  The music was good but was coming from neighbor restaurant.\n\nWe started off with Jalepeno popper and Lichitini with loaded tator tots. The drinks were a bit watered down. Lichitini was good well flavored drink but Jalepeno popper was ice and Jalepenos. Our server recommended a side shot along with syrup that would help improve the taste. After the shot it was better. But shot was $10. A bit pricey. We ordered cheeky tiki and mango mojito. Again, it was like drinking fruit juice. So, having shots added helps. The mix match sliders were good. We did complaint to the server about the watered down drinks and looks like they were standard pours.  So, I recommend accounting for a side of shot. It was a bit surprising since these were they special drinks.\n\nOverall, we liked the food but drinks not so much."
    },
    {
        "id": 18,
        "text": "What a great spot! Tacos and taters and burgers, oh my! Since I'm a huge fan of the NYC branch, I had to see if the NoLibs restaurant matched my expectations. It sure did! I love the indoor decor. My favorite cocktail this time around was, hands down, the Out Of Office. The twist of lemon made it super refreshing and easy to drink (which - I can see how that can be a problem lol). The taters were so CRUNCHY and flavorful - everything a fried lil potato should be! I shall be back."
    },
    {
        "id": 19,
        "text": "Avoid at all costs! Got terrible stomach issues the next morning. The menu sounded good but execution was severely poor. The service was awful. Our server had a really bad attitude and everything took forever to come out. We had a party of 11 people and the food came out at all different times so half the group got food and the other half got food like 25 minutes or more later which was not great. They gave a margarita to a 14 year old which she drank thinking it was juice. Then at the end of the service while we were all trying to figure out the bill, someone from the restaurant who was not our server came up to the 14 year old in our group (not any of the 10 adults at the table) and said that we FAR exceeded the 90 minute limit, that I saw no signs for so it may not even exist and that another group had been waiting a long time and that we had to go. We dropped almost $800 to celebrate a graduation on shitty food and terrible service.  Told them they were unprofessional and that the 11 of us will never step foot in that restaurant ever again nor everyone we know! Thanks for ruining a special event! BYE!!!!"
    },
    {
        "id": 20,
        "text": "Amazing tacos and appetizers to share. I ordered takeout from here twice during Covid and the service was exceptional and the food was great. The tempura shrimp tacos were my favorite and my boyfriend loves the cheesesteak tacos. Looks like it would be a really nice bar with small plates. Totally recommend!!"
    },
    {
        "id": 21,
        "text": "Three friends and I came to celebrate Cinco de Mayo. We circled the block (s) several times trying to find parking; that alone made us reluctant to come back. We had a reservation so seating was fine and there was no wait time. There were t.v.s with sports channels on that made it seem more like a sports bar. Our waitress, Dee, was nice and accommodating but it seemed that she may also be fairly new as she had to ask other employees questions.  The mojitos that we ordered were not flavorful and they were definitely missing something. We loved the charbroiled oysters which is what made us want to come but the pork belly skewers were nothing but fat therefore inedible."
    },
    {
        "id": 22,
        "text": "Made reservations just to ensure we had seating and happy we did. It was a beautiful day out and the place was packed. \n*Parking is a struggle in this area*\nOur server was on top of things. Even helped us select the better tequila shot. \n\nThe food was good and we were all happy with our experience. This was a great spot for a group to meet up, enjoy the weather, have good food and drinks with some great people."
    },
    {
        "id": 23,
        "text": "Went here for a birthday brunch. We had to keep looking for our server. She would pass our table and wouldn't ask if we needed refills or another drink which would've been nice since the food took forever. It was not busy maybe 3 tables inside a few outside so we couldn't understand the delay. Apps took forever then I had to ask the server to take the empty plates and clear the table because she kept floating by with nothing to do. They bought out everything but one persons food, and then we had to flag down the server to remind her our friend still has not gotten his food. The food was cold and hash browns hard. Everything else food wise was basic nothing special about the menu. The margarita flight was nasty, 1 of out the four drinks on the flight was good, they tasted like fake sugar syrup and fake fruit flavors. Go elsewhere there is better food and service all over Philly."
    },
    {
        "id": 24,
        "text": "Set is awesome. Great owners, great food, great service. Even during Covid we had a safe and sanitary experience and enjoyed every bit of it. Will be back for more!"
    },
    {
        "id": 25,
        "text": "Came here for a girls brunch and SET did not disappoint! From the drinks, to the food, to the service, everything was fabulous. We got 2 orders of the 30 day dry aged burger with tots, 2 orders of the breakfast tacos with tots, the drunken tots and countless bottles of champagne and orange juice. Everything was SOOOO good. Will definitely be coming back here!"
    },
    {
        "id": 26,
        "text": "A really fun bar with good drinks and even better food. The servers and bartenders are some of the nicest in the city. Do not sleep on set!"
    },
    {
        "id": 27,
        "text": "Pretty good place. The atmosphere is great and seems like it would be a good time for brunch! I had the charbroiled oysters and the waffle fries. The oysters were okay, the sauce wasn't great. The fries were decent but very salty. The old fashioned was made very well. My girls and I did have a great time there though. Staff was extremely nice and helpful. I'd probably have to try other foods but I would definitely return for brunch and the vibe."
    },
    {
        "id": 28,
        "text": "Went here for brunch on a Saturday at 1:30pm. After being seated and reviewing the menu for 10-15min, when it came time to order drinks, we were informed by our server that alcohol would not be served until 4pm. This information was not told to us upon making the reservation, is not on their website, and was not explained when we arrived, despite the alcoholic drink menus that were on display at the entrance of the establishment at our time of arrival. My second choice was a Thai iced tea. The waiter informed me that they were out of coffee and could not make the Thai iced tea. I did not realize coffee was needed for Thai iced tea as the usual ingredients are tea, milk, and sugar.  On to my 3rd choice, mint lemonade. When the glass arrived, you could see straight through the beverage as if it were purely water. The taste only validated the appearance, as this beverage tasted like water with hint of lemon squeezed in, in addition to a mint leaf or two. Did not stick around for food, but I can only imagine how disappointing that would have been. We were also asked for a card to \"hold\" for the tab and were told we would not be charged. Surprised! We were charged within minutes of handing over the card. Horrible experience. Do not come here. Would give 0 (or negative) stars if possible."
    },
    {
        "id": 29,
        "text": "I have seen this spot on IG looked good to try out. The food is really good. I went for brunch on Saturday, ordered the Vietnamese steak with home fries and eggs. So good highly recommended plate and my friends ordered alcohol drinks they liked it."
    },
    {
        "id": 30,
        "text": "Amazing service, really good food. Heard they just introduced a lunch menu with vegan options??? Sign me UP. Amazing hot toddies for when it's chilly. Love this spot!!!!!"
    },
    {
        "id": 31,
        "text": "I had a pretty good experience here! We came for a weekend brunch, and there were good options to choose from. The burger was delicious, and the waffle fries were great too. The atmosphere is really nice, and their dinner menu looks great too. I'd definitely come back again."
    },
    {
        "id": 32,
        "text": "Be aware!! . I went there to celebrate my new job with my friend. The food was amazing but the service was trash. Can y'all believe that they started playing \"get out of here\" song towards the end of evening. I wish that they would've just say \"hey, we are getting ready to close so you have to wrap it up within the next 10 mins or so\". That would've been a better response then them playing the two \"get out of here song\""
    },
    {
        "id": 33,
        "text": "Definitely not worth the 2 month wait to get the reservation.   We were promptly seated at 12 party of 4 we were inside which was ok especially since the restaurant is heading the 50 percent warning.   \n     We started with 3 drinks one classic margarita , one pomegranate margarita and a strawberry Bellini .   The standard marg was not good tasted like cheap tequila and had no sweetness to it.    Wasn't impressed.   We went to order from the menu code but were disappointed to learn that you can only order brunch menu on Saturday and Sunday .   Very limited menu for brunch.   2 people orders the breakfast wontons as an appetizer with tater tots.   One ordered the la Frieda burger.   One ordered set number 3 which was sausage and egg tacos.    The burger I had was dry and flavorless.   I was expecting more and let down.   The wontons had little to no identifiable bacon.   The tots were standard frozen variety deep fried.   Had high hopes and was let down.   All in 160.00 for 4 people only three had 1 drink."
    },
    {
        "id": 34,
        "text": "We had Ciara as our waitress. Service was amazing!!! We got the beer tower and it was perfect for our group. Thank you Ciara!!!!"
    },
    {
        "id": 35,
        "text": "Fun atmosphere when my friend and I walked in :) \nWe had a reservation at 6 and we're a bit early but the staff didn't mind and had our table ready for us already!\n\nThe menu consist of sets of food (sandwich + skewer + fries) or you can choose a set of tacos, sandwiches, skewers and appetizers.\n\nI decided to go with set #3 which came with a banh mi butter steak sandwich, sweet Italian sausage skewer and Cajun fries. I also wanted to try the garlic Cajun shrimp skewer too. \n\nMy friend who is vegan was excited for her options. Unfortunately the vegan cheese steak egg rolls were out that night but she enjoyed her veggie tacos, vegan chicken nuggets and veggie skewer.\n\nWe got two drinks while waiting and they were both pretty good and strong! We were jealous of the towers of cocktails at tables near us. Food was pretty good. Thought it was a bit pricey but you get a decent amount of it. It was a fun experience! Def. Want to come back and try their brunch menu"
    },
    {
        "id": 36,
        "text": "One of my favorite brunch spots. The staff is super friendly and gives great recommendations. The food and vibe are great for any occasion"
    },
    {
        "id": 37,
        "text": "This place was the best- my cousin and I stopped in for brunch and had a fantastic experience. I highly recommend the breakfast. The real MVPs are the staff. They were fun, friendly and attentive. It's a great atmosphere and all COVID requirements are in place- dividers, masks, social distancing... I can't wait to come back!!"
    },
    {
        "id": 38,
        "text": "Average brunch spot in a super gentrified part of town. That pretty much sums it up. Went here for brunch and had the Korean brunch burger and a few mimosas. The burger was okay at best but the drinks were good. \n\nI'm not super cheap but that $16 burger was a letdown.   \n\nI'm not saying the food was awful but it's 100% overpriced for what you get and I'm probably going to bunch elsewhere next time I'm in NoLibs."
    },
    {
        "id": 39,
        "text": "beer tower was fantastic. ciara was amazing! our group had the best time thanks to our waitress thanks so much ciara!"
    },
    {
        "id": 40,
        "text": "PSA: Went here today for the first time. My first tip is to definitely plan if you want brunch or dinner first. If you want dinner, make your reservation for 4:15 or later. Our reservation was at 3:45 and the dinner menu was not available until 4:30. We were not allowed to wait for the dinner menu to be available because there is a 90 minute table time so our only option was brunch. \n\nWhile this was a tiny inconvenience, the service, food, and drinks made up for it. For drinks I shared a beer tower, and also ordered their Hot and Spicy which was a hot apple cider drink with cinnamon and whiskey. This was incredible. For my meal I ordered the Bulgogi Breakfast Burger. This was definitely something that I would order again if I came for brunch. Our service was incredible the whole time and constantly had staff circulation the restaurant to see if anyone needed anything. Overall, I would definitely come back here."
    },
    {
        "id": 41,
        "text": "Tried SET the other night.  The chicken 'skewer' was more of a kabob with raw chicken and vegetables.  The Mexican corn salad could have been good but the corn was flavorless, probably used canned corn.  The wings were ok, but not worth a repeat.  I liked the fries and drinks were decent."
    },
    {
        "id": 42,
        "text": "Well, to say the least they have some work to do. Let me start out by saying the entire tables comes from the industry, and we all try to be understanding of the circumstances that surround eating out during COVID.\n\nThe server was very sweet and we could tell he was trying his best. He disclosed this was his first shift (first time serving I think) so we knew to give him some leeway and we were fine with that as we had all been in his position before.\n\nWe got drinks in a timely fashion, which was good. However we were not approached again to order food for about 20 minutes. \n\nBeing quite hungry at that point we order apps (just 2) so we had something quickly and ordered our food at the same time since we had plenty of time to make those decisions.\n\nWe did grow concerned when we hadn't seen our apps after a half hour of waiting, but we figured the kitchen was busy and covid, etc. however we also had empty drinks and waters, and were not approached until we asked to order more drinks. \n\nAfter about an hour and 20 minutes I finally approached the host stand to kindly prod. I asked her if she could check on our food as it has been a really long time and the server had on stopped back once to say \"they're working on it I think\".\n\nThe food came out about 3 minutes after I approached the hostess. Appetizers came with the meal. Not sure if this was just a misunderstanding, but it was definitely disappointing and we had a pregnant friend at the table that was starting to eat her hands at this point. \n\nThe food was overall decent. I wouldn't rave and rant about it but it did the job. A big thing that bothered us is that a few of the dishes listed on the menu did not match what came out on our plates. There we quite a few but for instance, the avocado toast \"set\" lists the meal and 2 toasts with sautéed cherry tomatoes, pickled onions, & balsamic vinaigrette. The set actually only came with 1 toast, mine had why I believe to be feta on it, some haphazardly cut tomatoes (not sautéed), no onions, no vinaigrette, while my friend next to me who ordered the same thing had the onions on it. She was a little upset it did not come with two as described, and she also unfortunately cannot have cheese (she wishes!) so she did not eat her meal. She was not asked if she wanted something else.\n\nThe whole thing was just very messy. No consistency, mediocre food, and a long wait. They took off my friends avocado toast, and gave a 15% discount. (Don't worry, we made sure we didn't screw over the waiter) \n\nPlease work on consistency, timing, employee training and communication! If you told us there was a problem or kept us updated or made sure we had drinks or an appetizer to hold us over, things might have been better. There is a laundry list of things that could have improved or saved our experience that unfortunately just didn't happen. We will not return :("
    },
    {
        "id": 43,
        "text": "Absolutely LOVE this spot! Can't believe how delicious the food and drinks were. And this is just their soft opening! So excited to see what's on the full menu. Our waitress was so sweet. We were also greeted by the manager or owner we believe and got free shots on the house. Such a great atmosphere. Cute paintings of all things Philly inside. Very nice bar. Cutest outdoor eating. Now my favorite taco spot. HIGHLY RECOMMEND"
    },
    {
        "id": 44,
        "text": "Everything here on the menu tastes great and you can't go wrong and it's perfect for outing because there are serval bars around after you finish eating to bar hop"
    },
    {
        "id": 45,
        "text": "MEG IS THE BEST SERVER EVER!!! \n\nWhat a fun person, she came here from Ireland and spreads the best of that culture. Also her service is great and we had the best time."
    },
    {
        "id": 46,
        "text": "The brunch at Set No Libs was pretty great. I do like a lot of options in a menu(double knot is a prime example), however to have a small menu with really quality options makes it even more specials. We started with the chicken and waffles which are salt and pepper jalapeño chicken, waffles, whipped scallion garlic butter and condensed milk syrup. I didn't really taste the jalapeño factor in the chicken but it was still crispy and yummy. The waffles were sooo good, soft, fluffy and I loved the scallion garlic butter. My entree was steak and egg skillet. I got it with tater tots instead of the sriracha garlic home fries because my inner school girl cannot pass on tots. I always think of that scene from Napoleon Dynamite with the tater tots in his pocket. My friend got the breakfast tacos which is one of their four \"sets\". Tacos have sausage, eggs, bacon pieces, caramelized onions, tots and chipotle Mayo. They are loaded but hella good. We had to pack up food to go because the mimosa tower seriously conquered us. I recommend having at least 3 people, trust me even were hardcore badass and we were like full to capacity. I will tell you now it is hard to get a brunch reservation unless you go late in the afternoon. They do have happy hour too I really wanna try. I think their brunch is what they're really known for however. I never grade a place on just brunch but I will leave it and say I highly recommend."
    },
    {
        "id": 47,
        "text": "The staff here is wonderful; so friendly and the service is on point! Kaitlyn and Kyle are beyond awesome and I can't wait to see them again. Will definitely be returning ASAP for the delicious sliders and tacos."
    },
    {
        "id": 48,
        "text": "Best burger in Philly! I HIGHLY recommend the brunch burger with the sunny side egg on top. Seriously perfection  when I crave a burger I will dream of this one. Also very impressed that they opened during Covid and could still provide an excellent experience!"
    },
    {
        "id": 49,
        "text": "Pretty nice place with great outdoor seating in the heart of No libs! The menu is pretty versatile and your vegetarian/vegan friends would be delighted to know that there are options for them! They have different specials each night which is great!"
    },
    {
        "id": 50,
        "text": "This place was awesome went with a friend had a few drinks and apps and Cat the server was so nice. Can't wait to go again"
    },
    {
        "id": 51,
        "text": "If I could give 10 stars I would.\n\nSet nolibs has SET THE BAR very high. In a world where the dining experience has suffered due to challenges beyond the control of those in the industry, Set has managed to create a spectacular example of what to do.\n\nThey are adhering and going above and beyond to comply with safety standards due to Covid. The outdoor space is heated and filled with the perfect ambiance. The happy 3 hours is as tasty as it is a value.\n\nCan we talk about service though. This is where the evening truly shined. Friendly, informative, safe, personable, attentive, kind, knowledgeable, and such thoughtfulness in our server and staff.\n\nBetween the atmosphere and the service we anticipated and fully expected the food quality to be amazing. It sure as heck was! Got the tots, oysters, tacos, and about 5 of their winter drink offerings. The food is bright, delicious and well seasoned. Can't wait to go back for the clams, mussels and pretty much the rest of their menu  nomnomnom, go here! \n\nOh, they are furbaby friendly too!!!"
    },
    {
        "id": 52,
        "text": "The service was great the food was great and the atmosphere was amazing. The waiter made sure we had a good time and accommodated substitution on orders. If you go, get the big ass margarita it will get you lit!"
    },
    {
        "id": 53,
        "text": "Love this place! Amazing food drinks and staff! Never write reviews but SET No libs deserves it"
    },
    {
        "id": 54,
        "text": "Love the cocktails here !! A very cute and affordable place but it's normally booked so make sure you reserve a table a few days ahead"
    },
    {
        "id": 55,
        "text": "I can't say enough about how delicious this meal was!\n\nOutdoor dining:\nThe restaurant is in the heart of Northern Liberties so it's perfect for people watching without feeling like you're in the mix and with Covid that's ideal! They set it up nicely with twinkle lights, and picnic tables so it's a casual chic vibe. All of the food was served on disposable cutlery and containers with the exception of our cocktails.\n\nCocktails:\nThey have a thorough drink menu with 16 and 32 oz options. The drinks are delicious and appropriately strong; however, If you want to add a \"shooter\" you can for just an addition $4. There are mixed drinks and frozen drinks and the menu clearly lays everything out for you. The drinks were so fun! They were served in a plastic red travel container with a bindy straw- it made me feel like I was on a vacation which was definitely needed! got the frozen piña colada which was so deliciously refreshing. \n\nFood:\nSo I immediately went to the taco section! Being a pescatarian I had two options, the fish or shrimp tacos. The great thing about the menu is you can mix your selections so you can try any three combinations for $14. I did two shrimp and one fish. The fish was good but the shrimp...incredible!! The flavor, the light crispiness, the size. The portions were fantastic because it wasn't too much food but it wasn't small by any means. I tried the classic tater tots and they were exactly what you would expect for tater tots- nothing necasarily stood out about them. For meat eaters- I don't eat meat, but my boyfriend tried the Cheese steak buns and I didn't even think he chewed he said they were mouth watering good! \n\nService: \nWas amazing. Our server was super attentive and patient walking us through the menu.\n\nOverall I loved it and would definitely recommend for a chill night where you want to eat well and have a fun time! \n\nEnjoy!!"
    },
    {
        "id": 56,
        "text": "i wanted to like this place, i really did. but it's so overpriced and the quality doesn't match!!! it's a 2.5 / 5 for me dawg. not worth it. way better drinks and food in the area\n\n\nmy first time here i just got take out and got some sliders and waffle fries and it was delicious! so it convinced me to come back for brunch with my friends\n\nwe got some bloody mary pitchers, margaritas and mojitos\n\nbloody mary - bland bland bland. even though it says \"thai chili\" i tasted nothing thai or chili about it. it was so bland that we asked for hot sauce and mustard and added in our own flavor to not waste the pitcher\n\nmargaritas - this was nasty. it was just lime juice and maybe a sparkle of tequila. we asked for new ones and tried to send them back but the server said too bad and wouldn't take them off our bill... which was $300 by the way.... RIDIULCOUS!\n\nmojitos - it was OK. super sweet and didn't taste very natural. for $16 i could have found a better one in the neighborhood\n\nnow on to the food... it was better than our drink experience but not good enough to make us come back\n\nthe vietnamese steak and eggs were OK. steak was cooked well but these potatoes underneath the eggs were so mushy. it was almost like boiled potatoes even though it said \"home fries\" it was inedible for me\n\nmy husband said his burger was decent but all his waffle fries were these little pieces of potato, he only had 3 full fries. \n\nthe avocado toast meal is literally one piece of bread. NOT EVEN 2 for the price.\n\n\nall in all, save your money, there's better brunch picks in the city"
    },
    {
        "id": 57,
        "text": "1 star for the food. If I could give 0 stars I would!Currently sitting in Set as I write this and I have yet to receive my food. I am totally disappointed in this server and service. We arrived around 7:10 pm. Had a reservation for 7:30 pm. The server's name is Maria H. The server stated she didn't like my tone and I was attacking her because I asked for an update on the food and asked for the manager... never yelled... Never raised my voice. Simply asked... she proceeds to say it's not her fault all of her tables are waiting and that she can't get me a manager. She also asked what would I tell the manager multiple times that I just gave up. Totally unacceptable. From the time we came recognized all the tables in her area were receiving lack of service or waiting on her. But ok, we give it a chance. She not only blamed the kitchen and her manager but said she has other tables still waiting on their food as if that's ok...\nOne table that was in her area that also walked out after their meal were saying \"I'll be writing a review on Yelp\"... smh.\nThey have a little sign on the table that states there is a 20% gratuity and they pre-authorize the card for \"outdoor seating\" after we order. She came back at like 10 mins after to ask to pre-authorize the card... we're sitting inside. There are no signs stating this. Seems like this is their method to make up for their horrible service. Pre charge the card and 20% gratuity regardless... this place is not recommended because customer service is everything and it's a turn off to hear her react the way she did to me and blame everyone else instead of a solution."
    },
    {
        "id": 58,
        "text": "I finally got the opportunity to check out SET. Came here for a late night snack and was underwhelmed. I sat at the bar and ordered the grilled mussels and the egg rolls. For the grilled mussels - the seasonings and the cheese was a bit overpowering, taking away from the taste of the actual seafood. As for the egg rolls, not the greatest. I wonder if my food experience was because it was near closing time. All in all, SET is a great place for drinks and meet ups for happy hours. I wasn't sold on the appetizers. I'll definitely return to try other things on the menu!"
    },
    {
        "id": 59,
        "text": "The shrimp tempura poppers are soo good! That was my favorite! The clams and mussels were great. The egg rolls and others apps were okay. I got set 3 anf it was great. The pork belly skewer is delicious. The slider was great. I love the vibes!"
    },
    {
        "id": 60,
        "text": "Steak and eggs skillet is amazing. The tenderness leaves a sense of juiciness left in your mouth for hours afterwards. The audacity. Don't forget their \"infamous\" mimosa towers, and if they run out of physical towers due to popularity, the best bartender in philadelphia, Abbey, will still take care of you and make you feel like you're on a tower. Great spot. Big recommend."
    },
    {
        "id": 61,
        "text": "Today I order online from their website.  Place order at 5:40, was told it would be ready at 6:10 for pick up.  Walk down and at 6:08 I get a text to say my order was cancelled.  Check with hostess since I had just walked in to see if it was possibly there and what happened?  Manager comes out to tell me that they've \"turned off\" those methods of ordering because they've had so many problems.  That the order should never have went through. No offer to make order as they were busy.  Left with no food.  Then when I message restaurant they don't respond but \"laugh\" at my comments."
    },
    {
        "id": 62,
        "text": "Huge fan of SET as I've been several times to the NYC location. Went around 12:30 and got the steak & eggs platter and a peach bellini. Both were very flavorful and delicious!!! Unfortunately I could only order Brunch and Cocktails at that time but was hoping to order some Bahn Mi sliders! That was the only bummer. \n\nStill have great food & drinks, definitely will be coming back."
    },
    {
        "id": 63,
        "text": "I love the fact that restaurants are still opening and thriving in this dreary time. We were looking forward to trying this place for weeks and finally got ready to try it on a Friday but we were hit by a thunderstorm. We were determined to Atleast get take take out so got to the place and the rain had almost stopped. They were nice enough to partially dry up a table and we decided to get a couple of drinks and an app and get the rest to go! We tried the jalapeño cheesesteak spring rolls, a Red Bull froze and a whisky drink. Absolutely delicious! \nTo go order- bulgogi cheesesteak sliders, wings and shrimp tempura tacos. \nIt was about time we got some fresh take on comfort food! Love love love this place. The indoors looked quite Instagram worthy so I can't wait to go back."
    },
    {
        "id": 64,
        "text": "Let me start off by saying I loved it here and cannot wait to return! With that out of the way, went to brunch -- there was mimosas! The end! LOL!\n\nOf course, I wanted the mimosa tower for $69 (it's better for maybe 3 or more people). It was just my friend and I. She met me here (drove over an hour to Philly). We opted for the bottle of champagne w/ OJ $35. I got a shot of peach flavor to go with my mimosa. I enjoyed every drop and loved mixing in the OJ, champagne and peach! On point...delicious. \nBuzzzzzed! I ordered the hangover tots!!! I did not know I wanted this in my life! I loved this yummy,  hot mess, of a concoction! Friend is vegan and she enjoyed her meal too!\n\nMade reservations several days in advance for Sunday brunch on OpenTable. Outdoor seating was the only spots available (at the time)-- I snagged it! The reservations are a hot commodity I see. We were both running a bit late. There's a little bit of a grace period and the employees here were very accommodating to our delay. Customer service was good too!\n\nLove...this...spot...for...BRUNCH!"
    },
    {
        "id": 65,
        "text": "Had a wonderful experience here with a large party for brunch! The champagne towers were too die for and the food was simply delicious! We were celebrating a birthday and I really appreciated that they allowed us to bring in an outside cake. All of my friends were really appreciative of their meals and the service.  I am very much looking forward to going back!"
    },
    {
        "id": 66,
        "text": "So, I'm rusty with remembering to take pics before eating, so this is after I started of course. \n\nFood: I got the lunch special lemongrass chicken skewer. You can choose rice or salad bowl. The salad was so fresh and good. The lemongrass dressing was amazing!! I need a bottle for home. I also did the taco lunch special you get 2 tacos and can mix and match between 4 chooses. Comes with tots or waffles fries. I got the shrimp tempura and fish one ( which was already in my belly by the time I remembered to take a pic). The tacos were good and waffle fries were great also.\n\nService: they were very accommodating. My waitress was nice, the hostess and the bartender who tried to get me, my friend and her girls and their friends seated faster after being very later for our reservation."
    },
    {
        "id": 67,
        "text": "The food was nothing spectacular. The waitress just sat us , took the order and brought the food . And then just the check. Interestingly they had audacity to add tip on their own. Probably will never go there again."
    },
    {
        "id": 68,
        "text": "Yesterday I was working in this area and I remembered that this place was located very close by and since I can't get in during happy hour time,  I decided to go over and check them out. \n\nParking:  Very limited due to restaurants setting up outdoor seating and  construction. I suggest parking somewhere close by and walking or catching a ride share. \n\n I found a parking spot, so I knew that the food gods wanted me to go in and try this place. I sat at the bar. Mike was my server, and he was very helpful and nice. \n\nDrink:  I chose the cheeky tiki, and it was pretty good; it had a nice kick to it. If you like, sweet, definitely try it. \n\nI got mixed reviews online about the charbroiled oysters; however, I took a chance and ordered them. The oysters were nice and tender very garlicky, which I loved, and they had flavor; however, I wish they were a little more charbroiled. The Oysters  do not come with any type of bread, so Mike suggested that I get the bread that normally comes with the mussels. The bread complimented the oysters very well! they should start offering this bread with the charbroiled Oysters also. \n\n\nOverall, I enjoyed my oysters and my drink,  and I can't wait to go back to try back to try other things on the menu."
    },
    {
        "id": 69,
        "text": "We just went to Set NoLibs today as part of their soft opening and got a few apps! Johnny and the staff were awesome and incredibly friendly. The food was great and we can't wait to come back to try more off their official menu! We got to tour the  bar and it definitely has an awesome vibe. Very excited to add it to our restaurant collection."
    },
    {
        "id": 70,
        "text": "On the brink of 4 stars but not quite there. Burger was okay, loaded bulgogi tots were excellent, margaritas get the job done but overall it lacks something. Been there three times and service varies from bad to decent. Likely would be a good HH spot"
    },
    {
        "id": 71,
        "text": "SET was a pleasant surprise. It looks small from the outside but has a relatively large dining area inside. Friendly staff, happy hour drinks were solid, and food was tasty with vegan options as well. Overall 4/5. Food 4/5. Atmosphere 4/5. Staff 5/5. Drinks 4/5."
    },
    {
        "id": 72,
        "text": "I came here a few weeks ago for a work dinner. There were 7 of us, and I was able to make a reservation in advance. They do not require vaccination for entrance. \n\nFood- 4 stars. We shared a few apps, which I've mostly forgotten but remember enjoying them. I got the banh mi steak sliders for my main, which were delicious. The menu is not super vegetarian friendly, and doesn't have many healthy options (it's a lot of fried and cheesy food). I got the apple cider mimosa which was way too sweet and did not taste good. \nService- 4 stars. Our waitress was not the most friendly but the service was sufficient overall. \nAmbience/decor- 2 stars. The bathroom is in the basement, and it was actively grimy when I used it. It looked like it hadn't been properly cleaned in a good long while. There are TV's over the bar, and several loud people sitting at the bar. The space itself is covered in ugly cheap-looking paintings. \n\nOverall, the food was decent, but the cleanliness and vibes inside the space didn't match the high prices. Luckily, I wasn't paying my own way, but if I were the $18 spicy margarita would have scared me off."
    },
    {
        "id": 73,
        "text": "We had a tower of Mimosas and a tower of Margs. I personally like margs better than mimosas, but both were really good. If you are looking to drink a lot of alcohol, set nolib is a place that would not skimp on champagne and not a place that would just fill your mimosa with orange juice. The food was also so delicious. We had the tempura shrimp tacos, the tempura shrimp poppers, and all of the skewers.\n\nI think the tempura shrimp poppers were 10/10 would order again."
    },
    {
        "id": 74,
        "text": "So I just want to start off by saying, MARGARITA AND MIMOSA TOWERS. That aspect alone makes me anxious to return to this place. I went with a group of four of my friends after seeing this place on TikTok (LOL). We made a reservation which I highly recommend doing so you can ensure you have a seat. It was a warm day so we were able to sit outside and they had a great area to do so. We split a mimosa and margarita tower and honestly, they were the perfect amount for each of us to have two-three full drinks. Not to mention the price was great when being split five ways. I highly recommend going with this option if you're looking to drink during your meal!! We personally left tipsy and happy.\n\nThe food options for brunch were great. I really liked how they had the predetermined \"sets\" for $16. They came with a lot of food and they tasted great! I had the korean bulgogi beef and it was so much food. My stomach was very full after leaving it. Additionally, three of my friends are vegetarians and they had plenty of options to accommodate them. \n\nNext time I am looking for brunch, SET is going to be at the top of my list!!!"
    },
    {
        "id": 75,
        "text": "The food was good but mandated a mask for $2 no matter what and then forced a 20% tip on you. Not worth the hassel and price"
    },
    {
        "id": 76,
        "text": "TLDR: Looks a lot better than it actually tastes - wouldn't recommend for dinner.\n\nMy sister went here for brunch and loved it, so she brought me here so that we could try their dinner menu. After looking at their website, instagram, and yelp photos, I was so excited to try SET NoLibs, but I was sadly disappointed. The cocktails were average. For food, we ordered the SET #2 House Speciality, charbroiled oysters, tempura shrimp tacos, and Set Loaded Tots. When the food came out, it looked and smelled so amazing, but the taste was underwhelming and the more we ate everything, the less we liked it. The chicken skewer was very dry and lacked flavor. Their pork belly slider had this metallic taste to it and a very weird aftertaste. The charbroiled oysters and tempura shrimp tacos also lacked flavor. \n\nI did like the Set Loaded Tots, but after a while it did get old and some bites tasted better than others. The best part of the meal and only thing I'd recommend is the waffle fries with the chipotle aioli.   \n\nThe menu is a bit on the pricier side (and because of my experience I'd say it's very overpriced) but pretty average for restaurants in the Northern Liberties area. In terms of atmosphere, outdoor dining, and service, I was happy. The outdoor seating is a nice set-up and from the photos I've seen of the inside dining, it also looks super cute. The picnic tables are dog-friendly (we were even given a water bowl for our pup) and pretty spacious. I believe our server was Desiree and she was so sweet. \n\nProbably wouldn't return for dinner, but my sister said she really enjoyed their brunch items so maybe I'll go back to try that!"
    },
    {
        "id": 77,
        "text": "idk what magic set nolibs puts in their chipotle mayo but it is unbeatable. great food with lots of vegetarian options 10/10"
    },
    {
        "id": 78,
        "text": "Absolutely loved this place! Came here with a friend for brunch and it was awesome. We got a mimosa tower and that was plenty for just the two of us. She got the breakfast tacos and I got the steak and eggs. The steak and eggs was probably the best steak and eggs I've ever had at any restaurant. I also tried one of the tacos and those were very good too. This place gets a 10/10 from me! I'll definitely be coming back!"
    },
    {
        "id": 79,
        "text": "Brunch review:\n\nIt's early fall - perfect time for outdoor dining in Philly. Not too hot not too cold so we booked outdoor seating for brunch. This was our first mistake. The outdoor seating is picnic table style and veryyy slanted. I was very concerned drinks were gonna be spilled multiple times. The table we were given was on the side walk. The tables in the street area didn't look as bad but we were told they were all reserved. \n\nOnce we were able to get moved inside we felt comfortable to order the mimosa tower. This wasn't what I was expecting but it ended up being my favorite thing. It's a huge tube of mimosas with a tap at the bottom for you to fill your own glasses. We were told it held 2 whole bottles of champagne. The mimosas were amazing, strong, and not to much OJ. \n\nNow for the food - this is where we were disappointed. It's called sets so you have to order a set, right? I got set #3 (tacos) and both my friends got set #4 (burger). And for our sides we were very excited about them siracha home fries. We even ordered an extra for the table but these were actually the worst part of the meal and barely touched. They could have used wayyy more siracha. They weren't crispy at all. They were just bland boiled potatoes. Not what we were expecting. As for our mains. The tacos were standard. Nothing to rave about but nothing to really complain about either. The burgers however weren't as good. They were soggy. So soggy that my friends had to resort to eating them with a fork. \n\nOverall I probably would only come back to get drinks unless they revamped the menu."
    },
    {
        "id": 80,
        "text": "Great food, great drinks, great service. Thanks to Ciara and the whole crew here at SET No Libs!"
    },
    {
        "id": 81,
        "text": "10/31 - reservations outdoors for 4, sat us at a picnic table with an umbrella that barely covered half the table. It was brunch. It started raining, we asked to be moved inside or to the tables on the street prior to ordering food/drinks. There were 4 open tables.  The Hostess stated she couldn't seat us there because our party wasn't 'big enough.' \n\nWe opted to try inside since they offered the bar, 4 seats were unavailable. Asked wait staff again if we could sit under the covered seating, again they stated no even though there was a party of 4 sitting on the street seating. Unwilling to accommodate. \n\nToo bad.\n\nWent to Sacho's and spent our hard earned money there instead and had great food and drinks there. When we left, no one was occupying the 4 empty tables at SET that we were told we couldn't be seated at."
    },
    {
        "id": 82,
        "text": "Terrible service. They didn't pay attention to anything we needed. It took us forever to get anything. The attitude of their staff is over the top, and they also had a happy hour food menu, that when you tried to order from it as it's advertised the server would just not honor it and say \"oh we dont do happy hour food anymore\" -- the neighborhood is full of decently priced fun options that have way nicer service. Spare yourself the chaos of this place unless you're craving a hot mess of an experience, then go for it."
    },
    {
        "id": 83,
        "text": "Honestly that place had good food , and I enjoyed my drink . The service was also speedy which I appreciate."
    },
    {
        "id": 84,
        "text": "We visited SET in the Northern Liberties area of  Philadelphia called SET NOLibs. We order a bunch of appetizers to try. Most of the appetizers were ok and needed work to get it to the taste they need to be. Our favorites were the Jalapeño cheeseburger spring rolls and the tempura shrimp poppers. The charbroiled oysters were dry and burnt ( they need to pay special attention to details). We ordered loaded tots and the waitress did not tell us they didn't have tots and brought us French fries that we sent back and they did not charge us. The mojito did not taste like one and was very strong and bitter( must pay attention to recipe) don't make drinks too strong. Their sliders were also ok. Bahn mi buttered steak sliders needed more flavor and the meat more caramelization flavor to it. Sesame chicken sliders were not at all sesame chicken. Their batter needs work to make it more tasty.  No sesame flavor and could use some sweet and sour sauce to it for added flavor. One of our favorites were the soy glazed pork belly Skewer which was tasty but the Vietnamese buttered steak cubes and lemongrass chicken were not the taste of Vietnam. I would suggest to go to a Vietnamese restaurant and learn the spices of Vietnam and redo these dishes to taste like Vietnamese cuisine. The atmosphere was nice with heaters to keep us warm outside which was an added touch. The service was acceptable but hoped for better service because not a lot of people there. We had to ask for water and it took a while to get it. Also we made reservations at 3pm and our food didn't come until 4:10. Be prepared to wait some time. You can't be in a hurry to eat here. We finished two hours later. Overall good attempt but needs some work on the dishes."
    },
    {
        "id": 85,
        "text": "I was enticed to try this place by their what seem like overly filtered pictures on instagram. I get that it's Northern Liberties, but the prices for such normal food items seem pretty high. All the food was pretty good, no complaints, but nothing to rave over either. Cocktails (cape cod lemonade and margarita) were very good and strong, on happy hour for $8, normally $12. A few tears were shed eating the thai chili wings, which i'm happy about, my breath was mad spicy in my mask walking around for the next 20 minutes."
    },
    {
        "id": 86,
        "text": "I came here with my cousin and I really enjoyed my experience here. we made reservations for 7 PM and it was outdoor seating however tonight was a lot colder than expected so we asked the host if we can come inside and sit. they told us they have to ensure that there is an available table because the tables that they already have set are for reservations only. after waiting 30 minutes they actually was able to let us sit inside and they were very nice about it and understood. \n\nour waiter was very friendly and took our drinks quickly as well as our appetizer and entrée. I believe we only waited no more than 20 minutes and our food was already coming out. I highly recommend getting the shrimp tacos it was amazing.  if I had any more space in my stomach to get another round I would have. we also ordered a margarita tower and it was not watered down like I expected it to be. unfortunately it was only two of us so we could not finish it but we definitely finished at least 3/4 of the tower. The vibe was just right and the music was not too loud to have an intimate conversation or anything. definitely deserves five stars in my book!"
    },
    {
        "id": 87,
        "text": "Tik Tok users rejoice! This place is just as described! \n\nSET NoLibs is nestled right in the heart of NoLibs where all the restaurants are on 2nd st. Use a rideshare to get here or may the odds be in your favor finding parking. \n\n\nForgot to mention you need a reservation. You might get lucky with a walk up but I doubt it, this place is very popular and reservations go quickly. \n\nThe inside of restaurant is bright, colorful, and cute. The outdoor seating is curbside picnic tables/benches separated by dividers. Not the cutest but it gets the job done. \n\nDrinkssss. Most of you are here for the margarita tower and want to know if it's worth the $69. Yes. Three of us split one tower and got 3 flavors on the side ($2 each). It's filled with so much ice that it looks like it's going to be watery but don't fret it's strong. Literally we were all shocked at how good the margaritas were. \n\nThe food. We ordered a variety of wings so forgive me because I don't remember which ones but what I will say is they were all really good. We also ordered tacos & the tempura shrimp were my fav! \n\nThe bathroom- It could be looked after better. It's not that appealing to the eye so don't think you're getting any cute selfies. \n\nThe service was amazing. Our server was really nice and friendly. \n\nSet NoLibs is going to be in my summer rotation heavily."
    },
    {
        "id": 88,
        "text": "It took us a long time to get a reservation for this place, we were finally able to go, I extremely regret giving them my money. \n\nMy first question when I saw our waitress  was if  a menu item had dairy in it.  She replied with \"I don't know.\" Okay, not every person will know all the ingredients in the dish so I asked very politely, \"Okay, can you ask the kitchen?\"  And she replied with a blatant and attitude \"No.\" That, right there, just shows you everything you need to know about the place. She refused because it would be more effort for her. I should've gotten up from the table and walked out. I've never in my entire life experienced something like that. Complete carelessness about a customers allergy/concern. \n\nMajority of the staff walk around with half mask on and mask off whenever they feel like it. The staff do no care at all as apparently it's a MANDATORY 20% Tip already included in your check. This is obscene as I definitely don't think my waitress deserved the tip at all. \n\nThe food itself was decent, but this place is very much overvalued and overhyped. This attracts college bar people, and they treat it like so.\n\nThe staff even let someone vape inside and didn't say anything at all to them. (Yes, the staff knew, looked directly at them too) What about my asthma? Just wow on so many levels. If I could give this place a 0 star rating I would've!"
    },
    {
        "id": 89,
        "text": "I love Set! If I could go every weekend I would :) I highly recommend trying the Charboiled Oysters, there hasn't been a time I've gone and didn't enjoy them immensely! I also recommend the Shrimp Tempura tacos, they're cooked to perfection."
    },
    {
        "id": 90,
        "text": "First time trying Asian Fusion style food. Never had Vietnamese food, Korean food, Lemon Grass, or Vegetarian food, and really wasn't in the mood to try it for the first time at the moment. If you like that type of food, this is the place for you. It is a very young crowd vibe in the spot. You have on option of inside, and outside dining. They ask for your credit, or debit card to place on file before you place your order. Apparently people have been walking away without paying for their order. The staff is friendly, and explained the menu. They have a Magarita Flight Tower of a set of 4 for $29. You can choose for flavors. I don't think it's worth it though. The drinks were average at best. I didn't like the Sesame Chicken Wings. The Shrimp Skewers, and the Cajun Garlic Butter Wings were the best thing I ordered, and they were appetizers."
    },
    {
        "id": 91,
        "text": "Stopped by Set again tonight to catch the sixers game and let me tell you, those margarita towers... what a deal! Our server Theo was fantastic. Great dude."
    },
    {
        "id": 92,
        "text": "Ciara was an amazing server! She was charming, hospitable, and quick to respond to my table's needs. It didn't hurt that we share a name! 10 out of 10!"
    },
    {
        "id": 93,
        "text": "So what I was NOT expecting on a lovely Mother's day of taking our moms and wives out was to experience one of the best burgers I've ever had. First of all, Set NoLibs is an interesting name, but at least the outside seating was swanky with a table fire pit encased in glass. Only hard part was passing food and hoping the person grabbe the plate fast enough so you don't burn yourself lol Be careful! \n\nThe oakwood benches looked cool, but most of our butts were hurting after a short while and our feet were getting numb. Random, I know. The no touch menu made things easy to order and I took the safe route with a burger which was a 30-day dry-aged beef burger with a fried egg and garlic aioli sauce. The burger was perfectly cooked and seasoned well. Not too salty, or greasy at all. The egg was perfectly cooked.\n\nMy fave part of the burger was that brioche bun and garlic aioli. The garlic was stronger than I expected which was a great thing to me. The waffles fries that came with the burger were amazing as well! It was enough food to fill me up half the day. MY sister didn't like her tater tots and tried to steal some of my waffles fries. She's lucky I love her, so I gave her 2 fries lol"
    },
    {
        "id": 94,
        "text": "Tried their soft opening menu.  Wings are off the charts good.  Tacos amazing.  Try the crafted lemonades."
    },
    {
        "id": 95,
        "text": "They chicken used for my skewers I had was spoiled. Soon as I bit into The chicken could taste the extremely spoiled chicken it spit it out immediately. Upon tasting my spouse and I smelled the chicken l. It had an awful smell. I then let the server know because our waited barely checked on us. They server agreed that it had a weird odor and took it back. However the manager argued wit me for 5 minutes stating that the chicken came in that day! And I would pay for the two remaining skewers!! Of course I was unsatisfied and wanted to be refunded for all the skewers which I didn't eat due to the file taste!! Eventually he wound up taking it off my bill without an apology or anything!! Because of this I will never return!!!! Horrible ass hole manger"
    },
    {
        "id": 96,
        "text": "This place had a nice vibe. We sat outside. I was underwhelmed by the flight because each drink tasted more like the syrup flavor. The oysters were super good though. They almost took me back to New Orleans. The bulto go tacos were good and filling. Lots of different flavors there. I'd have like more of a crisp on the steak. The chocolate mousse cake surprised me but was pretty good."
    },
    {
        "id": 97,
        "text": "I wasn't expecting much but food was amazing! Not many options to choose from for happy hour but you can't go wrong with the soy garlic wings! I got the Set 2 (pork belly slider, chicken skewer and waffle fries) which was DELICIOUS. The pork belly was mouth watering! The caramelized onions on the pork belly made it even better! Service was okay (pretty slow, but understood because ya know pandemic going on)."
    },
    {
        "id": 98,
        "text": "It was good.  I always forget how hoppin' NoLibs is and SET is no exception.  It was busy but our server was very attentive.  The food was good and the drinks were delicious.   The outdoor seating is right on 2nd street so there is a lot of activity. Would recommend trying but just keep in mind it will be VERY busy and loud."
    },
    {
        "id": 99,
        "text": "My new favorite spot in Northern Liberties!! Both the food and drinks are on point and the prices are better than everywhere else on the block. Megan is an above and beyond server and I will definitely be back to see her, along with the rest of the staff. Great energy here."
    },
    {
        "id": 100,
        "text": "This was our first visit here and the dining experience was horrible , had an reservation which the greeters were great   We had  drinks at the bar until our booth  became available. Order has been placed with bartender she was nice  so that was a plus , however a \"well\" done burger was ordered and it was not received . Never saw the server  but once and that was because I yelled and flagged him down smh , in his past time he was behind the wall on his phone, not even checking on his tables . I kindly let him know this up front . What I originally came out to eat was not available until dinner time which was a bummer . So I had to settle for something else which I didn't really. The server came to correct  the situation and we were hold it would be no charge doe the mistake and still wind up paying for it. Maybe we will return at a later date & time after 4 pm so I can try the shrimp  tacos,  but for a 1pm date it shouldn't have been so negligent . Very bad first time experience"
    },
    {
        "id": 101,
        "text": "We were disappointed entering due to the host being pretty dry / Uninviting and sitting us all the way in the back of the empty restaurant. However the food was good and flavorful. We ordered surf and turf sliders and fish tacos (both good to me). Now my real issue was the very below average service with automatic 20% gratuity.  Probably won't be going back there again ."
    },
    {
        "id": 102,
        "text": "Service really sucked the waitress was super slow, tip wasn't earned especially $33 the drinks are awful this was our first time and definitely the last"
    },
    {
        "id": 103,
        "text": "Already posted on open table but needs to be posted on yelp as well. Went for my roommates bday for brunch. We were really looking forward to this for weeks. From the minute we got there and i said my name for the reservation, the staff was rude. The food truly sucked and was majorly overpriced. My server told me what i had ordered wasnt on the menu and when i showed her on my phone, there was huge attitude and it wasnt comped even though the item came out after everyone else had finished their meals. Who does chicken and waffles with wings?! The waffles had congealed syrup on them like they had been sitting out. Bloody mary was all watery and didnt even seem like there was alcohol in it. Mimosa tower was cool but not worth $69. Dont waste your $ at this place!"
    },
    {
        "id": 104,
        "text": "A must see for happy hours! Drinks were so tasty and the food was so good! Highly recommend. There are many bars and other restaurants In proximity as well so it is very fun to sit!"
    },
    {
        "id": 105,
        "text": "I went here for restaurant week and I was not impressed. The servings were extremely small for the price we paid. They considered 3 clams an appetizer and a chicken slider with waffle fries an entrée. I would give it 3.5 star because the jalapeno margarita was excellent."
    },
    {
        "id": 106,
        "text": "Steak and eggs skillet is the best. Abbey is a great bar tender! I think she has a crush on me"
    },
    {
        "id": 107,
        "text": "Even if this was the only place open for food ever again, I would NEVER return here. I waited a day to post my review so I could mull over the meal and service and still can't find anything to brag about here. They charged $4 for my friend's tea and it was Lipton brand. Such a rip off on pricing. I ended up going to the Starbucks next door for a coffee instead. I have to say, I was surprised at how small the brunch menu was and how pricey these items were. I ordered the hangover tots because I wanted to try the SPAM in it. A few of us ordered drinks, and enjoyed conversing outside at our table. The food finally came and almost all of the meals were incorrect. One person in our party can't have gluten, and asked for her meal without ketchup or avocado and had to send hers back because it came with both on it. I asked for mine without ketchup and saw it was served on top. My scrambled egg on the hangover tots was like rubber. The ketchup, aioli and other toppings didn't mix well at all. I was expecting a ground sausage, but was surprised it was sliced. On top of that, no SPAM. I was going to ask for a replacement, but didn't want to wait for it as the original meals took some time to arrive and I had to be somewhere soon. Honestly glad I didn't wait, because the replacement meal we ordered for our gluten free friend didn't arrive until after the checks were paid. The hangover tots meal really was nothing to rave about for $15. Our appetizers never came. The waitress for our table barely checked on us. We had to kindly ask another waitress for the check because we hadn't seen ours in about 10-15 minutes and she said she would just be taking over our table for the rest of our meal.  It just seemed like they weren't on top of their game. When we got the check, we were charged for a bottomless mimosa (which someone did order) AND a bottle of champagne. We asked to have that fixed, and she removed the bottomless mimosa order, but kept the champagne bottle on (which was more expensive, mind you). She had already charged my card for this, and I was so frustrated, so I didn't ask for a refund. The ONLY redeeming thing was that our friend said her gluten free meal, that came out as we were getting up to leave, was delicious. So, brownie points I guess? It's also kind of terrible that a 20% tip was automatically added. Had the service been top notch, this would have been deserved...but it's like they could have cared less about us because they knew it was going to be added anyhow. Looking forward to never coming back and making sure none of my friends do if they're in Philly."
    },
    {
        "id": 108,
        "text": "I came here for brunch with my friends and it was a blast. The mimosa tower is a MUST if you're going with a group!!! The restaurant had a great, hip interior and seating was great. Plenty of gender neutral bathrooms for customers. I got the steak and eggs (delish), but honestly wish they had more options for a sweet brunch dish."
    },
    {
        "id": 109,
        "text": "Amazing Tacos.  The Bulgogi cheesesteak taco and sliders are fantastic!!  Good shrimp.  Service is on point.  Very happy we came and will definitely be back soon."
    },
    {
        "id": 110,
        "text": "AMAZING service QUALITY food and cocktails!!! So happy they are able to provide an outdoor dining experience during COVID- This is my new go-to spot :)"
    }
]