[
    {
        "id": 1,
        "text": "My friend and I came here around 2pm on a Monday. It happened by default, as most of the restaurants on Main Street were closed. We sat ourselves down at the bar and got to drinking. After a few drinks, I ordered the pulled pork tacos and my friend had a burrito. Not bad, not stellar. Just a standard very place to drink and eat Mexican food. It's got a very college feel even in the middle of the day, so keep that in mind if that's not your thing."
    },
    {
        "id": 2,
        "text": "Full disclosure: I have no experience with their food (other than the free chips which, meh). The special place Cactus holds in my heart is for one thing: Margarita Mondays.\n\nI walked in to Cactus this Monday with a friend from work, and the bartender had a pitcher of 'ritas going before we even sat down. Point to Cactus: The staff is on top of stuff for their regular customers.\n\nThe service can be a little slow at times, but once we get a table full of margarita pitchers life is beautiful. The 'ritas themselves aren't the most consistent (this week's were a little heavy on the juice) but for $10 I'm not complaining. And, to reply to one of the posts, they definitely don't skimp on the tequila. In fact, the bartender measures out the liquor for ever pitcher. Margaritas are pretty sweet so you can't taste it too much, and I'm sure it isn't quite as much as you'd get in a non-special, but believe me it's there.\n\nMy most serious gripe, actually, is the music. Don't know who puts the mixes on, but I protest. They actually played 'Closing Time' the other night - at 10:00, when people were still coming in. Way to send the wrong message.\n\nIt's not the best place around by any stretch, but if you ever need to unwind after a long Monday, you'll find me at Cactus."
    },
    {
        "id": 3,
        "text": "I got Cactus delivered. The salsa tastes like there's BBQ sauce in it, which to me is gross. The queso fundido was paste like and was hard to reheat. The chorizo reminded me of a regular pork breakfast sausage.  Portions were generous being delivery. I should have checked reviews first ..."
    },
    {
        "id": 4,
        "text": "The drinks and the customer care are the only redeeming factor to this place. Not an authentic Mexican food- order chicken enchiladas without cheese or sourcream and the chicken was crunchy...like old rubber crunchy! Sent it back got beef tacos much better but the beans were super dry. The group said the beef was good. Probs wouldn't come back."
    },
    {
        "id": 5,
        "text": "I Came here a few times for drinks and food. This place plays music at night so that's a plus for me. I was very impressed by their salsa, I'm pretty picky about my salsa, comes in right spicy level where you have to keep eating otherwise your tongue will burn.  \nTheir outside seating is very enjoyable during the summer/fall/spring seasons."
    },
    {
        "id": 6,
        "text": "Absolutely terrible in every aspect.  My fiancé and I came here on a Saturday at 5:45.  All of the waitstaff were standing around the back of the restaurant looking at us awkwardly.  Eventually the bartender greeted us from behind the bar and pointed to the table where we will be seated.  I ordered \"The Cactus\" margarita, and it was salt lime juice and water.  Not a drop of tequila in it.  I'll give it to them that the salsa was good because of the added chipotle.  However, they have the audacity to charge $4 for an extra basket of stale chips.  Our food came out reasonably quick. My fiancé ordered the chicken fajitas and I ordered the 5-Alarm burrito.  Mine was dry as a bone, bland, and not spicey at all.  I'm reasonably sure that they got a frozen burrito from wava and heated it under a panini press.  My fiancée chicken was also dry and just over all bland.  Then came the waiting. We asked our waitress for the check and then she disappeared for 20 minutes.  I asked her again as she passed by our table, and still had to wait another 10 minutes.\n\nIt's a different story if they were the only show in town, but this is Main Street manayunk.  There is no reason for places like this to be taking up space if this is the quality and service they are offering."
    },
    {
        "id": 7,
        "text": "We came from center city because the corn/cheese mix they do with their nachos really goes unmatched. For the rest of the menu: fish tacos burnt to a visible crisp. Pitcher of margs more watery than margy. We left and went for drinks elsewhere. Wait staff was extremely available tho. 3 stars because of waitstaff. Won't travel back for food again."
    },
    {
        "id": 8,
        "text": "I don't often find myself in manayunk, but I was there for a friend's birthday. That being said I'm not too familiar with the rest of the Main Street scene. Cactus was... below average. The bar was set pretty low, but my expectations still weren't met unfortunately. The restaurant itself is very difficult when it comes to customizing orders (for example they have shredded chicken for burritos but can't put the shredded chicken in a quesadilla). I don't think they realize it's literally the same thing just in a different form. \n\nThe wait staff was over bearing in my opinion. Our waitress kept butting into Over conversation when she came by with remarks like \"did I just hear you say you don't like corn?\" Im all about being friendly but \"was I talking to you?\" Made us help her clean the table bc she had another party coming in very soon. All in all the vibe was weird probably won't be returning anytime soon"
    },
    {
        "id": 9,
        "text": "This was probably the worst service I've ever received. I came in tonight for a drink with friends. Our server was Elizabeth. She did not greet me as I came to the table, and she did not take my drink order, a different server who I caught just in time took my order. After I asked for another round, she actually told us she was \"heading out\" and made us close our tab. Very poor service and attitude. I will probably not be coming back."
    },
    {
        "id": 10,
        "text": "I come here often and everything is always great! I love the happy hour specials daily with cheap prices and great food and drink (and all the chips and salsa)! The staff is always great too!"
    },
    {
        "id": 11,
        "text": "We went on a Tuesday when tacos are $2 and margaritas are $5. Not bad right? I had three tacos (pork, chicken and beef) and one margarita. The pork taco was the best by far, but it was basically like a Taco Bell taco. The margarita was gross. Wayyyy too much sugar and not enough tequila. I know it was a \"deal\" but it was so bad that I couldn't even finish it. It's pretty hard to mess up a regular margarita but out of the four of us NONE of us liked our margaritas. We left the restaurant feeling like we should have spent the extra dollars and completely enjoy our meal.\n\nOn the bright side, our waitress was really nice and she had a great memory."
    },
    {
        "id": 12,
        "text": "Upon entering the restaurant I was looking forward to enjoying some good company, food and music but shortly after sitting down I slowly was let down. While I did enjoy the music I was first informed they were out of mint so I could not order a mojito, mind you this was around  6:30pm on a Friday night. What kind of Mexican establishment doesn't stay stocked with fresh mint, especially on one of the biggest drinking days of the week. I sadly had to settle for another cocktail. I then proceeded to order the chicken tacos which were a huge disappointment from looking at other dishes served. It was literally dry chicken, rice and cheese. Overall first time dining experience was a major let down."
    },
    {
        "id": 13,
        "text": "Literally the most HORRENDOUS service I have ever experienced in my life. The food is what you pay for. At 9-15 dollars a plate, you aren't going to get anything out of this world. I went there with a few friends for a quick bite, and they screwed up 4 out of 5 orders. Not to mention having to ask for the complementary chips, silverware, and side dishes about 10 times. Also, they brought all of our food out at separate times. The first person got his dish 15 minutes before the second. It was just mind boggling that this place is owned by The Bayou, which is one of my favorite stops in Manayunk. Bottom line is, if your going to spend your money for someone else to make you food, spend it elsewhere."
    },
    {
        "id": 14,
        "text": "First off... The menu says Caesar salad with croutons. A Caesar needs croutons. We had to ask for them after the salad was served to us. Some other girls at another table had the same problem. I thought perhaps it was a new chef or something but now seeing all these bad reviews, I'm not so sure. \n\nSecondly, they have this advertised deal on the board and the waiter told us all about 25¢ wings... The wings were ok, nothing special. But, here is the problem and we learned a lesson as we don't really look at bills for accuracy all the time. We had already had our card swiped and then I looked at the bill and thought it was pretty high for what we got. I saw that they had charged us 8.95 for the wings! I'd like to give them the benefit of the doubt that it was a simple mistake but something tells me this probably happens a lot. I'm glad I noticed. \n\nIt was nice to be able to sit out on the sidewalk and they will probably still thrive with all the drunk idiots that frequent this area at night."
    },
    {
        "id": 15,
        "text": "Went here for early dinner with 3 of my friends about a week ago. We asked for a table and the host immediately asked to see all of our ID's. Now, not all of us are 21, and none of us even were planning on drinking at all. Maybe this is standard for manyunk or something since it's a bit of a party area, but i've never had this happen to me anywhere. It was awkward and seemed like they didn't want us there( the place was basically empty at this time, btw). This kind of made me want to leave but I was hungry and like I said the place wasn't busy. Now, i'm not normally that crazy about Mexican, mainly because i'm a somewhat picky eater, but i'm trying to be more adventurous. We explained that we just wanted something to eat and they dropped it and seated us. We were given chips & salsa to start which were pretty good. They have different specials on different days of the week and the day we went was something like $6 quesadillas. So, I figured I'd try that. The quesadilla was probably the best I ever had! It was great and really flavorful. Our waitress was fine, not memorably great or bad. Not sure if I would come back here just to eat because of the awkward seating thing, but like I said the food was very good."
    },
    {
        "id": 16,
        "text": "Me and my boyfriend went there Saturday for my birthday just to try something new and it was ok. I believe it was the day of the festival so there was a lot of outside seating and they used disposable plates and cutlery. My appetizer was delicious. I had ordered the Texas Shrimp which consisted of 6shrimp in a spicy butter sauce that came with dipping bread. The shrimp could have been seasoned but the sauce with bread is delicious. I didn't enjoy my beef tacos . It was more of steal which tasted like vinegar . I'll give it another chance in a week or two. The service was great. Didn't receive salsa and chips however."
    },
    {
        "id": 17,
        "text": "Having grown up with awesome Mexican food in California I'm not a huge fan of tex-mex. We were in the neighborhood and I was craving a sangria so here we were. Great attentive service!! Nice table outside for people watching. Food was ok.\n\n I wasn't a big fan of my water downed sangria and was sad to see no fruit in the drink. Although at $3.50 a pop (it was 1/2 price sangria day) it worked for me. They had bottles of Negre Modelo (one of my fave beers with Mexican food) which was awesome. \n\nMy husband had the pulled pork enchiladas which were yummy. Not awesome, but definitely good, especially with the beer. I had the chicken salad which was ok. The flavors were overpowered by the onion and I couldn't really get a sense of the chicken salad. Chips were good, salsa was kind of bland. Great addition to the neighborhood and great place to grab a drink (skip the sangria). Ok for food."
    },
    {
        "id": 18,
        "text": "I shouldn't be too harsh since this place just opened a few days prior but the bar was understaffed with bartenders that were not familiar with the menu or drinks. The group I was with waited for 30 minutes for 2 margaritas! Trying to get a drink at the bar was pure mayhem not to mention the bartenders were constantly looking at the menu to see what was in the drink that was ordered or how much something cost. Oh yeah...one more thing, paying for a $4 beer with a $20 and getting change in all dollar bills...not so cool. I will say the food looked good but I didn't eat while I was there. I am a big fan of mexican so I'm sure I'll give this place a fair chance once it gets off its feet."
    },
    {
        "id": 19,
        "text": "Cactus is a great, casual tex-mex on Main Street in Manayunk. Nice beer selection, great as a restaurant or just for drinks at the bar."
    },
    {
        "id": 20,
        "text": "Went with friends last night for the first time. We all wanna get back there ASAP, such a fun night. Colleen, our server, was really great. Not only was she super genuine and nice, she took great care of us and our order.\n\nMargaritas tasted fresh, we got a few pitchers...gotta say Im pretty sure they were weak.\n\nPork soft tacos were very good, split them with a friend and totally wished I'd gotten my own.\n\nMy other friend got the five alarm burrito, he was disappointed it wasn't spicier. Don't worry he just drenched it in hot sauce- so no harm done.\n\nI'm a big fan of Mexican food. This is a great casual spot, gotta get back on a Monday for $10 pitchers."
    },
    {
        "id": 21,
        "text": "Food was alright, service was horrible. Still waiting for our check back 20 minutes after giving our waiter my card."
    },
    {
        "id": 22,
        "text": "Miserable.   Server was painfully slow.   We asked for a sugared rim,  got a salted one.   Chicken enchiladas were overdone and crunchy.   Salsa is too smokey.   \nDefinitely not coming back.   \nStill looking for a good Mexican restaurant."
    },
    {
        "id": 23,
        "text": "This was the worst Mexican food I ever had in my life. Taco Bell is more appealing. I knew from the chips and salsa that it wasn't going to be good and I should have left but didn't. Playing it safe, I ordered chicken quesadillas but they were awful. It seems like they use a mix of cheeses and it isn't good. Service was good and prices are reasonable but the food isn't edible."
    },
    {
        "id": 24,
        "text": "We LOVE this place!!!!! They always have great food and drink specials and it's always a good time!"
    },
    {
        "id": 25,
        "text": "I used to come here on Sundays for a delightful brunch with friends but I now refuse to. I've gone on other nights as well. It's just not good. The food is ok. The drinks are alright too. I used to love the sangria but on more recent visits, it's always seemed like something was missing. The wings are great, but not worth it when there are so many restaurants in the area. What really gives this place two stars is the lack of decent service. It's terrible! Every time I'm there it's terrible. Once I had a server make a mistake on my food and she said I'd have to pay for a new order. Why? I didn't mess up, you did! Her reasoning was that they aren't corporate so they can do what they want. Umm ok. I'm glad you don't care about your customers. I want to try it again. Maybe they've gotten better, but it's just so hard when, like I've already said, there are so many better restaurants nearby."
    },
    {
        "id": 26,
        "text": "I wish I could give zero stars, as many people before me have also suggested. The bartender on this particular Saturday was the most rude and incompetent human I've ever encountered. Three of us had to send drinks back because they weren't what we ordered. When I asked for a water, he made some sarcastic comment that made me feel extremely uncomfortable. What an unwelcoming environment. You guys suck."
    },
    {
        "id": 27,
        "text": "This place is terrible. The manager was yelling at its employees in the middle of the  establishment. The food was not fresh at all. The rice tasted like it was leftover from last night. Chicken was disgusting and dry. The breakfast buffet looked more pathetic than a complementary hotel breakfast. I will never eat here again and suggest you don't make the same poor choice as me."
    },
    {
        "id": 28,
        "text": "Update: I have eaten the food. Cactus gets another star for that!\n\nFirst off, the fajitas. The servings are HUGE and all the fixins come out sizzlingly hot. My only minor gripe was the way the lettuce, sour cream, etc came out all on one plate. It made putting the fajita together a little tougher if there was something on there you didn't want.\n\nBut the real gem, crazy as it seems, are the firecrackers. See, I love poppers. They're spicy, fried and filled with cheese which basically makes them meet three of my four major food groups (the other being chocolate, of course). But the firecrackers aren't the wimpy frozen things you get at any pizza place in town. Oh no, these are huge singe-your-mouth peppers filled with a wonderfully melty gooey blend of cheeses and fried to crisp perfection. They're messy, certainly unhealthy and burn even my mouth a bit, but they are by far the best cheese-filled pepper concoction I've found.\n\nFirecrackers = worth a whole new star.\n\n(Was tempted to write about the firecrackers without giving an extra star, though, just to reflect the irritation I feel with their frequent and lousy guest bartenders. I don't care how cute she is, if she can't pour my drink and take my money get her the hell out from behind the bar!)"
    },
    {
        "id": 29,
        "text": "This is the 2nd time I've gone to Cactus. The 1st time was underwhelming too, but we were willing to give it a 2nd chance because they offered make your own bloody mary's during brunch. Well, they apparently stopped doing that and the result was the worst bloody mary I've ever had. It literally tasted like it was water and horseradish. Couldn't taste any tomato or vodka; I didn't finish it. My gf's mimosas mediocre (according to her). Her huevos rancheros tasted plain, if not bad. My chorizo omelette was not good either. The chorizo was dry, the eggs tasted like a mix, and the cheese wasn't even melted. I don't like leaving bad reviews, but this place deserves it; don't waste your money. 2 stars because the server was great and it wasn't her fault the food and drinks weren't any good. Will not go back."
    },
    {
        "id": 30,
        "text": "My family and friends have been coming here for years. The staff is friendly and informative. Food is amazing. The burritos .... oh my .. 35 cent wings oh my.... daily specials oh my ...lol just come here and ask for Tony the bartender"
    },
    {
        "id": 31,
        "text": "The margs are good. We had a few appetizers- I wasn't a huge fan of their fundido- it seemed to have more of an italian sausage in it rather than chorizo,  the guac was slightly bland, the salsa was very good and their shrimp dish was good but seemed more Italian then Mexican. All in all it was a good experience."
    },
    {
        "id": 32,
        "text": "I have had a real mixed bag of experiences at Cactus. When I have come in with my roommates who are regulars, I receive kind, prompt service, and tasty drinks. I really enjoy the weekly specials, particularly the Margarita Mondays. The Cactus margarita has a touch of orange that adds just the right amount of juicy sweetness. \n\nOther times, I have had really bizarre and slow service. Recently I came in for an early lunch and the waitress pointedly asked for ID...at noon...on a weekday. Not that I am under 21, but sometimes I bring friends there that are underage and I don't understand why they need to be ID'd to enjoy a meal, especially before dinnertime. Not that the food there is exceptional. I enjoy the taquitos and the fajitas the same way I enjoy Qdoba, Chipotle, etc. Just generic Tex Mex fare. I would give Cactus 2 stars but some of the folks there are extremely nice and I do like to come in for drinks, just not dinner."
    },
    {
        "id": 33,
        "text": "What the actual f. I came from Houston, Texas. Looking to enjoy a nice margarita and some basic Mexican food. My expectations were not that high, obviously. But when I say worse margaritas ever... Honey, was there even tequila in it?  It was watered down and frothy. Food was tasteless. I'd rather eat Taco Bell. Everything was as though it came out of a can. Server was nice but oh no, the food and Ritas were hideous."
    },
    {
        "id": 34,
        "text": "Every time some other place has a wait, we give up and go here- never have a problem getting a table, and there's outside seating. Pricing isn't anything to rave about, but on Main Street it's hard to find a good deal. \nThe server was super friendly, and dogs are welcome on the patio. I had their chili, which was okay, and my fiance had the enchiladas, which he said were a little burnt. The chips and salsa were pretty solid. Inside has a bar and some entertainment stuff, with a specials board that includes drinks and cheap wings."
    },
    {
        "id": 35,
        "text": "The chips and salsa here are awesome - best salsa dip I have ever had. I wonder if they make it because it tastes so refreshing.  The Mexican pizza (with chicken) was OK.  When we came it was so busy that service was so bad.  But the food was good enough that I would come back again. Oh the nachos and cheese were good too. It's saucy cheese too, none of this slices of velveta melted on top where it hardens"
    },
    {
        "id": 36,
        "text": "Cactus has by far the best burritos in the city. Bartender Tony is the best.... Specials every day of the week...Oh yea don't forget about the tequila flights ...."
    },
    {
        "id": 37,
        "text": "My overall experience with Cactus was mostly okay. It's a great environment for catching up with friends over drinks for a couple of hours. To start, they give you an ample amount of chips and salsa. The salsa itself had a nice bite to it (I personally love spicier foods, so if spice isn't your thing, take it easy). For food, I ordered the Chorizo Pub Burger, which was outstanding. The chorizo patty was nice and crispy on the outside, with a nice juicy center. Our server was also very sweet and attentive. My only issue with this place was the bartender that was working. The ratio of margarita mix to tequila was very inconsistent, with a taste equivalent to overly sweetened lemonade with barely any alcohol. When we kindly requested the bartender add an additional shot (we even stated we were willing to pay extra if we had to), he gave us a sour attitude about it and proceeded to talk about us to his coworker. To me, that just shows poor customer service skills. Word of advice: if you're going to complain about customers, do it out of earshot next time. If there's a different bartender next time around, I might feel inclined to return because the food was decent."
    },
    {
        "id": 38,
        "text": "We thought we'd try the spot out since we've walked by often. Now kinda regretting it. Service was slow, food mediocre and on top we were charged for drinks we find have."
    },
    {
        "id": 39,
        "text": "This review is not coming from just one visit. This is on 3 separate occasions. Watered down drinks. Could make better at home. Food was not even mediocre at best & service sucked given we were the only ones there. Waiters spent more time talking to each other rather making sure if we were ok. Would not recommend even on a drunk night"
    },
    {
        "id": 40,
        "text": "When I went to use my free app offer that yelp gave me no one knew what to do. I eventually got some really horrible nachos and service. The only redeeming part of this place is when DJ Ronnie is upstairs."
    },
    {
        "id": 41,
        "text": "This place is great to go for Margaritas or if you're in the mood for Mexican food.  They have jalapeno poppers that are full sized jalapenos stuffed with multiple cheeses and fried.  They are different than any other popper I've ever had and so delicious.  The deals on Margaritas are spectacular and the chips and salsa they serve are just great!"
    },
    {
        "id": 42,
        "text": "Food is great! Serving size is pretty good. Beer is a bit pricey, but they have a good selection."
    },
    {
        "id": 43,
        "text": "Ate outside so can't speak to the experience in the restaurant.  However the food (fajitas) were tasty and the service was prompt.  Seems like a good place to chill."
    },
    {
        "id": 44,
        "text": "Awesome guacamole, the cactus nachos with sweet corn (we added chicken) is delich too! Great vibe, great service. We'll be back soon!"
    },
    {
        "id": 45,
        "text": "Recently had a great lunch here.\n\nI can only comment on the fare since it was a workday, but both my mom and I were pleased! We ordered the shrimp quesadilla and fish tacos. Enjoyed both dishes! There was plenty of shrimp on the quesadilla and they provide you with homemade salsa and several hot sauce options which I love. Those weren't homemade, but that's no biggie for me. I will definitely be back here again. Next time, I'd like to try their margaritas! They have a ton of different specials listed on the wall too. Wish I lived in walking distance. Seems like it would be a great happy hour spot."
    },
    {
        "id": 46,
        "text": "Been here a few times, and have always had a pretty awesome experience. Enjoyed the veggie options- mushroom quesadillas and tacos. I've always had a good experience and service here - sat at the bar once and had some amazing margaritas. Katie the bartender knows what she's doing! She was super attentive and friendly. I'll definitely be returning soon!"
    },
    {
        "id": 47,
        "text": "Not a great experience. Very mediocre Mexican food. Slow service but that was acceptable given the crowds of people trying to eat during the Food Truck street fair April 12th."
    },
    {
        "id": 48,
        "text": "Chips and gauc are great. Chips and salsa were great too... Not to spicy! Cool staff awesome atmosphere."
    },
    {
        "id": 49,
        "text": "The outdoor seating is ok.  Kinda stinks to have people walking through as you eat.  They could place tables better.\n\nThis place is perfect for snacking and getting some marghs.  We usually get chips and salsa and wings.  The selection of margh flavors are great.  Very refreshing.  They will do skinny margh for you if you ask."
    },
    {
        "id": 50,
        "text": "This is the only place on Main St I'll go to. Great food, great specials, strong drinks and the friendliest staff in Manayunk. I recommend it to everyone."
    },
    {
        "id": 51,
        "text": "I have always had great service , and great food. Tortilla chips and salsa are so tasty. $2 Taco Tuesdays and .25 cent wings Wednesdays cannot be beat."
    },
    {
        "id": 52,
        "text": "Not really one to write bad reviews but this place is not good at all. Our server was super nice though only plus. The salsa tastes like weird BBQ sauce, the chips tasted stale. And our tacos were pretty much inedible, Taco Bell would of been fresher for sure. Totally disappointing if your looking for Mexican  don't go here, every type of meat we got in our tacos (chicken, ground beef, pulled pork) tasted and looked old and weird."
    },
    {
        "id": 53,
        "text": "The service was great but the food was TERRIBLE. I had the driest chicken in my tacos and cant tell if the corn tortillas were either old or poorly defrosted, I'm not sure, but they were chewy in a bad way. I was really disappointed overall and don't care to revisit. At least we got free chips and salsa when we sat down."
    },
    {
        "id": 54,
        "text": "The restaurant is cute and cozy. I ordered the beef tacos. They were good, but nothing crazy about them. The rice tastes kind of strange to me. The tortillas were cold, like they didn't warm them up or make them in the restaurant. My friend ordered a burrito bowl, and the portion was small despite the waiter insisting it was a huge bowl. They do have some great drinks. I really like the prickly pear. I would go back for the drinks and the chips and salsa. Perhaps I will try something else on their menu since this place is always packed."
    },
    {
        "id": 55,
        "text": "First time coming to Cactus and we loved it! The bartender (Colleen?) was amazing, she went over all of the specials and really made it a great experience. The $4 well drinks $10 mixed drink pitcher's on Friday's are life changing, and the half-priced appetizers were great! The jalepeno poppers were way too spicy for us to even eat, which was disappointing, but the rest of the food was great (and cheap!). The nachos w/ pork and guac were our favorite."
    },
    {
        "id": 56,
        "text": "Stopped in for lunch today, and thought it was good. Unfortunately, the bartender was also the sole server, so things moved very slowly. We had to wait 15 min or so for our drinks, and then about the same to get our orders in. \n\nService aside, the food was pretty good. The salsa they give you with the chips is actually among the best salsa I've had in Philadelphia. We both had sandwiches -- pulled pork for Wife and chicken club wrap for me. Both were very tasty, and I would def eat here again. It also looks like they have good drink specials during the week.\n\nWould probably stop back in again."
    },
    {
        "id": 57,
        "text": "I'm not going to lie I was very surprised how good the food was here. I had steak fajitas and a margarita and wasn't disappointed the least. I enjoyed my meal and will definitely be back soon."
    },
    {
        "id": 58,
        "text": "So my girlfriend & I came in during the Manayunk \"Stroll the Street\" event. Cactus Only had 1 appetizer available for the $5 special & it was a cheese dish. What if I was lactose intolerant? Why isn't there a cheese free option for the special? Or why wasn't that clearly explained on the door, sign or via rude ass doorman. But fine we order & our food was less than ideal (how do you mess up your signature wings??). All waitresses seemed very scattered. They didn't take our order right away. Another waitress was cutting oranges on the bar counter with NO CUTTING BOARD & didn't wipe it off after she was finished. Then proceeded to dig in her ear; YUCK especially from a lady!!!\n\nI WONT be back. EVER.  #MrProTip"
    },
    {
        "id": 59,
        "text": "Walking in the door Leah was very helpful .Look only a few Mexican restaurants that give you free free chips and salsa. Apparently the morons in the Northeast can't figure this out but these guys got it. I mean you're not breaking the bank, it's a snack with a $10 Margarita pitcher... oh wait this was a random Monday afternoon. Bartenders were phenomenal. Our servers Colleen and Ryan did a a great job of taking care of us. Margarita's not too sweet salsa awesome. Perfect snack stop in my case 5 hours."
    },
    {
        "id": 60,
        "text": "Good local place for some above-average mexican food and drinks. Nothing to blow you away, but a tasty/cheap taco tuesday and other entrees are pretty solid as well. They host a $8 brunch buffet on Sunday. The bunch is good for the price and it's $2.50 bloody marys and mimosas. Bring your crew here for a good hangover breakfast at 1/3 the cost of the brewery brunch (although theirs is definitely better)."
    },
    {
        "id": 61,
        "text": "Not a bad place to go and hang out at in Manayunk. They have a stellar wing special on Thursday (35 cents/each) and the wings are pretty big and are definitely delicious. Drink specials aren't too shabby either, and they give you free chips and salsa when you go in!!!!"
    },
    {
        "id": 62,
        "text": "This place deserves your attention. Locally owned, full of craft beers (that are good), a LOT of food, beer, drink, margarita specials.  Food is good, good bang for your buck. This isn't a romper-room full of the kiddies like Mad River. \n\nLike the ambiance, love the tacos and salsa. Will be back!"
    },
    {
        "id": 63,
        "text": "The pitcher of sangria was delicious! We ordered the chips and guacamole and they were only ok. There was nothing special to them."
    },
    {
        "id": 64,
        "text": "This review is strictly for quizzo Thursdays.\n\n$.35 cent wings and $4 mega mugs with $3 refills starting at 9 pm - can't beat it. \n\nThe wings are pretty great, not too spicy but definitely a lot of flavor. Always a couple good drafts to pick from for the mega mugs. \n\nQuizzo literally never starts at 9 - more like 9:30 but it's a good time. Get there early to grab a table if you're with a group because it's a lot of high tops and bar seating. There's also an upstairs area.\n\nTony the owner is great and all the waitresses have always been really attentive and nice. I would definitely recommend for a solid weekend activity!"
    },
    {
        "id": 65,
        "text": "Absolutely horrible.  The chips were stale.  The food is overpriced and terrible.  The service was the worst I've ever experienced.  We were finishing our beers, and the server asked us to \"order something else\" if we wanted to continue to sit there...this is after paying $50 for a crappy meal.  I don't know who the server was the evening of 9/1 for the outside tables, but I would recommend a new staff."
    },
    {
        "id": 66,
        "text": "Yeah so, the service sucks and the cleanliness isn't in accordance to a few servsafe guidelines... (Reference the picture I posted)"
    },
    {
        "id": 67,
        "text": "Soooooo some people get so offended because they're not related to on a personal level. Tony is thee Coolest Guy I've ever met. Someone you can argue about sports with but then get advice from like an uncle. On top of great food?!?! What more can you ask for??? The salsa?? Omg you definitely know it's home made. Please ignore the rude reviews. This place is awesome!! I've been a regular for at least 4 years. Can't wait to come back. I'm always well taken care of..."
    },
    {
        "id": 68,
        "text": "Food is mediocre at best - somewhat tasteless.  What's worst is that the waiter is totally incompetent.  Would not recommend and will not return."
    },
    {
        "id": 69,
        "text": "My boyfriend and I were excited to try this mexican restaurant in Manayunk, however, we were HUGELY disappointed. Once we sat down we looked at the menu and wanted to leave but our waiter brought us stale chips and salsa so we thought we should stay. We went on a Sunday morning so I ordered coffee. The waiter said he had to make a pot which I should have taken as a bad sign. I guess its my fault for still ordering it and at a Mexican restaurant. Once I finally got it it pretty much tasted like tar even with excessive amounts of splenda and cream. So on to breakfast. I ordered the breakfast burrito which the waiter said was the best thing on the menu. It tasted like rotten eggs. There was no salsa or any other condiments to cover up the awful taste It's basically fake mexican and you should just drive a bit further to Northern Liberties and go to Dos Segundos if you want good mexican cuisine!"
    },
    {
        "id": 70,
        "text": "Was in town for business and stopped here for dinner on a Monday night. Monday happens to have a lot of specials including $10 margarita pitchers and $8 fajitas. The margaritas were awesome, fajitas were great, although didn't come out on a sizzling plate, which I was expecting. Service was very good, prices were reasonable and the food was tasy. I'd definitely go back or reccomend it to friends for a fun dinner out."
    },
    {
        "id": 71,
        "text": "Owner was tending the bar and although it was somewhat slow the owner honored his free app and bought a round on the house due to his slowness.  He's a good guy and you should definitely try the firecrackers because they are great but will mess you up!!! It's a challenge! Always a good time here!!"
    },
    {
        "id": 72,
        "text": "I wanted to eat here with with friends during the food festival but as we were politely asking to be seated.The( manager) told us \"he will decide who eat at his restaurant\" in very awful attitude.I mean, I was ready to drop some dollars looking at their margarita menu but with that attitude we left.Hopefully that manager have been replaced since then."
    },
    {
        "id": 73,
        "text": "While out with my fiancee and some friends at the bayou bar and grill the manager Tony told my fiancee that he \"doesn't deal with Puerto Ricans\" and that she should \"shut up if she wanted her drink\" because she informed him that a word on his menu was spelled incorrectly. When I approached him about it he told us to get out of the restaurant. While leaving the business we all witnessed him turn a African American couple away because they \"weren't serving anyone else\" but he then allowed a white male enter when the couple walked away. I've been here many times before with my coworkers and never had any issues but we will not be returning as long as he works there."
    },
    {
        "id": 74,
        "text": "Stopped by for an early dinner on a Thursday night, so the place wasn't that crowded. Their beer selection is great. The service, food, and management leave a lot to be desired.\n\nIn over two hours of sitting at our table, I was able to obtain exactly two beers. It took over ten minutes for our server to tell me that they were out of the first beer I ordered. After waiting over fifteen minutes for him to return with the second bottled beer I ordered, he asked me if I wanted another of my first beer because he forgot I had already asked for something different. After that, I waited another fifteen minutes for it, ten of which the beer was sitting on the end of the bar perhaps fifteen feet away. I probably would have tried five or six of their premium beers. Everyone else at the table had similar problems, and we never seemed to get any water.\n\nI am rarely displeased with Mexican food, but the quesadillas were the worst I've ever had. The garlic mashed potatoes and citrus chicken tasted the same somehow. The staff bringing things out from the kitchen had no idea which table's food they were carrying. We were constantly asked if we ordered whatever they happened to be carrying, and an enchilada meant for someone in my party ended up going to someone at the table next to us (who immediately started eating it). After waiting for another enchilada to be made, it came out covered in sour cream, when my friend had specifically asked for none. Even though he hates sour cream, he ate around it rather than waiting for a third attempt.\n\nWhen the bill came, I found that I was charged for the beer they were out of as well as the two I actually had. When I brought it to the server's attention he seemed to know exactly what I was going to say, which was at the least very sketchy. It took quite a long time to get it removed from the check, which our server told us the manager had to approve. The manager was sitting behind the bar on his phone, drinking a beer. He never came over to address any of the issues we had. Somehow a casual dinner ended up taking nearly two and a half hours, and the next time I'm in Manayunk I'll be headed elsewhere."
    },
    {
        "id": 75,
        "text": "Had to try this place out since Tony C moved from Bayou over to here.  Since I'm a fan of the bayou then Cactus had to be great too.\n\nThere's food and drink specials every night.  We got a pitcher of margarita for $10, it was delicious and was plenty for 2 people.  The food was really good and I really have to go back for the lobster fajitas.  They're $8.95 on mondays!!! HELLO!!"
    },
    {
        "id": 76,
        "text": "Amazing service and can not be taco Tuesday. Great ownership and solid food. awesome margaritas."
    },
    {
        "id": 77,
        "text": "For what it's worth, we didn't eat here. We just went for drinks. It was my sister's 21st so we were also there late.\n\nWe actually really struggled to find places to get drinks since it was the night *before* a big drinking night. Thankfully (and why I am giving five stars), they basically strayed open for us. We asked when we came in, how long they'd be open. They said another 30 minutes or so, but when 30 minutes came, we started to get ready to go and the main bar tender told us we could stick around and order more drinks if we didn't mind them packing up some of the stuff around. We were really grateful since nothing else that was still open appealed to us. We ended up staying until 2:00 when, by law, they had to stop serving.\n\nWe chatted a bunch with the bar tender and he was great. He had helpful suggestions and a great attitude.\n\nTheir food looked good for future reference. So next time I am in Philly and in the area, I'd head back there. Good service is always appreciated."
    },
    {
        "id": 78,
        "text": "Terrible Margaritas, Spotty Service and Mediocre food just about sums up our experience at Cactus. The guacamole was the only thing that salvaged this place to 3 stars. I ordered the fajitas and got 4 small pieces of chicken (seriously, 4! I managed to make one fajita). Given how overpriced everything was, we certainly won't be returning anytime soon...."
    },
    {
        "id": 79,
        "text": "Food was okay. I loved the chips before hand more than my nachos I had for my meal. Service was good tho. It took a long time for our food to come but I'm not too upset because it is a bar. My friend loved her food and her margarita."
    },
    {
        "id": 80,
        "text": "Great place. I only went in here for drinks, which were very reasonably priced. The owner overheard my friend and I say that we wanted chips and salsa (it was late and food was no longer being served) and he brought chips and salsa over to us. I am frequently in New Mexico so I know good salsa when I taste some and this salsa was fantastic! I am giving four stars because I didn't get any food besides chips and salsa but everyone that worked there was super friendly and I will definitely be back."
    },
    {
        "id": 81,
        "text": "Not the best Mexican food around but certainly not the worst.  Good service, good prices and options for people looking to eat healthy!"
    },
    {
        "id": 82,
        "text": "Went a couple friends to get some margaritas and dinner. The margaritas were not good (tasted like straight mix) The \"specialty\" margaritas do not come with a salted or sugar rim, and you cannot request it. Advertised on the menu as mixed with Jose Cuervo- id be willing to bet it really isn't Cuervo and if it is they put so little in it you would never guess. The food is not terrible but it not worth anywhere near what they charge. I ordered $9.00 quesadillas that we're probably only worth $5-$6. And there was only a pinch of pico de gallo served with them. One of my friends ordered the nachos and cheese. There was almost more cheese on the plate than chips. That was $6. The service was not good. Before we were able to order out drinks, the hostess had to come check all of our IDs. The waitress was not able to do this. I guess the hostess was a human ID scanner or took special ID checking classes because she didn't have a handheld machine with her. I won't go back."
    },
    {
        "id": 83,
        "text": "Cactus is my favorite Mexican restaurant in the area, always delicious food and hear service! I highly recommend their shrimp burrito and loaded burritos (I usually alternate between those two choices). Their bar had a great selection of tequila as well\nAs non-tequila options. I just recently\nTried the brunch buffet on a Saturday and was pleased with the spread  but wish they had more Mexican breakfast options. \n\nI had a private party for my birthday in the upstairs area and it was fantastic! I can not say enough about how great the waitress was who served us and for $25 a person we had open bar, a Dj, the whole area to ourselves, food and a private waitress to serve is drinks! My friends are still raving about what a great party and great deal this was and I highly recommend cactus for a birthday party!"
    },
    {
        "id": 84,
        "text": "I've been to Cactus before but was hugely disappointed with my experience last night.  \n\nMy friends and I ordered a pitcher of strawberry margaritas and they were good!  We were going to order sangria next but they didn't have enough for a pitcher and we were told it doesn't come in pitchers (we did it before so we were confused as to why).  Our next pitcher was the mango margarita and it was horrible!  I honestly didn't taste any mango and thought they were a bit tart.\n\nThe chips and salsa were good but we never got a refill on the chips.  We ordered guac as well and that was very tasty.\n\nI ordered beef tacos.  Not impressed at all.  The beef didn't taste right and I swore I bit down on something hard so I stopped eating the tacos.  I tried to eat the shell but they weren't even great.  The rice on my plate was dry and not seasoned.  Luckily my sister had sour cream she didn't want so I used that to try and make the meal ok.\n\nWe also ordered a side of beans and never received them.\n\nThe place was quiet for a Saturday night and I know why!  If I do go back for food, I'll be sticking with the chips and guac.  And eating before hand.\n\nAnd like I said, I've been here before so I am so disappointed with this place and lack of pride they have."
    },
    {
        "id": 85,
        "text": "I am glad, I didn't dine in this restaurant. After a meal on Manayunk, I just wanted to get a drink with my friend. I should have known, when the tables were empty. My friend got a Mojito and I got a Mexican coffee. Bartender actually had no clue, how to make it. And when I got it, it was tasteless.\n\nWhen I started looking around, I realized how lousy was the service. Expect some rude service. And I never had a whiff of the good aroma, which comes from a Tex-Mex restaurant. My least choice to dine around in the area."
    },
    {
        "id": 86,
        "text": "The beer selection is great, maybe the best in the manayunk area. Prices are pretty good as well. Food is okay. I wasn't a big fan of their brunch buffet when I went. The mexican style food I've had there is good, but not great. The most recent time I was there I had an order of their wings and they were fantastic. If I'm looking for a place to bring friends for a few beers, this is one of my go-to spots because of the extensive beer menu."
    },
    {
        "id": 87,
        "text": "Came here back in October. We were originally seated in the front, but there was a loud bar crowd and my friend wanted to be moved. We were relocated to the back facing the bathrooms (I would've preferred the bar noise over toilet flushing but that's no one's fault). I would recommend the Baja tuna, it was pretty good. Chips that came with the guac were sort of stale and weird tasting. It was also crazy cold, I kept my coat on the whole time. There was also large man working the back computer. I'm not sure if he was the owner or a manager, but he was so loud and goofy that I thought he was drunk patron. He kept shouting around at people at the bar or staff; our waitress seemed really embarrassed. We thought it was kind of strange, especially since it looked like he was in a position of authority. The same thing happened with someone at the bar yelling across to a neighboring table. It was a mess. I don't get what the deal was... it was kind of like a zoo..."
    },
    {
        "id": 88,
        "text": "Come here for drinks only, service is great, price is fair and drinks are good. \nAs for the good, go somewhere else. The rice is way too dry. I ordered fish tacos and it was fried fish that was overcooked and mostly dried up. My friend ordered beef with rice and that was a horrible experience as well. I do love their salsa and chips tho, the salsa had the perfect amount of spice, the kind where you need to keep eating so you don't feel the spicy taste."
    },
    {
        "id": 89,
        "text": "Solid place, tucked away on main street.  They have southwestern style food which is pretty solid and a good beer selection.  Definitely need to take advantage of their specials, my favorite is Margarita Mondays which offers $10 pitchers and comes with free chips and salsa.  When the weather's nice there's outdoor seating.  Defintiely worth checking out."
    },
    {
        "id": 90,
        "text": "Went here with a group of 9 people on a Saturday night for dinner and sat upstairs.  The food was very good as was the service, particularly for a group of our size.  No complaints here.  I will definitely return if I'm craving some Mexican food."
    },
    {
        "id": 91,
        "text": "Lots of great beers, and good margaritas. The food is good, and you always get chips and salsa to start. Some staff is great - Molly is always very friendly and helpful. Some staff not so much. Overall, it's a good place to stop for some drinks and a quick meal."
    },
    {
        "id": 92,
        "text": "I'm not a connoisseur of Mexican food by any means, but to me, the food at Cactus was exceptional.  The guacamole left something to be desired, but other than that, I enjoyed every last bite of my steak fajitas and the gargantuan nacho appetizer my friends and I ordered.\n\nThe reason I only gave this place a three out of five star rating is because of the quality of the drinks.  One thing I AM a connoisseur of is Long Island Iced Tea's.  And quite frankly, their was absolutely HORRIBLE!  The margaritas were okay... but if you ask me, drink wise... stick to the beers when you are here.  They have quite a selection."
    },
    {
        "id": 93,
        "text": "Very average- I have given this place a second chance the other weekend and that is the last it gets. The nachos looked so good based on the menu description but when they came, it was luke warm with tons of chunky non-melted cheese with corn. It seemed like they poured a can of creamed corn with cheese all over the nachos. The steak fajitas were a huge disappointment- the steak was over marinated and there was hardly any steak but tons of onions and peppers. Not a fan and wouldn't go back."
    },
    {
        "id": 94,
        "text": "This review is not based off of my service and atmosphere, it is based off the food ONLY. Our waiter was great and it's not the waitstaff's fault if the food sucks.\n\nFirst of all the Margaritas are what everyone is saying- Mix lime juice and salt. I couldn't taste any alcohol whatsoever, and barely got a buzz off an entire pitcher. I would say if they made their drinks stronger the atmosphere is nice and it would be a great place to come on a Saturday night with friends, but I can go elsewhere for a stronger drink!\n\nI ordered the cheese enchiladas, they come with rice and beans. For $13 I expected fresh and quality food. Instead I got what looked like it came straight from the mircowave to my table. A greasy-oily slop of cheese over some stale tasting sauce and hard tortilla underneath it. The beans were crisp and splitting open (definitely mircowaved) and the taste overall was stale, mircowaved and greasy. The point of mexican food is the freshness and this was definitely not fresh. I sent it back after two bites and did not order anything else. \n\nMy boyfriend ordered a veggie burrito and it was dripping with water from the old mushrooms that were inside. But I have to say, the presentation of the burrito looked nice it was just the taste of it that really did not settle. He was so hungry he ate it anyways.\n\nI would say for the people who are running this place, make sure your kitchen is not reheating old and stale food because customers can tell the difference. The quality of the food and your business would strengthen so much if you had fresh ingredients and not just slop on a plate."
    },
    {
        "id": 95,
        "text": "I am giving 2 stars just for the Guacamole.. I ordered the chicken quesadilla and I've had better from Wawa which is pretty bad. I had maybe 3 little bites of chicken, the rest cheese and tortilla. I didn't get salsa or sour cream on the side. It was the saddest quesadilla I ever did see. Also our food was completely cold when we got it, but we ordered from grub hub so I'm not sure who is to blame for that."
    },
    {
        "id": 96,
        "text": "It's really hard to believe a restaurant with a storefront on Main Street Manayunk could be this bad. The first time I came here I ordered enchiladas and a margarita. The enchiladas were flavorless and the margarita was way too sour and super watered down. The only reason I came back was because my boyfriend wanted to try it out. I made the mistake of ordering a margarita again - I am now sure they use a really cheap margarita mix instead of fresh ingredients - and the fish tacos. The fish tacos were absolutely despicable. Having worked in restaurants for years, I actually couldn't believe a chef would allow a dish to come out of the kitchen looking like this. The fish was fried to a crisp - so crispy I couldn't even chew it, and coated in cheddar cheese with no other toppings. No pico, no cabbage, just awful. I sent it back and made dinner at home. This place is worthless. If you actually want REAL Mexican food on Main Street, go to Taqueria Feliz - it's excellent."
    },
    {
        "id": 97,
        "text": "What a birthday I had! I enjoyed quite the night out when I celebrated my 30th birthday back in May This was the 1st bar on a night of partying! WE found great parking right out front. the drinks were excellent, but tequila over ice can't be wrong. The bartender was seasoned he handled a crowd of drunken college kids just fine. There was a party in the back (someone gave me a bouquet of flowers, to which I gave to the next birthday girl I met). The food was slamming, i don't know why we didn't just stay there all night but my friends wanted to explore Manayunk. I mean with that many bars near by you have plenty of choices. This one was top notch. Like i said the bartender made a mean skinny marg for me, so i didn't need to drink much. The complimentary salsa and chips was delicious. i found myself scraping the bottom of the little cup, I think they smoke the tomato or something! It was kind of a slow night so the service was swift. i don't think we spent any more time here than any place else. Its a nice clean bar in the heart of the city. I don't have 1 complaint\nSo you may say why not give them 5 stars, I legit can't remember most of the night!!!!! Just the salsa and the bartender lol."
    },
    {
        "id": 98,
        "text": "Go there to drink but don't expect anything of the food.  Nothing on the menu resembles anything close to Mexican cuisine.  I'm always surprised when it's crowded, went once and won't go back."
    },
    {
        "id": 99,
        "text": "Stopped in cause my throats was dry. They have daily specials for drinks and food. It's a small\nBar but there are a few tables. The drinks here were reasonably priced but the glasses were all warm. Not a bad spot for a drink"
    },
    {
        "id": 100,
        "text": "The cactus! My boyfriend an I have been coming for for about 5 years now and absolutely love this place. \n\nAs far as their food goes-  they have great food specials, from 35 cent wings to half off appetizers. I have to say, their wings are some of the best I've ever had. It's very unexpected, coming from a Mexican restaurant. However, they use a sweet and spicy mesquite barbecue sauce that is second to none. Very good, and their wings are also large, juicy, and not at all overcooked. Also, their nachos are excellent. This is coming from a girl who orders nachos basically everywhere that serves them. I would have to say the \"cactus nachos with chicken added\" are the best in Philadelphia. Their cheese sauce is a blend of cheeses and Mexican corn- very delicious. As for the rest of their food, I have had their chicken fajitas which were also very good. I usually just come for the wings and nachos because they are so great. \n\nIn terms of their drinks, I'm a big margarita girl. When I first started going here they had the best margaritas. When one of the main bartenders left, the margaritas seemed to go down hill and the recipe changed. However, that same bartender returned a few months ago and I could see she fixed the recipe back to what it was before. I saw a previous review that described their margaritas as tasting like sprite or soda water.  To be honest, 6 months ago I would have agreed. However, once she returned to cactus the margaritas taste much much better, like they used to be. \n\nAs for their service, the service is quick. I'm often surprised by how quickly I receive my food and drinks. The owner is especially helpful. He is always running food and drink orders or bartending when large crowds come in. With that said, he always comes around and asks about our experience and truly cares about whether we've had an enjoyable time. Over the years, we've gotten to know many of the bartenders and always have a good experience when we get to see them."
    },
    {
        "id": 101,
        "text": "Wow, I'm really shocked at how low people have rated this place.  I think it's great!  \n\nThis is my first stop on any Main Street voyage that involves booze.  My roommates have dubbed Cactus the spot for \"one quick drink\".  We like the atmosphere.  It's not overly crowded and the staff are really nice.  While the place itself might be narrow, it's not a huge deal.  There are usually plenty of places to sit.  The bartenders do a great job as well!  And most of all, we LOVE THEIR MARGARITAS!!!  I hated 'ritas until I had one here.  We usually get a pitcher because nobody wants just one glass. \n\nTrue, I've a stale tortilla once or twice (hence the loss of a star) but the salsa is good and the food is pretty consistent."
    },
    {
        "id": 102,
        "text": "there is a charge for tap water!!  if you want water, you have to buy a small bottle for $2.!!  also they add and 18% tip to the bill even for 2 people.  food was so-so.  ran out of chips so no chips with the guacomole,  and no salsa with entrees unless asked.  very disappointing."
    },
    {
        "id": 103,
        "text": "I have gone here a couple times for brunch. The food is bland but the price is right: $8.00 for an all-you-can-eat breakfast buffet. The food needs seasoning but again:  8 bucks. Can't beat it, and you don't have to wait for your food! My real issue is the wait staff, unfortunately. LOUD and shouting to each other about stuff we don't want to all know: how drunk you got recently, how much you dread turning 30, how you only plan to work there another year and then get a \"big girl\" job, how you don't consider bloody mary's to be an alcoholic beverage...  The place was nearly empty both times I was there for brunch and witnessed this, so it's loud enough that you can barely carry on a normal conversation at your table. It's not like you WANT to listen to these girls talk, but you HAVE to. It's a shame. Good music is playing. But you can barely hear it over the bartender and server's banter."
    },
    {
        "id": 104,
        "text": "We went on a Saturday night, so it was busy, which was expected. It was just two of us and we were in a little corner and were seated really tightly. The food was good, but for the price you get a really small portion, which is not great for mexican food - I always say the more the merrier! Strawberry margarita was great, but I've had just as good tasting margs for a lower price. \n\nI think if I had gone on a less busy night and was a little more comfortable, I would have enjoyed myself a bit more. Also, if I ever go back I'll make sure I'm willing to spend a good amount of money so I get a bit more food."
    },
    {
        "id": 105,
        "text": "Never met a margarita I didn't like (or at least could tolerate) until our trip here today. The menu describes a delicious recipe -- tequila, triple sec, and fresh lime juice. Sounds great! I'm diabetic so I inquired if they add simple syrup to it and if they did could they make it without. Our waitress said she'd go ask. She comes back to tell us the bartender can substitute it with Sprite or Club Soda. I said, no thanks, just make it with the ingredients listed -- tequila, triple sec, and fresh lime juice. She looked at me like I had 7 heads. Being with a group of 4, I relented because, it's Easter and it was probably her first day as a waitress. Well, needless to say, what came to the table was so disgusting I couldn't drink it. The others at the table agreed but drank what we called lemonade since there also was no tequila in it. Rough. The food was ok. Portions for the fajitas and fajitas salad were weak. Beef and chicken enchiladas were ok. Overall, never again. I'll  stay with Loco Pez, Hefe, Sancho Pistola, Adobe Cafe, anywhere that serves quality food and drinks, and even Chipotle before I go back to Cactus."
    },
    {
        "id": 106,
        "text": "Went here the other night for dinner. Our appetizer came out first with one of the entrees. The other entree came out about five minutes later. Horrible service. We had to wait 20 minutes for each margarita and ended up being charged for a round we didn't order. Food was decent but the way it came out forced us to rush our experience. Some waiter also ended up screaming, cursing and quitting in front of the entire restaurant. Needless to say we won't be going back here any time soon."
    },
    {
        "id": 107,
        "text": "After a day of other deliciousness, namely Devil's Den, my best friend and I ended up here to warm ourselves a little before we trekked home. We shared their sampler. $16 for a huge pile of chips, 3 jalapeno poppers and 4 sliced up taquitos. Seriously, folks? \n\nThe employees were all having a pow-wow at the bar on Saturday night. Good thing we weren't really looking to eat a meal or we'd be mighty upset. \n\nSalsa roja and chips were flavorful and fresh. Guacamole hit the spot. Taquitos were blah and doughy."
    },
    {
        "id": 108,
        "text": "Food is subpar at best. Service was slow but courteous. Don't try to use the Yelp coupon because they have 0 idea what it is and will tell you at first it requires you to buy an appetizer first and then get a free one -- at which time more employees will come to see said free coupon and give incredulous looks. Eventually you'll get a free appetizer but it will take probably 20 minutes and you'll be limited in what you get. Too many good noms in manyunk to stop at this place. Also the bathrooms are kind of gross."
    },
    {
        "id": 109,
        "text": "Cactus Restaurant is a bar/restaurant located in a walkable bustling neighborhood with lots of revitalization in the works.  We enjoyed our visit with cocktails and shared appetizers.  Staff was friendly but a bit disorganized.  There was nothing bad about our visit but nothing was outstanding.  I would return and give them another try.  They seemed to have a lot of special activities and drink specials."
    },
    {
        "id": 110,
        "text": "I don't really care to be suffocated by a packed house of college-aged twenty somethings, so my boyfriend and I stick to this place on Monday nights when we don't feel like spending money on a big fancy dinner and we have nothing in the house to whip up. \n\nTheir staff on Mondays is always attentive and pleasant. Their margaritas are pretty darn tasty (I just try to forget I am drinking tons of well tequila) and their key ingredient is the o.j. they use...a healthy splash always gives a marg good taste.\n\nTheir complimentary salsa and chips is a nice bonus, although I end up snacking on it because on my buzz, not because I am particularly fond of the flavor - it's heavy on the garlic. \n\nTwice I've had their shrimp burrito - a cream sauce can seriously make anything taste good. Their wings (only had them as their special) are actually pretty darn tasty. One of the better wing deals/taste in this area in my opinion.\n\nAll is all, just go to enjoy a pitcher of margaritas, sit at the bar and watch the Phils. Nothing fancy...but sometimes that's all you need."
    },
    {
        "id": 111,
        "text": "Love coming here on a Wednesday night! The food is always good and the service is great."
    },
    {
        "id": 112,
        "text": "Well I went back here this past weekend to give it a second try. . .\n\nMUCH BETTER. Serivce was A++, the waitress was very attentive and kept our beer and drinks flowing. They give you complimentary chips which they kept re-filling for us, always a plus. We started with guacamole which was a decent size portion and a pitcher of sangria. (Buy the drinks by the glass--its cheaper then a pitcher that gets you only about 3 drinks)\n\nI ordered the chicken fajita salad which was very fresh and the chicken was juicy. The others that were with me had quesadillas which were huge and very tasty. We couldn't finish all our food because there was too much!\n\nAll in all a much better experience then when it first opened."
    },
    {
        "id": 113,
        "text": "Terribly prepared faux mexican. I would have preferred Taco Bell. Maybe they're better not on Race Day, but I am hesitant to even bother trying again."
    },
    {
        "id": 114,
        "text": "This place has great food, good for happy hour, great margaritas and lots of fun at night."
    },
    {
        "id": 115,
        "text": "Why does one of my favorite bars on Main Street have so few stars?  I'm here almost every Sunday after my rec softball games.  Ask for the controllers for Texas Hold 'Em at the bar, grab a margarita, order their ginormous (bigger than Chipotle) burrito, and you are set for a good time.  I am also always impressed by their extensive beer list.  Not bad for a faux mex place!  Oh, Cactus, I am truly a fan!"
    },
    {
        "id": 116,
        "text": "Honestly, this place is just okay. I've come here a few times for the brunch buffet and the bloody mary special, but never have I been wow-ed. The bloody mary bar is great, but getting another round takes an incredibly long time (seriously where were the servers?!). The three times I've been here for brunch, there were no more than three other people in at the same time, and I hate to say it, but I can totally see why. Even having tried brunch menu items aside from the buffet, I think everything is average. The food does its purpose (fill me up), but I expect a bit more from a place on Main Street. Perhaps I should come in for another meal, but I don't ever make the trek from West Philly to Manayunk, and I don't see this place as my reason to travel."
    },
    {
        "id": 117,
        "text": "Horrible service. Sat outside for a beer and it took multiple attempts to get our check even as two servers stood near us and made eye contact several times. I don't plan on going back."
    },
    {
        "id": 118,
        "text": "Love this place on Mondays....$10 pitchers of margaritas! Definitely delicious and worth the money."
    },
    {
        "id": 119,
        "text": "Stopped in for a snack-big mistake.  The chips where chewy. The queso was chunky and tasted like a powdered cheese mix. The Bloody Mary tasted like shrimp marinara. The service was sub-par. Don't think I'll be going back to experience the remaining menu choices."
    },
    {
        "id": 120,
        "text": "I've been here a handful of times throughout my time here in Manayunk thus far. Aside from a decent brunch, not really anything to write home about. When talking about Mexican options in Manayunk, I usually describe it as the following - if you want GOOD Mexican, go to Taqueria Feliz. If you want BAR Mexican, go to Cactus. Bar Mexican I think is a pretty good description.\n\nThe times I've been here, it's never been outwardly horrible, but never really good either. Went here last night with some friends. The place was not even half full and we were sat in the back of the first floor. Which that's not a big deal at all, but it was no excuse for our server to be MIA through much of our meal. We were right next to the computer station and even when we were trying to get her attention for the check when she was standing RIGHT THERE, she would ignore us and run off. \n\nThe margaritas are a ripoff. We all realized we were ordering the same margarita type so we were like let's just get a pitcher. We asked how many drinks you got out of a pitcher and she told us 4-5. How many did we actually get? 3. We got 3 margaritas for the 3 of us. $28 pitcher. I'm sure you can do the math and realize that is a few bucks more per margarita than if we had just ordered them individually. \n\nThe food is alright. I mean, you by no means go here for a killer meal. You go here if you want cheap decent Mexican-like food. Their specials are pretty good - we all did the $6 quesadilla. I had the steak and it was good. Not amazing, but good. \n\nThey do have a lengthy tequila menu so if tequila is your thing, this may be a good stop. But don't waste your $$ on the pitchers of margaritas. I mean, I don't mind paying top dollar for a GOOD margarita but like other reviews have stated, their margs are all mix.\n\nWill I be back? Sure, if I'm with people that want to go. But I don't go out of my way to eat here."
    },
    {
        "id": 121,
        "text": "After Flat Rock (see previous review) cancelled a private party 48 hours before the event, Cactus came to the rescue!  Michael (daytime manager and bartender extraordinaire!) and Tony hooked me up last minute with the best deal in town and no one could tell the party wasn't planned weeks in advance!  We had about 40 people in the upstairs area of the bar with a private bartender and an open bar which included a selection of craft beers.  They put out appetizers including their famous wings and had a DJ spinning great music, you would think I paid a fortune for such a great atmosphere, but it was actually cheaper per person than the deal stupid Flat Rock was offering!  The service was exceptional and everyone had a great time.  \n\nIn my other experiences at Cactus, the food is great.  The Cactus Nachos with pulled pork are so delicious and a total guilty pleasure.  On the lighter side, I almost always order the fajita salad with chicken.  The sangria is also wonderful and they have a great selection of Tequila for every price range.  \n\nIf you are looking for great tex-mex food and a laid back and friendly atmosphere, visit Cactus, you won't be disappointed!"
    },
    {
        "id": 122,
        "text": "Great specials in Margarita Monday and Taco Tuesdays, but the food is not the best and the service was all reactive... requiring some kind of signal to get their attention.  Nice atmosphere with some outdoor seating which can be hard to find on Main St."
    },
    {
        "id": 123,
        "text": "For starters, I really believe if you give a one star it is because you would NEVER return to the place. If there was lots of changes, I would give it another shot. Unfortunately as far as being a Mexican food restaurant/bar, they failed for me. Starting with their chips and salsa(no bueno), I really value servers input on food especially if they have drinks available to pair. The Margarita was very sweet with very little alcohol(not a big drinker btw), when I asked what was good at this Mexican restaurant I was told, \"our pulled pork.\" Umm...so I rolled with the punches and followed my servers recommendation and ordered a pulled pork burrito with an additional $2 for extras(what I thought was guacamole, lettuce, etc) it was just a burrito with below average pulled pork. It was also covered in cheese(which who doesn't love cheese) but the cheese wasn't very appetizing. I also enjoy nice presentation and as you can see, my burrito wasn't even centered on the plate. This place is on a very busy street so I really hope I was just there on a bad night. Cheers"
    },
    {
        "id": 124,
        "text": "Horrible. Don't bother. We came for taco Tuesday. We ordered tacos and beer. The taco meat was cold. The portions were very small. The beer was served with a slice of lemon on top of the unopened can. I returned the cold tacos for them to come back once again cold.  The staff was not very friendly.  We just paid for it and left. Save your money and go anywhere else."
    },
    {
        "id": 125,
        "text": "My group of friends and I came for a birthday party. The staff was super friendly and helpful.  Really great margaritas. Try the mango one because it is my fave :) quesadillas were also good.  Great time with great friends!"
    },
    {
        "id": 126,
        "text": "I had an issue but it was promptly handle by Tony. Super nice. I was a little upset at first, but his customer service has convinced me to definitely come back. 3 stars because I was in a really good mood and was taking myself on a date, but this kinda brought me down. Next time will be better, I know it. Maybe even worth 5 starts. However, I'm still really hungry because I'm still waiting for food after an hour. No big!"
    },
    {
        "id": 127,
        "text": "Stopped in for lunch once and the food was good and it came out really fast! There were homemade chips and salsa too, which I love! The prices are really fair and they seem to have great drink specials. I just moved to the area and I'll definitely be back!"
    },
    {
        "id": 128,
        "text": "Great specials and most of the food is good. I recently had the shrimp fajitas and they were disgusting. I made this know to the server and was still charged for them. I won't be coming back because of this."
    },
    {
        "id": 129,
        "text": "My girlfriends and I love cactus! They have amazing sangria!! It's a low key restaurant with friendly staff and a relaxed environment. Mike is our favorite bartender!!! Makes amazing cocktails and margaritas!! If your ever in town looking for good food and great drinks stop in!"
    },
    {
        "id": 130,
        "text": "We came in late night on Friday, group of 3. I think the owner or manager greeted us on our way in and actually sat us at the bar which was nice. The bartender didn't seem friendly or chatty. Didn't eat the food, but the first round of chips and salsa is on them and refills are $4."
    },
    {
        "id": 131,
        "text": "I do not know why this is at 3 stars!  Their over all atmosphere is great! Start off with a free basket of chips and salsa...their beer and mixed drink selection is huge. The bartenders are friendly! One night my room mate were there on an empty week night B/Sing with the bartender all night and he def knocked off a round or two of drinks for us. We left him a nice tip!  The daily specials are unbeatable! Margarita Mondays! $10 pitcher!  Normally they are $28....not worth $28...but on Mondays...well worth it!!  Their burritos are great! I think once i had one that was sub-par...but that was one time.  All of their other Mexican food i have had is excellent! The buffet on the weekends!!! def try it! for $8 you get eggs, sausage, pancakes, sausage, bacon, small burrito, pastries, fruit, and great drink specials.  Sangria is very good! Not too strong but still good.  5 star bar in Manayunk!!  I go two-three times a month... if you are in the Manayunk sport and social league you get a free drink after the game.  So after our Sunday softball games we usually go there instead of the bayou now!"
    },
    {
        "id": 132,
        "text": "A great place to eat and drink. Cj the bartender makes the best mojitos I have had in the city!!! Check it out. O and the chicken is seasoned not just salt and pepper!!!"
    },
    {
        "id": 133,
        "text": "I would like to preface this rant a of a review by saying that I used to be a big fan of Cactus! I frequently have enjoyed their $10 margarita pitchers and fajitas! I also am a frequent patron at the Bayou next door and have participated in Manayunk sport and social for several seasons.\n\nAll that being said, I was appalled at the service I received at Cactus last night! Sorry for the length of this post, but I really want to paint you the whole picture. \n\nThe manager, Tony, was our server . After waiting at the front door for about 5 minutes ( I get it , he was checking to see if people at the bar were waiting for a table, fine ) Tony comes over and without using any words points to my boyfriend and points to a table that was available ... 15 minutes after being seated Tony comes around and asks if we are ready to order drinks. By this point we were ready to order our drinks and food ! Tony scoffs at both me and my boyfriends drink orders when I ordered a blue moon and he ordered a cocktail. He suggests that my boyfriend gets a different cocktail with better alcohol in it for a dollar more. It was under the margaritas so I thought that sounded good too (foolish of me) . When I told Tony I would take that too he asked if i \"could handle it\" and then told us he likes to call them \" roofy-ritas\"!!!!\n\nAnd that they are how he \" got his wife\" (real cute....) \n\nI should have changed my mind right then and there but I try not to take things too seriously so I shrugged that COMPLETELY INAPPROPRIATE NICKNAME FOR A DRINK off and went against my better judgement and got it anyway...\n\nThe drink was disgusting. \n\nI ordered 2 waters with our drinks...never got them. Tony said he would bring over our salsa and chips... he never did. \n\nI will say my fish tacos were pretty good but my boyfriends meal came out wrong, very disappointing.\n\nTony came over to ask me if I needed a water to help wash down my \"roofy-rita\" and I said yes I would actually like water ( considering I ordered it in the first place) ... once again he never brought it.\n\nAt the end of the meal my boyfriend gave Tony his card to pay the bill. Over 10 minutes later Tony comes back to our table looking at us wondering if we needed anything else. We pointed out that we had already given him the card to pay the bill and Tonys face immediately turned to panic as I watched him wandering around the bar looking for the card and the bill! \n\nLike I said I try not to take things too seriously , but I have been bothered by the language the manager , the level of service, and complete lack of any sign of professionalism at this establishment , since leaving dinner last night."
    },
    {
        "id": 134,
        "text": "This place has the best Margaritas I've ever had. The  food is great and service is excellent. The atmosphere is great for gathering with friends and meeting new people."
    },
    {
        "id": 135,
        "text": "Next time I won't experiment. I can't even give a half a star.... Stale chips..... Stale bread... Dry meat...  They have horrible service. It has been over an hour and I did get a single drink and ordered... It is not busy.... But alas nothing has been received. Patience won out for food Nothing to be excited about. Disappointed."
    },
    {
        "id": 136,
        "text": "Went here with a few of my girlfriends to celebrate our birthdays.  The drinks were not that great.  I had a watered down captain and diet coke.  However, my friend had a skinny girl margarita.  It was a homemade one and it was so strong neither of us could drink it.  The salsa and chips were outstanding.  It was the best salsa I ever ate.  And, unlike other who wrote reviews, we asked for more chips and they gladly gave them to us.  My one girlfriend and I shared the shrimp burrito and steak quesadilla.  There was not much presentation to the dishes, which I usually like and came with no  sides.  However, the shrimp burrito was amazing and so filling, I didn't need anything else.  I also really like the steak quesadilla.  Now for the service.  It was ok.  Not great but not bad.  Waitress did not work hard for the tip and really wan't pleasant, but she wasn't miserable either.  But then again, it's Philly so I never expect much.  We went on a Friday night and the place was packed.  I would definitely go again and bring my son who is a salsa connoisseur!"
    },
    {
        "id": 137,
        "text": "My girlfriend and I recently moved here so we've been trying a few local places. Unfortunately, we had a really bad experience. To start, the chips and salsa were actually okay, the salsa had a slightly smokey flavor and they came as soon as we sat down. However, that's where it ends. We ordered the cactus margaritas and it was nothing like a margarita, more like lime soda and vodka. Still it cost $22. We also ordered nachos which were okay but more like something a home cook would make. Finally, we ordered fish tacos and a lime steak quesadilla. The tacos came out with un-melted shredded cheese (like you buy in a bag from the grocery store) and overly deep fried tilapia. It came with rice which was unseasoned expect for some cumin. The quesadilla was mostly sour cream, unfortunately you could feel it squeezing out when you took a bite so it wasn't very appetizing. Finally, after we finished we sat and asked for the bill, we waited thirty minutes until our waiter came back. If you're looking for Mexican in Manayunk go to taqueria Feliz."
    },
    {
        "id": 138,
        "text": "I anticipated a long night of drinking so I didn't get to sample anything from their extensive list of specials. But the steak fajita salad...  one word: Yummmmm."
    },
    {
        "id": 139,
        "text": "I went to Cactus Restaurant yesterday on Wed wing night.  I had been a good constant customer since about 2015 . But the last 2 times I was there the bar manager , I don't know his name and don't care to know it was very unwelcoming. I am an African American man and I have never come across such blatant racism in my life. The first time I encountered his behavior was the visit before this one. My friends and I entered and he stated their where no sitting accommodations when 3 empty seats where at the bar. We took the seats at the bar and he seemed to get upset. My guess is because it was wing night and he assumed my friends and I were not purchasing drinks and he didn't want us taking up space in the restaurant for a small order. Contrary to his beliefs we ordered a pitcher of margaritas \" which as stated in other reviews were weak and unoriginal and I agree\" as well as wings, nachos  and 2 drinks which totaled 60 bucks and tipped our bartender 15% all while the manager surveyed us from the corner of his eye all night. The feeling was so uncomfortable that I told my friends I would never go back again. Somehow, my friends persuaded me to go back hoping that the manager was not on duty that night. Unfortunately, he was yesterday and he had the same racist disposition as he had before. As soon as we entered the establishment his face turned beet red and he harshly said some one will seat you in a minute. When we were seated he tells our waitress to remind us that if we only want .35 wings we have to pay a $2.00 upcharge for water. The tension was so thick I could feel it and while we were placing our orders he was staring at us the whole time. The straw that broke the camels back is when my friend ordered a long island ice tea. The waitress put the order in with him and his exact words were \"tell her this is not on special\". Our whole table heard him say it and my friends response to the waitress was, there's no need to convey that message. I had finally had it. I waited till he completed the drink order told my friends to get up from the table and leave because I could not spend my hard earned money at an establishment that didn't appreciate my patronage. I walked over and kindly told our waitress in front of him to cancel our entire order. I explained to them both that this was the second time I had been there and felt as if my money yes\" BLACK\" money was not welcomed in this establishment and how uncomfortable the bar manager made us feel. I asked him why he felt the need to emphasize that my friends drink was not on special. His reply was \"I tell everyone what the specials are\" and had the audacity to ask another couple to cosign his blatant racism which they declined to get involved. Needless to say they can pour those drinks out and I will never spend another dime at Cactus ever again and I suggest any one of color to do the same. Its despicable that in this day and time I felt like I was at a sit-in at a Woolworth counter in the 1960's trying to get good service. Although, I tried not to let his ignorance ruin my night, sadly it did!!!!!"
    },
    {
        "id": 140,
        "text": "Great food, great drinks, great atmosphere, great service! Definitely a staple of manayunk"
    },
    {
        "id": 141,
        "text": "came here and had the tortilla soup and it was great in fact Iam surprised as to how low the other yelpers have rated this place.Even though it was the weekend and place was crowded I received great customer service.We returned for their $2.00 taco special and they were also very good"
    },
    {
        "id": 142,
        "text": "Decent Margaritas.\n\nFood is actually very good.  Don't compare to a gourmet restaurant but for a bar they have a good selection of quality food that is tasty too"
    },
    {
        "id": 143,
        "text": "This is a pretty chill place to hit for lunch on the weekends, they were playing some really good alt music too. Exactly what I was in the mood for after a crazy weekend.\n\nService was good, but it wasnt very busy so thats expected. Everyone was very friendly too.\n\nI had a shrimp burrito. It was great - nice and spicy, good portions. I havent had too many shrimp burritos so this was a pretty sweet find!! My friend and I also had some sangria (was the special that day). It wasnt the best I have ever had, but it was still pretty good."
    },
    {
        "id": 144,
        "text": "Margaritas were crystal clear! Margaritas had subtle notes of sprite or seltzer? Intriguing!"
    },
    {
        "id": 145,
        "text": "Cactus cantina provides a very welcoming atmosphere. The staff is friendly and actively engages u from when u enter.\n\nDrink selection is quality and the bartender Kyle will make anything u ask.\n\nFood is affordable and is filling.\n\nHeartily recommend this place."
    },
    {
        "id": 146,
        "text": "Saturday night... city festivities kept us from downtown. We started with the Host telling my friend who first arrived he couldn't hold the table.  Server was awesome (Very Friendly and accommodating) ... food was meh (Over cooked wings; tacoquitos felt like they were missing something; chili - umm yeah not my thing but my friend said it was okay; best was the chips, guac was okay, salsa out of jar but okay). The kicker... I was served a Moscow Mule in a ceramic mug! Please remove from your menu if your not going to do it right."
    },
    {
        "id": 147,
        "text": "a nice little spot on main st in manayunk with daily specials that wont break the bank. plenty of food specials and drink specials. Wing night 35 cent wings. Love there chicken quesadillas. nice seating outside for when the weather is nice. Overall a good spot"
    },
    {
        "id": 148,
        "text": "Checked in here, had one sip of my margarita and couldn't wait to check out. The servers were very polite and nice. Everything else was quite miserable. The margaritas tasted and nearly looked liked flat sprite. They were extremely syrupy sweet with the this slightly flat carbonation. Tacos were a hit or miss. Some were cold but one friend of 5 said his pulled pork was decent. Overall I'd recommend walking right by this place."
    },
    {
        "id": 149,
        "text": "Cactus is awesome!!! Tony is the best. Corona towers, awesome food. No salad bar tho. Otherwise, excellent!!!!"
    },
    {
        "id": 150,
        "text": "This is one of my favorite spots in manayunk. Great specials all week, bar tenders are friendly, and $4 drafts + $6 quesadillas on Thursdays. Ask for Andres. Very accommodating for specialty drinks."
    },
    {
        "id": 151,
        "text": "This place is awesome! Was here for cinco de mayo, even though it was crowded the food was amazing!!! The drinks were on point too! I will definitely come back on a regular day."
    },
    {
        "id": 152,
        "text": "Went back and had the most watered down drinks ever. Manager was shouting at his servers in front of customers and to make it cringier he actually fought with two customers behind us who disputed something on their bill. Servers were pleasant though looked miserable. The ''manager\" was rude and shook his head at other customers a lot and referred to his staff as \"mother f**kers\". Anyway, save yourself the hassle and don't visit this place. It sucks."
    },
    {
        "id": 153,
        "text": "My coworkers & I have had some FUN & INEXPENSIVE happy hours here.  \n\nThe good:  Cactus seated our party of 10 in no time @ 5:30 for happy hour, we took advantage of their $10 margarita pitchers Monday night happy hour special, we were promptly served free chips & salsa, the service was great (there when we needed them, not overbearing).  The total bill came to $25.  \n\nThe not-so-good:  Since our group was so large we sat in the dimly lit back of the restaurant - half booth half chairs.  The air duct over the booth seating was dripping with condensation and half our party got a little wet (it was a small price to pay for being in a nicely air-conditioned space on a hot July evening).  The chips were a little stale, but I'm being bratty by complaining because they were FREE.  The margaritas were heavy on the mix, light on tequila but for $10 a pitcher I'm compelled to lower my standards.\n\nOn a separate occasion I came with a smaller group & sat outside for their happy hour.  Again, specials were great & the staff were very accomodating.  The only problem I had was with the tiny tables - our group of 3 ordered the nachos & portabello quesadillas to split.  Our 4-top table couldn't accomodate 3 small appetizer plates & 2 entree sized plates & it was a little tricky trying to find a spot to rest your drink.\n\nExpect what you pay for - and you'll have an enjoyable time @ HH with Cactus."
    },
    {
        "id": 154,
        "text": "First time I went to Cactus was on their opening night. No remarkable memory of that evening but I'm all for not judging a restaurant on their opening night.\nI was looking for a decent and inexpensive place to grab lunch with a friend, and Manayunk area is not easy: you either have sandwich shops or fine dining... Cactus turned out to be a good balance. The food was almost better than I expected and the service very nice... I ordered the Fajita salad (fresh and tasty) and my friend had the pulled pork which he was raving about. Don't expect anything but a decent casual Tex-Mex, and you won't be disappointed."
    },
    {
        "id": 155,
        "text": "If you want to go to a fun casual place with great margaritas and a terrific beer selection... this is a great place to go...  The people are friendly,, the service is friendly.. the food is consistent and if you take advantage of the promos.. you can eat and drink very inexpensively..  The salsa is addictive... the burritos and quesadillas are top... and to make things even better you can watch all the games on the variety of TVS.."
    },
    {
        "id": 156,
        "text": "First time eating here and had an amazing time. Tony and Colleen took great care of us, and we're looking forward to coming back and having some more of the famous pulled pork!"
    },
    {
        "id": 157,
        "text": "My girlfriend and I dropped in on a Wednesday, just after the place had opened. This is really the only time I can enjoy Manayunk, when the raunchy bar crowds are still stuck at work, and on this night it made for a great early dinner. We hit up their 25-cent wing special for starters, and shared their pork enchiladas and \"loaded burrito,\" the latter of which was smothered in a generous helping of rich, creamy cheese sauce. It was some excellent Tex-Mex, loaded with chili flavor but never too hot for comfort. My Malbec was tasty and my lady's margaritas were very fruity, just to her taste. Not much to complain about, but I can picture the late night scene looking quite a bit different from what I've just described."
    },
    {
        "id": 158,
        "text": "Really impressed!\n\nWe went to this place because we were craving some Mexican food. We didn't know what to expect as we read different mixed reviews about this place, but we were glad we stopped by and gave this place a chance. \nMy wife ordered the longhorn meal and we shared.\nI ordered the pulled pork with black bean salsa and we both shared it as well.\nWe also had the stuffed jalapeno with three different kinds of cheese for an appetizer and were impressed. \nWe were stuffed and we actually had some left overs. \nI would definitely recommend you checking this place out if you are looking for a great place to eat for a reasonable price."
    },
    {
        "id": 159,
        "text": "Bartender was the only service and he got overwhelmed when more people came.  My burrito was hard and crunchy. Probably frozen and defrosted in oven.  Absolutely no moisture. Maybe the worse burrito I had in a while."
    },
    {
        "id": 160,
        "text": "Ugh. The only good thing about this place are the wings. Service is always terrible, margaritas are water + sour mix, food is meh, and did I mention how poor service is?\n\nGo for wings on wing night. Go elsewhere for anything else."
    },
    {
        "id": 161,
        "text": "I went for wino Wednesday last night and possibly had one of the best nights in a long time. cactus has a great atmosphere; delicious food and drinks, and wonderful staff. My friends and i went with no expectations and had a terrific time. It is also very affordable. If you are a tequila fan this is the place to be, i think they have every tequila under the sun. I would recommend cactus to anyone looking for an enjoyable night!!"
    },
    {
        "id": 162,
        "text": "Always have amazing service. Good food, a little pricey but totally worth it. The quality of their margaritas and quesadillas is fantastic. Save room for dessert- highly recommend the chocolate quesadilla. The atmosphere is awesome with not too rowdy of a crowd during the week and on Friday and Saturday nights. Definitely worth a visit"
    },
    {
        "id": 163,
        "text": "I managed to get to Cactus a few months ago and forgot to review. \n\nI'm not quite sure if Cactus is a bar trying to serve food, or a restaurant looking to push drinks. Either way, there is something about this place that just seems a bit off. \n\nThe guac was promoted as being very good, but it was ordinary at best. Our entrees were not horrible, but nothing to write home about either. Even the drinks were ok, but I've definitely had better margaritas. \n\nThe space was kinda cramped, but it was nicely decorated. The next time I'm going through Manyunk, I would definitely give it another shot, but its not an establishment that I would to consider to be a \"destination.\""
    },
    {
        "id": 164,
        "text": "Visited on a Saturday (before St Patrick's day) at 4pm as part of a bar crawl and there were only 2 servers, and the entire up stairs was closed. I had a margarita and it was really good and the staff was very friendly, they were just extremely under staffed. We were going to order food, but there was nobody to take our order and we felt like we'd have to wait too long. We left and went elsewhere to get more drinks and food. Don't know if their food is good; we never got to try it. I'm probably try somewhere else if I'm in the area again."
    },
    {
        "id": 165,
        "text": "I come here often. Its a cool, fun and diverse environment. Tony and staff always make sure that everyone including myself are taken care of. Thanks Cactus!"
    },
    {
        "id": 166,
        "text": "No-thrills Mexican fare, but their fatal flaw is their stinginess.  \n\nWhen ordering a margarita pitcher, it is expected that one would receive a wholesale discount from the individual drinks.  The individual margarita is $8 (too high to justify in itself), however a pitcher costs $32 and it doesn't even fill four glasses!  I have never been to an establishment where you pay a premium for buying in bulk.\n\nWe also ordered the nachos with guacamole and chicken (each of which commanded an additional $2 charge).  When the nachos arrived, it was obvious they didn't include additional chips for the added portions and the chip to topping ratio was amiss.  Needless to say, we tried to make the best of it but were left with no chips and unconsumed food.  We asked for additional chips but were told we couldn't have any.  If the restaurant isn't named Taco Bell, an additional 50 cents worth of tortilla chips should be a given.\n\nManayunk is full of great restaurants eager to please their patrons.  Cactus is not one of them."
    },
    {
        "id": 167,
        "text": "Best pulled pork sandwich I've ever had!!!! Great prices too. The salsa was also very good. The waiter was very polite. Definitely try it."
    },
    {
        "id": 168,
        "text": "Absolutely, positively, THE BEST chili I have EVER had!  Get the \"Desert Heat\". It ain't hot at all but it is AMAZING!  Get the cheese and sour cream on top, too. \n\nSeriously, I've been to half the states in America and half way around the world. THE BEST chili EVER! (Damn good Margaritas also)\n\nThe servers are really cool, too!"
    },
    {
        "id": 169,
        "text": "Ive been coming here for years now, always great staff, quick service and awesome food. Today I came in to get take out and the girl working the bar gave me attitude as soon as I walked in and was just plain rude. (Small framed girl with long blondish/strawberry blond hair). The entire 15 minutes I waited for my food she never offered me a drink. She needs a major attitude check; anyone in customer service should be pleasant and she was the complete opposite. Giving a 5 because I love this place and dont want to give the restaurant itself a bad rating but like previously stated, she needs an attitude check."
    },
    {
        "id": 170,
        "text": "It's rare, but every now and again I will fill an appeal to the Official Council of Yelp Ratings to request that a star be added to a business' review. It's an elaborate process that involves a meeting of dignitaries from around the globe, but sometimes, as in this case, it's worth it. Well, the council has spoken, and I hereby add a star to my previous review of Cactus.\n\nWe stopped in to watch a midday Phillies game today, and had a great experience, thanks mostly to the very friendly demeanor of Mike the bartender. He recommended that we order some of the wings, which were .25 on Wednesdays, and different than your usual buffalo wings. They are a smokey mix of a chipotle bbq sauce and wing sauce. I was really glad he did, as they were awesome, fried to crispy perfection. \n\nThey also have a pretty impressive beer selection. To go with the TexMex theme, they have a wide array of Mexican beers, but they also have the full PBC line in bottles, and several other creative selections. \n\nI would definitely recommend stopping by for lunch one day."
    },
    {
        "id": 171,
        "text": "How impressive is the food at Cactus?  Considering nearly everything went wrong with my recent dining experience, pretty damn impressive.\n\nWe arrived on Saturday for a quick bite.  It was busy, so we were sat all the way in the back, by the bathrooms.  It took nearly 10 minutes to get water to our table and another 5 for chips and salsa.  Once we ordered (another ~ 10 minutes), we didn't see our waiter again until the bill.  Apps took quite a bit of time to get to the table, my margarita sat at the bar for a good 10 minutes before it reached the table, our dinners came out while we were still eating the app, and they gave me pork instead of beef in my enchiladas.\n\nSo how good is the food?  Well, there salsa might be the best I've ever had.  I love their margaritas, and both the pork and beef enchiladas were solid - yes, they corrected my order without an issue.  Honestly, the food is 4 or 5 star worthy, so I am going back on a calmer night to let them earn those extra stars!"
    },
    {
        "id": 172,
        "text": "I had a great experience. The food was good and the bartender was great. If your looking for a good Mexican bar in manayunk this is the place."
    },
    {
        "id": 173,
        "text": "Good food and even better margaritas! Cactus is the perfect place to grab a casual bite with friends, and has specials during the week like half priced margarita pitchers on Monday's and trivia nights on Thursday's. When the weather is nice, you can sit outside but it's a little tight. Overall it's a great place."
    },
    {
        "id": 174,
        "text": "Be sure to bring your ID on a Friday or Saturday night if you roll up after dinner. Because this is a popular college destination, you can usually count on a bouncer barring access on those nights. That being said, Cactus is really popular and is usually packed to the gills with that crowd on the weekends.\n\nOnce you're inside, the decor is fairly spartan, although the walls are bright shade of golden yellow, which evokes the southwestern/Mexican theme. My friends and I got a pitcher of sangria, which was a little watered down to my taste, but it was really cheap on special, so that was a win. \n\nI also ordered the beef enchiladas, which were all right--they came absolutely covered in cheese, which overpowered the simple beef flavors within (I say simple because it was just mildly spiced ground beef inside). Rice and black beans (not refried) come on the side. This kind of food is great for a late Saturday evening snack (or really late dinner) if you're out on the town.\n\nThe salsa for the chips basket is indeed delicious and has just the right burn. I gobbled that up fairly quickly. Just to clear up the question of the \"free\" chips and salsa: first round is always on the house. If you ask for another basket, you pay $4 for the pleasure of getting unlimited refills of the basket for the rest of the night.\n\nThe service was really good, though, and the waiter didn't even bat an eye at the wildly inappropriate conversation that was going on under his nose, so kudos to him!"
    },
    {
        "id": 175,
        "text": "My first experience with Cactus was on a Memorial Day, which probably gave me a far more favorable impression of the place than I normally would have gotten.  Service was lightning fast (of course, the place was dead!), bar staff was pleasant...plus, Cactus does $10 margarita pitchers on Mondays.  This alone kept a friend coming back on a number of Mondays thereafter!\n\nActually having meals before 8 PM at Cactus, however, is an entirely different world.  I've now been there for brunch, weekday dinner, and weekend dinner, and have seen one HUGE theme -- almost entirely absent wait staff.  This would be a little more forgivable if the place had more than 10 tables!  When celebrating a friend's birthday, 25 minutes went by between being able to order drinks and food.  Outrageous!  However, I do have to hand it to their incredibly friendly owner, Tony; when he found out what happened, he offered us two rounds of shots on the house.  As for the food, not bad...I'd definitely recommend them for Sunday bunch (especially if you find other Main Street spots too crowded)."
    },
    {
        "id": 176,
        "text": "If you're looking for anything resembling real Mexican food, don't go here. The menu looked promising but the food just isn't good. This is strip mall Tex Mex food. With the prices they charge here, you're better off going to Qdoba or Chipotle--your food will at least contain other ingredients besides excessive cheese and meat."
    },
    {
        "id": 177,
        "text": "Today at the Manayunk Art Festival, my wife\nand I decided we were going to take a break and have some adult beverages and food at the Cactus. We saw an open table outside and we were in for a great experience. We ordered the Cactus Nachos and some Margaritas. The Nachos were wonderful. You can add whatever meat you want, we added steak and with the corn cheese sauce. This corn cheese sauce has a nice sweet start and if you add jalapeño's you have a nice 'zing' at the end.  The salsa and chips were amazing. The Salsa has a very sweet taste up front followed by a nice 'kick' of jalapeños at the end. The chips were fresh and delicious. Loved the Margaritas and we would definitely return to this restaurant. Even though it was a very busy day at the Festival the service was wonderful! \n\nI was in old town San Diego in California and the Nachos at the Cactus were different and more flavorful than anything we had there."
    },
    {
        "id": 178,
        "text": "I'm a fan... I find myself getting the quesadilla almost every time I'm here, but the tacos are good as well. The free chips and salsa are always a plus, and I like their salsa even though it's a little different. The guac is good, but a little costly for what you get.\n\nHad the margaritas before, and they are good, but really expensive (unless you go on Monday for their special). Fortunately, they have a pretty decent beer selection for other days of the week.\n\nOverall, a good option for when you want a casual mexican-ish meal."
    },
    {
        "id": 179,
        "text": "I LOVE this place. The salsa is so good and food is always the best. The atmosphere is so welcoming and the owner is great! Definitely the best Mexican food in Manayunk. Try the sangria and margaritas!!"
    },
    {
        "id": 180,
        "text": "I love the margaritas. Great food and drink specials daily.  My only suggestion would be that the cooks need to be more consistent."
    },
    {
        "id": 181,
        "text": "Was okay drinks was a lilttle watered down but love the fish taco"
    },
    {
        "id": 182,
        "text": "This place was not great. The margaritas tasted like yellow gatorade and only maybe had tequila in them. The guacamole had no flavor. We tried to leave as quickly as possible. Also, no gluten free options, so that was kind of disappointing. I would not recommend anyone go here."
    },
    {
        "id": 183,
        "text": "Loveeee thisss placeee ! Tony the manager and Eric the bartender were amazing!  Great customer service and definitely made me and my friend to feel welcomed !  Great tacos great margs ! If you're in Manayunk definitely come here !!!!!!"
    },
    {
        "id": 184,
        "text": "I saw someone post that the chips were stale and I just had to say that all of their chips are the freshly served kind... not like a Tostitos brand. ...and that salsa! It is smokey and delicious and damn near dangerous to consume! I have often found myself at the bottom of many a chips and salsa basket wanting more and more! The chips are a bit salty BUT when paired with the smokey salsa it works. Plus, it will give you a chance to sample some of their really well thought out beer selections. Good deal I think! (The Tequila flights will get you in trouble... do it)\n\nThe real shining stars of this fine Mexican establishment , besides Tony the owner, is: 1) The pulled pork. Anything with the pulled pork is sure to make your mouth happy. Nachos, Tacos, Enchiladas... have it in everything. EVERYTHING. Put some of their mashed sweet carrots in the mix and you will NOT be disappointed. 2) The margaritas. On the rocks and any flavor is awesome. Check their listing because they have drinks specials where the Margaritas can keep flowing at a fabulous price!\n\nGive it a try... and then slather yourself in pulled pork. Good times will follow!"
    },
    {
        "id": 185,
        "text": "Had a great time staff and owner was wonderful and very welcoming the food was great nice atmosphere.  I will defiantly hang out at the cactus in the future"
    },
    {
        "id": 186,
        "text": "I've was here for the first time last night but I assure you it won't be the last. The Wednesday wings for 35¢ is an excellent bargain as the wings are pretty big and definitely cooked and seasoned well. The margaritas are good and contain a good amount of alcohol, even if they are slightly pricey (1 or 1.50 more than I would have preferred). The complimentary tortilla chips are good and a nice touch. Because it was a Wednesday service was impeccable. But it's easier on days like Wednesday especially when late. They have a good atmosphere and the optional outside seating is nice. Tony who I think is the owner personally took care of my friend and I. He was very personable and friendly. His service was good and he informed us of specials and he made a few recommendations.\n\nI would need to go again and get a dinner or maybe be on a more crowded night.\n\nBut first impressions are important. And Cactus left a good impression on me as did Tony. Good enough to come back."
    },
    {
        "id": 187,
        "text": "Amazing special on mondays, $10 pitchers of margaritas! My roommates and I each get our own pitcher, its such a good deal! The waiter and waitresses I have had here have all been so sweet and fun! Love it here!"
    },
    {
        "id": 188,
        "text": "Great food! Good service great location kinda busy at night but overall good environment. Good drinks & great food specials! $.35 wings on Wednesday"
    },
    {
        "id": 189,
        "text": "Went to Cactus yesterday first time and sat down at bar.  Bartender was super nice and very quick when making drinks for multiple people.  Her name was Molly. She suggested some popular cocktails and told us about the brunch special.  Also the waitress Claire was a doll always happy and smiling all over the place and always checking in on us making sure our water was filled and our beer glasses didn't run dry.  This is a place to get to on a lazy sunday to chill and have a sunday fun day!"
    },
    {
        "id": 190,
        "text": "Stopped in for a drink. The female bartender was extremely rude and acted as if i was bothering her when i tried to order a drink. I just had to hear her talk down about her management team to other guests for being cheap not buying fresh ingredients for drinks. Bad experience will not go back. Wish i could have experienced the food."
    },
    {
        "id": 191,
        "text": "Besides the most AMAZING waitstaff known to mankind, this restaurant also boasts $10 pitchers of DELICIOUS margaritas! ! & they don't skimp on the good stuff in these Margarita pitchers! Plus lots of other drink specials & some pretty banging food! \n\nAlex is an ADORABLE and hilarious waiter with lots of interesting small talk to offer & samantha (I may have her name wrong) is possibly more adorable, advertised her restaurant to me when she wasn't at work (which shows me the owners keep a great work environment), & spoke to the menu knowledgeabley. \n\nI've been here a few times and everyone seems happy to be working.  The place is one of the cleaner establishments in mnyk. \n\n& outdoor seating where they brought my dog water!"
    },
    {
        "id": 192,
        "text": "I really like this place. It's one of the first bars we went to when we moved here and we've been back a few times since. The fish tacos are REALLY good and they have a pretty good beer selection. The Star Island is my favorite. We haven't been for a happy hour yet, but it looks like they have pretty good deals (they change daily). We will definitely go back again."
    },
    {
        "id": 193,
        "text": "Tony is an amazing banter-tender!! I would do 5 stars but it probably won't let me! He taught me  about so many drinks and beers ! Please try Grapejuice and 007!!!! He's very experienced and I'm so pleased. So glad this bar has someone that knows their stuff ! I wish the best for this bar and for this bartender!"
    },
    {
        "id": 194,
        "text": "Busy St Paddies Saturday but they were on top of their game at peak hours, rhen we came back Sunday for our friends birthday, and was just as good.\n\nAppreciate the good times, and those nachos were dope. Plus the tequila aged in smoked whoskey barrels..."
    },
    {
        "id": 195,
        "text": "One of my favorite places to go! Their margarita pitchers are well priced & well poured & their wings are AMAZING! The best wing sauce ever! The staff is always great & the owner, Tony is awesome! Always personable to the customers & the staff. I never leave disappointed!"
    },
    {
        "id": 196,
        "text": "This place has a chill atmosphere, very friendly and rarely densely crowded. There's great (cheap) deals from day to day... but taco tuesdays are a must for 2 dollars and pictures of margaritas. They boast a huge selection of the various types of tequila if that is your thing. Best item on the menu is the pulled pork! On anythinggg it's slow cooked for like two days and is perfection. Kyle is a dope bartender and if u're lucky to land Aisha as your waiter u're in for a good time. Order the \"Alien Brain Hemmorage\" shot... out of this world forreal"
    },
    {
        "id": 197,
        "text": "Another great spot on the brunch list.  Hubby and I went on Saturday, early afternoon.  Bloody marys were $3 and really good.  We both got omelets.  They were good.  Reasonably priced.  Service was good.  Very casual, relaxed environment - no bells and whistles...just a good local spot.  We definitely will return for some Mexican treats."
    },
    {
        "id": 198,
        "text": "best mexican food I've had in a while. Their special homemade salsa is incredible. nice low key spot with a good atmosphere and excellent service."
    },
    {
        "id": 199,
        "text": "Cactus is our local favorite for authentic Mexican food. The food is a reasonable price and is always excellent. My personal favorite is the fajitas which they even have a size option, for one or for two... we like to get fajitas for two and split appetizers because they always have a good happy hour menu. Atmosphere is great, food is excellent and the drinks are also great. Not to mention the staff, they are awesome and extremely attentive. Highly recommend!!!"
    },
    {
        "id": 200,
        "text": "After paying a few more visits to this \"cantina\" and having a better experience each time I am now ready to reward Cactus  with another star! \n\nThe one major gripe I had with Cactus in my previous review was that it seemed understaffed and the bartender doubled as the waiter and then again as the hostess.  They must have read my review because now they have plenty of servers and a bartender who has plenty of time to make you a drink and have a friendly chat!\n\nThe seem to also have expanded their brew menu by adding some Philadelphia Brewing Company(!!!!) and other microbrews.  Also, try the wings.....more tangy than spicy and have an amazing crisp to them....on Wednesday's the special is .25/wing.\n\nI am so happy to see that this place is making improvements and bettering themselves.....Cactus is now is my top 5 bars along Main Street!"
    },
    {
        "id": 201,
        "text": "We ordered sangria, we did not enjoy :-(\nAlso the tortilla chips were uber salty and stale. No thanks!"
    },
    {
        "id": 202,
        "text": "The $10.00 pitcher of margaritas are half the size they were last year  so it's no longer worth the trip.  Food has never been consistent."
    },
    {
        "id": 203,
        "text": "Went here for the first time last weekend. Didn't have high expectations but boy did they blow me away! First off the staff is AMAZING. They were more than accommodating and really nice and friendly. The manager is really nice as well. The chips and salsa were so fresh and delicious! I am actually craving them right now. We went there thinking it would just be typical bar food with a tex mex flare but boy were we wrong. The atmosphere was great as well as the food. Did I mention the chips and salsa??? Delish! I also have a food allergy so I can be a bit of a pain when ordering and the staff was more than happy and actually went out of their way to accommodate my very specific food needs. Great place will definetly return!"
    },
    {
        "id": 204,
        "text": "I had a birthday dinner here years ago but this was my first time back as someone who was over 21. It was during happy hour and I got their regular margarita was was wonderful because it has just the right ratio of everything and wasn't too much on the tequila. I ordered chicken tacos which came with a side of rice and it was just the right portion size and tasted good. My big thing about the place is that me and my friend were sitting in the back and there were a lot of gnats I think they were? Or fruit filies? It kind of ruined the dinner experience a little bit. But I would definitely come back."
    },
    {
        "id": 205,
        "text": "Yay I would give it 3 1/2 stars if I could.  Went there for a girls night out and immediately ordered pitchers of sangria & margaritas oh yummy! Drinks were excellent, service was pretty good.  Two bathrooms for the whole restaurant... not good =0(  We ordered the cactus nachos which were up there in my top 5 best nachos of the world!! Excellent nachos!! I was stupid and ordered something else thinking it would be just as good.  Nope.  My recommendation is nachos & sangria and you will be set.  Also the dj kept changing the songs we liked.  Like we would hear it for 30 seconds and then he would skip..poop =( \nI would totally go back for the nachos & sangria!!"
    },
    {
        "id": 206,
        "text": "St. Pattys brunch was delicious. Tony was extremely helpful and very friendly. Will definitely be coming back. Cactus nachos are top notch."
    },
    {
        "id": 207,
        "text": "Not a bad place! Things seem a little pricey but they have the best enchiladas I've ever had! Not to say I'm an enchilada connoisseur but I love them! Highly recommend it :) a manayunk fave!"
    },
    {
        "id": 208,
        "text": "As soon as I got there I was immediately seated and greeted. The manager Tony was awesome! He made sure I was well taken care of the entire night. Wait staff was very attentive to all my needs and the food and drinks were amazing! My food came out quickly. I would definitely go back again. Great time for either a girls night out or a nice date."
    },
    {
        "id": 209,
        "text": "Quality food, great margs and good selection of beers on tap. Great specials and staff is always attentive! Tony genuinely takes care of customers and every visit is a blast!"
    },
    {
        "id": 210,
        "text": "Hospitality is second to none! Went here on a whim to try something new and left very happy with our decision to go to Cactus. Hospitality is second to none. We got a pitcher of the house margs and were pleasantly surprised with how much flavor it had. Meals were large and well-priced, but don't expect anything mind-blowing... a classic American/Mexican menu. If you're looking for solid happy hour deals in the heart of Manayunk, this is the place. We'll be back!"
    },
    {
        "id": 211,
        "text": "HORRIBLE FOOD!! I don't tend to leave bad reviews but this place's food was horrible! Also, costumer service was pretty bad. To start, the hostess was very condescending then went ahead and plaed my husband and I in a very small and on the way table. The appetizer was good but then my food came out and it was cold. The meat in my tacos tasted sour and disgusting. The rice, that was included in the dish, was dry. And the worst thing is that the food was very bland. Now, we all know Mexican food is supposed to be very flavorful! So this place was a total fail!  \nNEVER EVER coming back!"
    },
    {
        "id": 212,
        "text": "I'd like to leave 0 stars. The past two times I have visited this establishment (and I shouldn't have gone the second time) the service was AWFUL. \n\nWe went one night to have a drink, they sat us at a table in the back of the restaurant and then looked at us about 8 times and never came back to serve us, take our order, even say hello. We sat here for 20 minutes with no service and got up and left. \n\nI went back this past Friday to meet friends. Again when trying to get a drink, we were unable to be served, even though Tony the owner was looking right at us and saying he'd make drinks and never did. When a girl at the bar (who seemed friendly with him) asked him to get us drinks, his reply was 'f*ck those girls' and he walked away. \n\nObviously we left and I have learned my lesson and will never return."
    },
    {
        "id": 213,
        "text": "Their brunch is more satisfying than their dinner. Then again, I've never had a bad breakfast burrito. Their nachos are particularly underwhelming for a Mexican joint. The tequila selection here is impressive but whatever else they're adding to their margaritas is not. If you can't make the pilgrimage westward to Plaza Azteca, Cactus will probably do the trick (service is attentive and friendly)."
    },
    {
        "id": 214,
        "text": "Cactus. Mike Molly and Kati are the best. Eat more chicken.  Cant win them all. And can't forget about Claire."
    },
    {
        "id": 215,
        "text": "love cactus!! great food and great drinks! i come here often with friends for drinks and apps. Their salsa is made fresh daily\nand delicious!!! staff is always friendly. Had to write this review to highlight\nour server Ryan tonight. He was funny, personable, and attentive!"
    },
    {
        "id": 216,
        "text": "Fantastic restaurant the most courteous  and friendly staff and in my opinion the most culturally eclectic bar in Manayunk. Very diverse and equally accepted crowd"
    },
    {
        "id": 217,
        "text": "I know this is a Mexican restaurant but the only reason to go here is for wings.  some of the better wings in Manayunk (25 cent wings on Wednesdays) and chips and salsa are top notch.  My girlfriend and I routinely go in on Wednesdays, each eat a dozen wings, have some chips and salsa, get drinks, and leave without spending 10 dollars."
    },
    {
        "id": 218,
        "text": "So me and my friend are here as I type this and it took them almost an hour to make our food.. after an hour my friends food came and it literally looked like dog food the waiter said \"yea I knew you would say something he messed the burrito up (the cook) \" so he takes the food back and never bring my food out. The girl with the curly hair (Aisha)came over brought our check and we didn't even eat lol we told her our concerns and she went to \"check on our food\". When they bring her food out is when they bring mines .. this food is suppose to be just made and it was cold and not worth it at all I'm still hungry  and  the drinks taste like straight up soda . NEVER AGAIN last but not least it was not crowded at all so idk what was the hold up :("
    },
    {
        "id": 219,
        "text": "I posted this four years ago and a friend just notified me some clown at this restaurant responded this post was fake.  It is 100% genuine so nice attempt manager guy."
    },
    {
        "id": 220,
        "text": "Well, what can I say. I almost gave it a one star, but remembered that when I checked in on yelp, we received a free appetizer! What's with places not knowing about that. 2x's I have checked in and had that promotion come up and both times... Unaware or it. Interesting. The appetizer, chicken spring roll, was the best part of the meal. Both entrees left a lot to be desired. Mine, the chicken quesadilla, would have been good, but all of the chicken was severely dehydrated?? The other entree, shrimp fajitas, lacked appeal. The tail was on the shrimp? I am thinking that this is a hit or mIss spot that in the future I will be missing. 2 stars out of 5, but the good was 1 star."
    },
    {
        "id": 221,
        "text": "Best mexican food in manayunk. My girlfriend and I come here all the time, and never had a bad experience. Chicken tacos are good price and taste great, and the burritos are banging. A must go on quizzo night. Brandon was a huge help"
    },
    {
        "id": 222,
        "text": "Great service and drink specials. Free chips and salsa definitely don't hurt. Plenty of outdoor seating as well to enjoy.  I had the chipotle chicken sandwich wrap and was impressed. This place checks all the boxes for mid level Tex-mex bar food."
    },
    {
        "id": 223,
        "text": "I went here for the 1st time last week - sad to say it was horrible. Not sure how you can mess up a margarita, let alone a taco but both were disgusting. The bartender was seemed so uninterested & played on his phone the whole time. Will NOT be back."
    },
    {
        "id": 224,
        "text": "Great food, wonderful service and cheap margaritas!! Had a great evening out with some friends and will definitely be back."
    },
    {
        "id": 225,
        "text": "Waitress brought us a round of drinks and appetizer, then completely disappeared. Wasn't busy. Had to get the bartender to cash us out."
    },
    {
        "id": 226,
        "text": "Cactus is a the perfect place for a low key night out with friends. Great prices for Main St, especially during the week with all of their specials. The food is super filling and the service is nice and efficient. You can tell how they all work as a team. Also I've been here a few times and the servers and bartenders really make an effort to remember your name. Very friendly! Great beer selection too!"
    },
    {
        "id": 227,
        "text": "Sadly , I received some clarification today, the cactus nachos, which are one of the most\nPopular food items on the menu due to the most amazing corn salsa, has been discontinued from the menu. I am devastating as it was hands down the best nachos I've ever had. I'm writing this review in hopes that we can bring them back to the menu. I know this sounds dramatic haha but everyone I've brought to have these nachos rave about them! Please consider bringing them back !"
    },
    {
        "id": 228,
        "text": "They're wings were good. Went during the week and it happened to be wing day so my food was dirt cheap. Lol. Lucky me. I didn't try much else. Not much heathy choices. Not bad for the price."
    },
    {
        "id": 229,
        "text": "I love their spicy chicken caesar salad, chicken enchilada and their chili. #solidcourses"
    },
    {
        "id": 230,
        "text": "Defining moments are infrequent but oh so important. And that's what I felt the first time I dined at Cactus. Want the experience of a free trip down to Tempe, AZ right here in PA? \n\nHead down to Cactus on main. The ambiance is on point, the drinks (both beer and cocktails) are unreal, and the service (especially Tony) is LEGEN - wait for it - DARY. Not to mention the burritos, just delish.\n\nIt's always a good time at Cactus, so come on down for some GTs (good times and gin and tonics)"
    },
    {
        "id": 231,
        "text": "I am giving this 4 stars  because the service was wonderful. Everyone we saw walking around helped us out. The staff was working together filling waters, grabbing our plates, getting new beers...it was very good! \n25 cent wings were awesome but I will mostly be back because of the service! Everyone was so friendly!"
    },
    {
        "id": 232,
        "text": "Ew! This place is actually gross. Ate here over the weekend with family and the decor was dated, service was slow, and food was really bad. I ordered a veggie burrito and realized on about the second bite that there was a bunch of pork hidden inside. The waitstaff did replace it, but eating meat for the first time in over 5 years led to a really upset stomach and ruined the rest of my night -- definitely not worth it for such bad food! There were 4 others in my party who all ordered different things (five alarm burrito, chicken quesadillas, fajita salad, and a chipotle chicken sandwich), and nobody was even slightly impressed. Perfect excuse to have a second dinner elsewhere after coming here.\n\nThe prices are decent and chips and salsa are good. That is about it. We were seated right next to the waitstaff station and it was loud, we saw waitresses drinking Gatorades and eating chips, and several things were dropped right in front of us. I totally understand that waitstaff need a place to eat, hydrate, and maybe take a quick break, but right in front of a table of guests is not the right place."
    },
    {
        "id": 233,
        "text": "It's about time I wrote a review about Cactus.  I'm the only Canadian that frequents this place.  It's also pretty obvious people know this because it's always empty when I come in.... they must see the snow I drag in behind me and the way I'm always talking about Tim Horton's and hockey.\n\nI usually come in late afternoon on Tuesdays and get horrendous service from the bartender Stefan, a small man from Detroit 1-8-7 who has the personality of a 10th grade English teacher that's sleeping.\n\nNo, seriously, I'm pretty much a regular and am always there watching college football or baseball.  $3.50 Philadelphia Brewing Co. beers and stellar company behind the bar!!!!\n\nBautista!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
        "id": 234,
        "text": "Came here to get started on happy hour and we had the mixed berry marg, which was their Monday special for $5. It tasted like a huggy or some grape concord drink. We tried looking at their website for specials prior to sitting down but it was not updated. Allegedly they don't have the password to update it? Yeah. But, this place is good if you want a quick fix or a snack but I wouldn't stay for long (they also don't have the upstairs open)."
    },
    {
        "id": 235,
        "text": "Zero Stars! Bartender was so racist, black people are not welcomed should be their slogan!"
    },
    {
        "id": 236,
        "text": "I love this place! It's a weekly for me! Great deals on everything every night of the week! Great margaritas food is good staff is great! Great neighborhood place to hangout!"
    },
    {
        "id": 237,
        "text": "Had a great time tonight Tony hooked me up and he knows his sports. The wings were great and there was servers everywhere so I didn't have to wait on drinks. It was a great time it's a every night spot."
    },
    {
        "id": 238,
        "text": "Worst service ever.  After sitting here at a table for 20 minutes, I'm writing this review before I get up and leave.\n\nWe saw the GM/owner standing in the doorway, asked if they had a bar, and when he said yes, asked of we could have a table outside and sat down.  With 8 tables outside, there are 3 girls at one table, already with drinks, the other tables all set but empty.  We sat, he went inside (I thought to get menus for us)\n\nAfter about 5 minutes, my girlfriend got up to go inside and had to ask the same guy for menus.  No excuse for not knowing we were sitting there now!\n\nAfter 5 more minutes, same older man in a polo shirt came out and sat 2 women next to us.  With in 2 minutes a waitress came out to take their drink order.  Asked if they had any questions on menu, and then took their food order!  She looked at me (as she had to squeeze past to get by as we were closest to the sidewalk) and said \"I'll be right with you\".  After a few minutes she came back out and went to the first table of girls to take another drink order, looked at use and went back inside.  After 5 minutes, with not even a glass of water, and the table after us placing their drink and food order, I decided to poke my head in the door to see if they were just really slammed...they're not. There's maybe 8 people total inside.  i'm going to put my phone down for 10 min before I start writing this review incase they come out with an excuse for the lack of service, or just wont come over with my phone out.\n\nIts now been 25+ minutes total.  No waitress, no drinks, no chance in hell I'm going to sit here like a fool and wait to be disappointed even more.  I don't care if they have kobe beef tacos with free tequila shots, I'm going next door where I know I can get good food and equally as good service.\n\nI highly recommend avoiding this place.  There is a taco shop a few storefronts down to the right and one about 1.5 blocks in the other direction with a liquor license, both with excellent service and food.  Go there, avoid the same disappointment we had."
    },
    {
        "id": 239,
        "text": "Bland. Overpriced. Came with NOTHING on the side. \n\nWe had to order chips & salsa for a 'side' and the salsa is just off-brand Tostitos. Chips are very oily. Very unappetizing.\n\nThis $28 (2 burritos, some chips and a cup of salsa) meal didn't even come with a garnish or sour cream or complementary salsa/sauce. \n\nWhat a disappointment. I wish I could get my money back, but I'm exhausted and just want to relax at home instead of returning this stuff."
    },
    {
        "id": 240,
        "text": "Went here with the hubster and some friends for a friends birthday party.  When we first arrived, we'd wondered where we were going to sit, because we'd made a reservation for 8 people, and there were no available tables.  The waitress immediately went back to where our table was to be, and told the people who had sat themselves, that they had to move, due to the table being reserved.  Most places don't even do that anymore, afraid to \"butt hurt\" a customer. So for that I give kudos. Brave waitresses = Ok by me :)\nI ordered the espresso martini (can't remember the exact name but I know it had espresso in it, and I had two of them) Muey Bueno! I ordered enchiladas and oh my goodness it was almost too much food for me .  I moved here from Oregon over a year ago, and had been trying to find a tex-mex/mexican place worth a crap, and now I've found something to tie me over until  my next mexican/tex-mex adventure at least, and I know if In Manayunk, Cactus is where I'm at for some grubbin food, and some stellar martinis!"
    },
    {
        "id": 241,
        "text": "Went here for Sunday brunch by myself. I was pretty exhausted from the night before since I was alone in my new apartment up a few blocks for the first weekend night and binge-watched CSI: Miami on Netflix. I used to watch this show a lot with Cynthia (my ex-wife) but she was always more of a CSI: NY fan. \n\nI know that's not what caused us to split, something so trivial. But it just became a thing where I'd come home from the office (I'm an actuary). I mean, I love my line of work. Risk valuation is a constant challenge. And I just got some new responsibilities training kids just out of college starting out as actuaries. But I let the stress get to me, I guess. But we have some deadlines we have to meet for our client before they can start constructing that parking garage in Conshohocken and the risk modelling can get a bit difficult. \n\nI really needed to learn to not take my job home with me. I wish I had a better work/life balance. I mean, what's more important -- being there for Bradley and Bryan (our twin sons) for their dance recital or staying home to crunch Excel spreadsheets? I just really messed a lot of things up and I know that no but it's too late. 14-years of marriage gone. \n\nAnyways, the brunch at Cactus is TREMENDOUS. It's a simple little buffet -- nothing too fancy, but all of it so tasty! The western hash browns were cooked just right, scrambled egg bin was done to perfection and they even had some soft-shelled taquitos. I had a Bloody Mary and it was too spicy, but to be fair I made it myself at the Bloody Mary bar so it was my fault, like everything has been for 14 years."
    },
    {
        "id": 242,
        "text": "Tony makes Cactus! Me and my close friend usually come to Cactus every week for their specials and to enjoy some of the sports that are being televised. We love the wings, chips and salsa, and the constant attention from are waiters and waitress. Tony always makes sure we are taken care of. Definitely our go to!"
    },
    {
        "id": 243,
        "text": "I sat at the bar and was given chips and salsa while I was waiting for the food to come. The salsa wasn't chunky and had a nice kick to it\n\nThe food did take a while to come but the chips kept me busy. I ordered their 35 cent wings and the fish tacos.\n\nWings were pretty decent. They were crispy and also had a mild kick.\n\nFish tacos had fried fish and purple cabbage coleslaw. It also came with a side of rice. There was a nice amount of fish in the tacos and it was seasoned perfectly. The only issue was the dryness. I asked for a sauce for the tacos and they gave me the chipotle mayo which complimented the tacos very well.\n\nThe bartender was very attentive and outgoing. The drinks weren't strong tho. It was quizzo night which was free to participate. The host was really funny and offered shots to ppl who were winning each round"
    },
    {
        "id": 244,
        "text": "This is the worst experience I have ever had with a restaurant/lounge. I was visiting Philadelphia from DC with my friend from overseas, and the bartender/host was really rude. He pretended he couldnt serve us without US ids. Should we declare Philadelphia a no foreigner zone? This was racism at its best! Do not support this kind of business. Thanks!"
    },
    {
        "id": 245,
        "text": "Used to come for years when I lived in the city. We came every week for the wing special and drinks. I miss going there. I will be regrouping with the guys this week and anticipate the good food and hope to see some familiar faces when we get there. Wings are cheap, tasty and big. Drinks are always good, reasonably priced and come quick from the bar."
    },
    {
        "id": 246,
        "text": "After moving to Manayunk from center city Philadelphia me and my friends were hoping to find a place that could satisfy our cravings for south of the boarder cuisine as well as places like El Vez and El Rey. After trying the Cactus in Manayunk I believe we found a place that could easily be considered the equal of places such as that. They started us off with an order of chips and salsa as good as any I've had, and we ordered a corona tower that held about 8 beers for only $25(great deal). For an appetizer we ordered the Santa Fe Eggrolls and \"Fire Cracker\" jalapeño poppers. Both were delectable, and while I'm usually skeptical about ordering poppers because you never seem to get enough for the price, they were at least 3X the size of what you would normally expect and easily enough for the four of us. I ordered steak fajitas for my entree and they were very satisfying for the price. Overall the service was great and it was an overall pleasant experience. They have outdoor seating right on Main Street and we will definitely be back Sunday for their all you can eat brunch buffet and $2.50 mimosas and bloody Mary's."
    },
    {
        "id": 247,
        "text": "I posted a 5 star review for cactus 7 years ago and after all this time I am still just as impressed. The food is consistently good and the staff are extremely friendly. Definitely would recommend this place to friends, family, or even strangers."
    },
    {
        "id": 248,
        "text": "I honestly never leave reviews for restaurants but this was so terrible I felt I had to share. My boyfriend and I came on a Thursday night and ordered a pitcher of margaritas and we both got the chicken tacos. The pitcher of classic margs was actually an overflowing pitcher filled with ice and a splash of margarita mix from the grocery store and maybe one shot of tequila in the whole pitcher. They were the worst margs I've ever tasted. The chicken in the tacos was literally rubber and my boyfriends tacos came out with the toppings he asked them to leave off. He would have sent them back but no one checked on us or asked how everything was.  Do not waste your time or money at this awful \"mexican\" place. Go to taqueria Feliz or la roca if you're on Main Street."
    },
    {
        "id": 249,
        "text": "We have been to the Bayou (same owner, nice guy named Tony) many times before and always enjoyed it. Today we decided to try out Cactus, and were not disappointed. Started with some complimentary chips and salsa, had a delicious margarita, and got burritos (I got veggie and my boyfriend got steak). Quality food for a reasonable price, and they play a lot of fun throwback songs I haven't heard in years. Will definitely be back!"
    },
    {
        "id": 250,
        "text": "I love this place! This is my normal happy hour spot.  They always have good food and drink specials. The staff is always nice and fun, which is always a plus"
    },
    {
        "id": 251,
        "text": "This is one of my favorite spots to cone to on Main St. The manager Tony is always so nice to me and my friends and the service is always on point. The bartenders are just amazing (Collieen is thee best)...  I recommend this place to anyone in the area... Seriously!!!!"
    },
    {
        "id": 252,
        "text": "Ordered some takeout from here in Cinco De Mayo and was horribly disappointed. Pictured is $100 worth of food. The food was sparse which bothered me the most. The Chicken Fajitas had literally 4 cubes of chicken and the $10 side of guac was a small quarter sized container. The food was fine nothing special but the lack of substance for the prices was disappointing. The burrito was really good though!"
    },
    {
        "id": 253,
        "text": "Taco Tuesdays and Wing Wednesdays!! What more do you need!? Also their margaritas are amazing"
    },
    {
        "id": 254,
        "text": "Had drinks and apps with coworkers last night and everything was amazing. I love coming to Cactus every time I hit Main Street. Tony and his staff are amazing and always accommodating to me and my friends. I highly recommend giving Cactus a try you won't be disappointed!! Thanks Tony!!!"
    },
    {
        "id": 255,
        "text": "I will definitely be coming back here.  My roommate and I were looking for somewhere to go have a drink after work and using Yelp I stumbled across Cactus.  Both of us ended up having the Pasion de Fresca (strawberry) margaritas and they were amazing.  We both agreed we would make this the first stop on a weekend night before heading out.  We got the small plate of classic nachos and they were the perfect amount for the two of us to share and the free chips and salsa were great.  Some other reviewers mentioned that theirs had been stale, but that certainly wasn't the case for us and we loved the guacamole.  It's a little small inside (at least on the first floor) and we were seated at a table by the door, so it did get chilly once more people started coming in and out, but I wouldn't count that against the place.  I absolutely recommend it."
    },
    {
        "id": 256,
        "text": "I was in Manayunk for a charity bar crawl a couple of weeks ago, and we stopped at Cactus for some nachos. Like most bars in the area, a bouncer was checking IDs at the door. I felt like I was fresh out of college.  We grabbed a round of drinks which were moderately priced and ordered Cactus nachos. There was some kind of creamy corn sauce on the chips. The first couple of bites tasted great but my stomach felt like lead after 3 chips. These nachos are loaded and the \"small\" portion is huge. It also looked like there was an entire pint of sour cream dumped on top of the nachos. Four friends couldn't finish half of the dish.\n\nCactus nachos weren't bad, but I'd never make the trek out to Manayunk just to eat there. I'm spoiled with Loco Pez, Dos Segundos, and Sancho Pistola's all within walking distance."
    },
    {
        "id": 257,
        "text": "I ABSOLUTELY fell in love with this place. I finally found a great mexican restaurant on Main Street!  It was a great atmosphere to relax and have a couple of drinks while eating some delicious food.  \n\nI had the Strawberry Margarita which was delicious and the chicken quesadillas that were so filling!  \n\nThe wait staff were very friendly and accommodating.  Our server gave us the remote to change the channel for the TV in front of us which was so nice.  \n\nI definately recommend coming here and trying the place out! I took a look at their weekly specials, and they look great!  I know that I will be back!"
    },
    {
        "id": 258,
        "text": "Stopped here for lunch on a leisurely stroll through my old neighborhood.  This place ranks in the middle of the pack: not the best, nor the worst bar on Main Street.  The pulled pork sandwich was juicy and tangy, surprisingly it even tasted good the next day ( I took the leftovers home). The real stars of the meal were the salsa and chips.....the chips were salted and cooked to crispy perfection,  the salsa was fresh and flavorful-yum yum!\n\nUnfortunately, the bar tender was also the only server during the lunch rush.  He was great at juggling both stations and even had time to throw in a few jokes but you could tell he was overwhelmed.  I definitely want to come back to this place and give it another whirl."
    },
    {
        "id": 259,
        "text": "Great place, good atmosphere!  Colleen by far is the best bar tender around!  She is friendly and sweet and takes the time to make sure her customers are served right!  Every time we come we make sure she is here, great to see her smile!  Good food and excellent service!"
    },
    {
        "id": 260,
        "text": "The only good thing was our sweet waitress . Disgusting nachos with some fake queso . How the heck do you mess up nachos ? Margarita was gross too . Yuck yuck yuck."
    },
    {
        "id": 261,
        "text": "This is a good spot if you're looking for a decent priced margarita. $7-10. They also do pitchers from $20-$30.  The food isn't special, nothing unique or very flavorful.  Big portions. It is what you would expect.  They have outside seating when it's nice out.  Service was very slow - no one came to the table for 15 minutes and the server was awkward."
    },
    {
        "id": 262,
        "text": "Went for a Margarita tasting/birthday celebration and had a fabulous time! Food was delicious and Tony was the best bartender:). Will definitely come back!"
    },
    {
        "id": 263,
        "text": "Let me preface this that the if I could give 5 stars for the wings and salsa..I would. \n\nCactus is usually my go-to for cheap wings on Thursday's, but lately I've become more and more disappointed and it stems from the absolutely poor service.\n\n1. Do not order a soda unless you ask beforehand if there are free refills. I found this out the hard way because despite not being charged for refills on the various occasions (10+ times I've been there) I was charged. I asked the waitress about this and she said \"it depends on who is working as to who charges you\"... which is my opinion is ridiculous. Also- I can't even remember the last time I was ever charged for a refill at any restaurant I've been to.\n\n2. The drinks are very watered down. I ordered a pitcher of margaritas with my friends and it was 10% alcohol / 90% juice. I wouldn't waste your money on those.\n\n3. The manager is very rude almost every time I'm there. \n\n4. The service is slow and almost non existent. (This is not all of the time.. There have been times my waitresses has been awesome) In particular, last night our waitress took 20 minutes to bring us our drinks and chips and salsa. She never asked us for refills on anything. In addition, she also forgot to bring my friend her food.. I can't imagine tacos take an hour to make. \n\nIt's unfortunate because sometimes I go to cactus and everything is great, but lately I've been walking out disappointed. I will likely go back intermittently because you can't beat 10 wings for 3.50, but I would never go there for any other food. If you want good Mexican, you should walk down to La Taqueria Feliz.. much better food and service."
    },
    {
        "id": 264,
        "text": "I come here after my weekday softball games. Love the wings and chips/salsa! Tony and his staff are always pleasant and welcoming. Definitely recommend!"
    },
    {
        "id": 265,
        "text": "Cactus is the only restaurant I've been to where I've had to stop eating the food because it was so terrible. I gagged several times while trying to eat their beef \"enchiladas\". It was just a plate of greasy ground beef and a big heap of burnt cheese. It didn't even come with enchilada sauce to help drown out the disgusting mess of whatever it was on my plate.\n\nI had their nachos previously which are actually pretty good, but holy crap were their enchiladas impossible to eat without gagging. \n\nThe margaritas came with flies in the mix, too.\n\nI won't go there again for sure."
    },
    {
        "id": 266,
        "text": "Amazing service, amazing tacos, amazing drinks. If you want a nice afternoon with Mexican flavor, this is the spot to go to."
    },
    {
        "id": 267,
        "text": "I'm reposting this because yelp hid it away in the \"not recommended\" section. Screw you yelp, I will not be censored.\n\nMy girlfriend and I go here on a near biweekly basis, thats not an exaggeration. The food isn't out of this world or anything but its always delicious and they've got the best margaritas anywhere (if you like them sweet). The brownie dessert which they just added a few months ago is one of my favorite desserts of all time. Recommend the quesadilla and the cactus nachos (with corn), so f-ing good."
    },
    {
        "id": 268,
        "text": "My girlfriend and I stopped here by chance on a Saturday around 4 pm. There were only a couple at the bar and a couple at a table so we made the third couple. The only employee visible was the bartender who let us seat ourselves but quickly approached us with chips and salsa.  She was pleasant and helpful throughout our service. She was very attentive considering she had to wait on 3 tables, make the drinks, and run up and down stairs to retrieve the food.  Her service was 5 stars.\n\nWe ordered a pitcher of Sangria, chicken enchiladas and a loaded 5-alarm burrito.  Sangria was definitely premixed, but delicious. It had plenty of alcohol for my liking.  My girlfriend's enchiladas were flavorful and chicken was moist. My burrito was well seasoned throughout and very fresh. In my opinion,  the enchilada sauce is not authentic, but it didn't detract too much from the rest of the meal.  Food was 4 stars.\n\nThe decor and feel of the place is very much main street Manayunk.  Clean and modern eatery during the day, but obvious night life place for social drinks.  Simple wall decor with multiple chalkboards displaying the drink specials caters more to the drinking crowd. Decor was 4 stars.\n\nOverall we were pleased with this experience and would recommend it to others.  I'm disappointed that previous reviews say poor things about the Margaritas, but we did avoid them for that reason. Perhaps we will try them ourselves on a future visit."
    },
    {
        "id": 269,
        "text": "Tony is AMAZING! Drinks and chips were great, and service was phenomenal. Will definitely be back!"
    },
    {
        "id": 270,
        "text": "Very slow service on online orders I always wait for them. I believe thats something they dont care at all."
    },
    {
        "id": 271,
        "text": "The worst service I've gotten here. I've been here a couple of times and the drinks are not good at all your better off ordering beers. But this time around it took forever to get our food and the service was horrible the waiter even threw my friends change on the table after he said he needed the change back. Meaning he was expecting to get tipped even after treating us like an after thought. Wish I could do 0 stars, never going back again. And to make it worst it was 5 de Mayo, thanks for ruining that for us."
    },
    {
        "id": 272,
        "text": "Great atmosphere with good prices. Wing night is awesome. One of the few staples in Manayunk."
    },
    {
        "id": 273,
        "text": "My boyfriend and I were dining in for the cheap wings. We asked our server for another order to go and if it was the same price. She said no. So we asked what if we got them for dining in but then boxed them to go...she said yes?? Lmao, I was surprised that worked? Lol... anyways the manager came over as expected and apologized because our server was wrong but he would still honor the discounted price for half the order."
    },
    {
        "id": 274,
        "text": "best service/drinks in manayunk! eric my bartender was efficient and knew how to make the perfect drinks. will definitely return!"
    },
    {
        "id": 275,
        "text": "Out of all of the Mexican restaurants in Manayunk, Cactus is by far the best. Not only does it have the friendliest service, but also the most delicious food. The chips are fresh and the salsa has a great, smoky flavor. If I don't get the steak quesadilla, I usually will split an appetizer and the chicken fajitas for two with my wife. That's after a pitcher of margaritas with salt. Don't miss out on the happy hour deals or Saturday brunch!"
    },
    {
        "id": 276,
        "text": "Had planned on going to another Manayunk restaurant but parking was so bad I had to park all the way on the other side of Main Street so my mom and I decided to just go to Cactus because it was close.  It was not my first time at Cactus and I didn't remember loving it but wanted to give it another chance.  We ordered from the very limited menu some nachos and some tacos to share.  I felt prices were way too high for the volume of food we got.  Our order took FOREVER and everyone around us seemed to get their food way ahead of us.  We saw a waiter carry our food and then he was staring at it really closely.  He showed another waiter and then headed back downstairs.  This was concerning.  When the nachos finally arrived they seemed much smaller than expected, as though someone had scraped off all the side nachos.  We got vegetarian nachos and yet there was chicken sprinkled all throughout.  Obviously they had realized that we didn't order the chicken and tried just scraping it off and hoping we wouldn't notice.  Fortunately I eat meat so it was okay, but what if I had been really allergic to chicken or a vegetarian?\n\nThe food was okay but not great and given the prices I really don't see any need to go back to Cactus again.  It's just not that great."
    },
    {
        "id": 277,
        "text": "Food here is delicious. After my second visit they knew who I was already. Staff makes you feel like family, always joking around and poking fun, equates to a good time every time. Kyle has to be my favorite bartender in manayunk hands down. Tony is a phenomenal owner and manager of both bayou and cactus. Highly recommend"
    },
    {
        "id": 278,
        "text": "This is a fun place for a casual meal or drink... The specials are excellent,, especially the 10 dollar margartia Mondays and 25 cent chicken wing Wednesdays.. The waitresses are young and cute and always helpful.. The food is consistent and I recommend the quesadillas, burritos and sandwiches... If you are a craft beer fan, the selection on both draft and bottles is excellent.. The games are on the TVs also so if you like to watch the game along with your meal and drink its a good place for that... Its a young crowd here too so be prepared for that..."
    },
    {
        "id": 279,
        "text": "I'm a big fan of free chips and dips and whatnot, however, I am not a fan of stale chips and flavorless dip and this happens to be what I got at Cactus. \n\nI enjoyed the decor but the food wasn't really anything special or out of the ordinary, especially with the prices they charge. They have taco Tuesdays where tacos are 2 bucks each...Let's just say I'd refer you to taco bell before telling you to come here for tacos.\n\nIn any case, also on Tuesdays, they have their \"Cactus Margarita\" for 5 bucks. I'm not gonna say it's a great deal because it tastes like something straight outta the mix bottle, therefore, something I could've made for myself and a bunch of friends for much less than $5 per head.\n\nI've eaten at the Cactus twice- the first time wasn't a great time and I swung back for a 2nd round just in case I could prove myself wrong but alas, I've come to the conclusion that I won't be making a 3rd trip here."
    },
    {
        "id": 280,
        "text": "Been wanting to try Cactus since I read about it in the Inquirer. Not impressed.\n\nThe chips were below average (mass produced, not home made)...and very stale! The salsa tasted like pureed tomatoes with specks of cilantro...it was awful...no flavor! If you're going to be a southwest/mexican themed restaurant, it's essential to have respectable chips and salsa.\n\nThe so-called spicy caesar salad was average (and not spicy)...it could have been worse, but also could have been much better. The chicken tacos were ok, but not much flavor or creativity.\n\nThe Lobster Quesadillas were ok, but again, could be better.\n\nThe limes in our drinks were old, discolored, and dried out. I requested some extras and they were more of the same.\n\nThe service was spotty, with very young, unexperienced, and poorly trained servers.\n\nMens bathroom was exceptionally clean.\n\nBottom line - there are so many better southwest and authentic mexican restaurants in the philly area. I won't be going back to this one."
    },
    {
        "id": 281,
        "text": "It was a bustling Thursday night and we were wandering Manayunk for a good 30 min before we settled on Cactus Restaurant. It was one of the places that had seating available last minute for 6 and their billboard of 50 different margarita flavors and pitchers, and $5 quesadillas enticed us in.\n\nOh the regrets. Make a reservation and go elsewhere.  \n\nWe got their mango jalapeño margarita pitcher, green apple margarita pitcher $5 chicken quesadilla, queso dip, and seasoned fries (can't remember the name and it's not on their online menu for some reason).  \n- Margaritas: The flavors were not bad; don't let the jalapeno deter you - it's not that spicy... but I could not taste ANY alcohol and there was SO MUCH ICE. Not really worth it. \n- Chicken quesadillas: This  was dry and flavorless with minimal cheese and chicken. No amount of their salsa or sour cream could salvage it. The hot sauce helped.\n- Queso dip was ordered by a friend and I didn't try - but they left 75% of it behind.\n- Seasoned fries: These were NOT seasoned. The best part of this was the cooked jalapeno and onions on it. Might as well have gotten regular fries. \n\nAll in all. I'm not coming back here. There are so many better choices in Manayunk."
    },
    {
        "id": 282,
        "text": "Had the best time tonight all because of Colleen! My absolute favorite bartender in manayunk. Great drinks and super fun vibe. Thanks Colleen!"
    },
    {
        "id": 283,
        "text": "I'm sorta shocked that this place doesnt have better reviews, Im always happy with my order and the staff has always been ok. And the chips are pretty good, although only one basket is free, waitress forgot to mention if u ask for a refill they charge each time."
    },
    {
        "id": 284,
        "text": "A solidly three star restaurant. We stopped by for lunch during the Manayunk Arts Festival to rest our legs and enjoy the air conditioning. The wait staff was very friendly and efficient dashing from table to table helping customers. We were expecting a Mexican restaurant, but this place is more of a tex mex establishment with typical bar decor. They serve \"Americanized\" Mexican meals like burritos and tacos that didn't have any exotic ingredients. The plates were plastic (picnic type) which was odd, but maybe it was just due to the arts festival. The food was ok. I had the breakfast burrito which was good, but not spectacular.  It came with a side of tortilla chips, but no salsa was offered."
    },
    {
        "id": 285,
        "text": "Went for $0.25 Wednesday wing night,  they only have one flavor of wings... a mild buffalo. Cannot get a to go box if you dont make an additional food purchase or drink. Their complimentary chips and salsa were really good. Service was speedy and friendly. Will definitely try again, they have lots of specials!"
    },
    {
        "id": 286,
        "text": "No utensils. Dirty bathroom. Cafeteria food. Pretty sure the bartender was high AF because he was so confused and there was hardly anyone there. I felt bad for him though, so I still tipped him well. Kinda depressing."
    },
    {
        "id": 287,
        "text": "Cactus has pretty good food. The waiters and waitresses are always friendly. They have really good weekday specials, too. Plus, they give you unlimited chips and salsa, which might be one of my favorite things about the place. \n\nTheir margaritas can be kind of expensive. On Mondays, they do Margarita Monday, which means you get a pitcher (maybe 4 margaritas) for ten dollars. They're a little watered down, but it's still a pretty good deal. \n\nI'd recommend you check it out during happy hour for some good specials."
    },
    {
        "id": 288,
        "text": "I don't usually complain on here, but I figured I should include some place I thought was awful, instead of just my 5-star places.  Cactus is a good place to drink (so I've been told) but unless you are stoned out of your mind, don't order food there.  We went for a cheap brunch with the kids and I had to choke my food down.  It was a total waste.  NOTHING was flavorful.  Everything was dried out and barely edible.  Sooo... good crowd and drinking bar - yes.  Restaurant, NO!!!!"
    },
    {
        "id": 289,
        "text": "The burritos are really good! I have gotten the shrimp burrito twice and it was great. If soda is your thing the sodas taste really strange maybe due to the water in the area so I would maybe steer clear of that. I have forgotten my ID both times but def trying a margarita next time, they have a great happy hour."
    },
    {
        "id": 290,
        "text": "This was a great spot to go after being in the cold for so long for the Eagles Super Bowl parade. At the time there was one waitress on the floor but she was amazing (she even let me charge my phone, true angle). We were able to get street parking right in front if the restaurant and as a party of 4, was seated very quickly. In addition the staff was extremely polite. They had a special of $0.35 wings with a Smokey buffalo sauce. It was great and the price was even better for 10 wings. My only complaint was that a basket of unseason fries cause $7.00, that overpricing a item with no real value. A lot of specials start later so I would recommend this place for and evening time of spot unless you don't want a crowd its perfect  for the lunch hour as well."
    },
    {
        "id": 291,
        "text": "Best nachos in town. Get the cactus nachos. Bartender Kyle is great. Recommend Taco Tuesday also."
    },
    {
        "id": 292,
        "text": "Got take out from this place today. I am not one to complain about food - ever, but this was my worst dining experience. The portion was tiny, compared to the price. The presentation was almost Fyre Festival-like and the taste was on the verge of mediocrity."
    },
    {
        "id": 293,
        "text": "I never give one star to any establishment lightly, but from the time we got there it was honestly the worst experience.\n\nWe walked in and immediately asked to be seated outside. The host accommodated us even though there was only a two seat table left. Our waitress took about fifteen minutes to even acknowledge us. It wasn't that busy. Just a regular Tuesday night. She was apologetic so we said it happens - no big deal. \n\nWell if didn't end there. We each ordered the classic margarita and I got two beef tacos. She took our orders and said she would be back with waters. A whole 25 minutes went by and she finally brought over the margaritas. I have to rant here - they were awful. Tasted like watered down sour mix. My friend finally reminded her that we never got waters. She apologized and went to get them for us. She brought back two glasses when there were three of us at the table. At this point we are all just confused at the service. \n\nFinally - the tacos arrive. They looked underwhelming but I was so hungry I took a bite right away. It tasted bland so I opened it to put hot sauce on it. At a closer look - I found a long hair that was buried in the sour cream. I waved the waitress down to tell her and she took them away immediately. I told her I no longer wanted food and she could tell I was upset. To make matters worse, no one came out to acknowledge what happened nor offered to comp our drinks for the horrendous experience we had. \n\nWe all left incredibly disappointed and most likely will never return. Save your money - go somewhere else."
    },
    {
        "id": 294,
        "text": "I wasn't the greatest fan of the food. The chips were ok but the salsa- I couldn't tell if it was actually salsa or some other random sauce. It was very smooth and sweet, which are terrible adjectives salsa at a Mexican place. My friend and I got the veggie [mushroom] burrito. It was ok. Not the worst, but definitely not the best. It had some flavors coming through from the mushroom, rice, and beans, but was lacking seasoning and a bit of salt. It was also a bit dry on the inside."
    },
    {
        "id": 295,
        "text": "Came in with a group of 20+ and the staff was very accommodating. Our waiter, Kyle was awesome and so was the food! Will definitely be back."
    },
    {
        "id": 296,
        "text": "This place was great, tonight was the guava margarita special and it was so delicious. I loved that they had out door seating!"
    },
    {
        "id": 297,
        "text": "Really a sports bar. \nOrdered chicken enchiladas which, including the black beans and rice were lukewarm. My friend's burrito was hot. I declined to have it warmed and ordered a chicken fajita salad which was fine.\nService rather lackadaisical.\nNo reason to go back."
    },
    {
        "id": 298,
        "text": "Meh.  The food sucks, to be honest.  I mean, it's greasy and fatty -- which can be good, very good, even -- but it's just too poor quality to be worth eating again.  The taco shells look like the type you buy from the supermarket, they put too much cheese on their nachos (which, seriously, for me is basically impossible).  HOWEVER, they give you free chips and salsa, which is always a plus, the service is friendly, and they have cheap margs.  It's worth a shot for people on a budget or people who want to get marg-wasted.  But, if you care about the quality of your food, you should go to tacqueria feliz a few blocks down the street."
    },
    {
        "id": 299,
        "text": "1 ounce of \"guacamole\" for $11. There was no flavor. Just mashed avocado. Insanity. I ordered via DoorDash and my order was royally screwed up in all facets. \n\nNot worth it. Next time I'll just not eat"
    },
    {
        "id": 300,
        "text": "I love this place! Every time I have been here the service was awesome. I usually go to Cactus to get a couple of drinks with friends, but I can never resist getting food there too. They have the best nachos on Main St. without a doubt. The fish tacos are also really good. Overall, I would say this place has everything you would expect from a great bar with the added bonus of delicious bar food and great service."
    },
    {
        "id": 301,
        "text": "I went for breakfast with 7 people on Sunday.  We had a great time. Service was great and so was the Sangria....it tasted just right..!  Everyone enjoyed their b-fasts...everyone got omelets  or wraps.  I am looking forward to doing a dinner there.\nI saw they are doing a Fajitas and Ritas on Monday night....$8.99 for fajitas and $5 for ritas.\n1/2 price sangria on sundays!"
    },
    {
        "id": 302,
        "text": "I went in to Cactus with a group of friends for dinner last Saturday night. The food is really good considering how reasonably priced it is. There are a lot of placed in the Yunk in which you can pay twice as much and receive inferior food. They have the college football package which is really cool. We were watching three different games at once while we ate, and our waiter was a lot of fun to talk to...he knew a lot about both beer and football which made for good drinks and interesting discussion. \n\nWe had originally planned to go to the brew pub after dinner but we ended up staying. They were running a ladies night special and there were A LOT of hot girls in there. We ended up closing the place down and having a blast. I'll definitely be there again soon."
    },
    {
        "id": 303,
        "text": "If you asked your whitest friend to please make the least spicy food possible, then restricted him from using salt or pepper, this is what those tacos would taste like."
    },
    {
        "id": 304,
        "text": "Very unprofessional establishment. I was a solo diner on a Tuesday night and was yelled at for asking for a table for one.. the guy \n  who worked there claimed he was working alone and couldn't help me for 20 mins. Furthermore the place reeked of trash and old sponges as soon as you walk in.. AVOID this dump. Gladly left and went to the place next door instead."
    },
    {
        "id": 305,
        "text": "Small bar but great Mexican Food!  any the tacos are great!  I prefer the pork, but the usually get some of the beef and chicken too!  Fresh nachos are always great for dippin with the salsa they make in house.  I am a big fan of the Texas Shrimp and the firecrackers!\n\nTHe kitchen is open late so I like stopping by for a beer  and a late nite snack!\n\nReally good draft beer selection - always something new!\n\nMy girl loves their tequila selection!\n\nLiam makes the best Margaritas in town!\n\nGreat staff and always fun!"
    },
    {
        "id": 306,
        "text": "Pros-- if you are starving you can get fresh food\nCons- flour taco and burrito were dry and not flavorful and not spicy \nIf you want Mexican go to Chipotle."
    },
    {
        "id": 307,
        "text": "Having eaten at several Manayunk restaurants and bars, I totally get the varied reviews. Service and food quality in this neighborhood is often incredibly hit or miss. Fortunately for me, Cactus was totally a hit!\n\nGranted, I hadn't eaten all day, and by six ish this girl was STARVING. Our original restaurant plan ended up being closed on Mondays (why do people do that?), and I remembered a friend telling me about the Monday specials at Cactus. Turned out to be 9 dollar fajitas, any style, and 10 dollar (!) house margarita pitchers. \n\nThe margs ended up being delicious, and surprisingly strong and labor intensive for 10 dollars. We sat the bar; I like to do this in order to stare down my bartender to ensure maximum tequila pours. JK. Kind of. The whole menu looked delicious, if you know what you're getting yourself into. Guys, this is total Tex Mex; not authentic by any stretch. To save myself time and deliberation, we both just got the pulled pork fajitas after the bartender assured us anything with pulled pork was their specialty. And the meat was really good, guys. Tasty and tender. Nothing ground breaking about the fajitas, but everything tasted pretty fresh. Ingredients that were supposed to be cold were cold and ingredients that were supposed to be hot were hot. Service at the bar, even by a bartender in training, was excellent as well. BF and I stuffed ourselves and got a little tipsy (maybe mostly me) for under 40 bucks. steal in manayunk!\n\nAs with any other nearby location, go to Manayunk on OFF nights. Mondays & Tuesdays. Go early or late, depending on when the place is least crowded. Sitting at the bar generally ensures better service, bartenders in Manayunk have the slowest turnovers and are generally better than the waitstaff. Not the rule, just a suggestion."
    },
    {
        "id": 308,
        "text": "I'm usually the first to suggest going to Cactus. Their food is generally solid and prices are reasonable. Unfortunately tonight was not what were used to when we came to pick up a takeout order. Servers and bartenders were pulling down masks while leaning in to talk to patrons and making drinks without masks on. \n\nFood was not nearly as good as usual. The fajitas were the smallest portion I've ever seen. The steak burrito was all fat. The wings were so overdone the bones were cracked and splintered. \n\nI understand COVID has upended many things, but this was beyond anything reasonable."
    },
    {
        "id": 309,
        "text": "Inedible food. Literally the worst meal I've ever been offered at a place claiming to be Mexican. Took one bite, gagged, and walked out."
    },
    {
        "id": 310,
        "text": "I really wanted to like this place but they had a lot of things working against them. I went during the Manayunk Art Festival so I feel like the business of the day was difficult as it is. We weren't able to grab a table outside but they were still able to seat us inside immediately, despite having a larger group of people. \n\nWe decided to order guacamole and a pitcher of sangria for the table. They didn't have enough sangria for a pitcher, so we ended up not being able to get some. That was kind of disappointing that they couldn't make more. I ended up ordering a berry margarita and it was just okay. It seemed like it came from a mix because there were clumps of mix throughout but despite that, the flavor was good. As for the guacamole, it left much to be desired. It tasted like they just mashed up some avocados with some other veggies and that was it. It had no spices or other flavors in it. We ended up asking for salt and pepper and I took the lime from my margarita and put the juice in it. After that, it was decent, but I wouldn't get it again. \n\nThe other food we ordered was just okay. Two of my friends got quesadillas and they looked pretty good. They didn't have any complaints about them. My boyfriend and I ordered the pulled pork tacos to share and honestly they were pretty tasty. The pulled pork was flavorful and went well in the taco. I would get it again if I came back. \n\nAs for the service, it was eh. I felt bad for the waitress, however because of how busy it was and she had to keep coming upstairs for us as we were the only table up there. She did a good job though for what she had to deal with so I didn't mind that it was slow. \n\nI don't know if I would go out of my way to return to Cactus, but I might return again in the future to give them another chance!"
    },
    {
        "id": 311,
        "text": "I use to love this place but have been trying other Mexican places in the area and have come to the conclusion that cactus is in fact a pretty sub par Mexican restaurant. The margaritas taste good but are 75% ice. They recently changed their pitchers and made them smaller so buying a pitcher doesn't save you anything. The chips are usually stale, guacamole is extremely bland, and entrees are mostly cheese."
    },
    {
        "id": 312,
        "text": "I have never had anything short of a wonderful experience at Cactus. From the service, to the food, to the drinks (Margarita pitchers for $10?? That's financially irresponsible to not buy one .. or two ..), everything is exquisite. The servers and bartenders both know an insane amount about what is offered behind the bar, and the food is incredible. The chips are always super fresh (they have a warmer for them right when you walk in) and the salsa is delicious. I asked for hot sauce and got about seven options. Thank you Cactus, for never disappointing!"
    },
    {
        "id": 313,
        "text": "Monday night we thought it would be dead and boring but when we walked into cactus for my friend 21 st bday, our bartender Colleen was amazing! She made our night the best! She even gave us green tea shots which happened to be our my friends favorite type of shot! It was meant to be!! Thank you Colleen!"
    },
    {
        "id": 314,
        "text": "Dive bar with okay price points for Manayunk.\n\nDesert Heat Chili - Lot of beans in this one and not a ton of actual Chili. The spice level was high but my girlfriend and I both did not care for it and the waiter was nice enough to take it off the check.\n\nChips and Salsa - First round is for free! If it is free it is for me! Or is it? The reason I pose this question is because the chips were not hot and the sauce by God man you MUST have good salsa if you are going to call yourself a Mexican restaurant! If you are looking for sauce with a good kick go to Taqueria Felix.\n\nSanta Fe Eggrools - This was the winner of the day. Chicken, corn, and black beans stuffed in a very soft pastry like egg roll cut up into about 6 small pieces with some ranch dipping side in the middle. This appetizer goes for $9.95 at full price. Didn't seem like a steal of deal but food was improving after the first two fails.\n\nSteak Fajitas - The steak was much better then expected. I have had the Fajitas several times at the Cactus's competitor Taqueria Felix and I can say hands down the Fajitas at this place are the better deal. \n\nI would not run back to this place but would certainly entertain the idea of coming back for a happy hour. And as always people SYOY!!"
    },
    {
        "id": 315,
        "text": "NOT the place to be on Cinco de Mayo. There was one guy. No mask. He's running around. He looked super overwhelmed. There was no order around the place so I just went up to the table and asked if I could order. It was roughly 7:20ish. He goes IM NOT TAKIN ANYMORE ORDERS UNTIL 10/11. \n\nI was like uh...what about margaritas. Here's the thing. We saw the sign. Says margaritas. (We being the boyfriend and I) we are like hell yeah. Just got our tacos from taqueria feliz (they dropped the ball a little but even in them dropping the ball their service is phenomenal) we were hype to see such easy access to margaritas. \n\nSo I ask about the margaritas. He says oh yeah I can do that. I ask if he does non frozen. He looks and says I only have mango (not the answer to my question but cool since that's what the bf and I want) so he goes makes them. They're huge. I'm hype. (Although he did put the straw in with his bare hands. Oh yeah no mask no gloves nothing) The outdoor menus says taco Tuesdays $5 margaritas. \n\nMakes them. Hands them over. $40. I literally felt my heart skip a beat. WHAT?! He says 32oz $40. I said but the sign it says $5 for Tuesday's. He goes that's in house only. \n\nSIR WE ARE IN THE MIDDLE OF A PANDEMIC WHEN WAS THE LAST TIME YOU HAD IN HOUSE SERVICE?! \n\n\nSo I'm looking because the sign that says frozen margaritas which is on the other wall doesn't have any price. Just \"FROZEN MARGARITAS ORIGINAL/MANGO/CHERRY\" \n\nNo price. \n\nHe goes if you don't want them I'll take them back. I hesitated and the only got one. Highway robbery. Period. \n\nIt's wildly unacceptable to have that up there....KNOW YOU HAVE SPECIALS EVERY DAY....and then say oh but those are in house. As if there's not a pandemic. Other places still have their daily deals. I didn't think anything of it that they had their daily deals as well. \n\n\n\nMan....so now I'm drinking a watered down margarita because (it was with chopped ice) and out $20 instead of $10. \n\nI hope no one else is swindled by them. Hence my yelp review. \n\nI would have done better going and getting a cider from my local sandwich shop.\n\n\nEdit: this has no alcohol in it. Makes sense why I wasn't carded."
    },
    {
        "id": 316,
        "text": "Food is so bad. If I were you I would not order the food, not authentic and honestly Taco Bell does a better job than this place, sad to say. Food was bland, sloppy and bad quality. This place has a good location for people watching..... and that's about it."
    },
    {
        "id": 317,
        "text": "I was really impressed by this relatively new addition to the Manayunk restaurant scene. Our party of four all ordered different things and shared...impossible to tell who had the best dish because they were all so good! We ordered the pulled pork quesadilla which was stuffed thick with the good stuff. The pulled pork was incredible... I think my favorite might have been the texas shrimp pasta. It was spicy and creamy and absolutely fantastic. Additionally the margarita menu had more options that what I'm used to and the tequila selection was impressive. Our server was incredibly knowledgeable about the drinks and beers. He was also quite funny and had our table laughing several times. We will definitely be going back and asking for \"the big guy\" as our waiter again! Two thumbs up!"
    },
    {
        "id": 318,
        "text": "3/2/2021 ~ Recently took a trip to Main St in Manayunk and ended up at Cactus: Restaurant & Bar. In my younger days I used to frequent Main Street for many a happy hour and cheap, but delectable eats. That being said it's been some time since I've done so and yesterday brought back a feeling of nostalgia. After a circuit workout with a friend we decided that we deserved a treat for our hard work and stopped in for some food and drinks. We were greeted by the bartender/server and were told to sit anywhere we liked (seating was limited due to covid restrictions). It wasn't very busy as there were only a couple tables, but the server/bartender did a good job of working the restaurant to make sure everyone was tended to. Once informed that Tuesday was $2 taco night it was an easy decision, tacos it was. I tried each of the tacos (beef, chicken, and pork) and they were pretty basic tacos with meat, lettuce, and cheese with sour scream and hot sauce on the side. I'm not going to lie, the tacos were a little dry and nothing exceptional to write home about but for $2 who can complain. Wings were also had and thoroughly devoured. The wings come in orders of 10 and are fried hard just like I like, they come with ranch on the side as well. For drinks I had a mango-jalapeño margarita, which was very nicely done, that had a decent spice to balance the sweet mango flavor. I also enjoyed the Cactus margarita which was just a plain margarita but it again was nicely done. The ambiance does leave a little to be desired, but I kind of like the understated nature of the décor as it fits the \"theme\" of the restaurant//bar. I would definitely tell people to check this place out, but fair warning it's nothing fancy. It's a no frills restaurant/bar with cheap eats, solid drinks, and interesting playlist that caters to a younger crowd."
    },
    {
        "id": 319,
        "text": "My girlfriend and I go here on a near biweekly basis, thats not an exaggeration. The food isn't out of this world or anything but its always delicious and they've got the best margaritas anywhere (if you like them sweet). The brownie dessert which they just added a few months ago is one of my favorite desserts of all time. Recommend the quesadilla and the cactus nachos (with corn), so f-ing good."
    },
    {
        "id": 320,
        "text": "Amazing Mexican I don't know what these people are writing about.. great drink deals & delicious appetizers!!! Can't beat the 35 cent wings on Thursdays - crispy!! Highly recommend."
    },
    {
        "id": 321,
        "text": "Eric and Tony were extremely great they catered to my friend and I needs while we while we dined here. If you need a place in Manayunk to go this is the place to go!!!!!!!!! Love it."
    },
    {
        "id": 322,
        "text": "Good food, great drinks and reasonable prices. It's a comfortable atmosphere and my friends and I had a great time there last week for our girl's night out. The only bummer was that they had a decent tequila selection that I wanted to try but it was a tad pricey. No doubt I'll go back but I'll have to start a tequila fund."
    },
    {
        "id": 323,
        "text": "Addicted to The cactus nachos - the corn cheese is amazing the best in town! The Salsa is amazing!"
    },
    {
        "id": 324,
        "text": "No stars for this place. I was met at the front door by a crass guy in a Hawaiian shirt who gave us lascivious looks. Should have walked out then. He sat us at our table and said they had great drinks and the food was O.K. Should have walked out then. Drunk guys at the bar staring at my daughter. Should have walked out then. Ordered  a pitcher of undrinkable mango margaritas and nachos gooped in Velveeta like cheese. Walked out."
    },
    {
        "id": 325,
        "text": "I love this place!!! The chips and salsa are great and their nachos are awesome!!! The drinks are very tasty. No complaints! The Mgr Tony is hilarious and constantly came to ask if we needed anything. I would highly recommend this place. I will be coming back next weekend."
    },
    {
        "id": 326,
        "text": "What is not to love about this place?! I absolutely loved everything about this place! The food was amazing, customer service was on point and the music selection was great! My rule when going out is I need to eat pork or something oily to maintain my sobriety the rest of the night. I ordered their pulled pork sandwich which tasted great! Their Long Island was okay, but their Pink El Camino drink was amazing! I maintained my sobriety and had so much fun! Overall, I would definitely recommend this place and I'm thinking of going back next week!"
    },
    {
        "id": 327,
        "text": "When the owners of the bayou opened this I was really hoping it would be exactly like the bayou but with Mexican food. Would love a place with really cheap tacos and Margs in manayunk. \n\nIt's nicer than that. The space is night. Food is good but not the best I've ever had. Margaritas are good but pricey. \n\nThe really hot burrito is actually cry hot so watch out."
    }
]