[
    {
        "id": 1,
        "text": "I remember when this was a great restaurant, decades ago.  So,as we're walking by heading for Indian food, one companion tells us about the G.R. makeover, so we go in.  Well, he may have changed the management and the menu, but he forgot to introduce the kitchen staff to their spice shelf.  My chicken mole looked nice, but the sauce had zero taste.  The steak tacos, while done with good meat [diner was not asked how he wanted his steak, by the way, and it was rarer than he likes] but the steak was totally unseasoned so didn't have any pizazz.  I won't be back."
    },
    {
        "id": 2,
        "text": "Trying very hard to be a high-priced fine dining establishment, but all you get are small portions of food for an exorbitant price.  I've said this before, and I will say it again:  please don't charge me for chips and salsa.  Five bucks for a small 4-ounce bowl of salsa and a basket of chips is insane.  I will not be going to Zocalo again."
    },
    {
        "id": 3,
        "text": "About 25 years ago, I hit Zocalo with one of my kitchen buds, Mark V. What an incredible experience - my first savory cocktail (Pablotini with a habanero), first true mole, first kiss in a life long love of chorizo. We knew Jackie and Lou professionally and from the restaurant school. Long before JG made the seen, they were rockin nuevo mex. For about 5 years, we would make a pilgrimmage and each time, introduce our friends to the incredible cuisine and dining experience. Then came kids...\n\nWell, a quarter century later, son number two goes to Drexel and we've been to Zocalo two times in the last six months after a long, long hiatus. Good things - the prices are reasonable adn the service was fast. The carnitas and chicken were flavorable and juicy. the guac was better than average. As for the rest., the service was more or less indifferent, maybe because the servers are staring at an iPad while they wait on you. The food was ok, but has completely lost the balanced authenticity and innovativation sparkle that made this place stand out back in the day. \n\nI might go back for a taco and a beer at happy hour, otherwise ... no mas, no otra vez. Gordon Ramsey? Bring back Jackie and Lou!"
    },
    {
        "id": 4,
        "text": "the red sangria is fine. it tastes like fruit juice...exactly like fruit juice...like as in \"no-really-there-isn't-alcohol-in-here-Betty-drink-more\" and so Betty drinks more and gets really drunk."
    },
    {
        "id": 5,
        "text": "Pumpkin seed salsa is fabulous.  Crab and shrimp empanada will give you sweet dreams. Puffed pastry filled with chocolate yummy!  Oh and my absolute favorite margarita..the tamarind margarita rimmed with pepper....taste like a sour patch kid!  YUMMY!"
    },
    {
        "id": 6,
        "text": "Went for lunch and ordered carnitas tacos ($11).  Lunchmate had the shrimp.  Came on a plate with refried beans, rice, guacamole, sour cream, pico and a basket of corn tortillas on the side.  Serving size was enough for lunch (with a bit leftover).  My food seemed salty...maybe even too salty.  Not just the pork but the rice and beans too.   \n\nAnyway, the guacamole was five-star.  Really, REALLY good.  Better than the other local places (Distrito, Gaucamole, etc...).  The presentation wasn't anything special (served in a clear glass bowl with chips around the side) but it was really fantastic.  I'd go back at happy hour for a margarita and some guac.  For lunch I think I'll continue going to Distrito for the $15 2-course lunch deal."
    },
    {
        "id": 7,
        "text": "I've eaten at Zocalo twice, and never been too impressed. The prices are extremely high for food that is hit or miss.  On a recent lunch trip the shrimp was quite over spiced, and the beans rather watery. Perhaps I have been spoiled by the Mexican food of New York, but charging for ordinary tortilla chips and salsa seems rather silly to me. Both times I have been there the restaurant has been almost empty, likely reflecting the fact that the portions are too small to be worth the price as well. Service was decent but all in all the lunch felt like a waste of time. Just up the block is Lemongrass, a thai restaurant which is a much more satisfying dining experience in my opinion."
    },
    {
        "id": 8,
        "text": "Five stars for the margaritas. My tamarind margarita with the sugar rim was one of the best margs I've ever had. Amazingly delicious. Three stars for the food. My dish would've been excellent if it wasn't so salty! Am I the only reviewer that noticed that? Lordy, I couldn't finish the thing. And the average dips with the delicious chips, along with the silly 12 dollar charge for them, keep it at three stars.\n\nMy friend enjoyed his meal a lot, although he said his was a bit salty, as well. The service was really good. The waitress was very friendly and kept up with me and my friend's dry humor. what a good sport!"
    },
    {
        "id": 9,
        "text": "Decent Mexican fare with good service.  Also one of the few attempts at authentic Mexican food on this side of the city.\n\nPersonally have been to Zocalo a few times, with mixed experiences each time.  The food is on the upper end of decent, with my personal favorite being the chile relleno.  They seem to consistently pick good peppers and the spiced cheese is of a very nice quality, although the same cannot be said about the sides.  The beans routinely seem to be overcooked and the rice way too hard and undercooked.  Very unfortunate, but I guess that the main dish is where they put the most effort.  Students can avail of a 10$ lunch special, which is very very reasonable for a UC eatery with above-average food, and there is also a 25$ prix fixe menu which is a good option for those who aren't too financially constrained.\n\nThe story of the restaurant is nice, with a husband and wife who worked in the food industry for over 30 years outside the city coming together to open their own eatery and serve traditional food.\n\nUnfortunately, the staff seems like they are forced to work there, and this is very evident with the service.  A few are nice, and actually help out with the food selection, but the majority just don't make the cut.\n\nThe bar selection seems to be decent, although I cannot personally comment.\n\nAll in all, decent pricing and above-average food make this place a good visit, and honestly, ymmv, depending on the staff and which chef is there for that day.\n\nGood eats!"
    },
    {
        "id": 10,
        "text": "So I'm not sure where some of the other Yelpers get their Mexican, but I thought Zocalo was amazing.  Located in the heart of University City, the decor is authentic Mexican - yes the owners are Mexican themselves.  Food was fantastic; we ordered from the $25 Prix Fixe menu which gave us our choice of appetizer, entree, and dessert.  Crab and shrimp empanadas melted in your mouth, and the service was attentive and super friendly.  My fiance and I aren't big drinkers, but I've heard great things about their margaritas!"
    },
    {
        "id": 11,
        "text": "Good food, very fresh-- had the nopal salad and carnitas tacos. It was understaffed when we went Thursday night."
    },
    {
        "id": 12,
        "text": "It's regular date-night cost... under 22 dollars for an entree, under 11 for an appetizer. 6-8ish for drinks? 6 for dessert.\n\nAll our food was very good. I got a soup, but it was 9 dollars I think- ouch. Not the best soup, I guess. but the pumpkin empanadas app was AWESOME, about the size of two perogies for 9 dollars... but yummy.\nEntrees are a pretty appropriate meal size. Lots of seasoning in all their food.\n\nWe also got a flan which was a little different than regular flan--- they tell you the syrup is bittersweet. More bitter than sweet. It is a genuine burnt taste of caramel sauce. Not my fave.\n\nWe also tried their Vampira beverage... a bizarre take on the tequila bloody mary that we decided was good. It tastes like they added worcester shire sauce or something... it reminds me of venison marinade. You might want to get one to share with someone to try it.\n\nService was sort of awkward. And it's cold in there in the wintertime, so of course they put you next to the window. Just ask to move, they understand. Asking for personal opinions helps the staff warm up to you, instead of seeming dissatisfied with their job. A bit slow, though.\n\nThe place is beautifully decorated with all hand-made decor  from mexico, including the tables, chairs, custom dishes, curtains, photographs."
    },
    {
        "id": 13,
        "text": "This place is consistently terrific.  You basically can't go wrong in whatever you order.  The service is friendly, the ambience is memorable thanks to the hand-carved furnishings.  Much to be preferred over Distrito--no pretentiousness here, just good, well-prepared food."
    },
    {
        "id": 14,
        "text": "Their is nothing authentic about the food at Zocalo. The burrito was lackluster and fell a part. I've had better food at Chipotle.\""
    },
    {
        "id": 15,
        "text": "The Cochinita Pibil is marinated and slow-cooked until it is wonderfully tender and full of flavor.  I get this every single time and will probably continue to do so.  The accompanying rice is nicely seasoned and fluffy, although I'm not a fan of the fried plantains.  The crab and shrimp empanadas are a nice diversion from the usual beef, pork, and chicken, and the guacamole is very fresh.  The service is very friendly and the sangria is great.  If you're a margarita person, they have pitchers of those, too.  The menu isn't very extensive but they do a good job on the dishes that are offered.  A nice place to grab some Mexican food and ritas."
    },
    {
        "id": 16,
        "text": "The decor is, as has been remarked, incredible, with hand-carved and -painted tables and chairs.  Service was excellent, although it was late on a Sunday and therefore not a good test of what service would be like when the restaurant is full.  My one complaint is that they could have used a little more of the Chinese restaurant water-glass ethic of constant refills.  The food was hardly spicy at all--if you like hot food, you should let them know and I assume they will make it hotter--but was incredibly flavorful and well-seasoned.  This is not your typical American Mexican place, and if that is what you are looking for you will be sorely disappointed.  It is, however, an upscale restaurant to compete with the best of Philadelphia, only at half the price or less."
    },
    {
        "id": 17,
        "text": "Went to this place about a year ago, so this review may not be a fair assessment  of it's current standing.\n\nAnyway...\n\nNo complaints about the environment. It was definitely a cute little restaurant -converted from a house, it has indoor and outdoor seating with appealing decor (dont remember exactly what haha...but i remember thinking it was very tasteful).\n\nThe menu was typical of any mexican restaurant. We ordered drinks that were very small for the price tag. I don't know if the waitress was new, but she was pretty clueless about the menu items. We decided to keep it simple and order some traditional favorites. The queso fundido came out - tried and immensely disliked. It was basically spicy ground beef with cheese melted on top. We both got fajitas - both sub par. \n\nWe got the bill and could not believe we were going to have to spend that amount of money for the meal we just had (like $90 for the both of us). Should have just gone to Lolita for that price....or Qdoba, which probably would have been more satisfying for 1/5th the price."
    },
    {
        "id": 18,
        "text": "Wow, what a disappointment. Very, very overpriced, the food was really boring and they couldn't get us out of there fast enough. The service consisted of someone coming over every couple of minutes and trying to take the plates away while you were still chewing.\n\nI had the enchiladas which were pretty flavorless and tasted the shredded pork, which was better - but probably just because it was heavily salted. The flan was slightly bitter and the burnt tasting. The best thing about this place was the margaritas. Unless you're into giving money away for no good reason, go somewhere else."
    },
    {
        "id": 19,
        "text": "I think I would rather throw $20 in the Schuylkill and hope someone finds it than ever go back to this place. It really stinks.\n\nThe food was bland, the place was empty and it was overpriced. The location on the corner and the deck have a lot of potential, but instead it is just an empty and bland place. No personality. I think the neighborhood and block would benefit from a little life on the corner -- why not drop the prices a bit (like in half), make the place actually fun, and have some customers? Word on the street is that the owners are absentee and have a pile of cash and no interest in making their restaurant appealing. Otherwise, how does a place like this -- with no atmosphere or customers -- survive in a neighborhood full of college kids?"
    },
    {
        "id": 20,
        "text": "I went here for dinner :\na) since it is relatively close to my apartment.\nb) i was craving mexican food\nc) I'm always down to try a new restaurant\n\nAnyways, the atmosphere was great, its rare to find a place with enough outdoor seating that is spacious enough so you aren't bumping into the people seating directly behind you.  The dishes were not bad, quite tasty, but what else is there to expect from mexican food?  Duly note that the prices are a bit on the higher end.\n\nAfter dinner however, my stomach did not feel so good.  But, I think that's just how my handles mexican food... Just be wary."
    },
    {
        "id": 21,
        "text": "Have been here a few times, both for snacks/drinks at the bar and for a sit down meal. I've enjoyed both experiences. I really like University City and am always happy to find another worthwhile eatery in an ever evolving section of the city. The interior is very homey and relaxing. I've been treated very well by the bartender and when we ate at a table the service was good as well, even with my 2 year old along. As far as the food goes, the guacamole is very tasty, the salsa fresh and spicy and I love the thin tortilla chips. They're well worth the couple extra dollars. Main dishes are good too. There's more authentic Mexican dishes as well as some of the regular Americanized classics. All were very good. The sides (rice and/or beans) were a touch on the bland side. I wouldn't consider the prices to be cheap, but they're not outrageous. It's been empty every time I've been which I hope is not a sign of things to come. I'm looking forward to my next visit."
    },
    {
        "id": 22,
        "text": "Went there with a large group of people from work for lunch. Really nice decor, decent bar area. I would like to come back for happy hour to see how it is.\n\nFood was very good, although portions were so-so. A little over priced but I enjoyed the chicken quesadillas. Service was a bit slow but maybe it was because of our group size.\n\nOverall, if you enjoy mexican I'm sure the lunch trucks can give you a good meal at a good price. If you want a nice setting give this place a try."
    },
    {
        "id": 23,
        "text": "service has always been great, food though for beening in a u-city neighborhood is over priced for small portions. also i can only sit so long listeing to mexican opera"
    },
    {
        "id": 24,
        "text": "We went to Zocalo a couple months ago because it's pretty much the only Mexican restaurant in the area.  We wished we hadn't, and we haven't been back since although we live just a few blocks away.\n\nThe sauce on our rellenos was an almost Italian-style red sauce.  You could've poured it over spaghetti, truth be told. The butterfly shrimp were exorbitantly priced, to say the least.  In short, the food was overpriced and hardly ought to be described as \"Mexican.\"  The drinks were extremely expensive.\n\nSo why am I writing this review?  Because it's lamentable that there are so few decent restaurants in West Philly.  When will a good Mexican place finally move into the area?  It's really sad that there are two universities and long-standing neighborhoods here and cheesesteak, pizza, and hoagies dominate the dine-out market.\n\nBut maybe it's more reasonable for lunch..."
    },
    {
        "id": 25,
        "text": "Went here for dinner on a Thursday night unplanned, was walking with a friend and we liked the menu. They have a cute area to sit outside. Zocalo has the best guacamole, it was fresh with chunks of avocado and just a hint of lime. I split the chicken burrito since the portion is huge, and we filled up on chips & guac! It was very tasty and not to spicy, the chicken was shredded and very tender. We both had frozen margaritas which were very refreshing and I couldn't taste the tequila which is fine with me, since I am not a huge fan of  the taste of tequila. Our waiter was nice, we were limited on time and he made sure we had our food quickly. It is very cool they use ipads to take your order and payment with a credit card. I will definitely be going back."
    },
    {
        "id": 26,
        "text": "The dinner started out well with great drinks - I had a white sangria with strawberries that was very good and my husband had a margarita with fresh lime juice.  But then our dinners came and I was shocked. The tilapia I ordered was $22 so I had high expectations for it. The fish was moist, but the portion was tiny. Filling up the plate was some plain, stir fried zucchini and a large heap of steam table white rice with peas and square carrot chunks - clearly from frozen. I couldn't believe the low quality of the food for the price i was paying. If I had been charged $8 for this food at diner I would have been satisfied. But not $22."
    },
    {
        "id": 27,
        "text": "Zocalo serves \"high end\" Mexican for what I considered to be outrageous prices.  It's not creative like Lolita and it's smaller portions for higher prices.  Why go here...ever?   Well, when you're trying to stay local to UCity and want to class it up one night you check it out.  \n\nMy crab empanadas were excellent.  Lightly fried and filled with a creamy crab concoction.  Paying like $6 for corn chips and an average tomatillo salsa was ridiculous.  \n\nThe decor was cute and the service was solid, if unspectacular.  I'd only return if someone else was paying.  Even then I'd try and talk them out of it.  Two stars for high prices, small portions, and making me pay for chips and dip."
    },
    {
        "id": 28,
        "text": "Decent food.  Lunch prices are reasonable, but a bit steep for evening fair.  Would definitely go there again at lunchtime."
    },
    {
        "id": 29,
        "text": "Every time I go, I'm disappointed by the poor service. Food is decent but overshadowed by the bad service. Portion are on the smaller side. I hope this place gets their act together. It'd be a shame if they went out of business."
    },
    {
        "id": 30,
        "text": "I really love Zocalo.  They have some of the best guacamole in town (that's not from my kitchen), and some really yummy deserts.\n\nI try to only frequent this place in the summer since I think their dining room is a little cramped and I LOVE their patio, and the patio is perfect for a late afternoon cocktail.  \n\nZocalo can be a bit expensive, but mostly worth it.  I don't recommend the shrimp del diablo, because the amount of spice on them is literally from Beelzebub himself.\n\nThis place has enough awards and Zagat ratings to satisfy a mom, a date, or even a boss."
    },
    {
        "id": 31,
        "text": "We arrived around 5 on a Saturday, as we were with the kids. The hostess asked us if we had reservations which I thought rather strange as no one else was there and this place is huge. My guess is 8-9 groups of people showed up in the hour + we were there. The restaurant is dimly lit, which is strange. It's a Mexican place not an upscale Italian restaurant. \n\nAnyway, when the waiter informs you the margs are sour. Trust him, they suck and I like sour margs... these were undrinkable without a shot of Grand Marnier. \n\nThe guac is pretty good, not too exciting with flavor and the house made salsa was... not good at all. \n\nI ordered the vegetarian enchilada (made with spinach) with the red sauce. The red sauce had no distinct flavor, it was just bad. The rice was okay but the beans were watery and tasteless. Just gross. Hubby had the shrimp special which he said had really no specific flavor and was not spicy at all. I got from the waiter that the chef isn't into spicy food as not much on the menu is. The kids had a quesadilla's made with corn tortillas which they enjoyed but it was just cxn and cheese. FYI, for you fellow Ceiiac's, the chicken is marinated in soy sauce. They happened to have a couple of pieces that hadn't been marinated yet, that's what the kids ate.\n\nI left feeling like I should have just stayed home and ate leftovers."
    },
    {
        "id": 32,
        "text": "I was really hopeful for this place after reading their website, but as my motto states, I am still looking for good Mexican Food in the northeast.\n\nThe Margaritas were OK, nothing great, nothing terrible.  The star of the visit was probably the Guac, but the homemade salsa was disappointing.\n\nMy wife had the enchilada and was disappointed, not much flavor or spice.  I had a special, shrimp in chipotle sauce, which was also disappointing.  Bland, overpriced food.  Luckily we used a Restaurant.com certificate so we saved $25.\n\nThe waiter was very nice, but that does not make up for everything else."
    },
    {
        "id": 33,
        "text": "Oh my what an awkward place. I was waiting for the waiter to go \"Listen, this isn't my real job, my real job is playing bass for a def leopard cover band\". What I am trying to say here, is the service wasn't great. The food is WAY over price, and the quality and portions of our meal were just terrible. \n\nThe place is also an eye sore. The restaurant looks like a middle age divorcee's idea of how to decorate her new apartment as \"south western\".\n\nI didn't know you could mess up Mexican food.\nI learned the true definition of  \"Ignorance is bliss\"."
    },
    {
        "id": 34,
        "text": "When I read about this place, I was excited. Finally a potentially good Mexican place west of the Schuykill(I don't count Distrito since its more Mexican fusion/tapas).\n\nI went here on a lazy Sunday night for a dinner break. The place looks really nice and the decorations are tasteful. It felt warm and comfortable. \n\nI ended up getting an order of empanadas and chicken enchiladas with tomatillo sauce. The empanadas came out first and were filled with  pumpkin blossoms, queso fresco, onion and jalapeno according to the menu. There were pumpkins blossoms, queso fresco and there was jalapeno. But there was enough jalapeno that it took over and prevented me from tasting much onion or the pumpkin blossoms. The empanada skin was nicely baked/fried and they put on enough but not too much crema.\n\nThe enchiladas came out next. For me, enchiladas and salsa are usually two dishes that can tell me whether a place is going to be good or not. Sadly, these enchiladas were pretty mediocre. I got three of them, and they were of pretty decent size/proportion. And there was a fair amount of chicken in them. But the tomatillo sauce was bland at best. It didn't taste like it was made from canned tomatillos, but it definitely hadn't been made in a while because there was no fresh tangy taste with plenty of garlic. It just kinda sat on the enchiladas. Also it was a bit watery for my taste. \n\nService was pretty decent and both the waitress and the bartender were both friendly.\n\nIts sad, this place had potential. But I felt gipped after paying 28 bucks for a mediocre meal that I could have gotten for half as much down on Washington Ave."
    },
    {
        "id": 35,
        "text": "This is my favorite restaurant in Powelton. Aside from the Thai place up the block, it may be the only restaurant without \"pizza\" in the title. \n\nI force my co-workers to take me here for my birthday lunch every year. I also try to get here at least every two months or so for lunch. It is not a bad deal, although when you add the three salsas app and a coke to your bill it comes out to about $15 a head. \n\nI have eaten a couple great meals here. If you like chicken, Pollo Santuario is a good choice. If you like steak, Arrachera is a flavorful dish. I like the empanadas, though its hardly a meal. Guacamole is a favorite as well. \n\n4 stars for being too expensive for dinner. Its like the exact same menu, but the portion isn't any larger and it is twice the price. What happened between 1pm and 7pm that warranted that?"
    },
    {
        "id": 36,
        "text": "I noticed many people complaining about price and size of portions.\nTry going here during UC Dining Days--Its a flat price ($30 I think) and you get TONS of food. The tortillas are handmade by a woman who is stationed right by the bar so you can watch her in action.  I arrived for my dinner early and had some nice drinks and conversation with a friendly bartender. The food is good for mexican. They have all your semi upscale mexican staples...enchiladas, skirt steak, shrimp, fried ice cream and margaritas. The roasted pumpkin seed dip is an interesting twist on salsa--try it!"
    },
    {
        "id": 37,
        "text": "Above-average food, but below average drinks which was disappointing. Service was decent, but not stellar. Indoor and outdoor seating - would be a great place for a large party. I probably won't go back considering there are better drinks in Philly to be had."
    },
    {
        "id": 38,
        "text": "Went here for dinner and I've never heard of this place. I was surprised because it was really really good. I had a little sticker shock when seeing the prices for the entrees but after I had a few sips of my margarita, I was ready to order.\n\nI ordered the flank steak and chorizo entree. It came with guacamole, rice, and refried beans. I was surprised how soon the food came out on a Saturday evening. \n\nThe flank steak was very very good. Perfectly cooked and and tender I put it in a homecooked tortilla that was warmed with rice and the beans and gauc and it was heaven almost. I could have eaten that all night long.\n\nThe meal was very worth price and would go back here again. \nI would like to note that the Hispanic music sounded a lot like the Police except in Spanish."
    },
    {
        "id": 39,
        "text": "Found this restaurant on a lazy Sunday.  Surprisingly, the GF and I were the only patrons between 2 and 3pm.  I guess it was a really lazy Sunday...\n\nFor appetizers, we tried the pumpkin seed dip and guacamole.  While guacamole isn't quite as interesting (or original) as the pumpkin seed, both were amazing.\n\nEverything on the menu sounded tasty, which will make it hard to choose.  Looks like the chef tries to fuse original recipes with local flare.  We decided on the flank steak - the spices were spot on and the portion was perfect.\n\nIf the prices were more reasonable ($45 lunch with tip) I would give this place 5 stars.  Regardless, it is a diamond in the rough.  A great restaurant tucked in a not-so-great part of the city."
    },
    {
        "id": 40,
        "text": "I tried this place out because my mom got me a Restaurant.com coupon (I think that's where it was from)\n\nWe ordered a few things, but the one that stood out to me was the hot lava bowl with cactus. DELICIOUS.\n\nWho knew that those mean prickley looking things tasted so good! I highly recommend that dish if you're looking to try something exotic."
    },
    {
        "id": 41,
        "text": "As much as I hate to admit it, Zocalo isn't on par with most of the other Tex-Mex & Southwestern restaurants located in Philadelphia.  Even though it's a little worse off than other restaurants it still has a memorable decor, service, drinks, & specials.  Located in West Philadelphia, this is for any local looking for a quality Mexican dinner."
    },
    {
        "id": 42,
        "text": "Gordon Ramsay finished redoing the restaurant for Kitchen Nightmares earlier in the week, and we thought it would be a good opportunity to try some of his recipes, and to see what he did to the place.\n\nAs for decor, it doesn't feel much different than before. It is still a little shabby in places. Not horrible, but it doesn't look like it was just redone. The major change seems to be new paint on the walls and some murals, as well as few brightly colored crates in the bar area.\n\nThe food was easily some of the absolute worst food we've had anywhere. For a starter, we tried the crab and shrimp lettuce cups. While fresh, they were just bland. Mixing in the dollop of bean salad that was on the plate helped a bit (the bean salad may have been quite good, but with only about two tablespoons on the plate, it was hard to know for sure). Overall, the dish wasn't bad, but it was very disappointing. No excitement, no wow flavor, just bland crab meat and even blander shrimp. Not taking the bean salad into account, the three leaves of lettuce were actually the star of the dish.\n\nWe also tried the chicken mole. The chicken was overcooked, tough, chewy and rubbery, depending on which piece you happen to be able to cut off and taste. What little mole sauce had no hint of chocolate, chipotle, or any good flavor at all. It was thin, sparsely applied, and only had the slightest hint of any flavor. The side of rice with mixed vegetables was a sad combination of plain white rice with some canned corn and bits of other canned vegetables thrown in. The 90 second microwave rice you can buy in a pouch is light years better.\n\nThe diet sodas with lemon we ordered arrived quickly, but the lemon never did, nor did the carbonation in the sodas.\n\nThe owner came over and asked us how the meal was. We told her it wasn't very good. She was pleasant, and told us about other Mexican restaurants that she likes. She talked to us for quite some time. So long, that our horrible food was getting cold. She made no attempt to remedy the situation. She did, however, send her husband (the chef) over. He, too, was pleasant, and couldn't stop talking. We told him that we were not pleased with the food, and he, too, made no attempt to remedy the situation. We were so disgusted with the food and the owners that we decided to not order desert, and get the heck out of there before the evening was ruined further.\n\nPaying the bill was an exercise in annoyance. the new wireless devices used to order the food are also used to pay the bill. This boils down to the bill being paperless, which means the waitperson stands there, device in hand, while you attempt to review the bill. You then add the tip, pressing the 15%, 18%, or 20% button. All while the waitperson is standing there, device in hand. This provides you with no opportunity to review the bill, reflect on the service, and decide how much to tip. I tipped 20%, or at least tried to. I was able to get a paper copy of the receipt, and saw no tip on it. I don't know what it was a paper copy of exactly (our order? the entire bill? I couldn't tell, so I'll find out when I get my credit card bill.) I hope the waitress got her tip, but I wasn't going to tip twice.\n\nTo summarize, on a scale of 1 to 5, I would give the place a zero, but 1 is the lowest number I can assign."
    },
    {
        "id": 43,
        "text": "Everyone seems to love to dump on Zocalo, so we went to check out how bad it was post-Kitchen Nightmares. No matter what happened, we knew that the ($3.75) margaritas would save the night.\n\nWe went the day after hurricane Sandy, so it was quiet.\n\nNot amazing food, but it was solid. Reasonable  value - 3 margaritas, two large entrees and an order chips and salsa (with chip refills) came to $40. The margaritas were a bit weak, but they were cheap. No major complaints."
    },
    {
        "id": 44,
        "text": "Lousy so call Mexican restaurant.\n\nOk so here is my background: Latin, hospitality manager graduate, worked in the restaurant industry most of my life, currently a food buyer for a major national company and as a second job I'm a flight attendant for an international carrier. If all of the above doesn't entitle me to make a restaurant review then I don't know what does.\nWe went to Zocalo's last Saturday to celebrate a friend's birthday. I should have known better when we came (3 of us) to the restaurant and we were the only ones there! Ok so we get seated and the drink order is taken. The waiter brought some chips without salsa. We asked for it and she said there was a charge for salsa. Charged for salsa????  When have I ever been charged for salsa in a Mexican restaurant...? NEVER!  We should have left at that moment but it was really cold out and I didn't want to make a scene with my friends.  My margarita arrived and to my surprise the glass was 1/2 full, I asked the waiter about this and she said that is how they served them..... Uhmmm 2nd warning! Our meal arrived, nothing special to mentioned, no specific taste or smells. It could have been heated up from a 10 lb bag and it would have tasted the same. We order some hot salsa to see if we could bring the taste a bit more authentic and to our surprise (or maybe not at this point) we were presented with a bottle of Tabasco sauce..... Please, do not insult my senses this way. Even if it is bottle sauce, please put it in another container. This is not Taco Bell; we are paying $27.00 for each dish.\nMy question is to the owner and manager: do you really care if you go out of business? Besides our table there was one more table with a party of 8 people. The count for a Saturday night: 11 people. No wonder. Please save your money and go ANYWHERE else. This place doesn't have atmosphere, good food, good drinks, or anything."
    },
    {
        "id": 45,
        "text": "My two visits in the last two weeks were very disappointing.  Regrettably, I cannot justify a third. \n\nHere's a summary:\n\nVisit #1: There are three empanadas on the menu. They were out of two. The service was incredibly slow and the waiter seemed ill-prepared to manage the tables assigned.  Nonetheless, I decided I'd give Zocalo another chance.\n\nVisit #2: Things started off poorly. I ordered tamales. They were out.  Then the entree order for one person in our party was lost. Apparently the new iPad based ordering system is still buggy; or, possibly, this was the first of two user errors made by the server.  Our group waited about 15 minutes, hoping the wayward quesadillas would arrive, but then started eating b/c our dishes were getting cold. The food was actually pretty good; but we were all halfway through our meals when the plate arrived.  Mistakes are understandable, but there was no update by the server during this time; and apparently the server didn't think it was much of a big deal, because I had to ask for it to be comped.  Finally, the iPad based credit card scanner decided that the server deserved an automatic 20% tip. The server couldn't/wouldn't reset the device.  I could've insisted it be resolved but was just so frustrated I just signed the screen and was happy to leave. \n\nI'm not sure what happened to Zocalo. It used to be a reliably good, if not excellent, place to eat and drink. No longer."
    },
    {
        "id": 46,
        "text": "You would think that a Gordon Ramsay Kitchen Nightmares visit would make a restaurant better.  You really would.  Unfortunately, it seems that Zocalo may be on the same path to closure as the other Ramsay redone-dive in Philadelphia, Hot Potato.  At this rate, I'm really hoping that Chiarella's doesn't suffer the same fate as well.\n\nRegardless of the Ramsay element, Zocalo's problem used to be (and still is) the same.  As long as stubborn owners like Mary (and to a milder degree, Greg) rule the ship with an iron fist, you're not going to experience much progress, and this certainly still shows up in the restaurant.\n\nAesthetically, sure, Zocalo has gone miles ahead of where it used to be, and the iPad POS system definitely adds the \"cool\" factor to the dig.  Nevertheless, the food still remains sub-par, with certain items borderline disgusting, certainly ruining the experience.  \n\nThe servers, however, definitely have a more positive vibe amongst them, and while I question the need for 12+ servers (that's how many I counted, at least) in such a small place, I think that they are the only positive element to this place.\n\nLong story short, swing by if you're interested in experiencing the ambiance of a Ramsay makeover, but don't hold it to any of his other standards.  One-time visit, if even that much, and definitely not worth the money."
    },
    {
        "id": 47,
        "text": "I was here for dinner with a group (someone else chose the place) and it's edible.\n\nI wasn't sure what would be good there and the waiter recommended the Grilled Filet, so I went with it.  Steak was tough.  Not good.  Sauce was all right.  I'm a little confused why she'd recommend something so clearly not good, but maybe that's the best they can do?\n\nI wouldn't choose to go back if I had to pay full price.  Or if I had a choice."
    },
    {
        "id": 48,
        "text": "Went to Zocalo last night with some friends and was seated immediately then told after we ordered drinks that they were out of Guacamole and the kitchen was closing in 15 minutes...should have left then but we already ordered drinks.  Food was ok, drinks were watered down.  Service was not so great...as if the waitress wanted to get home.  We sat outside and unfortunately at the end of our meal, we saw several cockroaches crawling around the feet of our table.  On top of all this, my friend was up all night getting sick.  This was truly a bad exerience and although I try to think everyone deserves a second chance- heck, we all have bad nights...I simply cannot bring myself back to this place for another go."
    },
    {
        "id": 49,
        "text": "Even after hearing all the bad reviews from my friends at work, my wife and I decided to stop in.  We had gone to Mad4Mex but it was way to crowded. We noticed upon our arrival that Zocalo is a little pricey.  Having been craving tex-mex we ventured in anyway.  When we went inside no one was there to meet us. We waited for a while in the bar area but no one showed up for a couple of minutes.  The waitress showed us outside into the outdoor seating area.  I ordered a margarita and my wife ordered a water. I love margaritas, but this one had so much lime in it that it was nearly undrinkable. It was so sour that I forced myself to drink it. \n\nWe asked if the meal came with chips and salsa or anything, but were told that you had to pay for it....which is fine with us....It's just not typical for a restaurant that has such expensive entrees.  We ordered the guacamole which was listed as coming with chips and salsa. When it arrived the guacamole was topped with a tablespoon of pico de gallo, but that was the extent of the salsa. The amount of chips were meager for the size of the guacamole, which was presented in a really cool pestle.  We then ordered a separate order of salsa to get our fix.  The guacamole was decent, not the best I have ever had, but not the worst either. The salsa was thin, but good.  We were not given extra chips with our salsa, but instead were supposed to use the ones that already came with the guacamole.  As a result, we had to wait 15 minutes for another basked of chips when the first ran out.  The waitstaff was VERY slow. There appeared to only be 2 waitress on staff and they were also serving as hostess, bartenders and the cleaning crew.  The 15 minutes we waited for the chips, our waitress was inside cleaning dust off of tables. \n\nWe each ordered a salad. Mine was a spicy Caesar salad and my wife's had cooked mushrooms and onions. Both of our salads were decent, but nothing spectacular. \n\nAll-in-all. The food here wasn't great and it wasn't bad. Every step of the way (side of dressing, extra chips, happy-hour only at the bar...which had no bartender, etc...) we felt nickled and dimed. The place didn't have very many people and almost no atmosphere. The waitstaff was slow as %^&*, because they were either cleaning, chatting or trying to do 3 jobs at once. \n\nI wont be back to Zocalo, which is a shame because it is so close to my work.  The food, drink....and more importantly the waitstaff and prices are better elsewhere."
    },
    {
        "id": 50,
        "text": "I am giving zocalo three stars for two reasons: 1) they had this awesome pumpkin seed dip on special, and 2) awesome margaritas with fresh fruit options that were really good.  Besides that, there are too many awesome mexican places in philly for zocalo to compete with them.  I would go back if it were during their happy hour except that it is only until 6:30 :( \n\nThey have a parking lot which is very convenient if you are coming from outside of univ city.\n\nThey are $25 on uc dining days. It would have been smarter for them to do the $15 option to get people in the door and then they order margaritas and up the bill.  There is a reason why this restaurant was on that restaurant show on tv."
    },
    {
        "id": 51,
        "text": "I read that Chef Ramsey did a makeover of this place. Isn't he kind of a big jerk? Anyway. Some patrons are here being congratulated and receiving t-shirts because they are the new presidents of something at Wharton University.\n\nThere was NOTHING special about the  chicken quesadilla, but I liked it that it came with a tasty side of rice, beans, and ok guacamole and salsa. Service was neither horrible nor Stellar. I don't think I'll be coming back."
    },
    {
        "id": 52,
        "text": "I want to like this place more than I do. One thing I will say is that their drinks, especially the red sangria, are great. Unfortunately, the Ramsay make-over wasn't kind to them. It seems strange that they're usually so empty in a college neighborhood - what college kids don't like Mexican? The main reason for this, I think, is that their price point is just a little too high. It seems like Ramsay tried to Americanize the menu, but it didn't really work. They should bring back the authentic cuisine, add some more veggie options, and lower their price point a bit. My advice? Skip the menu, sit at the bar, and order the sangria. Oh, and do order the pumpkin seed dip (xik-il-pak); it's pretty amazing."
    },
    {
        "id": 53,
        "text": "I am giving Zocalo 1 star, there are several reasons. \n1 when we got there we were seated and after we ordered drinks they tell us they dont have guacamole.\n2 They rush us with ordering food because the kitchen closes in 10 minutes, dont seat a group of people without saying that the kitchen closes in 10 minutes!!\n3 The food was really blend!\n4 During the dinner we were rushed all the time, \"Can I take this plate\" when I clearly still were eating!\n5 At the end of the dinner we discovered COCKROACHES under our table!\n6 And during the whole night after I spent on the toilet, puking! \n\n\nDOOONT GO THERE!"
    },
    {
        "id": 54,
        "text": "Yup, this place isn't going to last.  Sad, because it's been here a long time, but ultimately, Gordon Ramsay failed it as well.  Sorry Gordon, this ain't gonna work out.\n\nAs I've said before, the food is sub-par and way too overpriced compared to the quality (14$ for a terrible Chile Relleno), and the place is deserted.  Living around the corner from the place, I can vouch for the fact that there's maybe 3-4 tables filled when I walk by them.  On a Friday night.  That's just not going to work.\n\nThe staff is still positive that an upturn is on its way, but unfortunately I'm unable to share the same optimism. Sadly, this one is going to the dogs.  There's just not much more to say here.\n\nHit up Mad Mex right in the area for a more trendy atmosphere, with (comparatively) better food and better drinks menus for the liquid-diet folks.\n\nKokopelli and El Vez are still my go-to's for a Mexican craving in Philly."
    },
    {
        "id": 55,
        "text": "After the recent revamp of Zocalo, I was looking forward to trying it. I went with a few friends and meant to get their in time for happy hour, but missed it by a few minutes. \n\nI had a delicious margarita and very tasty (and fresh) chips and salsa verde.\n\nThe menu isn't extremely extensive, but it has a nice variety and if I was looking to get dinner, I definitely could have found a number of things to try!\n\nThe service was very friendly and attentive and an all-around pleasant experience."
    },
    {
        "id": 56,
        "text": "Finally, authentic Mexican.\n\nJust finished a nice dinner at Zocalo. Chef/owner Greg Russell again demonstrates his culinary talent and unwavering dedication to Mexican cuisine.\n\nWalking in to Zocalo, you definitely feel like you are a world away from downtown Philly. The tables and chairs are hand carved, and just very cool. You immediately make the connection to Chef Greg's cooking. That is, the pride and passion that he and his wife (and kids) put into this restaurant. Hand carved chairs, wonderful art and a warm welcoming staff. And I have not even eaten yet. Looking at the menu, you notice it is small. And if you have read any of my other reviews, that is a huge plus. A great Chef concentrates on a relatively small menu and making fresh dishes consistently. Zocalo has such a Chef...or two!\n\nWe started dinner with with the chips, salsa and guacamole, the fundido and the Mexicana and Argentini mixed drinks. You can certainly appreciate how fresh it was, but even more so was the taste. Just the right amount of heat in the salsa, and the guac was deliciously creamy with small chucks of fresh avocado. The chips are made fresh as well. Our fundido was a blend of cheeses and we added pablanos. All were a nice starter\n\nFor dinner, we had the Arrachera (skirt steak, see pic) and the Pollo Santuario (chicken and chorizo). The steak was well seasoned and perfectly cooked. The chicken was very tender and again, the freshness of ingredients shines through each dish. \n\nEach dish we had on this visit offered very distinct flavors, all well balanced.\n\nOur service was, and always is, very attentive. Chef Greg came out and spoke with us for a few minutes. I think that's something many restaurant chefs should try to do more often.\n\nOne area I think that can be improved is the presentation of the main course. I understand the \"home cooked\" feel, but every dish has this \"cup shaped\" scoop of rice and beans with pico and guac. This could be thought out a little better. \n\nSome reviewers here complain about the prices. I'm dumbfounded by that. This fare is so fresh and that costs a little more. It is by no means overpriced. $23 for my skirt steak is not expensive, not cheap either. And it was a nice portion. If you want cheap food, go to any Chinese buffet. If you do, keep the antacids handy.\n\nAnother highlight is the bar. They mix some really cool drinks here. I wish they were closer. I think I would visit the bar for happy hour more often. Zocalo makes my list for \"Creative Drink Masters.\"\n\nIf you want to taste distinctive authentic Mexican, prepared with the freshest ingredients then I recommend a visit to Zocalo. \n\nIF YOU ENJOYED READING MY REVIEW, PLEASE RATE IT AND SEND ME A COMMENT."
    },
    {
        "id": 57,
        "text": "I've never left a dining place in such a bad mood before. Seriously.\n\nThe food was just so mediocre, and it was mostly just a bunch of ingredients dumped onto a plate. My friend got a caesar salad, which was literally just a stack of WHOLE romaine leaves, with barely any dressing on it. When we asked the waitress for dressing, she pointed at a corner of one of the lettuce leaves and was like, \"The dressing is right there, see?\" Well excuuuuuseee my friend for wanting just a little more than a drop of dressing! I got soft tacos, and all I got was a plate with taco ingredients, which is fine, I can assemble my own tacos, but I can't do that when they don't give me TACO SHELLS. It took them 10 minutes after delivering my taco ingredients to give me 3 soft taco tortillas. \n\nThe service here was just really appalling to me. At the end of the meal, I didn't get any receipt. The waitress just showed up to our table with an iPad with our total, and just stood there waiting for us to pay. Soooo awkward. And then after I paid her, she rounded the change to dollar bills because she was too lazy to get change. Which I guess is just as well since that ended up being her tip. TSK."
    },
    {
        "id": 58,
        "text": "It's been about two weeks post-Gordon Ramsey Kitchen Nightmares at Zocalo.  I tried to get a reservation during the taping of the show but it was way overbooked.  Finally I decided to try Zocalo for lunch.  I was expecting more of a buzz but it was empty inside (episode hasn't aired yet).  I hadn't been to Zocalo before the show so I can't really compare the before and after.  The inside of the restaurant was okay, bigger than I expected with about four different segregated eating areas.  \n\nThe bf and I ordered the corn empanadas, the short rib tamales and the steak tacos.  The service was ridiculously slow considering there were maybe three tables total.  It took a little over 30 mins for the appetizers.  The corn empanadas were okay, good thing for the jicama slaw it came with.  The flavor was lacking so we were grateful for hot sauce.  The short rib tamale was much worse than the empanada.  It was super pasty and felt like eating chalk...thick and drying up my mouth.  \n\nThe steak tacos were nothing to write home about.  They gave us only three tortillas with the platter.  The steak was okay but kinda cold.  The guacamole had too much cilantro, the re-fried beans tasted like it came from a can.  The saving grace was the sour cream..  Definitely just go home and make this taco platter yourself.  \n\nThe price of the food definitely was not justified by the quality of the food.  Distrito is a lot better.  Not only did we pay a decent amount of money for it, I also paid for it when I got back to work...in the bathroom."
    },
    {
        "id": 59,
        "text": "I had a horrible experience here.  I came with three friends and printed out a gift certificate for $25 off from www.restaurant.com (it costs $10 to print this out, but I figured we'd get $15 off).\n\nThis is what happened after we got there:\n1. Before we got seated, I told the hostess we had the coupon and gave it to her - she said we could use the coupon.\n2. When the waitress came to take our drink orders, she said we could get 2 specials with the coupon.  Great - we order a round of drinks.\n3. We order our food and two of us wanted to share a prix fixe - not allowed!  So we order a la carte.\n4. Waitress comes back and tells us we can no longer use the coupon AT ALL.  One friend ordered a house margarita, which apparently was $1.25 off and that counted as a special. Even though the waitress said we could get 2 specials, apparently now we are disqualified from using the coupon.  Fine - we will still have what we are having.  I tell the waitress that I had to PAY for the coupon, so could they at least give us $10 off b/c that's how much it costs.\n5. The waitress comes back and says no - we cannot use it at all.  We say fine - let's just enjoy our dinner and suck it up.  We thought that was the end of it.\n6. The manager comes to tell me that they do not make any money off of the coupon and that restaurant.com advertises for them for free and the coupon is to attract new customer.  I say, yes, that is why I came, but if you don't want to honor the coupon, you should take your restaurant off the website.  She starts to yell at me.  I ask her politely to leave us alone - we no longer care about the coupon.  She gives the coupon back to me, but I say I no longer want it, I am never coming back here.  She stuffs it into my purse.\n\nOur bill was around $150 and we tipped more than 20%.  But apparently they wouldn't have made any money if they honored my $25 coupon.  \n\nThe food was mediocre at best and the portions small for a Mexican restaurant.  The salsa is runny and has huge chunks of garlic in it.  The ceviche looks like it's been sitting out for hours.  The margaritas have NO alcohol in them!!\n\nDO  NOT COME HERE - VERY RUDE PEOPLE!!!"
    },
    {
        "id": 60,
        "text": "I have been here a long time ago in the past, but saw the chance to experience this place again with a gift certificate I bought. It was as delicious as I remembered it. I walked in and it was very quiet (it was late on a Tues. night, after all), but everything is adorably decorated. I especially loved all the hand carved tables and chairs. It may not be everyone's thing, it certainly would not go with the decor in my house, but I admire the skill it must have taken. Even the curtains were beautiful and unique. \n\nI ordered the Arrachera (skirt steak) and my friend ordered the Cochinita Pibil (pulled pork). Both were delicious. I especially loved the marinade on my skirt steak. Dinners come with all you can eat tortillas, and one puts a portion of the meat and sides onto the tortilla to make their own soft tacos. Both of our orders came with perfectly cooked and lightly seasoned rice with bits of vegetables mixed in. My dish also came with some of the best guacamole I have ever eaten (and I am totally a guacamole nut), some pico de gallo and fried plantains (it really comes with refried beans, but they allowed me to substitute). My friend's order came with just the rice and plantains. The pico de gallo was delicious, fresh and flavorful. The plantains were just to die for! \n\nOur server was super nice and attentive. He came around often enough to ensure we would get anything we needed right away, without coming around often enough to be a bother. He was terribly nice about allowing me to substitute then changing our plates because he accidentally substituted the wrong thing. And although this is the height of unprofessionalism to comment (when was Yelp professional anyways), the waiter was very cute. I have to admit I predetermined that I was going to notice this because in the past the all the waiters at this restaurant were very attractive. One of them told me that there is a dance studio around the corner that a lot of them come from. Prices are a little high for me, but the eye candy might be worth it."
    },
    {
        "id": 61,
        "text": "Maybe it was the better company, the nicer time of day... but I had a better time this visit. Things are pricey, but I recommend a restaurant.com certificate to try it out. It applies to alcohol, too.\n\nThe menu doesn't offer much visually, and seemed to be smaller... but we had an awesomely rewarding guac and salsa, and then two monstosity meals that overfilled us. Fantastic. And I loved my house sangria with tequila, white infused with berries. :) I think they also offer imported beer here.\n\nWe got the flourless chocolate cake to share at the end, even though we were stuffed, and it was awesome. Might have pushed us over the edge into bellyache time, but it was still worth it.\n\nMy only complaint was that it got hard to catch a waitress's attention at that early dinner hour where there's a mad rush in the 3 separate sections of the restaurant. But also, the waitress was new, so you gotta be forgiving."
    },
    {
        "id": 62,
        "text": "Beautiful decor. fun music. great service.\nFood is absolutely fantastic! The mocajetes are a whole experience in and among themselves. You find yourself with a whole steaming lava rock filled with chicken (or shrimp or steak) in this great red sauce. go ahead and even give the grilled cactus a try if your feeling adventurous!\n\nIf your worried about the price then go during lunch. You deffinetly get bang for your buck. but Its a great place to go for dinner if your looking for somewhere really different to try."
    }
]