[
    {
        "id": 1,
        "text": "I love them!! The food is great and they will make alterations if needed to make the customer happy!"
    },
    {
        "id": 2,
        "text": "some of the best lunch truck mexican food i have ever had this side of north philly, these guys have  the Taco all figured out, the two sauces make it perfect, the green sauce is mild the red sauce is spicy! try the burritos stuffed with beef or chicken or pork. cant go wrong with the menu or the prices."
    },
    {
        "id": 3,
        "text": "I stop by once to get some churros and they were delicious, fresh, crunchy, and perfectly sweet.  Tonight I decided to stop by for a quick bite and was excited to see they had salmon and fish tacos.  I got them supreme which meant adding sour cream, pico de Gallo, and avocado.  They were very tasty and had phenomenal taste.  I also decided to order rice and beans but was disappointed they weren't refried beans.  The rice seemed to be the end of the pot a bit chunky.  Everything was tasty despite the few things I didn't like."
    },
    {
        "id": 4,
        "text": "Steak tacos were good but I found bones, yes multiple, in my chicken quesadilla so grossed out and still waiting for my reimbursement"
    },
    {
        "id": 5,
        "text": "It was a good portion size, but it was bland. The prices were reasonable, but there are way better places in the neighborhood."
    },
    {
        "id": 6,
        "text": "So me and my boyfriend constantly get food from this truck , their tacos are good the corn has became our favorite but today we purchased food from these guys and my boyfriend got a drink it's a special drink they have , he didn't taste it until he got home and it was horrible it was straight water ! So he went back and explained to them that this drink was no good could he get a new one they tried to give him a small one when he bought a large one , he had just left this place like 10mins ago from this situation , they told him they can't give him a new drink because he tasted the one he had like wtf ! They literally just lost customers because of that , they gave him the hardest time ever just for a drink so my boyfriend left very disappointed these people are BAD BUSINESS ! It was a guy ! Usually it's always ladies but this guy was a straight ASS"
    },
    {
        "id": 7,
        "text": "Me and my husband's got to spot for amazing Mexican food the carnitas tacos, chicken quesadillas, empanadas and elite are the best"
    },
    {
        "id": 8,
        "text": "Beeeeeest Mexican Food I've Ever Had ! I LOVE The Shrimp Quesadillas And The Elote Corn !!! The Flavors Of Their Food Are SO Perfect . I Just Love Them And Their Food So Much I'll Eat From Them Every Single Chance I Get !"
    },
    {
        "id": 9,
        "text": "The best shrimp burrito and elote corn!! I can't get enough of them! My husband likes the chicken burrito but I think it's a bit too dry for my preference. I always Uber from them and it's always prepared fast and it gets to me in a timely manner."
    },
    {
        "id": 10,
        "text": "My go-to authentic Mexican taco spot! I know flavor and I've tried plenty before coming to that conclusion. You can't go wrong with either of their locations, unlike other places. The tacos \"supreme\" with the 2 sauces that come with are amazing, and not to mention their elotes (Mexican street corn) are to die for!! My family and I have nearly ordered everything on the menu  from nachos, quesadillas, burritos, smoothies, churros, etc... and there's always silence in the room with lots of \"Mmm's\" and chewing sounds with how good everything is. Support this small business, you won't be disappointed."
    },
    {
        "id": 11,
        "text": "This food truck does everything Mexican well. From the burritos all the way to the empanadas. Prices are fair as well."
    },
    {
        "id": 12,
        "text": "Los mejores tacos que eh aprovado! Estaban deliciosos las flautas y los tacos al pastor! Recomiendo que vengan a ordenar no se arepentiran! Muy buena gente y buen servicio. No tome fotos porque estaban tan deliciosos que terminamos rapido. \n\nAmazing food! You will not regret it. No pictures because they were so good they couldn't stand a chance!! Give them a try! Good service and very friendly"
    },
    {
        "id": 13,
        "text": "Well I just moved to Philly from Texas and was in desperate search for Elotes and Tacos. I stumbled across this food truck.. I should've gotten back and kept moving. We ordered chicken tacos,  elotes,  empanadas, mozzarella sticks and fries (for the kids). It took literally 30 mins to get our food and it honestly wasn't that good. Fries were super hard... Chicken from the empanadas and tacos had small bones in them! That's unacceptable.  By the time I actually got the food, I was still excited for Elotes and it was cold and not enough spice or cheese. Highly disappointed and I'm still in search for authentic Mexican elotes and tacos."
    },
    {
        "id": 14,
        "text": "Bessssst carnitas quesadilla i've ever had the pleasure of eating. Seriously-- do yourself a favor and order from here! Food is flavorful, servings sizes are perfect for one person, and they always hook me up with extra sour cream. Wish it was open later so I could order for those late night cravings!"
    },
    {
        "id": 15,
        "text": "The best real Mexican food you can find ! Great seasonings and fresh flavor! Meal for two people will be around 25$ depending on what you order , try the sopes, they are to die for. Also remember or just so you know they have a restaurant and a food truck , I ate from the truck  and I don't regret a bit'"
    },
    {
        "id": 16,
        "text": "0 stars!! I had tried this place one time before and the food was okay at best, the elote was definitely overly seasoned. And the burritos were like I said average. I go to place a order tonight cause I was close by and it was convenient and the fat neck b**ch over the phone (haven't seen her I could just tell) immediately started giving me attitude when I asked if she could hear me because after saying hello politely and asking if I could place an order she got quiet for a minute or 2. B**ches like this are the reason businesses suffer. Nobody made you work there, give that energy to yourself stupid! And this business will never get my money again!"
    },
    {
        "id": 17,
        "text": "My Togo taco truck. Breakfast, lunch, and dinner. Good food and good prices. Authentic Mexican taco. The only thing missing when you order tacos is the radishes."
    }
]