[
    {
        "id": 1,
        "text": "Super amazing homemade food. They renew the interior and kitchen and it's looks great! Honestly hands down best Mexican in philly. Tamalex is good BUT this place is another story. Top Mexican by far. Only downside is cash only. Enjoy."
    },
    {
        "id": 2,
        "text": "fresh cilantro right on the counter \n\nthree tacos:\n1 - chorizo was awesome\n2 - al pastor was fantastic\n3 - carnitas was not so good.  very fatty pork made me gag a bit\n\nsuper nice people but service was slow\n\n\ncash only"
    },
    {
        "id": 3,
        "text": "This restaurant felt like a bit of a hole-in-the-wall but it was worth the search. I absolutely loved my meal there. The servers could not be any nicer. The chips that came before our meal were tasty but the salsas were amazing. The food came out quickly and tasted so good. I tried both the burrito and enchiladas and they were both fantastic--but watch out for the spice if you're not a fan! We did have to pay cash, but the ATM was in the restaurant. Overall, it was a great meal and didn't break the bank"
    },
    {
        "id": 4,
        "text": "We had a great time here! The food was unbelievable, and the chef was extremely friendly.  We will definitely be returning soon!"
    },
    {
        "id": 5,
        "text": "Hidden gem alert! Wonderful food and great service. BYOB. very authentic. Def try this! The shrimp tacos and the veg burrito were outstanding. The chips and guacamole.. amazing. The salsa verde.... best ever. No joke. The mushroom soup that came w our entrees, something I have never been offered and it was great too. Lovely spot"
    },
    {
        "id": 6,
        "text": "Really great place. Got takeout on Wednesday night - quesadilla and tacos. The earlier review about the quesadilla was spot on - fresh and flavorful. Tacos were excellent too. Family operation with everyone working the kitchen - great atmosphere. Highly recommend."
    },
    {
        "id": 7,
        "text": "This place was an amazing value for the money. The waiter was incredibly nice. The waiter was also the chef, which was frankly amazing. Somehow it wasn't even crowded, even though we came here on a Friday night. You should go here. Right away."
    },
    {
        "id": 8,
        "text": "This place is great. My husband and I sampled many things on the menus. Beware the empanadas (actually are quesadillas) are large. The tamales were my favorite, followed up by the tostadas and huaraches. The people are very pleasant and the interior is clean and bright. It's cash only but they have an ATM inside. We can't wait to get back to try more on the menu."
    },
    {
        "id": 9,
        "text": "What does a one $ sign, fabulous food in a pleasant setting  and great service warrant?     A 5 Star review!!!\n\nThat's cute, authentic and amazing Mexican BYOB did the trick for us in filling our bellies on this beautiful summer evening. All 3 of us Ordered the Carnitas which were shredded pork with a side of cactus, beans and rice and guac and chips. Everything was fresh and homemade and you could taste the love. I felt like my mama had made me a great big wonderful dinner. \nAnd we got to try cactus! The only other time the three of us that had cactus was when we had cactus martinis in the Grand Canyon. The free chips and salsa were refilled  each time our server saw them go low. \n3 ate heartily for $46 including 2 sodas. \nGreat experience in this wonderful South Philly Mexican restaurant. We are going back soon"
    },
    {
        "id": 10,
        "text": "Just ate the brisket and mexican sausage tacos, they were great! The perfect amount of heat. We had the guac btw the 4 of us, we had extra to put on our tacos! it exceeded expectations. \n\nThe waiter was prompt, our waters never ran low, he did a great job helping us pronounce the dishes. \nIt was delicious !"
    },
    {
        "id": 11,
        "text": "This place is great! My wife and I tried so many things from the menu (tostadas, tamal rojo, grill chicken huarache, taco al pastor, quesadilla) and all was good. The quesadillas are large. The service was friendly and the place is very nice and clean."
    },
    {
        "id": 12,
        "text": "Nice atmosphere; bright, clean space. Friendly service - not super fast but a pleasant pace. Had the beef torts, which was quite large and had fresh ingredients. Tasty, too."
    },
    {
        "id": 13,
        "text": "Stopped in for an impromptu lunch with a friend the other day. Incredible enchiladas and guac with homemade chips. Very accommodating in making a vegetarian burrito for my companion.  We'll definitely be back"
    },
    {
        "id": 14,
        "text": "I'm a huge fan of this place! Their weekend specials are awesome - the barbecued lamb tacos  served with consommé is insane. Also they have great homemade chips. Good service. Good prices."
    },
    {
        "id": 15,
        "text": "I'm not from the area so my BF and I were looking up Mexican restaurants in the area when we came across this place. We were looking for an authentic Mexican restaurant with good food... which from our experience comes from the small \"hole in the wall\" places. We were surprised that the yelp reviews  were so consistently high for Maribel's. We had narrowed our options down to Maribel's and one other restaurant but the Yelp ratings convinced us to go with Maribel's. I am sooo beyond happy we did because let's  just say that this is BEST Mexican food we have  ever had in the U.S... and I have had my fair share of Mexican food all over the place including in NY. \nLike the other review said- Do NOT judge this place just by its surroundings. If you do, you are only depriving yourself. It's a very clean and cute place inside. Everyone is super friendly and attentive. We ordered the guacamole which was delicious as were the chips. I ordered the Chicken Tinga Tostadas which were absolutely delicious. They were packed with sooo much flavor and had a nice kick to it (spice wise). My BF ordered the pork and chicken tacos and he absolutely loved them. My only \"complaint\" which really isn't legit is that I wish the portion of guacamole was a little larger. \nJust as an FYI for future diners- It is a BYOB restaurant- they gave plastic disposable cups (which was totally fine for us). There is no parking lot, but we had no issue finding street parking. As I said, I'm not from the area so to me the neighborhood seemed a little rough but I had no issues nor did I feel scared or uncomfortable walking around. \nThis is definitely a hidden gem and I will most definitely be making a trip back to Philly to eat here again!"
    },
    {
        "id": 16,
        "text": "I was expecting this place to be decent, but it was much better than that. This is the first place I've found really good Mexican food since moving to Philadelphia two years ago---the carnitas is fantastic. I'm only moderately sad that the waitress didn't think I could possibly know what I was talking about when I ordered a tripe taco with my carnitas plate, and therefore gave me a *carnitas* taco instead. Next time...\n\nThey've done a nice job on the interior are well; the open kitchen, subway tile, and chalk board all look great."
    },
    {
        "id": 17,
        "text": "Waiting to view a house in area stopped in for a drink while waiting.  Staff and place was very inviting. The inside looks nicer than I thought it would and it smelled so good. After appointment my friend and I went back to sit and eat.  Wasn't disappointed. Staff was happy to answer any questions about menu.  I got a chicken burrito and could only eat half.  Very filing and the chips and salsa were really good.  Enjoyed my aqua fresca too. Will be back."
    },
    {
        "id": 18,
        "text": "With so many good Mexican restaurants in South Philly there's a lot of competition out there, but this is definitely one of my new favorites. The atmosphere is great with the open kitchen and the staff is extremely friendly, but most importantly the food is fresh and delicious. The quesadillas were prepared deep fried unlike most Mexican restaurants down here, and the enchiladas came with a spicy sauce that I need to buy in bulk. We came right after it opened so we got a complimentary dessert that ended the night perfectly. The staff and chef were very open to suggestions but I think everything was already perfect. Can't wait to go back."
    },
    {
        "id": 19,
        "text": "This place is DELICIOUS. Very cute neighborhood joint, friendly service and the food is the best! Try the veggie burrito (cactus)."
    },
    {
        "id": 20,
        "text": "Delicious! We went here on a whim tonight and were so happy we did. The guacamole was phenomenal (and spicy!) and the steak huarache was delicious. I basically can't wait to go back again.\n\nAlso, the service was great and the restaurant was cute-- highly recommend."
    },
    {
        "id": 21,
        "text": "We were all in the area for a craft show and came across Maribel because it was close to the event and it received a 5-star review from Yelp. It was definitely a good choice. While the restaurant was a bit chilly and they did not have guacamole when we were there for lunch at 1 o'clock, everything was delicious deliciously prepared and was really quite tasty. I found the portions to be just right if not slightly large particularly for the cost so that was a good thing. \n\nWe had seen a review for the deep-fried quesadillas so we decided to get those as an appetizer. They were huge! We selected the cheese, and it was very good.\n\nWe had way huevos rancheros and burritos for entrees. Again, everything was well prepared, fresh, delicious and very good portions.\n\nWe'd definitely go back if in the area. I thought the service was just a little bit slow but extraordinarily friendly!"
    },
    {
        "id": 22,
        "text": "I created my yelp account simply to share how great my experience at Maribel was!\n\nMy boyfriend and I stopped in on a whim as we were walking to a bar nearby. Being drawn in simply by the scent of the food inside we were THRILLED to see that we could sit right away on a Friday (Memorial day weekend might have had something to do with that). \n\nThe service was very quick and the staff was the kindest I have ever experienced. They were happy to help us with the menu that was mostly in Spanish, and even made a few things to order according to dietary restrictions without hesitation. \n\nI can't say enough about the entire experience. Everything was absolutely delicious. Definitely try the Guac and Fajitas! We will definitely be back- and SOON!"
    },
    {
        "id": 23,
        "text": "Five stars all the way. The best Mexican grub in all of Phila. The homemade chips are crispy, the guacamole fresh, the shrimp and the al pastor perfectly seasoned and cooked by the attentive and kind owners.  I'm writing the review as I'm waiting for the check. So good guys."
    },
    {
        "id": 24,
        "text": "Amazing lunch - tamales, enchiladas, huevos rancheros, tacos, etc.\nFamily owned and all homemade. \nOur new favorite place in the city!!!"
    },
    {
        "id": 25,
        "text": "amazing food and well priced!  We had dinner prior to our movie and it tasted like we were in Cancun enjoying dinner! Highly recommend especially for the authenticity relative to price."
    },
    {
        "id": 26,
        "text": "We just left Maribel Restaurant after having the most delicious meal that we have had at a restaurant in a long time.  I had the special which was striped bass (whole, eyes and all) with rice and a salad and my husband had the breaded chicken served also with rice and a salad.  Delicioso! The interiors of the restaurant was such a surprise in our neighborhood (I live about 2 blocks from 7th and Moore).   A large space, thoughtfully laid out with the kitchen out in the open."
    },
    {
        "id": 27,
        "text": "This is my new favorite mexican spot/ The people are wonderful and the food - the best! BYOB, great service and please order the quesadilla and steak tacos."
    },
    {
        "id": 28,
        "text": "While visiting a friend, she ordered takeout from here, and it was amazing! My friend didn't realize the restaurant name and menu had changed at first; I believe they used to be called 'Maribel'. I ordered the chicken enchiladas with salsa verde. The chicken was so tender, and the sauce was so flavorful. The beans and rice on the side were delicious as well. By the time I was finished, my carton was pretty much empty. I didn't try them but my friend and her family raved about the chips and guacamole. The restaurant itself is located on the corner of Moore Street. There are a few tables in there for a sit-down meal. Oh, and they're cash only! I'll definitely be back to try something else on the menu."
    },
    {
        "id": 29,
        "text": "Such a great little place with super sweet cooks and waiters.  Food is absolutely delicious.  Carnitas and shrimp tacos are my current favorite.  Even the chips are so good!  My new favorite."
    },
    {
        "id": 30,
        "text": "Excellent Mexican food. Pleasantly surprised"
    },
    {
        "id": 31,
        "text": "Such a great local spot! We order from here at least once a week. All of the tacos are super delicious and authentic!!"
    },
    {
        "id": 32,
        "text": "This was by far the best authentic Mexican food I've had in Philadelphia! My five friends and I loved every bite of our wonderfully portioned food. I ordered the 3/$9 tacos(1 shrimp 1 mexican sausage and seasoned pork and 1 brisket) Ang let me just tell you..The FLAVORS and FRESHNESS were outstanding!! The service was excellent, friendly and attentive  I can't say enough about this unassuming cozy treasure of delightfulness. Do yourself a favor and make the trip. You too will be compelled to tell everyone about this place!"
    },
    {
        "id": 33,
        "text": "This place is a hidden gem. The guac is out of this world - very spicy!\n\nI would highly recommend starting with guac/chips and then ordering far too many chorizo or al pastor tacos for your own good."
    },
    {
        "id": 34,
        "text": "Came here for hangover grub.  Got the best mexican meal ive found in philly ever!  Guac was fresh and tasty.  Wonder where the day old tortillas go?  The chips are delish and fresh and salted!  Enfrijoladas were a dream.  Cheesy and fresh and beany and just spiced to perfection.  Portions are solid, price is right, service is kind, kitchen is open.... just bring cash..."
    },
    {
        "id": 35,
        "text": "My boyfriend and I were in the neighborhood and stopped by on a whim--we haven't stopped eating here for months since! We go as often as we can. The suadero and chorizo tacos are killer and they made us fresh chips the last time we were in for dinner served with house-made guac. The servers are sweet and the place is adorable. Parking is super hard down in this neighborhood but it's worth the inconvenience."
    },
    {
        "id": 36,
        "text": "This place dishes up the most authentic Mexican food in the city.  It's like taking a trip abroad without your passport. We loved it!"
    },
    {
        "id": 37,
        "text": "This is our neighborhood go to place for authentic Mexican food. The staff are so friendly and the food is always delicious. I've had the fish tacos, quesadilla, and some other dishes I forgot the names of, but they were delicious also. This place is a great, hidden little gem in the south Philly area. Please check it out if you want some great authentic Mexican food. Thanks"
    },
    {
        "id": 38,
        "text": "My friend and I came here before heading to Bok Bar and had a delicious, filling meal! We split an order of chips and guacamole. The guacamole was sooooo fresh, with tons of lime in it. I ordered the Mushroom Quesadillas, which were really delicious. I do wish they had come with a salsa or something else acidic to cut through the richness from the mushrooms and cheese. My friend got the chicken enchiladas which he really enjoyed, and I was jealous that his dish came with rice and refried beans! I definitely recommend stopping by for a bite to eat before/after hitting up Bok Bar!"
    },
    {
        "id": 39,
        "text": "Just had the \"BEST Tamales I ever had \nThe food & service was Amazing. I will be back Soon !!!"
    },
    {
        "id": 40,
        "text": "I stopped in the other day to order some takeout tacos. Initially I was a little skeptical because it was about 8pm, there was only 1 other person in there eating, and they told me my order of 3 orders of tacos and guac was going to take 25 minutes (it did not look like they were busy at all, so I was definitely surprised by the wait time)\n\nWell as it turns out...it was well worth the wait! This place was awesome. We got an order of Tacos al Pastor, Shrimp tacos, chorizo tacos and Guacamole w/ chips. Yes, might be a hole in the wall, but wow, the flavor in those tacos was outstanding. Overall, I would definitely come back. See below for the individual food reviews below:\n\nShrimp tacos 5/5: These were my favorite item of the order. The shrimp were charred perfectly on the grill. They came with some sort of awesome sauce that really gave a nice POP of flavor to it and even came with a slice of avocado on top. \n\nAl Pastor Tacos 4/5: Again, a great char on the pork. It was topped with onion and cilantro and just tasted awesome. The only feedback I have is that I wish it had some more pineapple on it. The piece it had was SO small and barely even noticed it.\n\nChorizo Tacos 3/5: Not as flavorful as the other tacos, but still pretty good. There was a good amount of meat on each taco so that was a plus\n\nGuac 4/5: This was pretty good. It definitely taste fresh (it was green, which is always better than brown!) and had a ton of lime and cilantro in it. \n\nPrice 3/5: Our 3 sets of tacos (3 tacos per order) and Guac + chips came to about $35, which is about average. I pretty much expect to pay $3 per taco nowadays.\n\nSauces 3/5 : They gave a green sauce + red sauce + limes with each order of tacos. The green sauce was my favorite of the two, because it was spicy but not too spicy. Hard to wrong with limes ago."
    },
    {
        "id": 41,
        "text": "Awesome Mexican food that is affordable. I would definitely recommend if you are in the East Passyunk area. Good tacos and fajitas!"
    },
    {
        "id": 42,
        "text": "I tried out this place based on yelp reviews and the close proximity to my house. I went on a weeknight night and it was dead emptied. There were 3 workers so service was very slow. The restaurant was super cold. It felt like they didn't even have the heat on. The Mexican style steak were super salt and the beef was very chewy and too much fatty part. The chicken tacos were very dry. The only good thing was the guacamole. It was fresh."
    },
    {
        "id": 43,
        "text": "Worst experience going there today. Long story short; 1: Took forever to make our food. 2: Asked for chips with salsa but they didn't bring it, and I'm sure the waitress heard us. 3: Packed our food with no bag. 4: Waitress brought out checks with candies, but not our table. Will not return."
    },
    {
        "id": 44,
        "text": "This freshly fried fish devours come from a south philly favorite México Lindo Y Que Rico Restaurant! This restaurant is located on 7th and Moore street in South Philadelphia. This small Mexican restaurant is a piece of pure joy. They have a very affordable prices and they offer to take out during this pandemic. Every time I visit I always get the freshly fried whole tilapia fish. It comes with yellow rice, black beans, a small salad, & tortilla wraps. The fish is very fresh with delicious seasoning. The salad is super fresh and the black beans were actually really good the yellow rice is perfectly seasoned also. If you ever find yourself wanting some authentic Mexican food while you're venturing around South Philadelphia? Please visit México Lindo Y Que Rico Restaurant! ¡Diles que te han enviado a ti!  #shimmyeats #philly #philadelphia #food #foodie #foodphotography #foodblogger #foodstagram #fish #tilapia #rice #yellow #beans #salad"
    },
    {
        "id": 45,
        "text": "Great small gem in the neighborhood. Inside is very cozy and appears professional. The food is great. Staff are very kind. Overall I recommend it."
    },
    {
        "id": 46,
        "text": "Went for dinner with my family tonight; for a place that doesn't look like much, it was an absolute top notch experience. My boyfriend and I both got tacos (3/$9); he had the brisket which was super tender and delicious, I had Al Pastor which were probably some of the best Al Pastor I have had outside of actually eating it Mexico. So simple, but exceptional. My dad had Carne Asada, and brother had the enchiladas - both were very happy with their meals as well. \n\nService was great, food was fresh and delicious, and we left full and happy. No frills, just everything done well and done right. Would 100% go back and 100% recommend."
    },
    {
        "id": 47,
        "text": "This place is clean , quick service and excellent attentive and friendly staff. Been here quite a few times and I'm always satisfied with their service and food\n\nI usually get their tacos with beans and rice on the side. The prices are not to bad. \n\nI like the fact that their kitchen clean and  open to the dining area so you can watch them cook your food.\n\nI have nothing bad to say about this restaurant."
    },
    {
        "id": 48,
        "text": "Welcoming service, amazing burritos, cute and bright interior for a hole-in-the-wall. \n\nPROS: There is no breakfast burrito on menu, but they do have breakfast and burritos, so at 1pm the lovely woman taking my order talked to the chef who agreed to make me one with basically anything I wanted. It's unclear whether they do breakfast all day, or decided \"why not?!\" since the place was entirely empty. We settled on egg, chorizo, beans, tomato, onion, cheese, and sour cream ($10). Far from the ones reminiscent of LA that I'm seeking, but I love the flexibility and willingness! This thing was big, full of eggs and chorizo, super fresh, and had amazing flavor! The al pastor burrito (con todos, $10) and the salsa verde are both knockouts as well!\n\nCONS: Eventually, I ate it all :(\n\nThere's a reason this place has 5 stars; come experience it!"
    },
    {
        "id": 49,
        "text": "Super delicious!!!!! People are so nice and the food is fresh and tasty. A staple for take out or dining in."
    },
    {
        "id": 50,
        "text": "Authentic Mexican in the heart of South Philly."
    },
    {
        "id": 51,
        "text": "This is a great local restaurant. It's a BYO cash only no frills Mexican. It's cute, clean and family run. It's a lot of food-the chilaquiles, even with green sauce still has some spiciness to it."
    },
    {
        "id": 52,
        "text": "I stopped in here on a whim on a Saturday evening when my boyfriend and I happened to be in the neighborhood and had some time to kill before a party. We both ordered barbacoa, which was juicy and delicious. Food was great, service was great (although we were the only ones there), will definitely go back. The location is pretty unassuming at 7th and Moore, I've passed by there dozens of times and I'm really glad I finally tried it."
    },
    {
        "id": 53,
        "text": "I found this spot on UberEats and decided to give it a try. I ordered the Flautws, Fajita mitas, and a burrito. The portion were pretty good and the food was tasty. The flautas came in quantity of 3 big sizes so it was worth the price. Honestly everything was flavorful and delicious. I would definitely love to sit in the restaurant to eat the food fresh since it was delivered for COVID reasons."
    },
    {
        "id": 54,
        "text": "Don't let the outside of this place scare you away. The inside is cozy and clean just as other Yelpers have described. It's hard to find good Mexican food in Philly, but I was pleasantly surprised at this place. \n\nThe focus is on Mexico City style food. The menu is quite limited, but we were really happy with what we got. As others have mentioned, the star of the show are the quesadillas. It's not like what you think of when you think of a quesadilla. I would never normally go out and order that because it's something you can make easily in five minutes. However, this one was different. It is a fried crispy dough with filling in the far inside (we got cheese and mushroom) and topped with queso fresco and lettuce. It's all about the texture of the dough and it's not something I could easily make at home. The portion is also incredibly generous. You get two per order. They're probably terrible for you since they seem to be fried, but hey we all got to live a little. \n\nThe chicken tostadas were also tasty. The chicken was tender and well marinaded. The enchiladas were just okay, so I will order something else next time instead of them. Free fresh chips and salsa were brought to the table. They kindly offered to refill our salsa later so we could enjoy it with our dishes. It was nice and smokey with a little heat to it. \n\nService is friendly. I love the open kitchen. To enjoy your meal in comfort, I wouldn't go on a day with a strong temperature extreme. We went on a cold evening and it was really chilly inside. It appears they only have one little old heating/air unit."
    },
    {
        "id": 55,
        "text": "Ordered for the first time the alpastor tacos were amazing my chicken nachos were delicious as well.very friendly staff i will be coming back here for sure so glad to have a awesome taco spot near my house with great food"
    },
    {
        "id": 56,
        "text": "No hesitation at all in giving this new restaurant all 5 stars. The food was fantastic and as authentic as it can be!!! We ordered the chicken quesadilla and the enchiladas verde. Both were amazing. We had never had a fried quesadilla, but now we know it is the all time best way to eat a quesadilla! The inside of the quesadilla were very moist as was the enchiladas verde! We can't wait to visit again!!"
    },
    {
        "id": 57,
        "text": "We went for breakfast. I had the camarones de a Diablo. Husband had the A la mexicana. Welcoming employees and awesome food. Great little spot! BYOB. Cash only."
    },
    {
        "id": 58,
        "text": "Excellent little family owned restaurant in South Philly. I really enjoyed my chicken burrito. So much flavor and the chicken was really tender. My girlfriend had tacos that she enjoyed. We also had chips and guac on the side. Service was great. Cash only"
    },
    {
        "id": 59,
        "text": "Wanted to love you- but during this time when covid-19 is on the rise I places a pick up order only to see that no mask were being worn inside by the cooks and wait staff and there was indoor dining available despite the current restrictions on indoor dining. So disappointed! Will not return!"
    },
    {
        "id": 60,
        "text": "I went here for the first time today and it was by far one of the best Mexican restaurants I have been to in Philadelphia. The food was amazing and the service was exceptional! My server was so nice and helpful! I would definitely recommend this restaurant!"
    },
    {
        "id": 61,
        "text": "Maribel has changed their name, but the delicious flavor and friendly service have stayed the same. I find myself returning here often for their Mexico City style quesadillas. If you have never had this, or even if you have, it's a must order! It's a homemade crispy masa dough that is fried and stuffed with Oaxaca cheese, a protein of your choice or mushrooms, lettuce, cream, and a little queso fresco on top. Then I add some of their homemade green and red salsa for a little heat. The ingredients come together in perfect harmony, but the crispy texture of the shell is what really makes it. \n\nWhen I first started ordering them, I got mushrooms because I would share a chicken dish with my husband too, so I wanted to change things up. Recently, I've been going because of my quesadilla craving and ordering them on my own. The first time I did this, I ordered chicken. It was pretty tasty grilled chicken, but I preferred the mushrooms. The second time I ordered it as tinga de pollo and ended up with the delicious well seasoned shredded chicken that is in their tostadas that I love so much. So please make sure you specify which one you're after when you order! \n\nI also found out that they can make this dish grilled as well. I am always tempted to try it, but the super crispy fried corn dough is always calling my name. If someone gets around to trying it, please let me know. I am just too addicted to the original at the moment!"
    },
    {
        "id": 62,
        "text": "Ate here for breakfast today and it was amazing! Tasty and authentic! And generous portions."
    },
    {
        "id": 63,
        "text": "I came here to kill some time for Mi Pueblito food truck outside. Super friendly staff, but most likely owners . I ordered chips and guacamole and my guacamole was made fresh in front of me so I can customize by asking not to put jalapeño. \n\nI will definitely come back to try their food"
    },
    {
        "id": 64,
        "text": "Buena\n atención y exelente ambiente todo bien\nRecomendable  todo bien la comida bien no es muy tardado como en otros restaurantes mi preferida es fajitas de pollo y los tacos campechanos"
    },
    {
        "id": 65,
        "text": "Found this business on Yelp when looking for an affordable BYO in walking distance. The service was great and the food even better! \n\nI had the enchiladas en salsa roja and it was very spicy, but delicious. When I ordered it the server said, \"are you sure? It's very hot\", so I was a little nervous but it was great. Came with a side of rice and beans too. Delicious!\n\nCash only but has an ATM inside with a $2 fee."
    },
    {
        "id": 66,
        "text": "I ordered burrito and tacos here and I was very disappointed. The burrito contain mainly rice and lettuce, It barely had any meat in it. Similar with the 3 tacos I got.  Not giving it another chance since there's plenty of Mexican food places around my area."
    },
    {
        "id": 67,
        "text": "My girlfriend and I ordered takeout from this place after finding ourselves craving some Mexican food. She went with her default of tacos a la carte, and I tried the carnitas burrito. The tacos were piled high with meat, but the burrito was lacking. The flavors were great, but the size and content of the burrito was a bit of a letdown. This place is definitely not the worst option, but there are plenty of better ones nearby."
    },
    {
        "id": 68,
        "text": "Came here a couple of Friday evenings ago. The tacos are very delicious and fairly priced and the staff was very very friendly. If I happen to be back in this neighborhood I would definitely stop by for a bite."
    },
    {
        "id": 69,
        "text": "I came back here because I enjoyed the fresh guacamole. I saw a sign promoting the birria tacos. Keep in mind that this restaurant is not related to Mi Pueblito truck that makes awesome birria tacos.\n\nI was greeted by super friendly lady, very welcoming. \n\nBirria tacos: the broth was salty, not too much flavor. I would rather wait an hour outside for the truck.\n\nAl pastor: small pieces of pork, missing the pineapple pieces, not too much flavor. It's a little bit salty for my taste."
    },
    {
        "id": 70,
        "text": "In my continued quest for the perfect Al Pastor taco my search today led me to Mexico Lindo. I first have to say that I lucked up and got a parking spot right in front of the place because trust me parking around this area is tight and there are tow signs literally every where so know before you go.\n\nThe restaurant is very small. You can eat in but there are only five or six tables. The gentleman who took my order was very nice.\n\nOn to the tacos. I was hoping for greatness but I just got okay. Like with Chiquita's Pizzeria and Mexican Grill, Mexico Lindo also puts sauteed onions in with the pork. I simply don't understand why you need cooked onions when you are going to garnish it with raw onions. Maybe it's a Mexican South Philly thing. In any event I took them out. There was plenty of pineapple included which I loved. There was no grilled jalapeno or radish on the side and the limes had definitely seen better days. The salsas were thin and watery but the green one had good flavor. The taste of the Pastor was acceptable but clearly my search must go on. Other than that, I would try other menu items."
    },
    {
        "id": 71,
        "text": "Most authentic tacos I've had in Philadelphia! Steps away from Bok Bar so it's great for some post beer eats. Other than that, it is quite far away. Owner and waitresses mostly spoke Spanish so ordering was a bit difficult, though their menu is very self explanatory. My friend had the vegetarian burrito ($9) and I got chicken and pork tacos ($6). Meat was tender, well seasoned, and the portion size was perfect. \n\nThey are CASH ONLY. There is an ATM but at the moment, neither me nor my friend had cash/debit card and we found this out after we had devoured the food (oops). The owner was way more understanding than expected and I promised to pay him with cash the next morning. We somewhat shoke on that contract and left. Without paying. Yup. They were super chill and trusting like that. Can't get any more mom and pop shop feel than that \n\nAnyways, irrelevant to the review but FYI I did bike back a good 30 mins the next day from West Philly and delivered my dues in cash. The owner was surprised I had actually kept up my promise since he looked shocked and thanked me profusely for paying.\n\nThanks for a great home cooked meal, Maribel! (Now Mexico Lindo)"
    },
    {
        "id": 72,
        "text": "This place is amazing! By far my most favorite place to get tacos in South Philly. The food is super flavorful, and they have really great salsas that taste very fresh. Really nice people as well. Definitely order from them, you won't be disappointed."
    },
    {
        "id": 73,
        "text": "I will absolutely be back to this authentic Mexican BYOB! I wanted to go here because I could see that it needed a little encouragement on yelp! I wanted to go and give it my fair try and chance for a good review! And they certainly didn't disappoint!\n\nAmbience- wise, it is adorable in there! And the bathroom is very clean! The staff was super friendly! But the place was empty. I went at 7 PM on a Thursday night. One or two Hispanic man came in, and so did a family of seven, but then they left when they saw that the place was on the lighter side that night.\n\nMy date and I wanted to stay and enjoy ourselves! And we certainly did! We brought in wine, and they gave us wine glasses. I ordered the chicken and steak mixed fajitas, and my date ordered Enchiladas. \n\nThe portion sizes were great, and the temperature was even better! The chicken was a little bit salty but tasted delicious mixed with the sweet peppers and onions that were cooked to perfection. Next time, I will ask for more tortillas! \nMy date liked the enchiladas! Only comment was that the chicken might be on the dry side. Salsa Verde was a sauce of choice! They also serve as complementary chips and salsa! One was spicier than the other so it complemented my date and my taste buds very well!\n\nOverall, I will definitely go back here for Mexican food! Next I will try the tacos, but I'm sure they will be superb! \n\n$24 for a lovely date night!\n\n\nThanks México Lindo!"
    },
    {
        "id": 74,
        "text": "Its a small venue but they have a nicely varied menu of traditional Mexican food. Friendly staff and service.  You can also watch them cook, which is something that I get a kick out of.  Don't let the neighborhood intimidate you as it's a great hidden gem."
    },
    {
        "id": 75,
        "text": "Don't let the outside fool you.  Don't even let the inside fool you.  Just sit your butt down and enjoy the best Mexican Meal ever.  \n\nThe prices are reasonable, the service is great, BYO, and when you leave you too will say, \"Don't let appearances keep you away.\""
    }
]