[
    {
        "id": 1,
        "text": "Food quality depends on the day. Yesterday was my last day spending money at this place. As we watch the waitress serve nachos and dip to the guy next to us and right before we were leaving another table. This had us very upset since we did nothing wrong and are the type of customers that you would love to have. Seeing that it was more family environment working there I always left a huge tip, as for last night I left nothing. Never again!! And I hope it wasn't a problem to them that I wasn't Spanish and my husband is. I will not bring my family here anymore. It's a shame because my daughter loved seeing the police officers eat there."
    },
    {
        "id": 2,
        "text": "I was dying for a good Mexican restaurant to open in North Philly. I did not expect a truly excellent one to open but here it is. I have been here 5 times and tried something new each time. So far the chicken mole is a killer dish. The sauce is truly sublime with a hint of heat. Now in my top five restaurants in the area."
    },
    {
        "id": 3,
        "text": "The owner Nicholas is usually in the kitchen and he is the best great prices and even better food the best Mexican restaurant in Philly everything on the menu is superb and fresh always.  I would recommend this restaurant hands down.  Edgar colon July 30 2017"
    },
    {
        "id": 4,
        "text": "I swear I wish I could give them 5 stars ! They are totally worth it , when the effort is put in . 4 Seasons has always been one of my favorite Mexican Restaurants . I used to stay strict to the burritos, but this summer they tried something new that blew me away . They took their cooking outside ! & the idea couldn't have been a better one . They began grilling the steak outside in front the restaurant , & yes , it's amazing ! Literally the BEST taco I ever ate in my life . This brought them so much clientele, put them on the map honestly . I'm so proud of them ! \n\nNow for the cons , cause like , why would I  give them 3 stars if they are the best ? \n\nTwo words : COMMUNICATION & CUSTOMER SERVICE !!!! \n\nI cannot stand trying to order food and not being understood . I understand that everyone isn't perfect but in a restaurant/business setting , I just feel like there is a certain level of professionalism that should be held when dealing with a language barrier . \n\nAs I've stated in other reviews , I am Puerto Rican but choose not to speak it . That's always a big problem I face in Philly . The daytime crew gets it poppin' ! They do their job effortlessly and quickly . The nighttime crew , which actually consists of young woman working the register and whatever cook they were able to get to work later , is terrible ! The girls are clearly not open to learning anything which has made me refrain from ordering after 6-7 pm , unless they're still outside . I even had one instance where I called in an order , went and picked it up & paid with my card , just to find out the next day that the girl gave herself a $5 tip! Like ... wtf .. regardless they fixed it the next day but the point is W T F . Lol . Anyway , if you're in the area and you see them on the grill , STOP ! You won't be sorry"
    },
    {
        "id": 5,
        "text": "Great Food And Sevice... Had The Shrimp Tacos And Steak Fajitas Everything Nice And Hot And Well Seasoned....!"
    },
    {
        "id": 6,
        "text": "The food is awesome. It's a popular venue in the hood for cops like me that serves good Mexican food. I work up the street in the police district. When I'm in the mood for some Mexican, I always think of this spot. The tacos are amazing. I always order chorizo and tongue tacos. When I'm not in the mood for tacos, I order a chorizo burrito which is quite a handful. If you dine in, you get treated to chips smothered in refried beans and cheese. I'm getting hungry just thinking about all this deliciousness!"
    },
    {
        "id": 7,
        "text": "The chicken breast looked unappetizing and tasted horrible. I had to stop eating it because I was starting to feel sick. I paid for tres leches and didn't receive it. I'm upset I didn't realize until I got to New Jersey. I'm so disappointed. Never again"
    },
    {
        "id": 8,
        "text": "El mejor restaurante que e ido en philadelphia su sabor. Su servicio, me facina ir a comer hay voy casi todos los meses mi restaurante preferido"
    },
    {
        "id": 9,
        "text": "Stopped in for a quick lunch and ordered 3 tacos, 1 chicken 2 carnitas (Mexican slow cooker pulled) to go. Our host was polite and friendly towards us and let us know it would be a 15-20minute wait. We received the tacos on cornmeal soft shell tortillas. Our food was good, which came with red and green sauce. I wasn't a fan of the pork tacos, it just wasn't my thing. The chicken taco was really good. \n\nInside was clean and had a few tables set up and have a few patrons eating. There's a soda refrigerator as well as fresh fruit for smoothies. Next time I come I'm definitely trying a smoothie. There's also Mexican style candy at the register."
    },
    {
        "id": 10,
        "text": "This hidden gem took me by surprise, on a rainy Sunday all three of us were feeling for some good Mexican food. We goggled what was near us and came across \"4 Seasons Grill Mexican Restaurant\" We had never been there and decided to go. This Mexican restaurant serving authentic dishes draws on fresh ingredients and traditional family recipes, the food is so flavorful and delicious I cannot brag enough about it. The atmosphere is casual it is small and cozy with a very friendly staff and patrons. We ordered the Steak tacos served with cilantro, onions and limes. These were incredible the steak was cut to order, we each had one and vowed never to go anywhere else but here for Tacos. Each of us order a steak entrée, I had the Bistec a la Mexicana this Rib eye sautéed with garlic, onions, jalapeno peppers and tomatoes draw on some authentic inspirations I've was especially impressed with how well-seasoned the steak was it melted in my mouth big, juicy, so flavorful. We all fell in love with 4 Seasons Grill Mexican Restaurant!"
    },
    {
        "id": 11,
        "text": "I've stoped at tacorias all over Philly, most suck, Today I found a gem in the hood. Friendly, helpful staff, quick service and terrific flavors. Definitely stoping back for more."
    },
    {
        "id": 12,
        "text": "Bruh this place is lit. 6 dollars for hefty burritos and other menu items are super cheap as well but dont let the low prices dissuade you because they definitely dont compromise on quality.  My buddies and I ordered 6 entrees, an app, and a horchata and the bill was just under 50 bucks!  I'm guessing cops frequent this place a lot because the day we went there there were like 30 officers dining there. So if you have the drunchies or \"munchies\" and you tryna bust a mean grub just be on your best behavior otherwise you might have to deal with law enforcement."
    }
]