[
    {
        "id": 1,
        "text": "Don't let the outside fool you-this place is much cuter and nicer inside than you would expect! \n\nFood is good and reasonably  priced. We ordered papaya salad, triple flavor duck, and king tofu soup. Papaya salad is always refreshing, but this place overdoes it on the fish sauce. Anything triple flavor is always a safe but delicious choice. I would say their king soup, with choice of protein, is a winner. \n\nAnd also, BYO!"
    },
    {
        "id": 2,
        "text": "I live in the neighborhood and absolutely love this place! Everything I have ever gotten here has been really good. They have a lot of dishes with very unique and distinct flavors. Overall, this is one of my favorite restaurants around. They also have a very good lunch special if you are ever nearby on a weekday."
    },
    {
        "id": 3,
        "text": "One of my favorite restaurants in Philly! Check out my full review. http://goodyummyeats.wordpress.com/2013/08/04/vientiane-cafe-best-laotianthai-in-philly/"
    },
    {
        "id": 4,
        "text": "Wow!   Soooo full!    Great staff!   Delicious food!   BYOB!   Good times!      I loved the wings, tofu, and the catfish!     I can't wait until I'm back in town to visit.    It's slowly becoming my undisputed go to restaurant when I'm philly!   Also heard from a patron that Uber eats started delivering.    Wish I lived closer so I could enjoy more frequently.    Absolutely one of my favorite spots for a good meal!"
    },
    {
        "id": 5,
        "text": "This is my kind of place - they use fresh everything and the seasonings are expert.  The service on Friday nights is fantastic.  \n\nOver the years, the cooking has improved and is tastier than ever.  It's hard to get a seat, so plan on waiting 30 minutes on a busy night - that being said, it's not long until you are seated and promptly given water and they have real candles here.  \n\nI always order the coconut soup (I order it with the tofu \"not fried\") and also the yellow curry with tofu - also not fried.  It lends a more delicate flavor to the already rich curry.  It is to die for - tastes like dessert.  It is served with rice.\n\nLast time I ordered the Pho - my goodness, the bowl is so huge and served with two sauces - hoisin and siracha.  Very good and filling - I would order it next time with more veggies (they are very good at helping you with special orders)\n\nThis is a BYOB and the prices can't be beat.  The menu keeps getting larger and I only wish I were closer to this place, as I would come here weekly for sure!"
    },
    {
        "id": 6,
        "text": "Delicious. So delicious. Why do they not have a sign anywhere that says CASH ONLY? We definitely had to send my brother out to get cash when the bill came. Embarrassing.\n\nI had the Pad Kee Mao (drunken noodles) which were delicious. Though the menu said they'd be spicy, and they didn't even have a slow burn thing going on. Next time, I would get it spicier. Lots of beef in it though, they definitely did not skimp on that.\n\nMy parents both ate Pad Thai and loved it. I snagged a bite of my mom's Chicken Pad Thai and it was pretty yummy. I prefer greasy spicy noodles though.\n\nThe desserts here are so so good. A bit overpriced maybe ($6 a piece), but delicious. I had the sticky mango rice, my mother ate the chocolate banana egg roll, my brother had the banana tempura. All yummy.  My dad clearly made the right choice when he ordered the coconut ice cream. It came in half a coconut and there was SO MUCH ICE CREAM. I dont' know if they make it on location, or if they get it elsewhere, but I could definitely eat it every day.\n\nI'm going to drag my brother here for the rest of the time he's at UPenn. I'm into it."
    },
    {
        "id": 7,
        "text": "I have been in a couple of times. I would skip their Pad Thai, I like it a particular way and either you got it or you don't.  What I do like is a lot of other items, like the Sweet Basil Salmon or the NomNom salad. I have also seen plenty of other dishes float by that I am willing to try.\n\nThere expansion seems to have paid off  and its now much more comfortable to sit and stay a bit."
    },
    {
        "id": 8,
        "text": "Delicious and authentic Thai/Laos BYOB that I would definitely try again.\n\nI don't usually wander too far into West Philadelphia but I'll have to make an exception for this place. With the cute interior and the papaya salad along with beef jerky was nothing short of amazing, I'll have to return sooner than later. Especially for the Thai tea as well. Some places make it watery but it was made just the way I liked it.\n\nStaff was friendly and attentive. Service was a little slow but it was a busy Saturday night, so it was understandable. A must try."
    },
    {
        "id": 9,
        "text": "This is an absolute MUST visit.\n\nEverything about this place is damn near phenomenal.\n\nThe food is fresh and clean; you can tell it hasn't been frozen or sitting in a fridge.\n\nThe service is great! All of the employee's there are friendly and helpful (I can barely pronounce \"perform\" correctly).\n\nThey have a lot of Gluten-free and Vegetarian options, which is nice."
    },
    {
        "id": 10,
        "text": "My green curry was wonderful and filling.  Went for lunch with a friend, as she'd been before and loved it.  Our server was really sweet  and attentive.  The only thing I wasn't crazy about was cash only, but it's printed prominently on the menu before you order.  Server helped me quickly find an ATM. Plans to go back are definitely in my future."
    },
    {
        "id": 11,
        "text": "Dinner here was great until the very end, but my opinion was definitely soured by being informed \"we do not accept credit cards\" only after I went to pay with a credit card. I checked the doorway on the way out - nope, no sign. There was nothing on the check to indicate they were cash-only, I don't remember seeing it listed on the menu (and I look for these things!) While dinner was delicious, that is a customer service fail that left me less-than-impressed. \n\nUp to that point, though, I very much enjoyed my dinner here. We started by sharing an order of spring rolls, two large rolls were served cut in half which was a nice portion for sharing. The peanut sauce they are served with is delicious! I had the panang curry -always delicious, although not anything particularly innovative. My friends had the pineapple fried rice (I had a taste - again, good but nothing mind-blowing) and sweet basil chicken (this is something I had never tasted before - yum!). Portion sizes were generous and the prices are reasonable. Service was OK - there was a long wait between appetizer and entrees, and for a while our water glasses were very neglected. \n\nThey would have gotten 4 stars had it not been for their poor advertising of the cash-only policy. If you like Thai food they're worth a visit, just make sure to hit up the ATM before you head in!"
    },
    {
        "id": 12,
        "text": "i have eaten pad kee mao (drunken noodles) at every thai restaurant in the city and i hereby declare that they are best at Vientiane!  fat noodles that are a tiny bit sweet and oh so spicy (if you ask for them hot- 1-4 stars).  the staff here are just fantastic at making sure to ask you just how you like it, and then delivering.  i get my padkeemao 2 stars of spice out of 4.  my boyfriend gets his red curry extra extra spicy and"
    },
    {
        "id": 13,
        "text": "Don't like being a hater, but 1st knock on it \nwas that it took an hour to get my food, then it wasn't that good either. Kind of bland.  The people are nice and the restaurant looks nice too, but doubtful if I'm coming back. The curry was bleh"
    },
    {
        "id": 14,
        "text": "I get the King Soup every time I go. It never disappoints. Great service. Friendly workers. Humble  Owner. Authentic food. AND BYOB. Can't beat that. The new fruit tarts they serve are a hit also."
    },
    {
        "id": 15,
        "text": "This is my go to restaurant! Omnivore, vegan, gluten free... All are welcome. The beef jerky is so yummy. The Kings soup is also one of my favorites.  The Naam salad is the best thing on the menu. West Philly gem."
    },
    {
        "id": 16,
        "text": "Ate at Vientiane for UCity Restaurant Week and was disappointed - the appetizers were good but the entrees (pad thai and paneng curry) were tasteless and boring. The dessert I had (can't remember what it was) was absolutely disgusting.\n\nAfter reading all the positive yelp reviews, we went back last night to give it a second chance. Thai iced teas were great. The crispy pork spring rolls were delicious, with a great pork flavor (though the crispy spring rolls at Vietnam Cafe are similar and much better). The grilled mixed vegetables with peanut sauce were bland, but the peanut sauce was excellent. I bet the chicken satay is good.  \n\nWe were really thinking that we were in for a good dinner until the entrees came. Not only did it take FOREVER for our entrees to come, but they were terrible! We got the pad thai (again, to see if it would be better), but it was exactly the same: bland. Pad Thai is supposed to burst with the flavors of tamarind, fish sauce, bean sprouts, and peanuts. This didn't burst at all.  After reading great things about the crazy pineapple fried rice, I went for it, but it was bad too: the pineapple was absolutely delicious, but didn't go well with the flavor of the fried rice, which was bland and vaguely unpleasant.\n\nWe paid $50 with tip for 2 entrees, 2 appetizers, and 2 thai iced teas. \n\nAs we left, I suggested we only come here again for appetizers. We decided to just not come again.\n\nMake the trek out to Silk Cuisine in Bryn Mawr! Best Thai in the area, hands down."
    },
    {
        "id": 17,
        "text": "Despite the fact that Vientiane had run out of nearly everything I tried to order, I am still giving it four stars.  Their food is that good, their menu that extensive.\n\n(But seriously, order more tofu.  This is West Philly where more people are probably vegetarian/vegan than not... Ugh!!!)\n\nRegardless of their failure to supply me with my necessary protein intake, I still really enjoyed my meal.  We started with the papaya and cucumber salad which was delicate and at the same time complex.  Then I had veggie pineapple fried rice and asked them to load up on the veggies because of the tofu outage.  They obliged, and the plate was delicious.  I got spice level 4/5 and didn't find it very spicy, but I may just have a high spice tolerance.\n\nFor dessert we had the mango sticky rice and chocolate banana fried something or another... Both were delicious.  The mango sticky rice had slices of fresh mango with coconut topping.  \n\nI will be back.  And hopefully they will have what I order."
    },
    {
        "id": 18,
        "text": "I love Thai food, and this place does not disappoint. Their lunch special is ridiculously awesome: $10 for soup, an appetizer (or, if you are soup averse like my husband, two appetizers) and an entree that is only slightly smaller than the regular entree. I, two opted for two apps and no soup, and the fresh spring rolls and dumplings were yummy. My husband's tofu satay was also good and came with some delicious sauce. The place is a bit small, but the food is great and the price is right."
    },
    {
        "id": 19,
        "text": "Deciding to come to the Vientiane Cafe, a Laotian/Thai restaurant, was a pretty easy choice after hearing a positive review about it from a friend. The only difficult part to getting out here would be convincing my other friends that it would be worth the short trek from Penn's campus. Always looking to explore affordable options outside of Penn's standard offerings, I finally got a small group to come out to try the place on a slow weekend.\n\nThe Vientiane has a small storefront located along a row of other randomly put-together offerings, including a record store and a Chinese take-out restaurant. Upon entering the restaurant, there was a sense of warmth and community as the waiters and kitchen hummed along and the diners happily focused on their food and conversation. Stepping in from the chilly walk and the proximity of the other tables certainly helped set the mood too.\n\nLuckily for us, we came just in time to snag the last available table. Promptly after we arrived, a small line began to form outside. As a side note, it's probably better to come a bit earlier for dinner because the restaurant only has seating for about 20-25 people.\n\nThe prices for entrees, about $8-$12 for most items, were in-line with what I was expecting and were pretty well-sized. We tried to order more Laos-influenced and less commonplace Thai dishes. We ended up sharing 4 entrees--homemade sausage, laab, sweet basil with chicken, and a pineapple fried rice--and stick rice, figuratively the \"glue\" to this meal as it absorbed the delicious sauce. The sticky rice came in these cool, little Laotian rice baskets which were used for steaming the rice. I'm sure the rice baskets are commonplace, but I was really excited to see them (*note to self: must get out more).\n\nAfter the meal, we were all quite satiated and satisfied with our meal, including the bill, which came to roughly $15 per person (all-inclusive).\nFor my first foray into Laotian cuisine, I was happy with the experience. Compared to other Asian cuisines, there was greater use of mint, cilantro and spices to bring out the flavor in the meat dishes. My favorite was the laab dish, a warm minced meat salad served with chilis and mint. It is allegedly  also the unofficial national dish of Laos (I'm always amused where Wikipedia sources their information when there are no footnotes).\n\nI would definitely come back for a lunch or dinner with a small group of friends."
    },
    {
        "id": 20,
        "text": "Awesome food, friendly staff, byob, cute cozy restaurant. I always get the duck curry (spicy), pad se eww, papaya salad and naam salad."
    },
    {
        "id": 21,
        "text": "My friend & neighbor got catering from here (all vegan) and it was amazing. Will definitely be going to the restaurant soon with my husband as I am certain he will enjoy it as well."
    },
    {
        "id": 22,
        "text": "My first time here and I honestly think this was the worst experience I've had at a restaurant. I was really disappointed with the food. I was hoping it'll taste authentic, but I guess they made it more Americanized which is kind of understanding. I ordered the papaya salad (thum ma hoong) for appetizer, it tasted okay... Down side was that it was too plain for me, didn't really taste like the flavor I was hoping for.  The pad see ew was also so flavorless, I wanted to get a taste of toasty-ness from the noodles. Lastly, the desert. I ordered the sweet mango sticky rice which is my favorite Thai desert ever and I was really upset with this one. The sticky rice was more on the soggy side than sticky side. The coconut cream was just slapped on top of the sticky rice which I don't know why because it's suppose to be mixed together with the sticky rice. Also the mango wasn't ripe, it was hard & not as sweet as it should be. The only thing that pleased me was the beef jerky (seen hang), it was really chewy & flavorful with seasoning & a side of a sweet spicy tangy sauce which made it taste 10x better. Although, the food wasn't to my likings, the service & the environment was great & soothing. Which was the reason for the 3 stars. Friendly staff, but horrible food."
    },
    {
        "id": 23,
        "text": "One of my favorite restaurants ever. So far I've had (and loved):\n\n- Panang Curry: This is by far my favorite. The quality of the tofu is amazing. \n- Drunken Noodles\n- Vegetable Dumplings\n- Banana and Chocolate Rolls\n\nThe only reason this is a four star and not a five star is because their red curry was pretty awful. \n\nThe place also has great ambience. It's super cute, and a great hidden BYOB. The servers are extremely friendly and service is quick! It is also really easy to get a reservation for a big group on fairly short notice."
    },
    {
        "id": 24,
        "text": "Excellent food, though if you can't handle spicy, do proceed with caution. I chose a Laotian dish was quite unique--very different from Thai. Mines was spicy but not red spicy; rather, the \"Aw Laos\" dish was flavourful with dill and other veggies in a beautiful stewlike concoction. Comes with sticky rice. Definitely recommend this particular Laotian dish. Desserts were nothing too spectactular--fellow diners ordered mango with sticky rice and a coconut-agar dessert. No wows but a complacent recognition by my friends. Atmosphere is nice, for date or with group of friends. Worth checking out. Seems a reliable staple in this part of the woods. Food did take a while but service was friendly. Overall, B experience."
    },
    {
        "id": 25,
        "text": "Love the Naam salad and the Panang curry!!! Coconut soup is also amazing. One of my favorite spots in west philly."
    },
    {
        "id": 26,
        "text": "We discovered this Laotian restaurant through yelp while visiting our family so we decided to give it a try. The look of the restaurant from outside was deceiving where we almost left after we arrived because of the location, parking situation, and my fear of not being used to the type of surroundings. When we walked in we were surprised by how warm, cozy, clean, filled with customers, and we were greeted and seated promptly. It didn't take long for us to get our food and the food was very $reasonable. We ordered the sticky rice, chicken larb, papaya salad, beef jerky, stick rice mango dessert and all we delicious. We enjoyed all but probably will not order the sticky rice mango dessert again for $8 although we didn't mind paying for it considering the cost of how much it would have taken for them to make it but it was just a little too watering for us. We would definitely do it again next time we visit Philadelphia since we don't have any Laotian restaurants in Tampa area. I would highly recommend this place for anyone who likes to try authentic Laotian food that cannot be found from Thai restaurants. This was the first Laotian restaurant we have ever been to and we truly enjoyed the Laotian unique food experience! \np.s BYOB is a plus.."
    },
    {
        "id": 27,
        "text": "I had the lunch special with Tom Yum soup, fresh spring rolls, and tofu Pad Thai all for a little more $11.\n\nEverything was really yummy and up to my standards. \n\nI have no complaints other than service was pretty slow but friendly. Either they need an extra person during lunch time on a Thursday afternoon or she simply was not attentive and proactive enough.\n\nFor the sake of the food and just more patience needed (or merely hoping for better service next time), I definitely would like to come back again."
    },
    {
        "id": 28,
        "text": "I had lunch with about 16 friends on a Saturday afternoon, and without exception, we were pleased.  The food was exceptional. My husband and I tried the Tom Yum soup, the satay appetizer, the pad thai and the fried rice.  We thought everything other than the fried rice was special; you know a little out of the ordinary compared to what we have eaten at other places.  The tofu satay was perfectly made, and the vegetarian spring rolls were really tasty.  Dessert included nibbles of coconut ice cream, a fried chocolate banana and the sticky mango rice.  I highly recommend the coconut ice cream.  Sticky mango is one of my favorite treats, and this was excellent. But the friend banana was pretty close to what I have had elsewhere (except I never had friend banana with a splash of chocolate tlike this). \n\nAs to other issues, here is the run down: parking was available in a nearby free parking lot; the wait service was friendly and service was quick; the atmosphere was perfect for quiet two-person conversation and large group atmosphere; and the prices were moderate.\n\nI highly recommend this restaurant."
    },
    {
        "id": 29,
        "text": "I'm basically addicted to the green curry with tofu. If you can handle a little spice you have got to get this dish. \n Also the king soup is fantastic and the Nom salad. And the coconut soup! The Mango sticky rice is also fantastic. Those are the only things I get. The fact that it's byob is super nice too. I'm giving it 3 stars cuz I've been pretty unimpressed by the noodle dishes. But it's still one of my favorite places to eat on Baltimore ave."
    },
    {
        "id": 30,
        "text": "A friend and I were craving savory curries and delectable mango sticky rice so we grabbed a few bottles of vino and situated ourselves at Vientiane Cafe. The space is small, but clean and comfortable. The wait staff was extremely courteous and prompt with our orders and didn't try to charge us extra for uncorking. I got the yellow curry (which is Massaman to me) and my friend got the green. Both were generously portioned and colorful. I would have liked by curry a tad less runny, but it tasted quite good and had the right touch of sweetness. \n\nNeedless to say, my friend and I ended up consuming a great deal of wine and lost track of time. We noticed the staff was closing, but they were really polite about it. They didn't say anything to us or passive aggressively thump around tidying up, they just waited patiently for our oblivious drunk selves to schlep our stuff and leave. I would definitely come here again because of the excellent service."
    },
    {
        "id": 31,
        "text": "Amazing food! I am obsessed with their Nam Salad. Although it is a tiny place, and very dim, I enjoy eating there. Their homemade sausages are delicious and full of flavor. I love their eggplant and duck rolls as well!\nDefinitely a good place to dine!"
    },
    {
        "id": 32,
        "text": "Ok. Without fail, EVERYONE I mention this place to, LOVES it. It has amazing, flavorful food, and it's SUPER inexpensive. I think the lunch special, for example, is something like $10 for a 3 course meal. WHAT?! And dinner's not much more than that. The decor is cute and quaint, too, AND it's a BYOB. I recommend coming on the early side on the weekend, as I don't believe they take reservations, and it gets VERY crowded. However, beyond that, it's pretty fabulous. Definitely a huge fan!"
    },
    {
        "id": 33,
        "text": "Not-so-good:\nSmall capacity increases wait\nService during peak times is slow\nPrices are slightly more expensive than considered reasonable\n\nGood:\nFood (I am a vegan) is FANTASTIC!  Been here three times and have never had a bad dish!\nService is friendly"
    },
    {
        "id": 34,
        "text": "Let me just update this review because I've had a new experience with this Heavenly Eden. \n\nI had these lovely people and gifted cooks cater an event of mine. Not only were they ridiculously affordable AND generous with their portions -- huge trays of individually cupped mango sticky rice for 40 people, with extra \"sauce\" and a good amount of mango topping each one -- but they were so nice about everything! Incredibly helpful, lovely people (who give you free chopsticks and more!\n\nI picked summer rolls, two entrees (one of which came with rice without me even having to ask for it), and a big dessert. Yum! The food was just as fantastic as it was in-house!"
    },
    {
        "id": 35,
        "text": "A fabulous little gem in West Philly! I was back in Philly for the weekend, and this placewas the epitome of what I love about the food scene in Philly. 8 of us arrived with a reservation at 8 PM on a Saturdsy night, and we were able to have a little corner of the restaurant to not disturb others while we BYOed. The servers were so friendly, gave us pitchers of water so we wouldn't have to wait for someone to come over, and uncorked out bottles of wine happily. The food came out quickly, and the portions of food were large for the price. A nicer place to come for a nice night out, without spending exorbitant amounts of money. Go here for a date night or a BYO with friends!\n\nps the sticky rice is wonderful."
    },
    {
        "id": 36,
        "text": "Ordered Pad Thai, pineapple chicken and an order of wings as takeout..... yummy yummy yum! Next time I plan to dine in- it's very casual and chill inside"
    },
    {
        "id": 37,
        "text": "Best Thai food I've had in Philadelphia, definitely recommend anyone who loves spicy food to check this place out!"
    },
    {
        "id": 38,
        "text": "This is another gem in west philly.  The decor is better than average. The service is decent.  Food is good but not exceptional.  This is a place I would gladly take any family members or friends from out of town."
    },
    {
        "id": 39,
        "text": "Vientiane Cafe - oh I love you dearly. Not only do you always provide an affordable meal that all seem to enjoy - you are consistent, every dish is made to order, and OMG can you accommodate all food preferences!\n\n\nThis visit is bitter-sweet, as I am departing the Philadelphia area for a new career opportunity.\n\nWhile I know I will be back from time-to-time, as I do have family in the area, I still can't just pop on over to one of my favorites when I need a good friend's couch to sit on. Because of all realistic measures, that is exactly what Vientiane is - a good friend's couch that you can come hang out in a laid back and chilled BYOB atmosphere.\n\n\nIt's that friend that makes you that big bowl of comfort food to help you celebrate the highs or to crush to lows... and for all of the amazing experiences I have had here - I thank you! I thank you for making eating out and being social a possibility for a gal who has multiple food allergies, is a bit of a food snob, and living on a budget. You are amazing and I will continue to spread the word that all of Philadelphia needs to come check out Vientiane, if they have not already!\n\n\nThis evening, we were seated and handed the revamp menu - which, is visually much more appealing. It is also helpful that this menu consists of GF (gluten-free) codes so I know what is and is not safe for me.\n\n\nI ordered a good classic for a table share - Lao Porridge (jow-piek) or congee. It is a smooth and comforting bowl of heaven - not too many more ways to explain it.  It is a subtle dish with simple flavors meant to heal. Good thing I planned on sharing and that I ordered the large because the entire table went nuts over it. P.S I order it with the soft tofu rather than fried - it is just a preference, but I think it makes a world of difference.\n\n\nThen, despite having a huge list of things I wanted to try (aka the casserole, Laab, any of their fried rice dishes, Banh-Xeo, a dessert, and more.....) I had to go out with the first dish I ever ordered.......\n\n\nDrum roll please..... the King Soup - or as I like to describe it as a Pho with coconut milk and much more spice! We all know I love coconut, love a creamy dish, and we LOVE spice - so win was always written all over this dish! Oh, and did I mention that they can make it gluten-free, vegan and it comes in a GIANT bowl for under 15!?\n\n\nA friend of mine did order the new dish, Bamboo Stew (gang-naw-mai) which is bamboo shoots mixed with pumpkin and mushrooms (very earthy) and served with their famous sticky rice. Note, while this dish is not marked gluten-free, I am sure that if you ask, they are able to modify it for us gluten-free folks! \n\n\nIn conclusion, it has been real Vientiane Cafe and I will certainly be back to visit! In the meantime, keep making some more awesome additions to your menu and oh, if any of my readers try the other dishes on my wish list, PLEASE SEND ME REVIEWS!\n\n\nUntil next time.\n\n\nOh, and check out all my other reviews of Vientiane Cafe below:\nhttp://gf-flamingo.blogspot.com/"
    },
    {
        "id": 40,
        "text": "This was such a great experience. The staff were absolutely delightful, attentive and genuine. The food was ridiculously delicious and the prices were very low for such high quality. Our experience honestly couldn't be faulted. Thank you so much"
    },
    {
        "id": 41,
        "text": "This is tied (with Sabrina's and Pico de Gallo and Le Bus' sandwiches) for my favorite food in Philly. As in, I have my birthdays here so I can eat all their desserts at once with a valid excuse. \n\nSo food: I started off ordering whatever sounded funny to say out loud. La Na -- amazing dish, even better cold the next day! All their egg noodle dishes are especially delicious, though it's hard to outshine their Penang curry. Also, appetizers, wow. So fresh -- the veggies the sauces! And then...dessert. Best mango sticky rice ever. Best rice pudding. Chocolate banana spring rolls. Truly fantastic. (Also BYOB, with no corking fees!)\n\nThe spot itself is a bit out of the way for me, but there's a lot nearby, and it's not so bad a walk from CC in the end. Inside, it's cute, quaint and often packed, especially on weekends -- and they don't take reservations for parties fewer than 6. Final warning: cash only."
    },
    {
        "id": 42,
        "text": "Vientiane is always reliably good. My favorites are the pad kee mao and the eggplant sweet basil."
    },
    {
        "id": 43,
        "text": "The curry is soupy. The pad thai is too salty/saucy. I like that they have a lunch menu special, but it feels like they're catering to the \"American\" palate."
    },
    {
        "id": 44,
        "text": "Just one  word: authentic, just like you would find in a restaurant, market  or street stall  in Thailand or Laos.   Recomend the laos style papaya salad, (made correctly with fermented fish), beef jerky, larb nuea.   We didn't order from the menu, we just told the one of the owners what we wanted, a mixture of Thai and Laos dishes, delicious(seap) and a good value. Couple that with BYOB, outside table service, it makes for great dining experience.  The service comes straight from the owners, with warmth and from the heart. If you are weary of self-important posers that wait on you in other resaurants, then head here. Tired of watered down Asian food, then head to Vientiane Cafe. \n\n My wife was born near Vientiane and has a culinary degree from Suan Dusit in Thailand, and she was so happy that I brought her here, because after a year, we finally found a restaurant that has  food that is as good as what we can make at home!"
    },
    {
        "id": 45,
        "text": "The food was really good and it was great that they could make some dishes vegan.\nThe service was a little slow, but the staff was very nice.  The food was very tasty and the portions were larger than other thai restaurants I have been to.\n\nWe ordered the vegetarian naam salad, Thai Basil Tofu, and Pad Kee Mao Tofu. I'd order all 3 again. My favorite was the naam salad."
    },
    {
        "id": 46,
        "text": "Apparently I seem to be missing something. The positives to this place is that is is small, and quaint. A good place for a first date I guess, when you are too nervous to think about the quality of your food. It's also on a trendy, up-and-coming block in West Philly, so that might add to the popularity.\nThe food was simply average, the prices too high, and service almost non-existent. I was very disappointed in this place and won't go back.\nI went there for lunch and got to the point where I started to wonder if the waiter had forgotten about me, and the other customers waiting. The soup was too salty, the dumplings too doughy and without enough \"stuff\" in them to give them flavor, and the chicken basil was too dry. The veggies just average. Since I mentioned the chicken basil I should add it wasn't even what I ordered. I ordered the shrimp. I didn't say anything, because a.) I was really indifferent about which of the four (veggie, shrimp, beef, chicken) I got, and b.) I didn't want it to be a hassle, and I certainly didn't want the wait to be even longer. So I didn't say anything. At the end, the waiter realized he gave me the wrong dish, and took 10% off the chicken price. Whatever. Had he appeared while I was eating to either refill my water, or ask me how my lunch was I would have said something and added, \"no biggie, just don't charge me the higher shrimp price\".\nMistakes happen, no problem. \nThe prices are a few bucks higher than what they should be. If this place was in some generic suburban strip mall, I think most of the positive reviewers would trash this place, but since it is in a hipster neighborhood people say it's great. Sort of like the Seinfeld episode where George convinces attractive models that he once dated a now-deceased fellow model and thus gets \"in the club\". Women looked at George and said \"well, since he dated one of us he must be a stud\". Same deal here, put a place in a cool neighborhood and somehow people think the food tastes better. \nOne last thing, this place does NOT take credit cards. Be warned. Don't get how in 2014 restaurants don't take credit cards."
    },
    {
        "id": 47,
        "text": "I love this cute little BYOB with Thai and Laotian dishes that pack a nice, flavorful punch.  We were here for UC Dining Days and the dishes were great.  I had the chicken satay app with the red curry chicken, and found both to be very good.  The satay was juicy and flavorful with a great peanut dipping sauce, and the curry was very solid although it wasn't very spicy.  I also had a few bites of the triple flavor tilapia in the sweet and sour sauce, and really like the crispy, pan-seared fillet combined with the garlicky sauce.  Will definitely have to get this next time.  Most restaurants like to fry the fillet when they make a sweet and sour dish but pan searing actually brings out the flavor more and gives that delicious crispy exterior without killing your arteries.  We finished off with the mango sticky rice and coconut rice pudding.  While the mango sticky rice was very good, I liked the coconut rice pudding more because I love all things coconut and this was a delicious coconut-based concoction.  If you are in the area this week, and need to grab a bite, definitely stop in for the $15 dining days special.  It's a great deal and the food is very good.  They also have homemade beef jerky at $6/order, which I couldn't resist getting to-go; while it wasn't as fantastic as my aunt's homemade jerky, the meat was very well-marinated and flavorful and great paired with the accompanying chili paste.  The ambiance is very cozy and the unique curry soup bowls add a nice touch.  Service was friendly but we did have to ask for water refills a few times."
    },
    {
        "id": 48,
        "text": "My favorite Thai BYOB in Philly! Lots of vegetarian-friendly options. Service is always great. Only downside is cash only."
    },
    {
        "id": 49,
        "text": "I could eat the Naam Salad every day for the rest of my life. The Paneng Duck is out of this world. They recently expanded into the adjacent building and for good reason. The food and atmosphere is perfect."
    },
    {
        "id": 50,
        "text": "Ordered pad Thai, pineapple chicken and an order of wings as takeout..... yummy yummy yum! Next time I plan to dine in- it's very casual and chill inside"
    },
    {
        "id": 51,
        "text": "Some of the best Pad Thai that I've ever had! This is cool little restaurant in West Philly worth checking out.  Make sure you bring cash though!"
    },
    {
        "id": 52,
        "text": "Small BYO. The restaurant is very very casual. The food was good. Nothing amazing. There was nothing that I said \"wow! that is really good!\" that would make me want to rush back. \n\nWe went for UC dining days so $15 for three courses = a great deal. We ordered the crispy spring roll with pork (just ok), papaya salad (light and refreshing), tilapia, pad-kee-mao (tasty! nice medium level spice), and banana chocolate spring roll for dessert.  The highlight was the dessert! It was just the right amount of food. The service was good - they kept our water glasses full.    \n\nFor a cheap dinner, and byo, this place hits the mark.  But the food can't even compare to Trio in Fairmount.  I wouldn't rush to go back or go out of my way to go there, but I am glad I tried it.\n\nDon't forget that this is cash only.  Our bill came to $32.40 before tip."
    },
    {
        "id": 53,
        "text": "I've been there three times now and have had a pretty different experience each time when it comes to food, so listen to the recs in other Yelp reviews. Bottom line: this is a fantastic local BYO spot.\n\nRecommendations: coconut soup, Nom salad. They're awesome!!\n\nDo not recommend the bbq Cornish hen. Totally underwhelming and dry."
    },
    {
        "id": 54,
        "text": "HEY LoOK HERE!!!! \n\nPlease take the time to listen.  3 stars is just what it says A-OK which this place really is.  It's very clean and the service was great.  However I felt the portions were small.  You must understand I am a big eater I love to pretty much stuff my stomach until its full before the food even settles.  So.. If you are a normal eater the portions will be great however if you like to eat so fast and fall in love with every bite just order an appetizer and you will be fine.  Go ahead try it out, it's the only way you'll know.  Pad Thai is always a safe bet if you are unsure. Trust me."
    },
    {
        "id": 55,
        "text": "Had the yellow curry with shrimp and the sausages entree. Curry was pretty average good but tasted a little watered down. The sausages were also good but dry so make sure to eat them with the sauces they provide. Atmosphere was nice but service was poor. It was a Saturday evening so a little busy but there was no reason two of our party had to go up to the counter to ask for extra rice or water. Overall underwhelmed by this place given our curry was $16."
    },
    {
        "id": 56,
        "text": "I went here for a BYO a few months ago, but I figured I would give review it as I feel like it's often forgotten about in West Philly. \n\nI came with a group of about 8 people, and everyone enjoyed their food, even people who were a little bit unsure about Thai food. The service was great, and the place is open pretty late, and didn't kick my group out immediately after paying. Also, can I mention how insanely cheap Vientiane is? It was ~$7 per person in my entire group, including tip which is pretty insane."
    },
    {
        "id": 57,
        "text": "Excellent food. One of my favorite places to eat. The tofu King Soup is my favorite, I was delighted when that became a regular on their menu. Try to save room for dessert as all of their desserts are delicious!"
    },
    {
        "id": 58,
        "text": "Delightful experience. We enjoyed a lot the food. The Pad Thai and the coconut soup are my favorite dishes. The banana and chocolate spring rolls are also amazing. Best BYOB in the area."
    },
    {
        "id": 59,
        "text": "My wife, daughter and I just love this place.  They always get something different.  I always get grilled mixed vegetables and sweet basil salmon.  The beef jerky is terrific too.  \n\nSometimes it's hard to get a table.  That's okay with us.  We love that they have so much business.  It's always worth the wail."
    },
    {
        "id": 60,
        "text": "Service is THE WORST! After placing my order for pickup and talking to someone who clearly shouldn't be answering the phone I already was a little ticked off. She had the biggest attitude as if I as bothering her by placing an order. I was told 15min wait. I get there 25mins later still not ready. 45mins later still not ready. I finally just gave up and left! Slow service while eating in, even slower with carryout!"
    },
    {
        "id": 61,
        "text": "Best Southeast restaurant in Philadelphia. These folks started out in their backyard selling Pad Thai and three colors of Coconut Curry for three bucks a bowl till a fricken SWAT team shut them down. Now at three times the price the food is just as good with TONS of amazing veg options. Best bets: Tom Yum Soup (spicy and sour--a real sinus cleaner), Green Papaya Salad (nice and tart), Ban Xeo (rice flour pancake made with coconut milk and turmeric, veg version stuffed with mung bean sprouts and tofu), Yum Salad (crunchy and spicy), King's Soup (like a Pho noodle soup mixed with Red Coconut Milk Curry--wow!) Their desserts are fab, especially with a ginger tea, and be sure to try the Guava Candy you get with your check. Simply fab."
    },
    {
        "id": 62,
        "text": "This is one of my favorite Thai places in philly! I love their Pad Kee Mao, it was perfectly flavored and left me wanting more. \n\nThe only thing is that it's not the cheapest dinner option, but the price is worth it. I am looking forward to trying everything else on the menu."
    },
    {
        "id": 63,
        "text": "Naam salad is our favorite appetizer here. My husband loves the shrimp pad kee-mao! I usually go for pad Thai. The staff is always friendly and helpful. This is definitely one of our go to BYOB places."
    },
    {
        "id": 64,
        "text": "This is the best Thai food I've ever had. Been coming for years. The coconut curries are fabulous. Also love pad kee mao. Byob and cash only but that keeps it cheap. Good place to make a good impression with great food and not go broke."
    },
    {
        "id": 65,
        "text": "I've been craving thai food for awhile now, and was very happy to have found this place.  Had tom yum soup, spring rolls and dumplings for appetizers, and the pad thai and red curry as entrees.  Overall, it was pretty good.  My only gripe was the lemon for the pai thai - that lost me on the authenticity right there.  It would have been so much better with a slice of lime - so the pai thai came out a little sweeter and not as tangy as I'm used to."
    },
    {
        "id": 66,
        "text": "We stopped in here for a weeknight dinner, and were pleasantly surprised.   It's BYOB (wish we had planned ahead).  My husband's Pad Kee Mao was tasty (leads us to believe they do Thai classics well), but we both agreed that the real star of the meal was the Vegetarian Nam Salad - a sticky marinated rice with a bunch of toppings served with lettuce wraps.  The flavors in this dish were exquisite and unique."
    },
    {
        "id": 67,
        "text": "I really should branch out and order something other than pad Thai, but I didn't have it in me, once again.  The pad Thai here is not my favorite I've ever had, but it's pretty good.  The vegetables were fresh and tasty and the noodles were nicely cooked, but I think it was just slightly lacking in flavor.  I ordered the medium level of spiciness and it just wasn't that memorable.\n\nI also ate the papaya salad for an appetizer.  This was good, as far as papaya salads go.  I think I totally just miss what most people like so much about the consistency of the raw green papaya strands.  To me they are....ok.... but nothing that I crave or order of my own will.  Every time I've eaten it, it's because someone else wants to share it.  \n\nThe place itself is super cute and BYOB so you should check it out.  They are open until 10PM on weeknights, so it's convenient for late night dinner eaters.  Cash only!"
    },
    {
        "id": 68,
        "text": "I've been here 2x, once with a group and once for an anniversary dinner. The food was pretty good, we mainly just wanted somewhere that was BYO. The reason why I only give them 2 stars is because of the atrocious wait staff. The first time I was there we had such a hard time flagging down our waiter for anything but assumed it was because they were somewhat busy (only about 60% full). The food also took forever!! The second time I went back with my boyfriend the food also took over 35 mins (and it was a monday night!). After we were finished eating I repeatedly asked for the dessert menu from 3 DIFFERENT WAITERS and yet none of them brought it! Finally after 25 mins of waiting for it  our waiter just brought us the check! Incredibly rude and inefficient. The food is good and the place looks cute, but not worth it."
    },
    {
        "id": 69,
        "text": "We eat at Vientiane all the time and often bring our friends and family here when they are visiting. The food is flavorful and delicious. Some dishes that you don't see on the menu at every Thai place. Service is hit or miss, but I've never had any problems. Fresh vegetable spring rolls are incredible. Laab is yummy. Steamed red bean dessert is like nothing you've ever had before. There's some ginger basil something rather that is probably my favorite thing there. We eat there a lot and I'm trying to work my way through the menu.\n\nI've knocked them down a star because the spiciness level varies. That being said, I've requested my food Thai hot and, after an \"are you sure?\" from the server, was served an incredibly delicious super spicy meal. I have found that, unless you specify that you want it very hot, though, that the food will come out mild. That's certainly fine for a lot of people and they've probably done so to Americanize some of the authentic spicy dishes but just know to ask for it hot.\n\nSince the recent renovation, the interior decor is much nicer and the cafe has doubled in size.\n\nLunch special is a great deal too!\n\nNB: it's cash only, BYOB, and they don't take reservations."
    },
    {
        "id": 70,
        "text": "Ok New chief to me...been three months..maybe more since I have been here.. Sweet Thai basil with chicken has always been my stand-by love here. I have to say cudos to the new chief...by-far the best I've had here and have been coming here for 6 years"
    },
    {
        "id": 71,
        "text": "We've been here many times.  Only downside is that it's cash only.   If you are looking for Thai food that is more authentic than other places, go here!  I am told from my Thai friend that the food is more northern style Thai but I can't comment on that.  The place is clean and the service is good.  There's a large parking lot in the back.  Everything I've had there was good except the mango sticky rice dessert.  The mango was sour and hard. Other than that, the food great!  Try the Laab pork.  Soooo good!  We keep going back!  5 stars for sure!"
    },
    {
        "id": 72,
        "text": "My boyfriend spent some time in Thailand and when we first started dating suggested this thai place across from his apt, I had never really eaten thai (save pad thai) but was too shy to say no.  but it's AMAZING.  I reccomend the sausages, the fresh spring rolls are good, the papaya salad was amazing, tilapia with curry, crazy stuff i had never tried before as well, and i loved every second of it.  It's also got that quirky west philly thing going on which makes it fun.  BYO for sure. A crisp white wine with your meal will make it even more enjoyable."
    },
    {
        "id": 73,
        "text": "My wife and I stopped in for dinner recently on a Saturday night and were pleasantly surprised with the food here. we actually meant to go to the vietnam cafe, which is around the corner but popped in here by accident. Its a pretty small place with the tables packed in tightly together so you can pretty much hear what everybody around you is talking about and it got pretty loud when the dining room filled up.\n\nThe servers were very attentive and friendly. I got the pad thai which I thought was fabulous but I've never had it before so I don't really have anything to compare it against. The amount of food for the price was great as well. My wife got the sweet thai basil shrimp and that tasted wonderful. She doesn't really like spicy food and they cooked it up sans spicy-ness with no fuss. Hers was a little smaller portion size, and it was perfect for her but might leave you wanting a bit more if you're a big eater.\n\nThe neighborhood was nice, with a major \"portlandia\" vibe lol. I would be careful about straying too far though because the area gets real sketchy if you go to far in the wrong direction"
    },
    {
        "id": 74,
        "text": "I really don't know why I waited so long to try this place.  I really love Thai food and I normally go to Pattaya (which is also very tasty.)  My friends recently went there during University City Dining days and had a great experience so I was looking forward to trying it, too.  My opportunity came when my friend wanted to \"go out\" to celebrate her completion of the bar exam that day.  At first I thought she meant \"go out\" like to a crowded bar somewhere downtown but when her husband explained that we were going to Vientiane Cafe I was more than happy to tag along.  I think one of the reasons I had never gone there was that it doesn't look like anything special from the outside, so I was surprised to see just how large it was inside when we got there.  The ambiance was nice.  I felt like we could be ourselves, talking about the \"bag lady\" at the bar, and be boisterous without being awkward.  But it was still quiet enough to enjoy a more relaxing meal.  \n\nWe had a group of 7 of us and they easily and quickly accommodated us.  Between the seven of us I think we all ordered either the Panang Curry or the Pad Thai.  Both were delicious but the panang curry was truly something special.  I really don't know how they made it so good but it was SO good.  It makes me mouth water just thinking about it now.  One thing I will say, though, is that the spice levels really don't matter at all.  The have a scale of 1 to 5 with 5 being the spiciest.  I got a 4 and most of the others got 2, however they all tasted the same, which was not so spicy.  Normally I would have been really upset that it wasn't very spicy but the flavor was so good I didn't even care.\n\nOn the downside, prices were pretty high and the service was only so-so.  Also, they are cash only which I find really weird and inconvenient.  With that said, the deliciousness will definitely draw me back again!"
    },
    {
        "id": 75,
        "text": "Don't order fish cake otherwise you want something in unreasonable price.   4 small pieces which cut in half for 6.69$.  What's an expensive appetizer.   I'm really disappointed!!!!  Overall other dishes seem cheaper when comparing to fish cake, but the taste are good."
    },
    {
        "id": 76,
        "text": "Vientiane's food was good but it wasn't the best Thai food I'll ever had. I will say that it's appetizers are really good but the entree's were definitely just average.\n\nPlus points for it being a very charming and well-decorated place. \n\nI came here during lunch and had one of their lunch special. (3 courses for $10.95). \n\nGood Appetizers: Coconut Soup, Tom Yun Soup, and the Chicken Appetizer\nMediocre Appetizer: Steamed Pork Dumplings (this definitely came out of a bag you can buy at a Chinese \n\nGood Entree: Pad See Ew (drunk noodles). If you like spicy food, definitely get add a spice level to it. They add a lot of onions, broccoli, and other vegetables into their interpretation. \n\nPlease avoid the Pad Thai. I'm not sure what everyone was raving about, but the Pad Thai was very dry and tasteless. It didn't blend well with the vegetables."
    },
    {
        "id": 77,
        "text": "Came here for University City Dining Days. Service was friendly and attentive. Dinner service is candle lit and dimly lit. Very romantic. $16 for a one piece crispy spring roll, regular entree sized curry, and a mango rice pudding. Great bang for your buck. Curry was significantly better than what I had over at Erawan, less coconuty and more aromatic. If you're looking for a place to grab a bite to eat during UCDD, come here."
    },
    {
        "id": 78,
        "text": "Pretty eh experience here. I stopped by for dining days one night to try the 3 course option for $15. I chose the fresh spring rolls, Pad kee mao with chicken (+$1), and the mango sticky rice. Portions were small and relatively skimpy. Service was slow and servers were hard to get a hold of. I asked for the noodles to be \"very spicy\" but they came incredibly mild, no spice at all. I didn't bother to send them back since we had already been waiting a while. Pretty subpar experience, I would't go back. Cash only."
    },
    {
        "id": 79,
        "text": "Great, authentic southeast asian food. Consistently great quality. Good service and a decent amount of seating although you might want to make a reservation on the weekends. The prices seem to be between 13-15 for an entree... It can add up especially with appetizers. BYOB. I love the pad kee mao."
    },
    {
        "id": 80,
        "text": "Showing love for my neighborhood Laotian / Thai restaurant. This place is really cute and has good food. Great for a date night. BYOB!\n\nI've been here a number of times, as it is within walking distance from my house. The food is a good mix of authentic Laotian food and somewhat Americanized Thai food (which is why I'm giving it 4 stars). I tend to love places that remain true to their roots, which is why I was hoping that some of the dishes I ordered here weren't so Americanized. Either way, I love this place and highly recommend it as a date spot or a place to take your friends when they're visiting you in town. Friendly service. Reasonably priced."
    },
    {
        "id": 81,
        "text": "A neighborhood secret. I always get the pad Thai and spring rolls. I always think I'm going to try something new, but those items are just so good."
    },
    {
        "id": 82,
        "text": "I am a big fan of Thai and this restaurant definitely stayed true to the fresh flavors that make the cuisine so good. Fish and chicken were both tender and well prepared.  The thing is the food had no oomph. Wonton soup looked great bit the base was too sweet. Same with the pan seared tilapia meal.  I ate it all but couldn't savor it the way I've had Thai at other restaurants."
    },
    {
        "id": 83,
        "text": "Visited the Vientiane Cafe on Sat night. Nice little place in the heart of West Philly. My wife and I both ordered a appetizer of veggie steamed dumplings and Pad Thai. She ordered Tofu Pad Thai, I opted for the Shrimp Pad Thai. The dumplings were nicely cooked and the dipping sauce was excellent. The Pad Thai was very good. I thought the spice level was nice (I ordered a 2 out of 4 on the heat scale) and they definitely kicked it up a notch! The shrimp were good, but you have to peel as you go, and I'm not the biggest fan of that serving method. Nice portion size and quick service. Its also a BYOB, so thats a plus as well. The two down sides to the place is 1. Its a little run down inside, and its completely no frills and 2. Its a tight dining room. If you like some elbow room, this isn't your place. However, all in all, nice little Thai place. 3 stars. Recommended."
    },
    {
        "id": 84,
        "text": "Vientiane's food is just all right & not especially good. \n\nThe Pad Kee Mao (Thai Drunken Noodles) were soft and tasty for the most part, but the meat was overcooked & not enjoyable.\n\nThe Laab (Laotian) was bland, with overcooked meat again, though it wasn't as badly overcooked as in the noodle dish.\n\nI've had a fish dish (tilapia?) which was edible -- meh.\n\nThis is a charming little restaurant that's nicely decorated and comfortable to sit in.  The food is around 2 or 2.5 stars, so with the decor and ambience, I give it 3 stars all around."
    },
    {
        "id": 85,
        "text": "2.5 stars. \n\nThe truth is that this place is no better than the string of other mediocre Thai restaurants in West Philly (ie, Lemon Grass, Pattaya, etc).\n\nI started with the Thai Coconut Soup. It wasn't bad, but it lacked the subtle tartness that makes good Tom Kha good. \n\nI always judge a Thai place based on the quality of their curries--a fundamental aspect of Thai cuisine. I ordered the Green Curry, and it can be described as a few carrots and broccoli stems floating around in a soup of watered down coconut milk. \n\nWith tax and tip my bill was $18, and I don't see any reason to go back. As my friend said at the end of our meal: \"The search for a half decent Thai restaurant in Philly continues.\""
    },
    {
        "id": 86,
        "text": "I would actually give 3.5.  I like the new size and the ambiance is vastly improved by the rehab and expansion.  My kids loved everything.  The Tom Yom soup was not the correct flavor I have had before, but all of the dishes were very very fresh beautiful ingredients.  Dumplings and spring rolls were excellent..  Everything was just a little too bland for Thai, but on the other hand that made everything accessible to my kids.  It was very reasonably priced, especially for Thai.  Love the BYOB and they even brought me the right kind of glasses for my booze.  Very friendly staff.  I plan on going back without my kids and asking them to kick it up a notch and see what happens.  Maybe they can get me to fork over another star."
    },
    {
        "id": 87,
        "text": "This is my all time favorite Thai/Laotian restaurant in Philadelphia. I am not much of a salad person, but I absolutely adore all of their different salad dishes here. Papaya Salad, is probably my favorite food...ever. There is the Nam salad (vegetarian) and the Yum salad, which I get with beef that is also very very flavorful and delicious. My favorite entree there is the Pad Kee Mao, similar to the Pad Thai, but it is flat rice noodles with more flavor (in my opinion). \n\nMore perks: friendly staff, BYOB, perfect place for a date. :)"
    },
    {
        "id": 88,
        "text": "We came here for lunch but we did not have enough time for the lunch deal so we ordered some soup and the steamed dumplings and spring rolls. The staff is friendly and the food was out pretty quickly but unfortunately it wasn't that good. Yeah there was a lot of garlic but the actual food fell short of my expectations. I am giving three stars because we did not try their entrees and\nwho knows maybe they're amazing. If I were to base this strictly on the food I got today I would give two stars but it seems unjust to judge only by appetizers.  This place is cash only."
    },
    {
        "id": 89,
        "text": "Fish clay pot is to die for. The red sauce is full of flavor and the kimchi gives that perfect hint of sour. The stuffed grape leaves are also MANDATORY. Great service and great drinks!"
    },
    {
        "id": 90,
        "text": "The food is so good here! i had my first Pad Thai here and it was great. We had the fried spring rolls too which were delicious and also grilled veggies with a peanut dipping sauce. Everything was great! \nThe place was really nice and the servers were very friendly."
    },
    {
        "id": 91,
        "text": "The vegetable naam salad is soooo good. And banana chocolate spring rolls - why isn't the entire world making/eating these??? Such a cosy place, and perfect for byo since the liquor store is less than a block away! A +"
    },
    {
        "id": 92,
        "text": "When I proffered my companion the option of a \"Vietnamese place down the block\" or ordering in pizza, the choice was the former. Now we both feel very strongly about pizza-it's easy and almost always delicious. But I'm glad we decided on dinner at Vientiane Cafe because it reminded me that it's probably my favorite Thai restaurant in town.\n\nI'll mention that I love that this restaurant is especially friendly to vegetarians, which is likely a calculating move given its location in the transition zone from University City and West Philly. The service was just the tiniest bit slow, but nothing egregious. After all, Friday night is bound to be busy. We got the Tofu Skewers for appetizers (4 perfectly grilled slabs of Tofu) and  the Green Curry and King Soup for entrees.\n\nSince we're both suckers for fever-inducing food, we were slightly disappointed that the Green Curry, which was marked with their highest spice rating, didn't register a temperature for us. Which is not to say it wasn't flavorful. The King Soup was, well, majestic. The curry-coconut broth was rich and chock full of noodles, bean sprouts, cabbage and adorned with the perfectly crispy-soft pieces of tofu. \n\nThe wait staff, while not overly attentive, was prompt in responding to our various requests during the meal. A final note is that the place is cash only!"
    },
    {
        "id": 93,
        "text": "The atmosphere here is kind of dark and romantic, so don't bring someone here when trying to keep them in the friend zone. Just saying. Overall: love the curry, pad thai is not great. Hate that they only take cash. Not my favorite Thai in the world, but I've yet to a find a favorite Thai place in Philly."
    },
    {
        "id": 94,
        "text": "Tonight was the first time I ate at Vientiane - even though I have lived at 44th & Baltimore for almost a year. It was delish and I will definitely go again!\n\nSplit the veggie spring rolls and dumplings with my friend and then she had the House Special Fried Rice with chicken and I had the Crazy Pineapple with chicken. We thoroughly enjoyed all the food!\n\nOh, and I had the Thai iced coffee and it was fantastic! The waitresses were nice and kept refilling water which is super important to me. \n\nDon't forget it's cash only and relatively small. But it's a nice meal and I recommend it! Enjoy!"
    },
    {
        "id": 95,
        "text": "We went here for dinner with a group of 7. We brought our own wine because they do not have their liquor license. We ordered so much food and entrees that its hard to separate one from the other (or maybe it was the wine). It doesn't really matter because all the plates were good (and we seriously shared about half of them). After all this the bill was a laughable $90."
    },
    {
        "id": 96,
        "text": "I've been eating at this place for about 3 years now and I love it. Would give 4.5 stars if I could.\n\nReasons I love it: The owners are sweet. I love the remodel they did awhile back! Their King's soup knocks my socks off. Their fresh and fried spring rolls are also really great (i've not tried the duck). Love their coconut soup.  Love their tamarind wings. Love their pad se ew. The Thai cut fish is also delicious. Good atmosphere and they let you relax and hang out with your friends & enjoy your meal instead of rushing you out the door.\n\nReasons I didn't give 5 stars: The last time I came in there was a strange smell in the dining room area.  :/  I brought someone here after talking it up and everything he got truly wasn't great. The chicken satay was really small and tasted of fish. The service was very nice but we were seated way in the far back corner and there were long periods of time where no one checked on us. His food wasn't spicy at all and he asked for 4/5 spice level. I ate it and I was fine with it--normally a 4/5 spice level would kill me. He got a bad bite of something in his salad and these things combined ruined the dining experience for us both.\n\nWill judge on the whole and not this one time, but I hope that this was a one-off. Certainly hasn't been my experience previously.\n\nto note: Cash only, BYO"
    },
    {
        "id": 97,
        "text": "Try everything on their menu! Food is great, has flavor and good presentation. The ambiance is nice.  Will definitely be visiting this place again."
    },
    {
        "id": 98,
        "text": "Note to self: when you enter restaurant and see harried, rushing, glum-faced waitstaff, turn around, walk away and eat elsewhere. Lesson learned!\n\nTwo of us dining. We ordered two apps to share and an entree each. One app came soon, the other 20 minutes later. Barely minutes after the 2nd app arrived and we were still enjoying it (or trying to), one entree arrive, just one. A full five minutes later, as entree 1 gets cold (since my companion is gracious enough not to start without me), still no other entree. Waitress rushes by, we manage to catch her eye and ask where other entree is. She says she'll check, but after five minutes more hasn't come back. I get up from table and go to find out. Waitress sees me and look of \"uh-oh\" comes onto her face because she obviously forgot all about it. She gestures toward manager who starts to give me all sorts of excuses -- \"we're so busy, kitchen got backed up, it will be out soon\" -- and I say, well, yes, but my companion's dinner is now cold. So she says they'll bring him a new one along with mine. Which she herself does after a few more minutes but then slams it down onto our table, literally slams it down onto the table without a word of apology, no smile, no nothing -- and, by the way, no fork, since the waitress had cleared our forks with the apps. Meanwhile, our empty beer bottles sit on the table throughout the meal, as no staff have the sense to take them away, and a grimy, dirty candle-holder sits there, too, because, when we finally ask about a candle, we're told \"we ran out.\" So, I figure you either walk a block to the dollar store nearby and buy some candles or you take the yucky candle holders off the tables.\n\nAll in a lousy experience. When entrees finally came, they were adequate, nothing special, same for the apps. Never again.\n\n\nhttp://www.tripadvisor.com/ShowUserReviews-g60795-d893578-r323391251-Vientiane_Cafe-Philadelphia_Pennsylvania.html#"
    },
    {
        "id": 99,
        "text": "Another after work dinner night with my kids.\n\nSticky rice, sausage, bamboo soup, laad na and fried banana with chocolate drizzle. All of that food was all for me... lol. Thai ice tea to finish off my dinner. Got embarrassed that I was eating too much and had my food packed to go with extra sticky rice. Food was excellent. Service was great."
    },
    {
        "id": 100,
        "text": "Came here with my mom and had the lunch special. The coconut soup and dumpling appetizers were delicious, as was the Pad Kee Mao noodles (like drunken noodles)  that my mom ordered . I wasn't a huge fan of the chicken satay - it was cut differently from what I was expecting and was just okay. The Penang tofu curry that I ordered was a little too peanut-y. \n\nOverall yummy, but it depends on what you get."
    },
    {
        "id": 101,
        "text": "i really dislike giving bad reviews and i'm quite surprised this place has such high ones at that. i rarely ever say that i don't enjoy a meal however this thai joint really disappointed me. the service was excellent, but i've honestly never had such bad pad thai in my entire life. maybe it was the day that i went? or perhaps the chef changed... i have no idea. \n\nbut because of the high reviews i've decided to drop by and give it another try when i'm in the area."
    },
    {
        "id": 102,
        "text": "My husband and I went for an early dinner on Monday. We absolutely loved the food! There are so many vegetarian options that we want to come back to try each and everyone of them. For the first time ever we ordered something different then red/green curry and Pad Sew ew. We got the bamboo salad, king's soup and one more thing that I cant recall right now. But everything was great, As I said, we are going back soon!"
    },
    {
        "id": 103,
        "text": "If you're looking for standard Azn food then Vientiane Cafe is the place to rock out to. It's a quaint BYO with a menu customizable to any palate. Standard options such as noodles, rice, curries and vegetable stir fries accompanied by your choice of meat, tofu or more veggies abound. No one will leave disappointed...even if they only eat the sticky rice. Because everybody loves perfect sticky rice.\n\nThe green papaya salad is scrumptious, even without peanuts. This is where Vientiane lays claim to other Asian establishments: peanut allergy? No worries. They'll make sure those little goobers don't infiltrate any part of your dish...even offering to box a separate papaya salad only after learning of a food allergy. Nice."
    },
    {
        "id": 104,
        "text": "Excellent BYO, I recommend coming in really hungry, food is delicious and spicy. I had the green curry rice dish and it was very tasty. Good atmosphere to come in with a few friends and have drinks while you eat."
    },
    {
        "id": 105,
        "text": "To be clear, I'd give this place 2.8 stars.\n\nStaff was friendly and we got seated quickly despite that the place was full. Oh, it's CASH ONLY. We ordered the Vegetarian Naam Salad. The texture was good (good, as in \"expected, because I've eaten this before\" good). The flavor was...actually, unremarkable (but not bad at all, to be clear). To be fair, naam khao is normally a favored dish for me and my friends...so an unexpected unremarkable flavor also means a heightened sense of disappointment. If you have had really good naam khao, this dish is like naam khao that your cousin makes when they're lazy...because it's crunchy and chewy and tart, but missing the salty and sweet flavors. You will need more lettuce too. We also ordered the homemade jerky; it was fine. Fine as in, it's not bad at all, tasted like soy sauce...but it's not ::shrugs:: good like the jerky that you get at the Lao temple during the New Year's good. Last, we got the pork laab (instead of beef laab since we didn't bring a lot of cash, we thought we'd save $1 with this option). We ordered medium spicy (I think) and I thought it was definitely \"butt burn\" spicy level. Actually, I think we ordered medium spicy and then asked for chilly on the sides...whatever, it wasn't the complex type of flavor that you normally get with laab anyway. It was just spicy (as my friend said, \"one note\"). We got a teeny tiny, looks like kid-sized portion of sticky rice to share among three adults with the laab. Well, dang, we had to take really small bites of our sticky rice to make it last...but the proportion of sticky rice to laab wasn't really appropriate. Oh, all the herbs and greens and stuff tasted fresh. \n\nThat's all I can remember. Now...with all that said, I feel like this is a good place to eat if you haven't really eaten all that much Lao or Thai food and would like a tidy introduction to basic flavors of the dishes I have mentioned above. There are a lot of other things to try on the menu too."
    },
    {
        "id": 106,
        "text": "Nice place, byob and cash only. I took advantage of being in the area for the Baltimore Dollar Stroll to finally have a sit down dinner here. I'm not well versed in Laos cuisine so I tried to pick anything that didn't seem obviously Thai or explicitly said Laos. That turned out to be homemade Laos sausage which came with a spicy pepper sauce and sweet chili. It was delicious! There was also a side of veggies and sticky rice that was served in a cute wooden container. I also tried the chicken skewers and the yellow curry with grilled salmon. For those, they were just meh and would recommend picking something else."
    },
    {
        "id": 107,
        "text": "I'm genuinely mystified as to why everyone's so mad about this place.  Based on the over-the-top reviews, I gave it two tries over three days:  once dining-in on a Wed night; once carry-out Fri night.  Neither time blew my mind, and I did get the much-praised King Soup.  It was fine, but I literally had a better version of it last spring in a middling Thai place in Lincoln Nebraska, so that's kind of telling.\n\n1)  The food seems v. fresh, so that's great.  It's also on the pricey side, so I would actually expect it to be more mind-blowing.\n\n2)  WAY TOO LOUD.  Be prepared to face a Wall Of Noise when eating at Vientiane, and to shout at your dining companions - there is no other way.  \n\n3)  They're understaffed:  service is friendly enough, but very haphazard (it took multiple tries to get anyone's attention for things like extra napkins or a wine glass).  On the rare occasion that we saw an employee, they seemed feverishly consumed with what they were doing - to the point that they expressly avoided looking around at any surrounding tables to check if they might need anything.  Food is pretty slow -- again, this would be fine if I thought it were really spectacular - I just don't think it is.  Def. won't be hurrying back, and will actively avoid the dinner rush.  Chaotic dining environment = super stressful."
    },
    {
        "id": 108,
        "text": "I have eaten here a few times and it's consistently been great.\nJust about every thing has a vegetarian option, which is great, and it's always nice and tasty.\nThe best thing to do is go in a group of 3 or more, each get different things and then share it all. It's great for new-comers to the neighborhood who are tight on cash. You get a great meal for a great price.\nTheir hours can be kooky and the place is really small, so make sure you investigate before you decide to go. I've gone a few times and not been able to get a table or found out that they're closed.\n\nOh! Definitely don't venture from the norm on the drinks. Some of the drinks they offer are, well, terrible. It's BYOB, though, so just bring some good wine and enjoy!"
    },
    {
        "id": 109,
        "text": "Incredibly awesome place for Thai food ! The service was extraordinary and the staff was extremely friendly ! The food was authentic and mind blowing! Our whole meal was vegetarian and every dish had just the right amount of vegetables. Green Vs Red curry, Red curry was the winner. Basil fried rice had just the spice level we asked. Drunken noodles were one of the best I ever had. Each and every single bit of food was worth the penny spent :)"
    },
    {
        "id": 110,
        "text": "One of the best BYOB joints in Philly. I've been here several times and have never been disappointed. I must say that the last time the food came out incredibly fast and our meal didn't last more than 30 minutes. That's what I call a speed dinner. I think they could have waited to take the food out another 10-15 minutes. Usually, I don't complain about this but it just felt kind of weird.\n\nThey have the most authentic Laotian cuisine in the city and the service is very friendly. The ambiance is nice and quaint but still perfect for groups or small gatherings. I may need to give it a break considering there are so many other places to check out in the city but if I'm recommending a nice, delicious, cheap dinner with a BYOB policy, Vientiane is usually among the first places I mention."
    },
    {
        "id": 111,
        "text": "This is my go to place for sit-down or takeout.  BYOB and cash, so be forewarned.  There is nothing better than the King's Soup on a cold winter's night.  The Nam Salad is like nothing I've ever had before or since."
    },
    {
        "id": 112,
        "text": "We went last night for UC Dining Days and Vientiane was terrific.  A lot of restaurants slack off for Dining Days, which I always think is a big mistake.  It's a great opportunity for restaurants to lure you in, which Vientiane did!  They had great choices on the pre-fixe menu.  The food was terrific and the service was very good.  \n\nGreat local byob.  Can't wait to go back!"
    },
    {
        "id": 113,
        "text": "I love this place...when its not busy and I'm only with 1 other person...and its lunch time... I've been disappointed on more than one occasion when I've gone for dinner. They are considerably busier but they make you wait a lot. The staff are really nice but aren't honest about wait times. I waited out front at 9:30 on a saturday night for 45 minutes (when they said it would be a 20 minute wait) before I left to go somewhere else - they never gave us an update or checked in or said anything. I cant really comment on the food because I'm addicted to pad thai and tom yum soup so i always get that. But both are delicious and you cant beat the lunch special prices and bang for your buck."
    },
    {
        "id": 114,
        "text": "3.5 stars: I tried the lunch combination which included the satay tofu, coconut soup and red curry dish. The tofu was awful; half of the tofu was overlooked (like burnt) and it was very salty. The coconut soup was okay; a little bit runny and sweet. The red curry was good but I think it was lacking ingredients (a bit runny). Customer service was great."
    },
    {
        "id": 115,
        "text": "The service was very friendly and the food exceeded my expectations. I had the spicy basil fried rice with chicken and the mango sticky rice was a great choice for dessert. Would definitely come back!"
    },
    {
        "id": 116,
        "text": "Very authentic Laotian and Thai food. As good as it gets. \n\nOrdered the Naam rice salad, sate and fresh spring roll. Light dinner for 2. Flavors were great, food was fresh. Ordered via Uber Eats as we were staying at a hotel."
    },
    {
        "id": 117,
        "text": "Great customer service \nWaiters visit frequently \nWater is refilled\nClean\nDecorations aesthetically pleasing \nFood is warm and fresh\nYou can control the level of spicy you want\nOn time service (not much of a wait time)\nWaiters/waitresses are friendly and considerate"
    },
    {
        "id": 118,
        "text": "This is a cute little place. I am boring and unadventurous so I ordered pad thai with tofu and it was excellent. The portions could be a little larger for the price, but that's just me wishing I had been able to have leftovers.\n\nI would go here more often if they weren't cash only. I don't always have time to run to the ATM."
    },
    {
        "id": 119,
        "text": "going here on a triple dinner date was quite nice on this nice spring-like night and i believe we got the only large table that could fit us all! it is a small place, so come early. it gets crowded fast due to the good food and cheap prices.\n\nthere are plenty of veggie options and they do offer fish and meat for us carnivores like myself. yay!  but bring cash! cash only here. also, this place is byob. i started out with the thai tea. yums. the fresh spring rolls were just that, fresh! the veggie dumplings are delicious. whether you get sticky rice with sauteed lemongrass, shallots, and chicken or if you get curry soup and jasmine rice, there is sure to be something on this menu to please every mouth!\n\nthe meal ended with fried banana with honey. of course, i was the only one that got dessert. the smallest girl at the table, but i always leave room for dessert! it's how i roll."
    },
    {
        "id": 120,
        "text": "This is absolutely amazing !!! Everything we ordered were so delicious and I definitely recommend this place for dinner. Great atmosphere, nice staff,and underrated food!! It's definitely a five star restaurant for me. Thanks for providing us with such amazing food!"
    },
    {
        "id": 121,
        "text": "This place is my favorite in the whole city. Always amazing food, and my friends who visit insist that we go here. Try the Naam salad, you will not be disappointed by the crispy, crunchy goodness - not really sure why it's called a salad. My family begs me to bring it to them to MI! The satay is delish too. Try the triple flavored duck with the sauce on the side so it stays crispy. The pad thai is not like other pad thai, but it's amazing. It actually has veggies in it too! Maybe avoid the casserole thing. The curries are great, yellow one isn't spicy. The yum salad is pretty awesome too! You gotta try this place!"
    },
    {
        "id": 122,
        "text": "The warm weather inspired a byob food adventure into an array of flavors and ingredients, familiar and foreign. It was my first time eating Laotian food, but it resembles Thai, so we were able to work out tasty dishes to try with the help of our super helpful and friendly server! We had six dishes and two desserts among us and rolled out satisfied and stuffed!!\n\n**Cash only"
    },
    {
        "id": 123,
        "text": "\"The food is terrible and the portions are small.\"\n\nI don't remember what comedian said this but it is true of Vientiane.  I hate dissing a small, locally owned place, but I've eaten here four times and the food just sucks.  I can only figure that the people who have eaten here and like it have never had much Thai or Laotian food before.  \n\nI always swear off this place but friends want to go and I don't want to be a pain in the ass.  The last time I got carry out I had two bites and threw the rest away.  Life is too short to eat Thai food that is this bad.  The dishes are either flavorless or off flavor.  All that and it is so overpriced."
    },
    {
        "id": 124,
        "text": "Vientiane Cafe is a great spot for dinner, but even better for lunch. The dinner crowd is often a big one with long wait times, but lunch is usually quieter & you get your pick of tables. When it's nice out, sitting at one of the outside tables is lovely.\nTheir dinner prices are a bit high, though the food is good quality. Also, their crispy noodle salad is *technically* a salad because it has a sprinkling of scallions and a sprig of greenery, but mostly it's tasty sauce and little fried noodles. Not something to order if you're trying to be health-conscious.\nTheir lunch special is a moderately-priced three course meal, consisting of a soup, an appetizer, and the main course. Each category has several options. I prefer the coconut soup, which is creamy and tangy, with a nice assortment of veggies, though I'm not a fan of the peppers. The dumpling appetizer is not very good. Although the dipping sauce is just right, the dumplings are kind of chalky and bland. I suggest the fresh spring roll with strips of fried tofu and two dipping sauces instead. The entrees offered are mainly curry variants, as well as pad thai and a few other things. I enjoy their pad thai a lot, and it's good with beef and great with chicken. \nI'm giving them three stars due to a few unpleasant incidents, one opf which I'll detail. We were waiting to have dinner for a while, and we'd left and come back to kill some time. The waitress had said 20-ish minutes, so we were back in that time. We waited some more, and then we got seated by one waitress. Unfortunately, a moment later, another waitress unseated us and told us we'd have to wait at least another 20 minutes, if not more. Needless to say, we were rather disgruntled. The waitstaff should really be more coordinated and communicative on busy nights. And long story short, we went home and got delivery."
    },
    {
        "id": 125,
        "text": "The spice levels listed on the menu are * (low spice), ** (mildly spicy), *** (spicy) and ***** (super spicy).  Or something very close to that.  I am a huge fan of very spicy Thai curry dishes with a delicious Thai iced tea to cut through the heat.  \n\nVientiane will NOT sell me the super spicy.  I don't know why.  I've tried ordering the spiciesy.  They will give me mild.  I've tried convincing the waitstaff that indeed they cannot make it hot enough.  I've received mild food.  I've even then pointed out a lack of heat in the dish and the crappy side of spicy red pepper flakes in oil.  My wife has had the exact same problem.  I gave up going here because it would appear they do not make anything spicy.\n\nThen, my friend Mike assured me he was actually served spicy food here.  It was renovated so I gave it another chance.  Both my wife and I ordered 5 stars.  Our waiter looked surprised with my wife's order and checked with her to confirm that she REALLY did want 5 stars.  She said yes, that she wants it as hot as possible.  5 stars.  MAKE IT HOT.  I then proceeded to order 5 stars as well.\n\nShe received mildly spicy.  I received zero spice.  When the check arrived we were shocked.  Her order was written down with 5 stars next to it and TWO of the stars were whited out.  Yes, they changed her order.  Mine?  Well it had one star written next to it.\n\nI have no idea why.  But they will not sell us spicy food.  This is not just once, it is endemic.  Fans of spicy food, do not frequent this place.  I know I will not."
    },
    {
        "id": 126,
        "text": "This is one of my favorite restaurants not only in West Philly but in all of Philly. They have a great lunch special where you get soup, an appetizer, and an entree for about $9. \n\nThe Pad Thai and fresh spring rolls are excellent. I also recommend any of the curry dishes with tofu. The pho was a little lackluster but I chalk that up to the vegetarian broth. Portions are large, so I normally have to bring half home. \n\nThey have nice outdoor seating in the summer. There's also a free city parking lot right around the corner if you can't take Septa. (The 34 trolley line runs right in front of the cafe)."
    },
    {
        "id": 127,
        "text": "Hands down, one of my favorite places to eat in West Philly, and beyond. I've lived in the neighborhood for almost five years, and have been here several times.  \n\nThe service: Very friendly, thorough, and fast. \n\nThe prices: Reasonable, though it has increased a little over the years. They also offer a lunch special - which includes an appetizer (love the fresh spring rolls), soup (LOVE the coconut soup), and entree (I frequent the curries with vegetables or shrimp) for a set price (comparable to the cost of just an entree at dinner) depending on your choice protein (tofu, chicken, shrimp, duck, and more). \n\nOther things to keep in mind: BYOB, cash only, they close between 3-5pm, and very allergy-friendly.  Gluten-free folks, you will have many options and the servers know what's up.\n\nGreat dishes: Yum Salad (a little spicy), Penang Curry (nice and peanut-y), Sweet Basil or Ginger Sauce entrees (really fresh flavors). \n\nAlso, of note, they serve the most delicious coconut ice cream in a coconut shell. with strawberries."
    },
    {
        "id": 128,
        "text": "So glad I got to try their food during the Baltimore dollar stroll! I got their tofu summer roll and the nam salad - both were really yummy! The only thing was I got the salad thinking I needed to get my daily need of veggies, but the summer roll ended up being more veggie heavy..the salad was still good! Just lots of fried things so it didn't feel as healthy as expected"
    },
    {
        "id": 129,
        "text": "I must have ordered the wrong dish (and my sis in law must have, too) because I did not enjoy my meal at all. \n\nI ordered beef thai basil. My experience with thai basil dishes is that they, at the very least, have some miggyfiggy thai basil in them. This bowl of soupy veggies did not have a hint or trace of anything resembling thai basil. Literally. None. Not like, \"oh man, i love thai basil i sure wish they put more of it in here!\" It was just completely absent from the dish.\n\nThis place also doesn't take cards. I totally get that lots of little cafes in West Philly don't take cards. It's inconvenient and I hate it but I get that when most of your transactions are $1.75 cups of coffee, accepting debit and credit is not a necessity. But when the average dish on your menu is $10+ being cash only is ridiculous to me. \n\nI just don't see why I'd ever return. meh"
    },
    {
        "id": 130,
        "text": "BYOB and so so good, I so enjoy going to this place, the people are friendly the people that eat here are friendly, and the food is good and the spices are hot hot hot. Come and enjoy"
    },
    {
        "id": 131,
        "text": "charming locale, badass food!\n\nAppetizers:\n*Sticky Tamarind - strips of fried tofu, plated on a bed of mixed greens with a tamarind dipping sauce - fabulous!\n*Shredded Green Papaya salad - crisp, fresh - delicious.\nEntrees:\n* Panaeng Curry with shrimp, 4 star heat -  a spiciness that blended perfectly with the sweetness of the peanut sauce - declared the biggest winner by all present,\n*Green Curry with tofu, 3 star heat -  slightly sweet with basil & perhaps annise - fantastic flavor!\n*Yellow Curry with tofu, 4 star heat - this is my friend's go-to dish, he orders it on nearly every visit!\n\nthoroughly enjoyable!"
    },
    {
        "id": 132,
        "text": "I recently moved to the neighborhood and always wanted to try this restaurant since I LOVE, LOVE, LOVE Thai food. \n\nit was last Friday, I was soooooooooo tired and drained from my hectic-crazy work week. Glad I went early,so, i could soak up the intimate atmosphere, sipping Jasmine tea while listening to the traditional Laotian-Thai music. first, I ordered an appetizer: I was channeling my favorite Thai restaurant in Chicago (Joys) and thought I should try the fresh, vegetarian spring rolls. I had one before from Vientiane, as I did the Baltimore Ave stroll in August. Yum! It was light and tasted nice with the sauces it comes with. Then, my entree: I have always LOVED Thai noodle dishes. Nice fragrance and spices. Yum! The  Vegetarian Pad See Eiu  is chocked with veggies and Tofu. It has a nice flavor too.\n\nI am glad the restaurant is a mere couple of blocks from my apartment. \nIt was very good. PS when I walked by after my coffeehouse visit to Satellite Cafe, I saw the cafe was filled to capacity later that evening. Awwwww, come early, come often!"
    },
    {
        "id": 133,
        "text": "Reading the other reviews, there must have been something wrong tonight.\n\nIt took 1 hour to get our food and the restaurant was not even very busy.\nYou would think that waiting for an hour would make everything taste better on account of us being hungry, but it did not.  The food was serviceable, but it was not worth waiting for an hour and definitely not worth going back for.  I will definitely look for a different place next time I am in the mood for southeast asian food."
    },
    {
        "id": 134,
        "text": "Absolutely delicious and cheap food. \nI came here for a birthday with a party of about 14 people. Service was noted to be excellent. \n\nThere was so many known Thai places in the city, and I never heard about Vientiane Cafe so I was a bit skeptical to think that it would be any good. But I was proven wrong. \n\nThai tea was delicious and on point, although I have never tried bad Thai tea at any restaurants yet. \nI was debating over coconut or tom yum soup and I gave their coconut soup a go, and it was delicious. Chicken was perfectly cooked and the flavor of the broth was full of flavor.\n\nP.S: DON'T MISS OUT ON THE NAAM SALAD FOR APPETIZER. It's like Thai version of lettuce wrap but the stuffing is so crunchy and flavorful with a bit tangy and spicy kick. I'm obsessed! \n\nFor dinner, I got the green curry with chicken and it was divine. Texture of the chicken was prefect and the flavor was just amazing. I just wish that their sauce was a little creamier than watery, that's all. \nI'm already craving to come back here again, and I'll be sure to try their drunken noodles next time.\n\nUpdate after few more visit: I returned back and tried their drunken noodles and they're literally the best drunken noddles I ever had. It's called pad kee mao."
    },
    {
        "id": 135,
        "text": "Best Thai food I've EVER had including in Thailand!!! Unbelievable. Everything is amazing!!!"
    },
    {
        "id": 136,
        "text": "Love this place. BYOB. Lao and Thai food. You can get things spicy 1-5 stars. Fair warning, five stars will make you cry. Lots of vegan, vegetarian and gluten free options. This place is great for adventurous eaters. Vietiene has several authentic options that some americans might cringe at; like papaya salad with soft shell crab. That being said they also serve the typical food you would expect to see on a thai menu like green curry or Tom yum soup. I've been going here for years and it's consistently yummy food that anyone could love. Never had a complaint about the service."
    },
    {
        "id": 137,
        "text": "Fantastic, quaint, and welcoming!  Most things can be made vegetarian, which means many options to choose from.  I especially enjoyed the banana chocolate spring rolls."
    },
    {
        "id": 138,
        "text": "One of my favorite places to eat.  Great place to take a vegetarian friend too, because any of their dishes can be made without meat.  Don't forget, they are cash only, and BYO.  Not open on Sundays.  Everything on the menu is amazing.  My favorite is the Panang Curry dish. With shrimp or chicken.  \n\nWhen I was looking for a new apartment, this restaurant was one of my top reasons not to leave West Philly.  I left anyways, but there is a great sadness in my heart when I remember that Vientiane is no longer the closest restaurant to my house.\n\nThey do take out orders too."
    },
    {
        "id": 139,
        "text": "I went here with a friend for University City Dining Days recently and got the naam salad, panang curry, and mango sticky rice. I was really excited because of the average rating of 4 stars on yelp, but I wasn't really a fan of Vientiane by the end. \n\nFood: \nThe naam salad was delicious, and the panang curry was pretty good, but they used a little too much oil -- I could see the oil separating from the curry on my plate. As for the mango sticky rice, they used a little too much coconut milk. The small mound of sticky rice was completely covered in the milk, rather than being well-balanced. Overall, I would give the food 3.5 stars.\n\nService:\nThis was where I detracted 1 star because I was pretty ok with the food at all, but the service was extremely slow. In addition, they messed up the dessert orders for both my friend and me, so I had to go to the front desk and wait for a waiter to come out to tell him of the mistake. In addition, the service didn't seem well-organized, as there were long periods of time in the back of the restaurant where a waiter did not even check in on the tables. I would be ok with this, except that the waiting time was inordinately long and that this was during Dining Days, where the restaurant should at least try to be at their best.\n\nOverall, go for a nice long (like 1.5 hour long or more) dinner, but if you're in a rush, skip."
    },
    {
        "id": 140,
        "text": "Vientiane Cafe is a terrific neighborhood gem gently nestled along a string of dive bars and fellow ethnic joints on Baltimore Ave.  We came here on the recommendation of a friend of mine while entertaining out of town guests in search of the classic Philadelphia BYO experience.  Armed with two bottles of wine, the six of us enjoyed a filling dinner of delicious and cheap Thai and Laotian food that satisfied our hunger and kept our wallet light.\n\nI enjoyed the Lad Na with Beef, which is sort of like a Pad See Ew except with a slightly thinner sauce and more vegetables.  The broccoli was crisp, the beef was flavorful and juicy, and the noodles were done just right.  Everything in the dish worked perfectly together.  The BF and I also split a Nam Salad; some sort of lettuce wrap thing that tasted pretty good although I have no idea what the filling was (kind of reminded me of Bac-os?).  Not as good as the noodles in my opinion.\n\nThe service could have been slightly better (it took them forever to get us the wine glasses, although to their credit we were a large party and it was very crowded for the later side of a Friday night), but I was still very pleased with the food, ambiance, and overall value.  Definitely a place I would be happy to return to for a low-key dinner or even take out.  Also, at just under $20 per person with tax and tip included, it's extremely reasonable.  Do make sure you bring cash though."
    },
    {
        "id": 141,
        "text": "One my favorite restaurants in all of Philadelphia. They always have plenty of customers and for good reason. Their food is authentic and addictive. The vegetarian papaya salad is just perfection(warning can get extremely spicy so tell them to keep it at 2 out of 5 spice level). Their curries, from red to panang, are all excellent. The flavors are not to be beaten. I also love their homemade stuffed Lao sausages. I dont even live in Philadelphia and have eaten here about 4 times in the past two months. Go here."
    },
    {
        "id": 142,
        "text": "Cozy little BYOB with limited seating, so get there early.  The food was great, I had the penang(sp?) curry and everyone else got the pad thai.  The curry was the best I've ever had, the pad thai was excellent, but I've had better.  We visited for dining days so we all got a desert too, all of them were excellent, especially the banana and chocolate spring roll.  The prices on the menu were very cheap considering the portion size and quality.  Would definitely recommend if you're in the area and you can go to dock street first and grab some beer for your meal."
    },
    {
        "id": 143,
        "text": "All my friends love Vientiane but I just can't bring myself to like it very much. All the food I've had from here has been mediocre and the layout of the restaurant is a little weird so when you are stuck on the narrow side they sometimes forget about you and the service gets slowed down a lot. It is a BYO which is nice and my friends always like their dishes but I am just never overly impressed. I had the cornish hen this time and the meat was very dry and the vegetables weren't cooked much at all. The one detail I do like is that they put their rice in little baskets that make me happy to look at."
    },
    {
        "id": 144,
        "text": "being new to the area, i checked my yelp android phone app to see \"what's hot\" near me, and i found this restaurant close to where i was staying.  i loove thai food, and they had a killer lunch special, so i dropped in one day for lunch.  i ordered the coconut soup, dumplings (i know, not very thai, but i can never resist dumplings), and pad thai (my usual go-to when trying out a new thai place).\n\n- coconut soup: yum. normal. as expected. downed the broth, left the veggies.\n- dumplings: soggy, mushy, fell apart.  disappointed.  my bad for ordering chinese at a thai place.\n- pad thai: from the first bite it just tasted too soy saucy.  it didn't taste like pad thai to me.  very, very disappointing.  \n\ni might try this place out again to give it another shot, but if a thai restaurant can't get pad thai right each time they make it (in my opinion), then i'm not sure it's worth trying out a second time :T"
    },
    {
        "id": 145,
        "text": "I came here with a friend for the University City Dining Days thing ($15 for 3-course meal). Do know this is cash only, BYOB. When I first arrived, the staff seemed to make a big deal that they couldn't find our reservation (though my friend said she had made one), despite the number of empty tables. She finally seated us at a table near the door. At no point was there a line of awaiting diners so it seemed like they made a big deal out of it for no reason.\n\nThe food wasn't bad but the portions were a bit on the small side. Maybe this was due to the Dining Days deal.  The curry entree I got was an OK size but the appetizer and dessert were tiny.  The banana-chocolate spring roll was almost dwarf-sized and definitely small enough to rule out any sort of sharing.  \n\nMaybe I'll come back here and try the non-Dining Days dishes to see if the portion size will impress but my experience here was just OK."
    },
    {
        "id": 146,
        "text": "We went here on a weeknight and had the curry shrimp with sticky rice and chicken pho. The food was excellent, everything arrived in a timely manner and the portions were generous. If you're wondering the food keeps well for leftovers. I highly recommend the restaurant if you've got a hankering for Asian food and are in the area."
    },
    {
        "id": 147,
        "text": "This is a good neighborhood BYOB. Seating is limited for large groups so I would recommend a reservation and still possibly expect a wait, it is a great fit for two people though (they have a lot of two person tables). \nFood is decent but I still haven't found my \"go-to\" dish.\n\n$$$ Cash Only"
    },
    {
        "id": 148,
        "text": "Came here for lunch on a weekend, they have a lunch special that cost just under $10 with your choice of soup, appetizer, and main course. \n\nI had their Tom Yum Soup - it was spicy with a lot of veges which I liked. My friend had their coconut soup which I felt was a little on the sweet side. I had steamed vegetable dumplings - nothing special there. My friend had chicken skewers and we both really enjoyed their peanut sauce. Our main lunch meal was pad thai. I had leftovers after, it has a lot more vegetables than most chicken pad thai places I've had before.\n\nSmall, quiet and cute. A little pricey but portions were definitely worth the price."
    },
    {
        "id": 149,
        "text": "Take your girlfriend here. She will love you forever. Try the stuffed talapia. Or the Panang. Or the pineapple fried rice. Great menu, plenty of vegetarian options, and plenty of spice! Good prices too. Take your date here. She'll be impressed and you wont break the bank."
    },
    {
        "id": 150,
        "text": "Excellent food. Friendly staff.  Good to eat in or take out. Lots of veggie options. Great small plates and entrees. I have never been disappointed."
    },
    {
        "id": 151,
        "text": "I have been coming to this restaurant for a few years now and I've never been disappointed. The food is fantastic and the customer service is superb! I enjoyed all the dishes here but I especially like the papaya salad extra spicy and Laos sausage (it comes with this authentic sauce that you dip in). It goes great with sticky rice. Most authentic thai/laos spot in Philadelphia!"
    },
    {
        "id": 152,
        "text": "This place can be a bit snug on the on hours, but the wait and packed-ness is well worth it. The food is excellent, and it's not just excellent for being cheap; it's excellent, period. Though I might be mangling spellings here, the Bahn-Xeo appetizer is amazing, with or without accompanying sauces, while all the noodle dished -- particularly the Pad See-Ew and Lad Na -- are sizable and scrumptious. Plus, in my opinion, they taste even better cold the next day. On to the desserts, all of which are near incomparable. The mango sticky rice is faboo, though you can definitely get that same goods elsewhere. Try the spring rolls and/or rice pudding for something new and different."
    },
    {
        "id": 153,
        "text": "i love the renovations!  the restaurant is now more spacious and seats more people.  lots of hits and misses here.  \n\nlove:  homemade sausage (well seasoned and great to share with a group); duck curry (this is the largest portion of duck that i have ever been served for a duck curry.  the meat is meaty and not overcooked), deep fried catfish (hit or miss, when done right it is crispy but not dried, when done wrong, it just tastes bad); the sticky rice that comes with your entree (served in a small bamboo container that keeps your rice warm and fresh).\n\nmeh:  paneang curry (i love peanut butter, but not peanut butter curry); cornish hen (looked and tasted like chicken than cornish hen).\n\nthe service is always spot on.  i love the family business feel and they are always accomodating to large parties.\n\noverall, a good place to go with the family."
    },
    {
        "id": 154,
        "text": "Came here with a group of 3 friends and was seated right away due to us making a reservation beforehand. We ordered our drinks first, one friend and I ordered the Thai Iced Tea and another friend got the red sello drink. The Thai iced tea was great, it had the perfect amount of sweetness and was very much enjoyable. But on the other hand, the sello drink looked cool with the pink color but tasted very watery. Which was very disappointing. Moving onto food, we ordered appetizers, which were the homemade beef jerky and sticky tamarind chicken wings. Both were good and flavorful. As for our entrees, we decided to do a \"family style\" meal and ordered more than 1 entree and share. We got the duck Penang curry and chicken laab. The curry soup was extremely thick and did not have enough flavor and the chicken laab was good but lacked some flavor. \n\nOverall, I feel that this place would be great to get a little taste of authentic lao/thai food. But personally, I have had authentic, homemade lao/thai food and I feel like this place lacks some flavor in their dishes. Would recommend if you want to try some lao/thai food but personally will not be going back."
    },
    {
        "id": 155,
        "text": "Great for taking out or dining in.  Very friendly, quick service, and super food.  Reasonable prices, too.  I have tried several dishes here and have yet to be disappointed."
    },
    {
        "id": 156,
        "text": "I don't like to give reviews, but my dining partner and I ordered an entree that tasted like cat food. very terrible. \n\nit's byob though."
    },
    {
        "id": 157,
        "text": "I had a perfect meal at Vientiane cafe tonight!!! I got the king thai soup which was spicy and delightful, nice lemongrass and lime flavors, and my boo for excellent pad thai. We started off with an amazing Laotian crepe with two different sauces - it was crispy and full of nice veggies and tofu. Also, great dumplings. My favorite restaurant for an easy and fun West Philly night!"
    },
    {
        "id": 158,
        "text": "Fantastic food, excellent service, and romantic ambience. Everyone in my party really enjoyed their food and the prices were very reasonable. A wonderful find! Also accessible for persons with mobility impairment.  Highly recommend."
    },
    {
        "id": 159,
        "text": "This place has always been good for a quality lunch or dinner on the cheap, and now we finally review it.\n\nWe ordered a special egg and fish-chili sauce appetizer, the bbq cornish hen, and the red curry. \n\nThe egg and chili appetizer was a thinly fried spiced egg served with a dish of chili sauce and rice, but the taste was really lovely. It was definitely an appetizing start to the evening. The bbq hen was a dry barbecue that came with a sweet and sour dipping sauce. The hen itself was cooked very well. Finally, the curry was superb.\n\nThe service is always reasonably good here, and even though they are popular for dinner, our table had enough room around it so we could relax."
    },
    {
        "id": 160,
        "text": "I have been following these people throughout the city for the last 10yrs.  They first operated out of their backyard under a blue tarp, served beer for 2 bucks, then was re-located to a wing shop by Drexel, and then was kicked out and moved back to their house but only secretly offering takeout from their house.  So I was quite happy to see that in the last few years they've been able to relocate to their own, cute BYO on Baltimore.\n\nAlthough the food doesn't seem quite as good as the days it was operating out of their backyard, it's still pretty solid.  The green papaya salad is delicious (but has a lot of fish sauce if you are okay with that), the pad thai has thinner, less traditional pad thai noodles which I actually like better,  isn't greasy and very flavorful."
    },
    {
        "id": 161,
        "text": "Over the past few years, Vientiane has remained one of my go-to BYO choices in Philadelphia. \n\nThe food here is so flavorful and always well-prepared. Some of my favorite dishes are: Vegetarian Naam Salad, Red Curry, Pad See Ew, and Pad Kee Mow. I don't know what they put in that salad but it's good. Really good. I first had it at the Baltimore Avenue Stroll for like $3 and now I have to order it every time I go to Vientiane. I've introduced it to a bunch of my friends too and they can't get enough. Definitely one of the underrated items on the menu. I'm all about the flavors and trust me, it doesn't get better than Vientiane. \n\nThe only downsides are that it's cash only and usually pretty busy. Service can get slow when they are packed (which they usually are). However, these minor issues are signficantly outweighed by the benefits of the BYO, price, and food quality. I'll miss Vientiane for sure when I move out of Philly!"
    },
    {
        "id": 162,
        "text": "I'm a huge thai food fan, but normally I stick to pad thai, two nights ago we went to Vientiane and while enjoying the weather outside I decide to try the crazy pineapple fried rice with chicken... and well, i think i have a new favorite"
    },
    {
        "id": 163,
        "text": "I love Vientiane!  The prices are fair, the staff is excellent, and the food is delicious.  In addition, they really understand vegan food, including the fact that it doesn't contain fish.  I especially recommend the ginger tofu and the aw lao, but there are many other good dishes, as well.  This is the best restaurant in West Philly, and you can BYOB."
    },
    {
        "id": 164,
        "text": "Where do I begin?! \n\nI absolutely love Vientiane Cafe (even though I may not be pronouncing it correctly, haha)! Do not let the poorly lit entrance fool you, the food here is amazing. \n\nFirst visit: I came here with a sister and friend for their dinner special. This comprised of a soup/salad, followed by an appetizer and ended with an entree. I remember getting their seaweed salad, spring rolls and shrimp drunken noodles. OMG! Amazingggg.. It was so good that I took some to-go. \n\nLocation/ Service/ Decor: The restaurant is located on Baltimore Ave. There is nothing fancy to this establishment, I actually wish they put a little more effort into the entrance and decor because I can see how it may turn people away. Service was fine. \n\nRestaurant is BYOB. \n\nCraving Thai fried rice, I decided to order take-out from Vientiane. I got their Basil fried rice and opted the protein for more vegetables. The rice was amazzzzzingggg. The aroma of the food took up my entire car.. it was sooo hard not to eat it before getting home.\n\nOverall, great food and reasonably priced. Would recommend!!"
    },
    {
        "id": 165,
        "text": "Vientiane is cute and casual little neighborhood BYOB self-described as Laotian. I'm a big fan of the pad thai, which is rich in flavor and served with still-crunchy broccoli and carrots, and you can't really go wrong with an appetizer of fresh spring rolls or edamame. Most of the food is just OK, but there are a handful of really excellent dishes.\n\nIf you're planning to go, make sure to bring cash, because they don't take credit cards and have no ATM inside. They also do take reservations, so keep that in mind, as they do fill up on Friday and Saturday nights."
    },
    {
        "id": 166,
        "text": "This place has great Thai food, but it recently raised its prices!! A beef pad thai is now $15 and a chicken pad thai is now $14 - we ordered these for takeout and it was seriously not worth it for the size you get. They also didn't tell us the total cost over the phone when we made the order, nor give us a receipt when we paid. Seems like a crappy way to treat local customers. Really disappointed! :("
    },
    {
        "id": 167,
        "text": "This place is yummy. Great Pad Thai which is the standard, and definitely my fav. dish.\nI went with my boyfriend who is Indian and he appreciated all the spice they had, which even made him sweat. That means a lot coming from him, so if you can handle the heat, order the green curry.\nBYOB so bring your fav drink. They do have great teas, and of course thai iced tea and thai iced coffee, delicious."
    },
    {
        "id": 168,
        "text": "I came here after randomly remembering the suggestion of a friend a couple years back..\n\nThe exterior is very unassuming and it almost looks closed, but the interior is very classy and modern, and larger than I expected! \n\nWe tried the pad thai and green curry. It was weird because the pad thai was obviously very well made but had almost no sweetness/tamarind taste which I was disappointed by. The green curry was only slightly spicy but still delicious! \n\nTook a star off because it was a little more pricey than Thai food tends to be for not a huge difference in quality... Maybe I should have tried the Laotian food instead - would definitely return for that!"
    },
    {
        "id": 169,
        "text": "I ate here once a long time ago (2009) and I thought the food here was good, but not outstanding.  The curry was barely spicy--perhaps we should have explicitly spelled it out.  But beyond this, it was flavorful but not really amazing or anything.  It also wasn't very filling.\n\nI came back here in 2013 and...wow.  Just wow.  It was like a completely different restaurant...the food was really subtle and flavorful and completely unlike any Thai food I've had before.  I don't know if I hit it on an off day before, or if I ordered a dish better suited to my tastes the second time...but I've since come back, and tried quite a few different dishes here and it has been consistently top-notch.\n\nThis place is a little pricier than the average low-end restaurants that I like to eat at...it's hard to get out of here without spending $15 and it's easy to spend much more than that.  But I think the food is worth it.\n\nService was a little slow and inattentive the most recent time I came here.  I found that somewhat annoying.  But the food was so good that I'd totally keep coming back.  I've had lots of Thai food, and even some Lao food before, and I thought this was an unusually good restaurant of its type."
    },
    {
        "id": 170,
        "text": "Love this vegetarian cafe. Great area with cool setting and clean fast service.Also great prices."
    },
    {
        "id": 171,
        "text": "Living around the corner from Vientiane was the greatest thing I ever did in West Philly.  Now that I'm out in the mountains, I regret not taking advantage of it more than I did.\n\nLet's look at the cons, first:\nThey're small.  Kinda stuffy in the summer.  Fills up quick.  Waiting for a table outside during the winter sucks.  Inconsistent interpretations of their heat scale (I've had mild-medium that was a 5 alarm fire in my mouth, i've had medium that was just right.  I dunno, just guess.) \n\nBut the pros, oh, the pros.\nTheir fresh spring rolls. Squishy and chewy and full of mint and unicorns.  Maybe not really unicorns, but probably.  Actually better vegetarian than they are with meat.  Shrimp?  Whatever.  Get the tofu.\n\nThe soups.  Huge, unfinishable, delicious.  Just enough kick to warrant ordering 9 billion thai iced teas.  (did you know that you can get thai iced take as takeout?  I totally learned that here.)\n\nMy main course, every. Single. Time: Chicken Laarb.  I have never, in years of thai food, found another place that does laarb the way Vientiane does laarb.  Everywhere else, it's a weird vinegar-y appetizer salad thing, too sweet, kinda gross.  Here?  God, I don't know what they do here.  It's full of fish sauce and cilantro and lemongrass and scallions and magic fairy dust or something.  I would eat this for my last meal on earth.  Actually, I would eat the leftovers for my last night on earth.  (It's 100x better after it's been marinating in itself in the fridge overnight, and it's pretty damn perfect when it comes out of the kitchen.)\n\nDessert: does it even matter? Mango sticky rice, deep fried bananas, ice cream, who cares, it's gonna be delicious.\n\nI fly 2000 miles for this meal every 6 months.  Not even kidding."
    },
    {
        "id": 172,
        "text": "I came here to meet up with a group of friends and thought it was OK. It was quiet enough for talking and we were not rushed. \n\n I wanted to try the Laotian food since I have had plenty of Thai.  I had the \"Laah\" with chicken which I could describe as chopped chicken mixed with scallions, herbs and it was a little tart with lemon or lime juice. I would say it was interesting but I did not love it and would not order that again.  The laah came served with \"sticky rice\" which is just as it sounds. The rice came in a little bamboo container which was cute except that they lined the container with plastic to keep the bamboo clean.  I don't really like eating food in plastic.  \n\nThe rest of the group seemed to enjoy their food. The things that looked interesting to me were the King Soup (came in a giant bowl!) the Triple Flavored, and the papaya salad.\n\nThey offer an early bird special Mon-Thurs which comes with a small cup of soup, a few small satay skewers and a main dish for $15, a good deal, especially as it is BYOB.\n\nOverall I would say this is a decent place and probably one of the best options in a neighborhood not known for its cuisine. I would recommend it if you happen to be in the neighborhood but not if you have to make a special trip."
    },
    {
        "id": 173,
        "text": "I am still craving these dishes weeks after trying them! I went with about 10 friends to celebrate a birthday last week. Because there were so many of us in our party, we were able to try so many items on the menu and ALL of them were outstanding! The dish I cannot stop thinking about: vegetarian naam salad. It will blow your mind. Tangy and sweet and crunchy and unbelievable. Another standout: King's Soup. Believe me when I tell you that it's the creamy coconut spicy soup you crave. The pad Thai is also not to be missed. \n\nThe only reason I can't give this place five stars is because of how slow the service was. Granted, we were a large party...but the wait staff would sometimes disappear for 20-30 minutes at a time and it was over an hour and a half from the time I got there to the time I received my entree. \n\nBUT do not let the slow service stop you. Take advantage of its BYOB status and settle in with some nice wine and be patient for some very worth-the-wait dishes. \n\nWe will absolutely be back!"
    },
    {
        "id": 174,
        "text": "I ate here summer of 2008. An adorable neighborhood restaurant gem that I will visit again next time I am in Philly. Delicious spring rolls, Pad Thai and Yum Salad and the best part to me was that you can bring your own bottle of wine! I believe they charged us a small corking fee, but it was very reasonable and really helped keep our bill down significantly. Quaint and lovely on both food and atmosphere..."
    },
    {
        "id": 175,
        "text": "a great authentic thai/lao place nestled in west philly! Highly recommend the Pad Kee Mao (w/ chicken)- strong flavors of thai basil and super fragrant noodle dish. Also got the Banh Xeo (Vietnamese pancake) that was super crispy and flavorful! Cash only, but also BYOB. Such a little gem in West Philly!"
    },
    {
        "id": 176,
        "text": "Hands down the best Thai food in Philly (and I'm hella picky) but yeah service is great and fast. Appetizers come really quickly and they don't shove food in your face while your appetizer is still on the table. But Tom yum here is fantasbulastic and the curry is yummm"
    },
    {
        "id": 177,
        "text": "This would be my first and last time here, I ordered papaya salad(that's what good) , larb with beef and beef jerky( both of them are super super super salty Iike they put a full of table spoon in there. That's so disappointed ( - -)."
    },
    {
        "id": 178,
        "text": "Hands down my favorite place to eat!\n\nPros: spicy, authentic, tasty, vegan-friendly\n\nCons: service can be a little spotty. If it had been better, I'd eat there a few times a week. It's that good."
    },
    {
        "id": 179,
        "text": "Very good BUT ********CASH ONLY******** -- see second paragraph.\nI took my daughter there for lunch. The place was nearly empty at the time, maybe 25% full?? The food was very good, the waiter friendly, and the service decent. I can't tolerate much spice, so I asked for low spice level and was satisified: good spicy taste, but not overwhelming for me. I'd have given it four stars or maybe even five except for the booby-trap:\n\nI only had a little cash and was planning to pay with a card, till I opened  the bill folder and saw \"CASH ONLY\". I complained to the waiter, \"There was no warning of this!\" He pointed to the phrase on the regular and lunch menus-- very small print, lost amid other text unless you look closely. I had to walk with my cane 15 minutes to the nearest ATM and back; good thing it wasn't raining or I'd've just left. No sign outside, no indication on their website, and the ONLY warning of it on this Yelp review page is buried in Yelp's standard list:\n    Vegan Options\n        Yes \n    Takes Reservations\n        Yes \n    Delivery\n        No \n    Take-out\n        Yes \n    Accepts Credit Cards\n        No \n    Accepts Apple Pay\n        No \n    Accepts Google Pay\n        No \n    Accepts Cryptocurrency\n        No \n    Good For\n        Dinner \n    Parking\n        Street \n    Bike Parking\n        Yes \n    Good for Kids\n        Yes \n    Good for Groups\n        Yes \n    Ambience\n        Casual, Classy \n    Noise Level\n        Average \n    Alcohol\n        No \n    Good For Happy Hour\n        No \n    Outdoor Seating\n        Yes \n    Wi-Fi\n        No \n    Has TV\n        No \n    Caters\n        Yes \n    Gender Neutral Restrooms\n        Yes"
    },
    {
        "id": 180,
        "text": "I left frustrated and hungry...it took an hour to get our meals and they only seemed to finally bring out our food after we threatened to leave.  I was starving by that time and the meal barely satiated my hunger. I order the laab which was tasty but there was just not much too it. Just ground pork in a tangy sauce and some bean sprouts.  The sticky rice was interesting but not very tasty.  Was not worth the price. It was also crammed packed and so noisy you had to shout to be heard. I wouldn't go there hungry.  I won't be back.   I recommend their neighboring restaurant Dahlak, I've been going there for years and have never been disappointed"
    },
    {
        "id": 181,
        "text": "My wife and I ventured to this spot the other day for lunch. The funny thing is, we thought it was Vietnamese food because of the name. Ironically, there is a spot just around the corner called Vietnamese Cafe. Anyway, this is a Thai place.\n\nThe had a great lunch deal. For $9.99 you get a soup, appetizer and an entree. My wife and decided to share the appetizers. We got the Spring rolls and dumplings. Both were fantastic. \n\nI had the Spinach Soup with chicken and it was great. My wife got the Coconut Soup. She said it was okay, but not her thing. She did say it probably tasted the way it should, but realized afterwards she's not a huge coconut fan.\n\nFor the entree, I got the Pad Thai with chicken. I was perfect. I really enjoyed it. My wife got the Sweet Basil with chicken. She really liked it too.\n\nAll in all, it was a great experience, and the price was also great."
    },
    {
        "id": 182,
        "text": "Amazing food (I love the tofu Lad Na), loads of vegetarian options, BYO, friendly staff, outdoor seating. Small, clean, comfortable. Only negative is that it's cash only."
    },
    {
        "id": 183,
        "text": "This one here is definitely a hole in the wall kind of place. The place is simple and clean looking however the designs are kind of bland. The food is definitely the star here. When you see here, you have to order the Laos sausage. It comes with three sausages, sticky rice and two dipping sauce. One sauce is tomato based, think of a cross between spaghetti and tangy pizza sauce. The other is purée pepper sauce, terrific flavor but extra spicy! They also offer a lunch menu for 11 to 13 dollars which consists of soup, appetizer and entree. So far everything I had here is great, the Thai tea is especially amazing. Word of advice though, the food does take a bit to come out so make sure you have time, especially on a lunch break."
    },
    {
        "id": 184,
        "text": "Vientiane is one of my top five favorites in West Philly, and one of my top ten favorites in the city. It's always a lovely dining BYO experience. The decor is elegant yet comfortable. It's a lovely place to have a special but cozy dinner although it's is equally suited to working into your rotation of takeout places. The staff is knowledgeable and everything runs smoothly even on busy nights. \n\nThe food is terrific!!! Way better (more adventurous, more flavorful, less formulaic) than the other South East Asian option around the corner (cough cough, Vietnam Cafe). If you live in the area and are looking for something along the lines of Vietnamese or Laotian food, the only argument for going to Vietnam Cafe instead of Vientiane is the liquor license. Anyways...\n\nI frequently order a duck dish of some kind. It's clearly cooked by an experienced chef and is always super tasty. I love the way they cook their rice-- it's magically chewy without being too sticky. My husband loves their house-made beef jerky and their yum salads. We also LOVE their coconut puddings. Honestly, sometimes we do take out just for the coconut pudding; it's that good. \n\nIn sum; Vientiane is awesome. You should go."
    },
    {
        "id": 185,
        "text": "The best part about this place besides the pho (I got tofu but my boyfriend got beef), and the crispy spring rolls was the service! The friendliness and smiles made us want to come back again. If In university city definitely should try this restaurant! It was my first Time eating pho and i truly enjoyed it! Definitely a 10/10! The only thing is they are cash only so come prepared"
    },
    {
        "id": 186,
        "text": "Amazing place for W. Philly!!! Everything I ever had was delicious. They are really nice and kind as well"
    },
    {
        "id": 187,
        "text": "So obsessed with this place now thanks to my friend! But seriously, best Penang curry ever and I love their vegetarian naam salad and Thai tea!! Service is also great and they're very friendly. I highly recommend this place if you guys are craving for some delicious Thai food! Mmm!"
    },
    {
        "id": 188,
        "text": "One of my favorite restaurants because they don't hold back on the flavor.  It's authentic laos food, not watered down dishes.  I love love love the papaya salad and order it with the crab sauce.  There are pieces of crab shell in the dish; that's the real deal.  My second favorite is the rice salad, perfect blend of sour and sweetness.  The laab is better when it's spicy.  You must order sticky rice to compliment these dishes and eat it with your hands. \n\nI noticed the restaurant expanded and the decor has been updated.  I was happy they didn't change the menu.  Keep it tasty.  Keep it real."
    },
    {
        "id": 189,
        "text": "Some of the best food I've ever had. Quite surprising since Laotian has never been on my radar, but it is now!"
    },
    {
        "id": 190,
        "text": "They have a really nice selected of vegan options.  The Penang Curry is my new favorite food. I LOVE that it is byob. The service is hit or miss but the food is consistently good."
    },
    {
        "id": 191,
        "text": "Love this place!!!! Food is awesome. Waiters and waitresses are very nice and attentive :) go eat here! You will not be let down."
    },
    {
        "id": 192,
        "text": "Very much a neighborhood and college town kind of place. I went with relatives here last week, and I was expecting a very good experience, food wise (I don't think anywhere in Philly is outstanding for Thai, but this had good reviews). Others in my party had the King Soup, which is like a coconut soup. It was pretty good, but not amazing.\n\nI ordered a chicken tom yum and chicken pad thai. The tom yum was solid, but a bit lacking on spice. My main gripe is with the chicken pad thai. I asked for it at a spice level of \"medium.\" What I received was a mound of gummy-textured noodles, a few pieces of chicken, and some veggies, with no spice whatsoever.\n\nWould order other items from the menu next time, but in no rush to return, even with the handicap that I give to Philly Thai restaurants (none are all that good, with Chabaa in Manayunk, or Ratchada, being the best of a meh bunch)"
    },
    {
        "id": 193,
        "text": "What a great place. Very unassuming but absolutely delicious!\n\nWent around 615 on a weekday and had their daily dinner special, which included Tom Yum Soup, A noodle Dish, and Pork dumplings. \n\nEverything was absolutely delicious! The soup had great flavor and was a perfect portion size. The dumplings were well made and very tasty as well. Noodles were excellent and very flavorful. And it wasn't overly peanutty (That's a word right?). And the whole thing cost 18$! \n\nGot packed as we were leaving. Finally I have found a go to Thai place!"
    },
    {
        "id": 194,
        "text": "I would never notice this place if my friend didn't recommend it to me and 8'm glad i tried it out! Their sausages are the best! Tastes like home made and not too salty. The eggplant sweet sauce with half duck was my second fav. I don't think you will go wrong with any dishes. The only reason I don't give 5 stars is the long wait. We didn't order appetizers, and waited for 50min to get the first entree..."
    },
    {
        "id": 195,
        "text": "I've only been once, and it was fine but not enough to bring me back.  It was recommended by several people.  I've heard it described as Laotian-Thai.  I haven't eaten Laotian food anywhere else, but I've eaten a LOT of Thai food.  This place wasn't very exciting.  Maybe because I don't know from Laotian cuisine and didn't know what to order.  I LOVE green papaya salad, but theirs was just meh.  The other entrees were adequate--not bad at all.  You could do worse."
    },
    {
        "id": 196,
        "text": "Best Thai in West Philly. I honestly don't know how this place isn't busy all the time. Flavorful dishes, fresh ingredients, good portions, and friendly staff. Lots of vegetarian options and their spice levels are no joke. Cash only is a little annoying, but the food makes up for it."
    },
    {
        "id": 197,
        "text": "One of my favorite restaurants.  This is the real deal, if you like authentic Laos food.  Very happy with their papaya salad."
    },
    {
        "id": 198,
        "text": "I've been here 3 times before and always loved it, especially the coconut soup  and mango sticky rice, but this time I'm pretty sure my boyfriend and I got food poisoning, either from the pad thai or pork dumplings."
    },
    {
        "id": 199,
        "text": "This place is great! We have ordered catering from here twice, and they haven't disappointed yet; they arrive on time with lots of trays of food. We have a lot of vegetarians, and their tofu and noodle dishes are very popular. Their ingredients are very fresh, and they always give us lots of limes to go with our catering. You should definitely consider thinking outside of the box and get your next event catered by them."
    },
    {
        "id": 200,
        "text": "No need to fly to Asia to get amazing Laotian/Thai food. Vientiane Café will satisfy your Asian cravings without breaking the bank. \n\nFor starters we had the delicately sweet beef jerky and level 1  and level 3 papaya salad (note: level 1 was just the perfect spice level for me, level 3 was like throwing a fireball in my mouth) along with the grilled mixed vegetables and spring rolls. Everything was made to perfection. Although I wished they served sticky rice with the beef jerky, that can be remedied by ordering a side of sticky rice. \n\nWe continued to gorge on naam (crispy rice with lime and peanuts), vegetable fried rice, crispy duck, shrimp red curry, and drunken noodles with chicken. You can't go wrong with anything on the menu. As you can see we ordered a wide variety and we all left feeling like stuffed turkeys."
    },
    {
        "id": 201,
        "text": "I live pretty close to Vientiane, but don't get to eat here much. The last time I went must have been 5-6 years ago, because when I went here recently they have expanded! They said they expanded 5 years ago. It's a bit dark inside, but the ambience is nice; minimally decorated with Laotian (at least that's what I think came from since it is Laotian restaurant) arts, comfortable environment, friendly service, and did not feel rushed out. The server answered our various questions, recommended few things, and the service was prompt. \nMy friend ordered Aw Lao with beef. I got a taste of the broth and it was so nice! I don't know how to describe, but it was definitely a comfort food. Steamed sticky rice came in a straw container. I ordered Papaya salad Lao style with fermented crab, and spice level 3. At first I was taken back by the fishiness, but it kind of got addictive. I am Korean so I am used to spicy food, I think spice level 3 was a bit more spicy than I am used to. I have had spicier food, but I had rice to accompany the spicy food. Maybe next time I will adjust the spice level to 2 so I can enjoy some spice, but not have to blow my nose. Overall, the fishiness and spice added to the addictive quality of the salad! \nWe also ordered chicken satay, I thought maybe it was a bit bland, but I also ate it without dipping into sauces. We did not take advantage of their lunch specials, but I would like to go back again to try their lunch specials."
    },
    {
        "id": 202,
        "text": "Great cozy atmosphere. Food is very good. Service is fast. Overall it is one of the better places Baltimore ave. will definitely come back."
    },
    {
        "id": 203,
        "text": "worst of the worst! \nFood is totally fake, tastes bad, but the service said that is how they cook here. Sucks"
    },
    {
        "id": 204,
        "text": "It's a significant trek out to Vientiane from Penn's campus but it's worth the trip. I think they're better than the general Thai/Malaysian/Laotian food near campus, and they have good lunch specials too."
    },
    {
        "id": 205,
        "text": "We ordered the Pineapple Fried Rice.  It was delish! A decent serving of food .  We also had ginger tea.  I pretty much drank The Whole pot by myself.  The prices were also very reasonable. It's nice little restaurant"
    },
    {
        "id": 206,
        "text": "Really good authentic food. Baltimore avenue is looking beautiful! So many awesome places including this one. I only wish you took credit card too. I would come more often. I don't like paying in cash. Please respond to this when you take credit cards and we will frequent you place a lot more."
    },
    {
        "id": 207,
        "text": "thai/laotian food. i don't really know what laotian food consists of, but my thai dish was pretty good. i got the red curry and although it wasn't spicy enough to my liking (it rarely is at thai restaurants), i still enjoyed it. the curry came in a bowl that was uniquely decorated, kinda cool in and of itself. the outside of the restaurant is decorated with all these loud colors, but inside, the place is dimly lit and has a kind of cozy feeling to it. definitely makes a good date location."
    },
    {
        "id": 208,
        "text": "Disappointing. Everything is watered down and flavorless. The coconut soup is a far cry from authentic Tom Kha soup, and even the mango sticky rice, which is typically hard to screw up, was disappointing and served with a sauce so watered down it actually had the same consistency as water and ran off the rice & mangoes. \n\nPerhaps if you've never had authentic Thai or curry you'd be impressed; otherwise, this place is a huge miss. Don't waste your time or money."
    },
    {
        "id": 209,
        "text": "My sister declared this her favorite restaurant in Phila, so I offered to take her here for dinner last night.  However, it should be noted that they dp not take credit cards (that was all I had on me) and so my sister took me out do dinner instead.  (A wonderful trick to pull if you are going with someone who is obligated to love you no matter what.)  But even though she had to pay, our dinner (apps to entrees to dessert to yum iced tea) was under 40 bucks.  Pretty awesome.\n\nI'm a relative noob when it comes to Thai food and have never had Laotian, so I usually stick with shrimp pad thai.  So I've had my share of shrimp pad thai.  And this ranks up there with the best I've ever had.  Yum yum yum.  Sis got the red curry and it was like a sweet, spicy soup with lots of veg and chicken in it.  The spring rolls we split for an app were so tasty, light and fresh.  I tried the thai iced tea and I was scared it would be too sweet, but it was pretty close to a perfect compliment to my meal.  I ordered the rice pudding for dessert, expecting normal rice pudding, but it came in 4 little warm cups and was anything but normal, but decidedly delicious.  We were stuffed to the brim with delicious dinner.  (No sense in leaving too little to take home on your plate, of course.)\n\nAs for the service, it was above average.  Our waters were refilled, the food came out quickly, but it did take a while to flag down the waitress for the check.  Not a big deal at all, just us being in a hurry to get out the door to answer the call of nature ;)  \n\nSo go here.  It's a cheap, delicious, cozy restaurant."
    },
    {
        "id": 210,
        "text": "I love this place!!! I've been twice so far, and the food is heaven. So far I've tried the naam salad (a perfect mix of sweet and spicy with a nice coconut flavor), the duck spring rolls (perfectly cooked and not greasy), the Cornish hen (flavorful but I wish they hadn't cut it into pieces), and my all time favorite THE KING'S SOUP!! I cannot even describe the deliciousness of this soup. I ordered mine with shrimp and tofu. The broth is a flavorful red curry with lots of veggies, and a mint garnish that is really good. I plan on going back and trying the fried fish, and the papaya salad."
    },
    {
        "id": 211,
        "text": "I've eaten here 4 or 5 times over the past few years. It's a decent place, but I really don't think it's anything special. I've ordered vegetarian red curry, yellow curry, and eggplant sweet basil. I found the curries more flavorful and interesting than the eggplant. The eggplant was pretty nicely cooked (and eggplant is easy to over or undercook, so that's nice), but the flavor didn't seem that interesting -- lots of basil and not many other flavors supporting it. The curries are nice, very rich, flavorful, and spicy, but I didn't think they were a great value ($11). I do really like the sticky rice. My usual dining companion likes the beef and seafood red curries, but once ordered the Thai catfish and said that it was *horrible*, weirdly deep fried to death. He ate only 3 or 4 bites and couldn't stomach any more.\n\n I've never had lunch here, but dinner prices are not super cheap -- entrees are in the $11-$15 range. Tables are very close together, which occasionally leads to awkward moments because it is almost impossible to avoid overhearing other peoples' conversations and to avoid being similarly overheard by those at neighboring tables. Wait times can be a little long, but are generally bearable -- I've never had to stand around for more than 20 minutes.\n\n As busy as this place is, it's ridiculous that they don't accept cards...at the very least, they should post a prominent sign to warn people about their cash only policy."
    },
    {
        "id": 212,
        "text": "I've always had good experiences here until tonight...\n\nMy boyfriend ordered the Mussels on their appetizer menu which he was really enjoying until he opened one and found it was entirely black (and rotten?  I don't eat Mussels but I'm sure they're not supposed to be black).  I don't think it would stop us going back because every other time we've been the food has been excellent - we just wouldn't order mussels!\n\nThe hostess allowed him to order something else on the menu with no problems but... He ordered Pad Thai which was ok but not the best in the city.\n\nI ordered Aw Lao * soup (with sauteed lemongrass, shallots, chili, asian eggplant, dill: served with sticky rice, which was excellent.\n\nNeed to remember they only accept cash.\n\nLunch specials are also a great deal - soup, appetizer and main meal for less than $10.\n\nGreat vibe tonight though - the place was really busy and full of chatter."
    },
    {
        "id": 213,
        "text": "after watching the \"black metal vegan chef: pad thai\" youtube video, i implanted into my friend's head the idea that pad thai must be consumed in the near future.  since she scoffed at the idea of actually MAKING the pad thai per the vid, she suggested this place near her abode.  my friend, her ladyfriend, and i sojurned to this previously unnoticed hole in the wall.  we beat the rush and got a table immediately.  the environment was quaint and warm.  i sensed that they didn't take credit cards and the host directed me toward an ATM down the street.  the wait staff was friendly and happy to serve us.  we brought a bottle of wine. my friends ordered their desired pad thai but i can never say no to red curry.  the waitress convinced me that salmon would go best with the curry and i asked her to kick up the heat on it.  she was right, the salmon worked great, though i could tell the filet was previously frozen. it was a bit tough and grilled without any seasonings.  the curry was spiced perfectly and the helping of food was enough to leave me full, but not overstuffed. i tasted my friend's pad thai, which also didn't have the heaviness that you'd expect from the dish.  it was light, airy, and full of flavor.  for desert i ordered the banana and chocolate spring rolls with sweet peach dipping sauce and they got the sweet coconut sticky rice.  i'm not a fan of coconut so i stuck to my sweet and melty spring rolls.. omg... so good.  get. them.  i WILL be back."
    },
    {
        "id": 214,
        "text": "Came for a lunch special which is soup, app, and entree for 13-17 which is a decent deal. It was definitely a lot of food. The coconut soup was p good, although nothing really stood out- it was just a coconutty broth with veggies. The chicken satay were a bit dry, but still very flavorful- the sauce was perfect and really went well with the satay. \n\nI got the Panang curry medium spicy for my entree. All I can say is that it was alright. Spice level is as expected. My biggest complaint is that when it arrived, it looked like it was starting to separate into a layer of oil and a layer of lumpy inside. Still tasted pretty good, and they were generous with the beef so extra points for meat lovers. We got there at 1:30ish and there was no line, service was pretty fast also. Just watch out it is cash only. \n\nStill probably the best Thai place in west philly, although there really isn't much competition."
    },
    {
        "id": 215,
        "text": "I decided to come here for University City Dining Days with two friends and it was well worth the $15.  We went on a Tuesday night, and the place was packed.  There are a few tiny tables on the sidewalk which could seat only 2 people each, so we had to sit inside.  The restaurant is very small, but it did not feel cramped to me.  Great ambience and great for a date or just a place to go with friends...my friends love that it's a byo, which one of the other good Thai places in University City, Thai Singa, is not.  Warnings: there is no AC and you must pay with cash.\n\nSo moving onto the food itself, I ordered the crispy pork spring roll, the chicken pad thai, and the mango sticky rice.  One friend ordered the chicken satay, the Paenang curry, and also the mango sticky rice.  My other friend ordered the green papaya salad, the stir-fried eggplant with chicken, and the banana chocolate spring roll.  The appetizers were all tiny: my spring roll was basically the size of a taquito, the chicken satay was only a few pieces of chicken on a skewer, and my friend's papaya salad had no papaya in it.  The entrees, however, were rather large and compensated for the bite-size appetizers.  By default, I always have to try the pad thai before making any judgment on a Thai restaurant.  I really enjoyed my pad thai here; it was flavorful and the chicken was very tender and moist.  My friends' entrees were not as good--both were so-so.  As for dessert, my friend's banana chocolate spring roll was delicious--perfectly pairing of crispy and mushy textures, and nice and warm.  My mango sticky rice was deconstructed, which was not how I have usually seen it, but it was pretty good (almost as good as the mango sticky rice from my favorite Thai restaurant at home!).  It was a little too flimsy though.  The Thai iced tea was also delicious, and I got it for free because I had to ask for it twice.\n\nI would definitely recommend checking this place out!  And be sure to have the guava candy they give you with the check. :)"
    },
    {
        "id": 216,
        "text": "King soup the curry the grilled veggie and the papaya salad are my favorites !!! I only eat here when my friend works here or the manager because the new waiters usuallly mess up my order!!! But over all love the ambience and the authentic food!!!"
    },
    {
        "id": 217,
        "text": "Decent Thai food, sweet setting. We had great service though, & that's what the 4 stars are for. They have an ample amount of seating now that they have taken over the storefront next door. Cash only."
    },
    {
        "id": 218,
        "text": "Love this place ! Byob ...and you have to try the naam salad ...to dye for, I go there sometimes just to eat that !"
    },
    {
        "id": 219,
        "text": "I very much enjoy coming for the affordable and deceptively filling 3-course lunch.  For your $10 you get a soup, a small appetizer, and a main entree from a limited menu.  I always get the Tom Yum soup which is delightfully spicy, but also very light.  You can't go wrong with any of the appetizer choices. \nThe main courses include Thai curries, Pad Thai, sweet ginger, and one or two other things that I can't remember.  I really like the green curry and the sweet ginger with any choice of protein.\nThe staff is very friendly, the clientele is all over the spectrum, and it looks like they are planning to expand their space to include the place next door so there will be even more room.\nI have yet to be there for dinner, but lunch is solid."
    },
    {
        "id": 220,
        "text": "To call this \"Thai Food\" is an insult to the people of Thailand. We ordered the Chicken Satay and Chicken Pad Thai. Two staples of Thai food. Both dishes that Every thai place should have mastered. \nMy first issue came when I found not one, but TWO pieces of hair in my Pad Thai. Two different pieces of hair. Different lengths, and different colors. Unacceptable, but I was hungry, so I pulled them out and let it slide. \nMy main issue was that this food was just disgusting. I have never tasted food so absolutely bland and flavorless before. The chicken was dry, the noodles were one large clump, and the vegetables were soggy. Everything, both the satay and the pad thai, was just gross. There was very little flavor in anything. \nI will be the first to admit that Philadelphia is not the place to go for good Thai food, but this was just so unbelievably gross that we ate a few bites each and threw the rest in the trash.\nI can absolutely assure you I will never be back."
    },
    {
        "id": 221,
        "text": "I was very excited to eat at this place which has 4 star rating. Also I looooove Asian food! To my disappointment the food was very blend, meat was tough and service very friendly but slow.  I take it that we might be spoiled by North Jersey restsurants, where we have a big Asian population. I do not think they would survive in our area!"
    },
    {
        "id": 222,
        "text": "It's a big place, and it's BYOB so that's cool. But I just didn't think the flavors were anything close to what I get in Queens. I'm forgiving, but I wouldn't go back."
    },
    {
        "id": 223,
        "text": "After an initial bad experience and then giving them a second chance, I was still disappointed. The size of their entrees are smaller than my doggie bag I take home after eating at other similar restaurants. \n\nSkimpy amount of vegetables in the curry dishes. Pad Thai would be good if it was spiced. Fried tofu appetizer was amazingly bland, not even salt added. The banana and chocolate dessert was tasty but hardly worth the visit. \n\nThere are too many tables in too small a space with too few servers. You can do better."
    },
    {
        "id": 224,
        "text": "Talk about an under the radar gem. After living in Philly for over 6 years and loving Asian food, we finally made it over to West Philly and tried this BYOB, and all I will say is that we have gone back every week for 5 straight weeks. It's that good. And cheap. And did I mention, BYOB.\n\nFirst, my girlfriend is a vegetarian and this place is absolutely wonderful for her. If you know of the \"Best Thing I Ever Ate\" on Cooking Channel, her choice for the Asian category is the Vegetarian Naam Salad. And let me tell you, as a meat eater, it is just so damn satisfying. They puff and crisp rice, and then serve it with lime, cilantro, peanuts, chili, and give you lettuce cups to use as a vessel to transport it from the plate to your mouth. The perfect blend of crunchy, salty, acidic, and spicy, we could eat it every day. And, it's healthy! \n\nFor the entrees, my girlfriend loves the King Soup with tofu. It's a red curry Thai-style broth, filled with rice noodles, tofu, bean sprouts, and some veggies. Perfect for a winter day. I would recommend the Laotian Sausages with sticky rice. They are homemade with lemongrass, chili, and other spices, and serviced with this amazing spicy acidic dipping sauce. Little rice, little sausage, and some dip, perfect bite. I look forward to continuing to try their Lao speciality dishes. \n\nFinally, they have all the \"normal\" Thai style noodles, curries, and rice dishes, and they truly are awesome, way better than the normal take out stuff you can get at all the \"normal\" Thai restaurants in the city.\n\nOverall, everything is delicious, the service is great, and it's BYOB. What else can you want? Do yourself a favor, make the drive from anywhere in the city to this West Philly gem. And enjoy!"
    },
    {
        "id": 225,
        "text": "Thanks to Vientiane Cafe, my eternal craving for mango sticky rice is finally satisfied! I had been looking for sweet sticky rice with mango at quite a few Thai restaurants, but the closest one I could find before I found Vientiane Cafe was Erawan, which is quite a distance away. The mango sticky rice was perfect; the coconut milk sweetened the sticky rice just enough and complemented the slightly tart mango slices perfectly. The sticky rice was warm and cooked perfectly--not too hard or too mushy.\n\nI also have tried Vientiane Cafe's papaya salad with anchovy sauce, as well as its sweet basil tofu dish. I liked them both equally. The papaya salad tasted different from papaya salads I've tried at other restaurants, but it was a good kind of different. The sweet basil tofu dish was flavorful. I expected there to be a ton of basil in the dish, but there actually were not very many basil leaves on my plate. I wouldn't mind more basil to be honest since I love basil, but I can see how having too many basil leaves could overpower the dish. Overall, I enjoyed my lunch here, although I probably would not come back when I'm pressed on time since the service is on the slower side."
    },
    {
        "id": 226,
        "text": "Look no further, Vientiane is here! Every time I'm craving thai food, Vientiane is the first thing that comes to my mind. I've been here about numerous times over the last few years and it always hit the right spot. Love everything I've tried here and can't wait to go back to this West Philly gem.\n\nPros:\n- BYOB!!! Need I say more? \n- Great service! The wait staff gives great recommendations and is always accommodating \n- Almost every dish has a Vegetarian/gluten-free options \n- Good ratio of protein to vegetables to grains for each dish\n- Tofu here out of this world! I actually prefer it over meat options \n- Great place for lunch, dinner dates or small group gatherings  \n\nMust eats - \nKing soup - enough for two! but you might not want to share, I didn't haha\nTamarind wings \nChicken Satay \nAnything Curry! \nAw Lao \nPapaya salad \n\nTips: \n- cash only :( \n- Fall/early winter 3 course special $20 only on Weekdays 5-6:30pm\n- Call-ahead on weekend"
    },
    {
        "id": 227,
        "text": "I think i just need a tad more bit authenticity to bump this up to a 4.\n\nPad see ew- 3 stars. This was extremely Americanized in my opinion. It tasted fine, but it definitely wasn't Thai. The noodles were cooked well, and so was the beef. but the sauce -- it honestly tasted like the whole thing was sauteed in a bunch of soy sauce. That was highly disappointing. \n\nTom yum: I'll give this a 4 star. A little bit of sour, a little bit of heat and the shrimp was nicely cooked. I enjoyed this.\n\nChicken in Yellow Curry: 3.5 stars. I thought this dish was executed nicely. It tasted much more authentic than the pad-see-ew.\n\nI may return for the lunch special the server spoke of. She said it's something like $10.95 for 3 courses for lunch? TELL ME MORE :) If I go, I shall update :)"
    },
    {
        "id": 228,
        "text": "Dinner at this popular local restaurant was preceded by a brief wait until a table was open but was worth the wait.\n\nThe restaurant is a lot bigger than what appears to be from the front entrance with a long room on the other side of the double store width.\nAs a starter, the chicken satay was more than satifying with a delicious flavorful sauce accompanying the chicken. The spring rolls were equally as tasty.\n\nThe entrees, one of which was Eggplant Sweet Basil had\nbell peppers, onions, and carrots in a sweet chili sauce in the dish and was delectable. My Green Curry entree with onions, basil, green beans, broccoli, carrots and green chilis in a coconut broth had just the right heat for my taste and was very good.\n\nAnother entree of Pad Kee Mao - tofu flat noodles that is pan-fried with bean sprouts, Thai basil, vegetables in a spicy garlic sauce was ordered my one of our dining companions on a previous visit and did not disappoint.\n\nWe diffinitely plan another visit to the Vientiane Cafe when visit this area in the near future."
    },
    {
        "id": 229,
        "text": "I can't say enough about this place. Everything I have ever had was delicious - panang curry, egglplant/dill/sticky rice, Pad Kee Mow (so tasty that it took me a year to stop ordering it), red curry, yelloy curry, green curry- try it all, rice noodles, curries.  It's not Thai, as some people claim, but Laotian, which is why many people don't recognize dishes on the menu, or certain flavor combination. \n\nI don't give 5 stars based on food, though. I love this place because it is a neighborhood joint, because you can eat outside in the summer, because it is a BYOB, because it is CHEAP for the amount of food you get, because when you're there you feel happy just knowing that everyone else is having as good a time as you are. It's not fancy, it's just fantastic. \n\nAlso, there are so many vegetarian options, it's always a hard choice to decide between something new and something that I've had beofre and loved. Really, I could go here every day."
    },
    {
        "id": 230,
        "text": "I had the Chicken Pad Thai. It was phenomenal. I love that they can make your dish as spicy or as mild as you want it. I recommend a heat level of two to start off with. I felt like I got a plentiful portion for how much I paid and I left extremely full! I will definitely be going back and bringing friends. Everything on their menu looks amazing."
    },
    {
        "id": 231,
        "text": "My first introduction to Thai was 12 years ago at Lemon Grass...that became the barometer by which I judged all other Thai...until I ate there in July 2012 and it was terrible...I've never looked back.  I have however continued on my quest for the new gold standard...on my first visit I always order the same thing - Tom Kha Gai and Pad Kee Mao...if they're able to handle the basics then I'll put them on my rotation, which lately has been Thai Singha House, Thai Kuu (just for convenience to meet friends), and Pattaya Grill.  \n\nI actually decided that I would just go back to making my own (especially since my friend showered me with spices from her trip to Thailand), that was until I finally stopped into Vientiane Cafe.  I've been driving by it for years, unsure of what was behind the shadowy threshold.  I was on Penn's campus and just didn't want to be disappointed at Pattaya so I went out on a limb with Vientiane.  \n\nFirst, they have customer service...after eating at Lemon Grass for so many years, I was stunned by the attentiveness of the server...and when I said that the soup was a tad too sweet, he returned with a lime \"to balance the flavor\" and it did.  I attributed this ethic to the fact that they appeared to be second generation; hence, they understand the customer experience. \n\nSecond, the food was very good...after I added the lime, the \"coconut milk soup\" was spot on, and the \"drunken noodles\" were just the right spiciness, achieved with chili oil and dried chilies, and for the first time ever, a nice balance between chicken, veggies, and noodles.  \n\nI plan to return for another prix-fixe lunch and an early-bird dinner.  This was certainly a pleasant surprise that has been hiding in plain sight."
    },
    {
        "id": 232,
        "text": "I love the food here! My favorite dishes are: \n\n1) Penang Curry (I highly recommend it!) \n2) Shrimp Dumplings\n3) Pad See Ew\n4) Drunken Noodles\n\nI also love that it's a BYO. It can get pretty crowded, the service is sometimes a little too slow and it's CASH ONLY. It's a cute place nonetheless and there is rarely a wait for a table."
    },
    {
        "id": 233,
        "text": "Easily one of my favorite restaurants in Philly. I've been here more times than I can count and every time is better than the last. Food is absolutely exceptional! Service is always perfect. Check it out :-) Thank me later!"
    },
    {
        "id": 234,
        "text": "My GF had been wanting to get me to try a bunch of her old restaurants spots from where she used to live (West Philly). We had gone to Vietnam Cafe a few weeks back and it was amazing so I was REALLY excited to go here after reading the menu. I love asian food and one of my favorite soups is Tom Yum soup so I was really excited to try the Yum Salad (which is odd because soup is better than salad).\n\nAnyways they had a early bird dinner special where you could get a salad an app and an entree so I went with that.\n\nThe salad came out first and it speaks of a \"spicy lemon dressing\". Tom Yum soup is spicy so this was in line. The first bite I had tasted awful, I couldn't describe it but it brought back memories of something gross. All the other bites however didn't have that same taste (I was actually trying to figure out what the taste was with additional bites, but never got it again. Not a bad thing I guess). The dressing was in no way spicy, it was very sweet. Gave it a 2 out of 5.\n\nThe next thing was the chicken satay. Either they cooked it on top of fish or used tongs they used fish on, but it tasted like fish. I like chicken and I like fish, but I don't want my chicken tasting like fish. 1 out of 5\n\nNext I got the Ginger Sauce with shrimp. They have a spicy level, and 5 options. I like things very spicy, but with Thai food I know it can get quite extreme. I went with Very Spicy, which is 1 notch down from their spiciest. When it came there wasn't even a hint of heat from the spices. Personally I think they used the sweet basil sauce instead as it almost tasted like a very sweet tomato sauce. 1 out of 5.\n\nNo interest in going back here again. Vietnam Cafe is a much better choice. Won't hold it against the GF, she's recommended some of my favorite places in the city to eat, she's due a dud."
    },
    {
        "id": 235,
        "text": "This is probably the best Thai food I've had, ever. That might not be saying much, since I've only tried a handful of places, but from my two experiences dining here, there really isn't much I would've done differently. The first time, I got the Pad Kee Mao (due to a fellow Yelper's raving on how it took her a year to stop ordering it!) and I almost had to fight off my boyfriend's prying fork off my plate. The tofu was perfectly cooked, the noodles were fantastic in texture and taste, and the vegetables fresh and abundant. I had a few bites of the boyfriend's panaeng curry, which was also quite the delight-- perfectly creamy and peanut buttery, with an extra kick of something I've never been able to replicate in cooking at home since (and I've tried). The second time, I went with a friend at around 9:30, and for some strange reason the place was packed. Our 20-minute wait was worth it though, and my Eggplant sweet basil didn't disappoint. The rice was a little too greasy for my tastes, but the eggplant was delicious and satisfying. \n\nAs for the appetizers, I've tried the fresh Spring rolls and the deep-fried tofu. The Spring rolls themselves were just okay-- the filling couldn't been better.  However, the 2 dipping sauces more than made up for the rolls' ho-humness with their very different, yet complimentary, flavors. The fried tofu was deeeeelicious, but probably not something to which I'd subject my heart every time.  I still really want to try the veggie dumplings (if anyone has, shoot me a message!)\n\nThe place is BYOB, but with all that food I found water was plenty. The service is fast and friendly, and the interior is cute (bonus: magazines by the window sills while you're waiting...I caught up on some interior decorating fluff via Domino).\n\nCan't believe I've waited so long to go here. Lemon Grass is closer, but (no offense) only a tenth as good.  With the average dish under $10 and lots of vegetarian options, I'm sure this restaurant will be receiving more of my had-earned cash in the year to come!"
    },
    {
        "id": 236,
        "text": "PROS: Light, medium-portioned dishes that leave you satisfied (not bloated)\nCONS: Stuffy & simple dining space, mediocre service\n\nVientiane Cafe is cheap for the quality of food you receive! The steamed dumplings were more like veggie raviolis and the sweet and sour tilapia was a bit too sweet (albeit the fish itself was moist and cooked to crispy perfection). Overall, the dishes are not mind-blowingly good, but they won't break the bank either! Worth a visit. BYOB!"
    },
    {
        "id": 237,
        "text": "There food  is everything taste as good as my mom's cookin and the stuff was very friendly. Everything I had was great. My new favorite place to eat . Just like home cookin"
    },
    {
        "id": 238,
        "text": "A solid, clean Lao-Thai BYOB just outside of University City on Baltimore Ave. Street parking was not a problem. \nStaff was friendly and service was good. \nI would've liked my Panang curry a bit spicier, but I think they would turn up the heat if I asked them on my next visit -- and I plan on returning."
    },
    {
        "id": 239,
        "text": "This used to be my hood. I moved to center city, but when I am craving yummy fresh lao and vietnamese here is where I go.\n\nThe sticky rice is amazing. The service and wait can be mediocre, but its worth it. \n\nThey do not accept cash, but there is an atm arround the corner in the corner store. There is a municpal lot right behind it too! BYOB as well!"
    },
    {
        "id": 240,
        "text": "I love the food here and I would love to give a five star review, but I'm taking 2 stars off for false advertising.  Their hours are listed as 4-9pm, but they close their kitchen at 8:30.  That should be noted on the website for folks who want to order."
    },
    {
        "id": 241,
        "text": "Cute place. Great food. I've tried several dishes here (all vegetarian) and loved them. The eggplant sweet basil and green curry were great. I recommend trying fried tofu as an appetizer."
    },
    {
        "id": 242,
        "text": "It's great to see an underrepresented country and its cuisine stand alone and shine proudly in a city highly saturated with Thai and Vietnamese restaurants. It was my first time trying Laotian food and it was an exquisite first impression that only makes me want to keep exploring more! \n\nThe location is very accessible via car or public transit.  Just don't confuse it with \"Vietnam Cafe\" around the corner. \n\nThe atmosphere was authentic and interesting with cultural artifacts like tapestry and musical instruments from Laos. The real plants and flowers were a nice touch. The servers were sincere and courteous, even when it got really busy. \n\nWe started with nam nam vegan salad which tasted like very savory crispy fried rice, paired well with the freshness of iceberg lettuce.\n\nFor dinner, we got the King Soup and the pan seared fish (tilapia)wrap. The king soup was a coconut red curry with vermicelli noodles , mint, cabbage, bean sprouts and tofu. It was very nourishing to eat on a cold day but a bit on the salty side, so was my least favorite. It also resembled curries I've tried before at Thai restaurants so it was not as pleasantly surprising as compared to the other Laotian dishes we tried. Still, a pretty solid curry. \n\nThe pan seared fish wrap was our favorite. The fish filet was flavored and cooked very well (albeit without skin)  and the there was an arrangement of finely cut fresh ginger and lemongrass, tomato, shiso herb, starfruit, cucumber, and vermicelli noodles, as options to wrap with the fish. The only challenge was the the iceberg lettuce was cut in triangular chunks,  so it wasn't big enough for wrapping all the other contents and things easily fell out or into the sauce. The highlight was definitely the spicy tamarind sauce, thick, sweet and tangy.\n\nThe mango sticky was somewhat disappointing to end our delicious meal because the mangoes were not in season,  so not very flavorful and the proportion of sticky rice to fruit was not enough. \n\nOverall, highly recommend trying the Laotian appetizers and entrees dishes on the menu."
    },
    {
        "id": 243,
        "text": "Great BYOB serving up delicious food. The menu features a wealth of vegan & vegetarian options and their tofu is delicious (must be homemade cause it's nothing like what they sell in stores). Everything is very flavorful and fresh tasting. Just be warned that when they say a dish is spicy, they really mean it."
    },
    {
        "id": 244,
        "text": "Came here for New Year's Eve with a party of 3. Called ahead to see about reservations but they said to just come in. They were right. Very kind people all around. The wait was 30 to 40 minutes and they let us run to the bar around the corner and called us when it was ready. They were a bit abrupt on the phone but hey it's new years eve and you have to expect a little frustration. The food was awesome! The beef jerkey was one of the best things I have ever eaten. You need to get it. I'm a Polish girl, we are meat conissuers and this was some of the best. The ambiance was pretty good. Cute, little place. The tables were kind of rickity but who really cares. This place really made our new years great and we will definetly be back soon."
    },
    {
        "id": 245,
        "text": "Yes!!!! Finding a place in the city with great food and great costumer service is not the easiest, but I must say, I've found it. Byob, great food, LOTS of vegetarian options and pleasant servers make this place one of my favs!! \nWe decided to come on Christmas Eve. This is actually my 2nd time here. I have no idea why I don't come more often. It's definitely a hidden gem."
    },
    {
        "id": 246,
        "text": "Best Pad Thai this side of town. Must try the homemade beef jerky! Be aware it is cash only and they don't have an ATM available in the restaurant."
    },
    {
        "id": 247,
        "text": "This restaurant is not a place I take dates. Why? I just shovel everything put in front of me into my mouth, as though I have five minutes to live. \n\nAlright. If you need seating for more than two, you may have to wait. The restaurant is small and you may be nearly sitting on top of the table next to you. \n\nI'm obsessed with their pad thai. Vegetables are always of perfect consistency. Their vegetable coconut soup is awesome. I've tried eating other things but really... no sense in toying with perfection. \n\nI've had the distinct pleasure of eating here with the below yelper Marissa B and she's not joking about the mango sticky rice OR this place haunting you from the other side of the country. Their thai ice tea is worth drowning in."
    },
    {
        "id": 248,
        "text": "Too bad, because I love Thai food...\n\nI just moved into the area and have been checking out the local businesses and restaurants.  I am excited to see all the Thai restaurants and this place was my first stop.  The restaurant is super cute and clean.  The service is excellent.  I'm disappointed to say the food is just not on-par with everything else.  It seems this place likes to cater to the white man...sorry...not sorry.  I like my ethnic foods to...well...taste ethnic and not watered down.  I ordered the Tom Yum Koong soup and the broth was just ok but what confused me was why there was broccoli, bell peppers and carrots in it.  I'm from southern CA and have been to plenty of Thai restaurants to know that this is just plain weird.  My spicy basil eggplant and tofu was also just ok...super oily.  My friend ordered the Papaya salad, which was the only thing we finished eating because it was SO delicious and the red curry with chicken.  Again, why there was broccoli, carrots, green beans and  bell peppers in here is beyond me.  The curry itself was just ok...a little bland imo but edible.  Just weird to have those ingredients in the curry.  I MIGHT give them another try again at a later time since they were so nice and the papaya salad was so good but I will be checking some other Thai spots first."
    },
    {
        "id": 249,
        "text": "I love this place.\nIts a cute place to go on a date - small and cozy with good mood lighting. However, it fills up quick - be warned! \nMy partner and I are vegetarians, so we only ever get the curry and the pad thai...and its all we ever need in the world."
    },
    {
        "id": 250,
        "text": "I wanted to update, since my last review I have been back more times than I can count and have only had good service."
    },
    {
        "id": 251,
        "text": "We've been so many times because the food is great. There are a ton of gluten free and vegetarian options. The ban xeo is my personal favorite. It doesn't look like much from the outside but definitely worth checking out!!"
    },
    {
        "id": 252,
        "text": "We came here with friends in our hunt for a good Thai-Laos meal. We ordered the bahn-xeo, pad kee mao, spicy basil fried rice and green curry. The only dish that disappointed us was the green curry which was a little too sweet and watered down but the rest of the meal was pretty flavorful."
    },
    {
        "id": 253,
        "text": "Wonderful local Thai food place... another lovely BYO in West Philly. Definitely check this place out :)"
    },
    {
        "id": 254,
        "text": "The food is fresh and delicious!  Some of the best of its kind in Philadelphia. Service is often slow, but the food is worth the wait. Highly recommend"
    },
    {
        "id": 255,
        "text": "Fantastic Thai/Lao food.  The best in the city, actually the most authentic Thai/Lao food I've had in America.  I spent a lot of time here, the cook was from Isaan and knew how to cook actual Thai/Lao food, so I'd highly recommend it to anyone that was looking for something a little more authentic that the standard Pad Thai."
    },
    {
        "id": 256,
        "text": "This is a very cozy and neigborhoody restaurant a little bit out of the way from where most Penn students live, but it's still a great place to get nicely prepared Laotian and Thai food.  The atmosphere is very relaxed and I wouldn't mind spending hours at this place reading a good book.  It's a bit out of the way, but certainly worth the trip."
    },
    {
        "id": 257,
        "text": "Two Words: Dee Licious\n\nGreat service. Perfect portion sizes.  Surprisingly well kept bathroom.\nThe Panang curry and the iced tea were equally yummy and... orange!"
    },
    {
        "id": 258,
        "text": "Me and my boyfriend have been two times.  We've walked/drove by here dozens of times but it wasn't until University City restaurant week that we went here (it was one of the participating restaurants) and we were curious.  \n\nTo be honest, I would have never gone in here judging by the outside.  But I'm glad I did.  The food is very reasonably priced and also good the both times we have been there.  The menu is also very friendly to vegetarians.  \n \nPlease note that unless a place is designed to be some type of entertainment centered place, I generally don't rate based on anything else except food.  Other people seem to really like this place besides it's a sort of neighborhood joint but I didn't take this into account (since I'm new around here)."
    },
    {
        "id": 259,
        "text": "I went here on a Saturday night at peak time, 730 pm, and my friend and I were seated promptly. We ordered the Naam salad (which is vegetarian), tofu pad thai, and the shrimp laab. \n\nService here is only ok- the servers were friendly but pretty slow, we had to remind them a couple of times for things like hot sauce, etc. \n\nAs for the food, the Naam salad is fantastic. Highly recommend. It's truly delicious and so fresh and flavorful. The pad Thai was excellent, more on the savory side, and just really good overall. The laab was good and I'm glad I tried it. It was very citrusy and savory. I probably wouldn't order it again because there are other things I'd like to try, but it's a light, fresh, tasty dish."
    },
    {
        "id": 260,
        "text": "Very good Thai food and excellent value for their lunch specials.  Everything I've had so far has lived up to or exceeded my expectations.  Service is friendly but can be a little slow at times, but worth the wait.  Cash only."
    },
    {
        "id": 261,
        "text": "Absolutely one of Philadelphia's best restaurants. One of the only times I (center city resident here) cross the river. Such an amazing, slightly hidden, gem for this great city. \n\nMust haves.... crispy rice salad, laab, lao sausage, all the desserts!"
    },
    {
        "id": 262,
        "text": "I absolutely love this place.\nFirst, the food is amazing. Lots of vegetarian and vegan options. My personal favorites are the king soup, the nam-nam salad, and the summer rolls! \nPortions are large and there is always something to bring home to have the next day!\nIt's a BYOB restaurant, which we love.\nThe staff is lovely and very helpful. \nWarm and cozy atmosphere."
    },
    {
        "id": 263,
        "text": "Got delivery from  Uber eats from Vientiane tonight. The city is shut down this thanksgiving eve, so it was so comforting to get delivery from this consistent restaurant and eat such delicious food. I had the Penang curry with chicken and sticky rice.. silky, peanut-y, spicy...I ordered a combination so it came with the vegetarian naam salad. So delicious! My kid ordered the Kings soup with tofu. So tasty and comforting! Try this place! They've been putting out delicious, consistent food since 2000 when they were a secret restaurant just two streets over from me. They always deliver great food!"
    },
    {
        "id": 264,
        "text": "Have gone here several times with my girlfriend, as well as once for a big birthday party. For the price the food is terrific - but I'd say that anyone who makes a special trip from outside the neighborhood might be left scratching their head about Vientiane.\n\nIf you live nearby, or find yourself outside, this restaurant and are hungry you honestly could not do better.\n\nDon't forget two things before going: it's BYOB and it's cash only. There's an ATM in the corner deli if you ever end up short of money and the closest wine and spirits store is at 49th and Baltimore."
    },
    {
        "id": 265,
        "text": "A worthwhile destination, even if you are not from the neighborhood.\n\nI lived at 48th & Hazel back in my art school days which was before the area was cutely named 'Cedar Park' and when Baltimore Ave. did not have very much to offer in the way of ethnic food, other than Lucky's Chinese Take Out, which is still in business after 37 years-possibly under new management. \n\nAfter a too long stint on the West coast, I moved back to Philly in 2015. I had been longing to see my old West Philly neighborhood again. In the back of my mind I was also on the look out for some decent, non trendy, authentic Thai food but I never expected to find it here.\n\nLaotian food is damn good food, somewhat along the lines of Thai cuisine but subtler. My dining companion and I found parking on a side street and as we crossed Baltimore and headed towards Vientiane, I was giddy with memories and pleased to see this old street looking better than the last time I waited on the corner for the trolley to take me to art school in Center City.\n\nThis place is cash only and byob. \n\nFirst impressions-one was how utterly delicious the place smelled when we walked in. I wanted to go from table to table, asking the diners what they thought the best thing on the menu was. Second was the unfeigned courtesy. We got seated right away and were watered and menued up with no waiting. Everything looked so good. Wonderful to see that sticky rice could be had with entrees.\n\nWe started with fried spring rolls and Yum Salad with shrimp. Excellent! Smart, crisp flavors and fresh, well handled food. Someone in the kitchen absolutely cared about what they are sending out to diners. The crowd was mixed; Caucasian students, married, straight 20 somethings, elegant looking mixed race couples, beautiful Rasta boys, professors, seniors-all the casual, natural and unstudied diversity that made me ache for Phillly when I lived elsewhere. This is not a big place and it can be loud, bit it's an easy, happy, comfortable kind of raucousness that washes over you and pulls you in, making you feel like part of an all embracing, wonderful party.\n\nService was polite and pleasant. Entrees were more than ample. My companion had green curry with tofu that she raved about while I had the Lao pork sausages-three fat, juicy ones with a side of sticky rice, lick your fingers dipping sauce and a mound of vegetables which were forgettable but fresh. I didn't care because I wanted to reserve my appetite so I could do the sausages justice. Time slowed as it does when one is having a really exceptional meal. Between the audaciously fine food and the people watching, I was in heaven. We were not rushed or pushed to order more than we already had. \n\nWe finally finished with Thai iced tea and the tempura fried banana (cliched but delicious). As we wound up our repast, we were making future plans to come back for lunch, and for dinner again and then for lunch and...who knows, maybe I'd even head down the block to get something to go from Lucky's for old times sake...\n\nRemember-cash only and bring your appetite."
    },
    {
        "id": 266,
        "text": "I love Vientiane and all that it manages to hook up food and atmosphere wise. But as much as I want to give it 5 stars, it always manages to have that one crucial snag in service that keeps it from getting there. The first time was how long it took to get the check squared away (which was also partly our fault) in the end. But most recently it was how long it took us to get some water in front of us even though we had some pretty damn spicy entrees in front of us. I love it spicy, and didn't exactly help matters when I added a dose of Siracha to the mix, but good thing we had some iced coffee in front of us! watching the server walk by us with the water pitcher a couple of times got to be some serious torture, but to their credit they apologized for it when they realized it.\n\nBut a couple snags aside this really is an intimate and inexpensive BYOB in West Philly. and Laotian food is pretty delicious."
    },
    {
        "id": 267,
        "text": "Although their spicy drunken noodles passed the Thai test with flying colors, the entire menu is ridiculously overpriced. Also, it's 2013, why is this place \"cash only\"? The food is authentic, but I don't think it's worth the arm-and-a-leg prices. I'm now on a quest for a more humble hole-in-the-wall establishment for my chronic Thai food cravings."
    },
    {
        "id": 268,
        "text": "I have mixed feelings about Vientiane Cafe.  I like the neighborhoodiness of it.  And the food is alright, I've had some really good, nothing ever down-right bad, but mostly alright fare here.  The menu seems basically straightforward Thai, with some exceptions... which was a bummer to find after walking in the first time thinking Laos... even though there's overlap.\n\nI get the impression that the whole operation is afloat by a shoe-string... which is sad.  I hope it all gets sorted."
    },
    {
        "id": 269,
        "text": "I know the Vietnamese restaurants along Washington Avenue. But, I knew nothing about Lao food. A quick check online directed me to Vientiane Café at 4728 Baltimore Avenue. The section of Philadelphia is quite remarkable for its Victorian houses, no small number of which have been wonderfully restored. There is also the quite remarkable Byzantine green domed St. Francis de Sales. (See my site http://www.daytraveller.net/2013/04/24/university-city-philadelphia-hidden-in-plain-sight/)\nVientiane Café has very convenient free parking just behind the restaurant. The interior is small but clean and comfortable. The staff is most congenial and second generation English speaking. Our server brought us the menu. Of course we had no idea what anything was. In such cases I always turn to the server. \"If you were having lunch, what would you have?\" He proposed a selection. We could not have done better. We began with Green Papaya Salad: Shredded green papaya with tomatoes, chili, lime juice and special sauce mixed together in a mortar and topped with crushed peanuts. The salad with sweet and acidic and spicy all at once: a wonderful exploration of all your tastes. I will say, however, that it was so enveloping that it did dull the soup (at least for the first few minutes) which followed.  The\"King soup\" offered an introduction into another new set of taste experiences. The base seemed something of a curries coconut milk. The other ingredients I believe were thinly sliced white radish with unknown small vegetables. Long noodles provided the main substance.  Now, as usual with Asian restaurants, the main course came out at the same time. We have long since given up trying to have them do one course at a time. The suggested entrée was nothing that one would expect from an Asian restaurant:  Homemade Laotian Sausages: Stuffed with pork, spices, lemongrass and kaffir leaves; served with steamed vegetables, sticky rice with sweet chili and tomato chili sauce. These sausages, so unexpected in Asian food bore little resemblance to the gristle and hard chop sausages we know. The Lao version has something of a creamy and unctuous quality with a hint of sweetness. The bill for our lunch was a bit more than the price of a Vietnamese lunch, but still well worth it. With our quality first experience of Lao cuisine we are sure to return to broaden our knowledge of this new face of Asian dining."
    },
    {
        "id": 270,
        "text": "I really love the location and ambiance of this place.  It has all the making of a cute, neighborhood BYOB.  Servers are always friendly and food is ready fast.  The menu is fairly extensive and offers a wide range of vegetarian and non-veg options.  It is cash only, as a heads up.\n\nThe food however, is not great in terms of Thai or Laos food.  Many of the vegetables taste like they are pre-cut frozen.  The spices and flavors just aren't quite there and some of the food, especially meat, is overly salted.  It's not bad but I have high standards for this type of food, and it doesn't meet them.  \n\nYou can definitely have an enjoyable meal here; just don't expect that it will be really authentic Thai/Laos food."
    },
    {
        "id": 271,
        "text": "Pretty OK place, but very high likelihood of not returning.  The entrees are a huge rip off for what you are paying.  You're essentially paying for a platter of sautéed miscellaneous vegetables, whether it be bell peppers, carrots, broccoli, or whatever they feel like putting in.  As for meat... imagine one small tenderloin cut into pieces.  That's $15 and the portion is on the small side.  Also extremely stingy wit the rice at the comical level. The flavor is pretty good, but not good enough to compensate for all the other shortcomings.\n\nMenu description also doesn't match what's served, they also admit that in fine print which kinda validates my statement, \"...whatever they feel like putting in.\"\n\nI got the ginger chicken which has onions and carrots. I said no carrots, assuming it would be chicken and I onions stir fried.  Nope there all these bell peppers and random crap that they did not list and I most certainly did not ask for.  I assuming you've guess I also do not like bell peppers...  :p. Dinner should not have to be spent tweezing out stuff you didn't ask for with your chopsticks.\n\nI don't know anyone that does that... oh here's a cute sweater that's pink and cashmere.  We'll stitch in some glitter and Mardi Gras beads if we feel like it. Doh!"
    },
    {
        "id": 272,
        "text": "I can't believe I've never reviewed this place. I've eaten here so many times throughout the years. In fact, my oldest daughter worked here for a time. This place is always on point. The flavors can't be beat. Tonight my youngest daughter wanted chicken satay, so naturally we headed here. She got exactly what she wanted and and I got the ginger entree with chicken. Delicious, flavorful with crunchy veggies and generous shoots of ginger. We finished with green tea ice cream. The service is always good, the food never disappoints and it's a byob. What more could you ask for. Even if you don't live in west Philly make this a destination. This little intimate place won't disappoint."
    },
    {
        "id": 273,
        "text": "Prices on yehp are not accurate, other items are written on yelp for more than 6$ , but when we eat the same food that cost up 8$ , pad Thai is 15$, good service, good food, the beef is not good , the table dirty."
    },
    {
        "id": 274,
        "text": "Came here because my bf stopped at the VAPE shop. We love Thai food so we gave this restaurant a try. There is no parking lot so street parking it is. You may or may not be lucky to find parking near by, luckily for us we found one right in front of the shop. \n\nThe restaurant is not that big but again we were lucky enough to get seated right away. In ten mins, the place started to get packed and later i understood why the server asked us if we had reservations. Anyway my bf and I ordered the tamarind chicken wings, chicken satay and Tom kha ( coconut soup) we also ordered papaya salad and chicken pad Thai to go. \n\nAs for the food- we got 5 pieces of chicken satay. I thought 5 pieces was a lot but it worked out well since the size of the meat was rather small. Moving on to the taste- the chicken was very salty. It would've been really good but that salt was just overly done. Moving on to the tamarind wings - again very salty and I didn't taste the tamarind sauce at all, more like soy sauce. The chicken wings were pretty disappointing as well because the wings were so tiny. I've never seen wings as small as they had. Coconut soup was ok. Thank god it wasn't so salty, although the soup was not very authentic in taste. The coconut in the soup was water down mixed with green and red peppers, and broccoli. I'm use to simple ingredients like onions and mushrooms only. \n\nOver all I gave this restaurant 3 stars due  to the saltiness and very small portions of the meal."
    },
    {
        "id": 275,
        "text": "What a surprise!\n\nWe ordered take out through UberEATS and it was definitely a good choice!\n\nI hadn't ever tried Laotian cuisine before so I was on the fence about ordering in for my first experience. I usually like to go and do a sit down meal when trying new cuisines so I have a chance to ask questions before making a decision. \n\nIn any case, I threw caution to the wind (I know - really wild over here) and ordered away and it was definitely worth the risk! I got the Vegetarian Nam Salad consisting of marinated rice, coconut flakes, mint, scallions, parsley, lime leaves, and chili - served with lettuce wraps! My friend ordered the King's soup - vermicelli noodles with bean sprouts, shredded lettuce, carrots, mint, cilantro, scallions in a red curry coconut broth. Both were delicious and very flavorful! The dishes weren't overly spicy but they definitely had a kick (which I enjoyed). I enjoyed the different taste profiles, especially the coconut in the salad - sweet but not too sweet!\n\nThe servings were ample, and I'm glad we were able to share and taste each other's meals - able to understand the menu a bit better this way. I also appreciated that the menu has a lot vegetarian friendly options (which is a always a hit or miss with Asian restaurants) so I'm looking forward in trying other dishes in the future. \n\nPricing was also fair, and I think overall we made out like bandits - paying less than what I think the food probably deserves given how well everything was prepared!\n\nDefinitely will be back!"
    },
    {
        "id": 276,
        "text": "They never answer their phone and have no way to leave a message. I called five times tonight (yes, it was the correct number) but no one picked up.  It has happened previously on at least four or five occasions. \n\nThey don't accept credit cards either."
    },
    {
        "id": 277,
        "text": "My friend and I had never even heard of this place before but were looking for a restaurant to eat in the area. What a gem! The ambience inside was nice and the waitress was really helpful in making recommendations for us. We may be small women but we have big appetites, so we shared 3 dishes!\n\n* Homemade Beef Jerky - we felt fancy eating these, it was a nice appetizer to start the meal\n* Pad See Mao - kinda spicy, but very filling\n* Panaeng Curry - so good, especially loved the peanut and coconut flavor with lots of spices\n\nI can't wait to come back and try more dishes on their menu!"
    },
    {
        "id": 278,
        "text": "We got the fresh spring rolls which were okay - the noodles were a bit overcooked and they weren't vermicelli, but the mint was so fresh. Got the Panang curry (level 3 spice) with tofu and the pad Kee Mao (level 2 spice) with tofu. Very spicy at level 3 but still incredibly rich and incredible. Loved the veggies in both dishes. Expensive for what you get - be sure to ask for sticky rice because they won't ask you! Good flavors but over priced."
    },
    {
        "id": 279,
        "text": "came a few months ago and had some of the only panang i've liked from a restaurant in philly. today i decided to return and had (i'm not kidding) the BEST pad kee mao of my life! i'm serious - the vientiane cafe is DEFINITELY worth a visit. i look forward to enjoying more of my old favorites and finding new favorites on their menu!"
    },
    {
        "id": 280,
        "text": "I actually signed up for Yelp just to review last night's dinner. \n\nMy boyfriend and I went to Vientane for Valentine's Day. We love their pad thai - that dish is great and continues to be great.\n\nNo, the problem was the Homemade Laotian Sausages. Normally we split a pad thai and a curry, but last night we wanted to try something different, and our waitress recommended the Sausages. We were excited! Trying something new. Then our dish arrived, and:  \n\nThey give you 3 TINY sausages. Tiny. Vienna sausage-size tiny. \n\nThis dish is $15, btw. \n\nEach sausage was the length of my index finger. The rest of the plate is covered with a limp salad of lettuce and carrots, plus the 2 sauces (which are good). My boyfriend and I ate 1.5 sausages each. \n\nWe paid $15 for a tiny appetizer's amount of sausages. Normally I love Vientane, but last night we were SO DISAPPOINTED. Why didn't the waitress warn us or communicate the size of this dish? Do they think $15 for 3 tiny sausages was a reasonable price? \n\nI didn't say anything last night, but I wish I had. Not cool, Vientane.\n\nEdited to add: Boyfriend reminded me to add that the service was slow  despite the fact that the resturaunt was half full by the time we left - took us forever to pay and leave - and that we didn't get waters until we were parched & had to ask for it. I wouldn't mind either of these if only I hadn't paid $15 for 3 meat Cheetos."
    },
    {
        "id": 281,
        "text": "Love, love love this place. Have tried a few dishes on their menu and am never disappointed. Small and charming, this is a great place to take a date. They have outdoor seating on Balimore which is great for people watching/ running into friends. My favorite is the yellow curry which you can get with jasmine rice or sticky rice- both are beyond amazing. You may have to wait for a table, but overall this place is worth it. Beware though- they only accept CASH!"
    },
    {
        "id": 282,
        "text": "I've been coming to Vientiane for YEARS! My mom was Thai and used to bring me when I was a child when they only had space for about 5-6 tables! They've grown so much but the staples have remained the same, thank goodness. My mom passed away a few years ago, but whenever I come here I feel a sense of nostalgia for the flavors I had as a kid. \n\nMy personal favorites every time I come are the homemade Laotian sausages and the beef jerky with sticky rice!"
    },
    {
        "id": 283,
        "text": "It was University City Dining Days and time to head to Vientiane Café.  Vientiane Café is named after the capital and largest city in Laos and it is a fantastic Laotian restaurant.  It also serves northern Thai food as the two cuisines can be very related.\n\nCafé Vientiane began life as a word-of-mouth unlicensed speakeasy restaurant in University City before more than ten years ago getting licensed and moving to its current location on Baltimore Avenue.  In fact it has expanded into the building next door.  The staff are always accommodating and friendly and the dining room has an airy attractiveness about it.  But it's the food that takes center stage here.\n\nTam som is Laos's famous green papaya salad which has also entered the cuisines of the other southeast Asian countries.  (In Thailand, you reverse the word order and call the dish som tam.)  Vientiane Cafe's version is awesome.  I could eat this every day of the week.  The Laotian main course of Pad Kee Mao or more popularly named \"Drunken Noodles\" was just as excellent.  So many different flavors melding together to produce a symphony of tastiness.  Capping off the meal was a coconut rice pudding.\n\nThis was the best Asian meal I have had this year anywhere.  Def two (or twenty) thumbs up!"
    },
    {
        "id": 284,
        "text": "Had lunch at Vientiane Cafe.  Unfortunately, it wasn't any better than I'd remembered it.\n\nPast experience with Vientiane Cafe indicates that one shouldn't order meat here. All the meat I've seen here has been overcooked. \n\nI ordered an eggplant veggie dish, which was poorly executed. The texture of the eggplant was not great -- it wasn't cooked well. The dish was edible but not very tasty. Disappointing."
    },
    {
        "id": 285,
        "text": "VISIT HISTORY: \n- Last visit: this evening with a friend \n- Frequency: first time! \n- Next visit? would definitely return\n\nFOODRINK:\n- Green Papaya Salad: friend described it similar to kimchi. I half-agree. The spice level can be adjusted from mild to spicy (1-5) we did medium (3) and that was really spicy. In addition to the spice level, the style can be modified as well, whether it's gonna be Thai style or Lao style etc. We chose the Lao style. After taste burns were real. Had to take breaks in between and typically I am really good with spicy food. Pleasant surprise!  \n- Homemade Lao Sausages (Sai-gawk): roasted chili garlic sauce is awesome! Idk what the other orange sauce was but it was the perfect amount of sweet. The lao sausage was perfectly seasoned. The lemongrass and the kaffir lime leaves really did their magic with the sausage and idk how they were cooked but all the grease & fat were minimal. On the side was sad and mundane pieces of broccoli and carrots just so that the dish could say it had a side of vegetables.\n- Sticky Rice: served in the cutest little roundware! Cooked and delivered perfectly. \n- Pad Keep Mao with Tofu: eh. It was aight. \n- Mango Sticky Rice: mango was perfect ripe. The creamy and warm rice with the mango slices. NOMZ.\n\nVIBE: \n- Feels authentic \n- People kept coming in throughout our entire stay so it must be really popular \n- A lot of Buddha structures and decorations \n- We were able to order from different waitresses, whoever was available. \n- Wait time for food arrival: 6 min 4 sec (for appetizer) 18 min 32 sec (for entree) 12 min 31 sc (for dessert)\n- Wait time for check arrival: arrived very shortly after dessert without asking\n\n**TIPS**\n- BYOB \n- ca$$h only"
    },
    {
        "id": 286,
        "text": "Great food.  CASH ONLY but don't worry they have ATM near checkout,  I recommend the coconut soup!   The Panang curry was just ok, but want to try others."
    },
    {
        "id": 287,
        "text": "Vientiane is another of several restaurants that was popular among my classmates when I was in college that I never got around to trying. So of course it's another restaurant that my partner was very interested in, so we recently made it one of our pandemic dinner takeout selections. The menu is quite extensive and vegetarian-friendly, and we both liked our entrees so much that this is definitely being added to our list of West philly restaurants to return to.\n\nI decided to go with a Laotian dish that I was unfamiliar with, Lad Na with tofu, while my partner went with one of his Thai favorites, Pad Kee Mao (also with tofu). While the containers were the same and looked similarly filled, the La Na is a MUCH bigger portion, even the half portion I ate was quite generous. And so good! The rice noodles were kind of sticking together, but still tasted great, the tofu was perfect- fried just to the point of creating that perfect crisp edge without being TOO fried - the brocolli greens were a good complement, and the sauce was spicy and flavorful. I was worried it might be too sweet but it wasn't at all. \n\nMy partner really liked his Pad Kee Mao too, and was able to finish the smaller portion in a single sitting. While the prices are a bit higher than we're used to, the quality and portions make them quite reasonable (even without considering the Baltimore Ave markup). Looking forward to trying something new next time!"
    },
    {
        "id": 288,
        "text": "This is our favorite asian restaurant in Philadelphia. They have wonderful Laotian and Thai food. The people are always friendly and the food is always fresh and so full of flavor that we just keep coming back. We have tried various things on the menu and everything is excellent. Try them you will not be disappointed."
    },
    {
        "id": 289,
        "text": "Great Low key BYOB to go for a variety of food options. You can pho it up with some soup and spring rolls, or you can get some chicken tofu, or seafood over a bed of fried rice with plenty of veggies. Not bad by my book.\n\nThe veggie spring rolls I picked up weren't anything special. Vietnam Cafe definitely has better, and ones at Vientiane were pretty similar to the generic ones you can find in many stores over. But the mad pineapple fried rice with seafood that I picked up was fantastic! the shrimp, crab, squid, and scallops that it came with were cooked to perfection, and the pineapple provided just enough citrus to add on some extra flavor.\n\nDefinitely bring cash since it doesn't take credit. My friend made the mistake and it resulted in us waiting a little longer than most to resolve the check. bummer. and now that Summer's in the air they have outdoor seating!"
    },
    {
        "id": 290,
        "text": "I'll let you in on a little secret: order the Aw Lao. Holy crap, it is knock-your-socks-off delicious! A punch in the teeth of flavour, this giant, steaming bowl of complex lemongrass broth with veggies and meat will make you want to never eat anything else. I didn't order it, my companion did, and I had the most serious case of ordering envy I've ever experienced. I stole quite a few bites/slurps.\n\nMy pad kee mao was pretty good, ordered at a level 5 spicy and it was hot, but not unbearable. Then again, I might have iron tastebuds. The portion was ample but it and the chicken satay were both overpriced, the satay egregiously-so. 4 tiny pieces of chicken for $7, maybe half a chicken breast worth of chicken. It was tasty, but not such a good value.\n\nService was good and I was happy with the meal overall."
    },
    {
        "id": 291,
        "text": "Visited this CASH ONLY & BYOB restaurant for my birthday dinner & coz I was craving mango stick rice!\nThe entire restaurant had this Asian/Malaysian/Indian vibe with pretty artsy decorations. The waitresses were very friendly & patient with our lengthy decision making! I\n\nEverything on the menu looked delicious.\nWe ordered a couple appetizers: Chicken Satay (chicken skewers with a side of peanut sauce), Veg Spring Rolls (super crisp & mixed with light flavor) and Shrimp Wontons (if you like shrimp, don't think twice!) The food was super yummy and were totally looking forward to the main entrees.\n\nWe ordered 2 entrees (Sweet Basil & Ginger Sauce). It comes with a side of rice. You can choose the type of protein in it as well. The entire entree filled the whole plate. It was a mixture of veggies, stir fry sauce and the chosen protein. Simply amazing!!! Could've gobbled the entire thing but wanted to save space for dessert!\nThe Noodle dishes were equally great with veggies & your desired protein.\n\nIf you do visit, you must order a plate of dessert. We had 4: \n1. Sticky Mango Rice (fresh cut mango + warm sweetened coconut milk drizzled over a mound of warm sticky rice--the best Thai dessert ever.)\n2. Coconut Pudding (4 cute mini bowls filled with warm coconut milk pudding. A little more simple but after a few spoons you'll tend to love it!)\n3. Banana Chocolate Rolls (melted chocolate and  sliced bananas wrapped in spring roll paper. A warm peach sauce accompanies it for dipping.)\n4. Banana Tempura (fried banana fritters)\n\n\nA Great Thai experience. Will most definitely be returning for the mango sticky rice (and of course everything else!!)\nLoved it! 5 stars for sure!"
    },
    {
        "id": 292,
        "text": "Having lived in both Laos and Thailand for years, I can say that I know the genuine cuisines of those countries and hold little tolerance for establishments which cut corners or pass bogus dishes off as the real deal. Whenever I encounter a \"Lao\" restaurant in a foreign city, my first reaction is one of skepticism. Some of the critical reviews of Vientiane Cafe made me pause before deciding to give it a try. And I'm glad I did.\n\nMy family members and I ordered only Lao dishes, so I can't comment on the quality of their Thai offerings. The Lao staple dish is laab - delicately spiced ground meat served with sticky rice. My pork laab was excellent. I savored every bite. I therefore highly recommended it. My wife's aw lao - a kind of stew with veggies and meat or tofu - was also authentically spiced and delicious. Our daughter ordered King soup - a coconut milk-based noodle soup. It was exquisite. As a side dish, we had the papaya salad (Thai style), which also did not disappoint. Finally, for dessert, we had sticky rice with mango topped with coconut creme - it was to die for!\n\nContrary to some reviews, we found the service to be quick and friendly. The owner, a gracious elderly woman, spent time chatting with us and wanting to know how we found the food. Portions were ample and attractively displayed. I realize that restaurants occasionally slip on food quality and service due to the usual chef being absent, or a shortage of serving staff, which can account for some customers dissatisfaction. This certainly was not the case for us.\n\nI therefore wholeheartedly endorse the food and service at Vientiane Cafe. I wouldn't hesitate to return."
    },
    {
        "id": 293,
        "text": "Wonderful! Pad Kee Mao is our favorite. Remember they are cash only before heading over."
    },
    {
        "id": 294,
        "text": "So reliably good & you simply must order from the Laotian Specialties portion of the menu"
    },
    {
        "id": 295,
        "text": "They never ever answer their phones.  Don't waste your time trying.  You can't order pickup online, and they don't answer cell phones but of course you have to pay in cash."
    },
    {
        "id": 296,
        "text": "So I really want to love the Vientiane and have it be my go-to thai place....but I have never been wowed. Recently, I came here for UCity Dining Days. It was crowded but they seated us....and then ignored us for about 20 minutes. No water, no service, no nothing. Now, like I said, it was full so it is a forgivable offense albeit not excusable. \n\nThe food: it's good. Not great, but solid. I had a curry dish with tofu that had a nice kick to it. The spring rolls were good as well, although everything seemed to be a very small sized portion.\n\nVientiane Cafe is fine if you are in the area, but there are so many better options in Chinatown/Center City if you feel like venturing out."
    },
    {
        "id": 297,
        "text": "I haven't had anything I didn't love here, but the Vegetarian Naam Salad here might actually be my favorite food in the entire world."
    },
    {
        "id": 298,
        "text": "Bring Cash!\nFirst time having Laotian food, and I love it. This has quickly shot up to one of my go-tos, because of its location near University city, and its absolutely delicious array of food. I had the Sticky Tamarind and the Penaeng Curry, and both were super delicious. Not only does Vientiane provide great food, but it also has so many gluten free and vegan options. Definitely recommend for anyone living nearby."
    },
    {
        "id": 299,
        "text": "The difference between Thai and Laotian cuisine is damned if I know.  It is a fairly safe bet that if you like one, you'll like the other.\n\nAll of the curries here are very tasty.  The Shrimp sweet basil is very good and so is the triple-flavor red snapper.  I also have to hand it to this place for making my favorite thai iced tea in Philly.  It is like the tea leaves, condensed milk, and sugar had formed an unholy alliance with the devil so that they could climb to the top of the thai iced tea game.  It is very sweet and very tea-y.  ? Whatever.\n\nAnyhow, the place has a pretty ambiance and the service has always been stupendous.  On top of all this, it is a BYOB.  It is a great place."
    },
    {
        "id": 300,
        "text": "I visited Vientiane Cafe with my boyfriend and friend.  The food was absolutely delicious.  The staff was very friendly. The drunken noodles and thai iced tea were fantastic!\n\n(+) Food is authentic and delicious\n(+) Staff is very nice & friendly\n(-) Service was longer than anticipated. We were in a rush and it took a while for our food to arrive & receive the check.  We asked for the check right upon receiving our food and had to request the check 2-3 more times."
    },
    {
        "id": 301,
        "text": "This eatery isn't much larger than a walk-in closet, but bright walls, flowers and candles - and the fact that they're a BYOB - make this an affordable date spot. Due to its size, you'll never be ignored by the friendly staff, even when there's a crowd.\n\nThe kitchen works fast, turning out piping hot Laotian and Thai dishes in record time. There's the usual assortment of curries, seafood, and rice plates. Fresh spring rolls ($3.95; vegetarian; cash only, last I checked) come with a side of sweet plum sauce and a pleasantly tart fish sauce. Try the pad kee mao ($10.95; with beef): While it could be spicier and the beef is almost dangerously dry, the sauteed rice noodles are moist, and the mix of onions, carrots, broccoli, chili peppers, bean sprouts, and basil give it flavor and color."
    },
    {
        "id": 302,
        "text": "Vientiane is my local Thai restaurant. I just ordered take-out for the first time since quarantine and Uber Eats totally messed the whole thing up. Bo, on their staff,- who was not to blame at all- felt bad, and offered to hook us up the next time we ordered. I called back 2 days later, and they remembered me by first name, and without asking, through in a free dessert, etc. While my experience trying to communicate with Uber Eats has been frustrating, Vientiane's kindness has meant a lot, and their food is delicious."
    },
    {
        "id": 303,
        "text": "If you haven't tried the duck spring rolls you MUST! I would give this place a 5 star based on those alone. They were perfect and sooo good. I had it for the first time Tuesday and went back Wednesday for more. The sticky rice is also sooo good. It's not the same as in Thailand but it's close. \n\nI had the shrimp basil entree which was good but didn't blow me out of the water. The reason for the 4 stars is because the prices are on the high side and there are so many places offering the same type of food but tastier. However No one can hold a candle to these duck spring roles."
    },
    {
        "id": 304,
        "text": "They seated us at 7:45 for a 7:30 reservation because a table that was done was just sitting there talking and the restaurant wouldn't ask them to leave. I had the papaya salad and the salmon green curry. The curry was rated as very spicy in spiciness but was not very spicy at all.  The papaya salad was rated as mild spicy but was very spicy. The cost for the food was kind of high as far as Thai goes.  Maybe its a good place for vegetarians, as most of the positive reviews seem to come from vegetarians."
    },
    {
        "id": 305,
        "text": "Vientiane is a cozy little place that's BYOB, with friendly service and a solid selection of Laotian-Thai staples--e.g. curries, pad thai, laab (or larb, depending on where you're from) etc.  No more, no less.  Truthfully, for the price I paid for dinner, I expected the dishes to have a bit more \"wow\" factor.  But do take note that I am from California and I tend to judge food by Bay Area standards.   I will be back for lunch here and there, but I will look elsewhere if I wanted something spectacular."
    },
    {
        "id": 306,
        "text": "My husband has been a fan since they first opened and were just a tiny spot.  Now they're slightly larger, a bit trendier/more expensive, but he still loves the food.  I am not an adventurous eater, but I did enjoy the angel shrimp appetizer and the crazy pineapple rice.  It came with tofu, which I tried and enjoyed.  Their tossed salad is one of the better ones around.  It's substantial and worth ordering."
    },
    {
        "id": 307,
        "text": "I absolutely LOVE Vientiane Cafe--every experience has been fantastic! \n\nVientiane is a tiny BYOB along Baltimore Ave. serving the best Thai/Laotian food in town.  Every bite is fresh and spicy.  The service is amazingly friendly.  On top of that, they have an incredible lunch special: soup, a side order, and an entree for $10--$11!  I HIGHLY recommend the red curry with chicken, along with coconut soup and crispy vegetable spring rolls.  Plus a glass of Thai ice coffee!\n\nYou cannot go wrong with Vientiane.  The atmosphere is pleasant, with greenery in the storefront, soothing colors and calming pictures on the wall.  (Because of its small size and popularity, it can get a bit crowded--lunch is the best time.)  Vientiane would be ideal for casual dinner dates, for parents, for hanging out with anyone with a taste for curry or foreign cuisines.  But bring cash, because credit cards are not accepted!"
    },
    {
        "id": 308,
        "text": "So glad to have this place in our new neighborhood. A little slow service-wise, which is why I gave them 4 starts, besides that, excellent.\n\nAs others have noted the Vegetarian Naam Salad was wonderful - but ask for extra lettuce - as was the Lao Pork Sausage. The sausage was NOT dry as had been called out in another review, and the sauces were delicious. Beware though, those sauces are very spicy!\n\nAnyway, I know we'll be back many times in the years to come. This place is a local treasure."
    },
    {
        "id": 309,
        "text": "Food is decent and much special is a great price. The coconut soup is very flavorful and the spring rolls are fresh tasting."
    },
    {
        "id": 310,
        "text": "after a long jury duty process I treated myself to a late lunch at this wonderful cafe! I had forgotten they have lunch specials - that's right 3 course meal for: (dining in $9.95) and (Carry out $10.95). You have a choice of 3 appetizers, 3 soups and 3 entrees. So, today I choose the following:  Appetizer: Vegetarian dumplings,  Soup: Chicken-spinach soup in broth and Entree:  Chicken Pad Thai. Yum! it was all delicious. I first received my soup. It is a clear broth with spinach and you can have chicken or tofu (I had chicken). Then, my appetizer: 3 steamed dumplings (I had vegetarian, other choice pork) - comes with a garlic soy sauce - good and last my entree: chicken pad thai (other choices beef or tofu). The dish was beautifully presented I took a picture of it. fresh bean sprouts, carrots , scallions and broccoli with the thin rice noodles. It was relaxing after the \"zoo\" of jury selections. Lunch is served from M - SA 11am - 3pm. Dinner is 5pm - 10pm. Always good!!!"
    },
    {
        "id": 311,
        "text": "Incredibly average Thai food.  Teeny-tiny, overpriced portions: $30 for pad see ew with tofu and rad nar with chicken.  Sizes so small we ended up needing another dinner two hours later.  What a waste of money!\n\nIt is a cute restaurant, which is the only thing this place has going for it, but that is not nearly enough for me.  Eating here pissed me off."
    },
    {
        "id": 312,
        "text": "I could see myself becoming a regular here. First time was excellent. Food was delicious and ambiance was relaxed. One star off for being cash only, really cold AC, and slowish service/food took a longer than average time to arrive (though we went on a weekend so they were probably really busy)."
    },
    {
        "id": 313,
        "text": "It took us more than 1 hour to get our food despite that there were only 2 customers in the restaurant, including us. Service is below average. And they messed up our order the first time, so it had to be brought back to kitchen to be re-made. \n\nDrunken noodles is a bit saltier than usual, but pretty good overall. The appetizer Banh Xeo is really good! It is or first time having it, and tastes Amazing. It looks like an omelette, but without eggs. It's liked fried crepe thing with vegetables stufffed inside. Quiet delicious! Highly recommend!! \n\nAw Lao is like a stew with rice on the side. Stew has very strong basil taste, a bit sour, and interesting, not bad."
    },
    {
        "id": 314,
        "text": "When the world opened back up, and my partner and I finally felt comfortable enough to go out to a restaurant, Vientiane was the first choice.\n\nWhat a perfect spot for a date. We chose seats outside, in a twinkly-lit back patio, and ordered all of our favorites from the Lao Specialty menu: the Lao sausages and pork Laab (which are the two staples we order every time, without fail), and this time, the Aw Lao with salmon. \n\nYou might be on the fence about the sausages, as there are only 3 for about $16 - but please know they are worth every penny. They're spectacular: crispy from a fire grill, and packed with fresh herbs and savory mince. \n\nThe pork Laab is our favorite meal for a hot night in the city as it's served cool. With all the fresh herbs cooked in, it always tastes so light and bright.\n\nWe finished the meal with the tempura-fried bananas and a drizzle of honey. It's my death row dessert, and so tough to find in Philly. \n\nA special bottle of red I received as a gift made the dinner date even more special - it's BYOB.\n\nIf you're looking for a dimly lit, cozy date spot with tons of flavorful, unique options: Vientiane is definitely it."
    }
]