[
    {
        "id": 1,
        "text": "Tried this place because Pho 75 was closed at the time.  A nice suprise. Very clean and the menu was huge.  Im not a pho expert but it was a decent inexpensive meal."
    },
    {
        "id": 2,
        "text": "ommmmmmg love love love.  Pho+summer rolls with peanut sauce+pear sake=best meal ever.  Great service, casual atmosphere, the best prices.  Food was very fresh and well made, I eat on the regular! Might go eat some right now, actually.... :D Bit of advice: order a small bowl of pho...its still huge. If you have leftover pho, ask them to put the noddle in a separate container as they will get soggy before second helpings."
    },
    {
        "id": 3,
        "text": "decent Pho.  Nothing really special.  I can't imagine ever going back to this place when Pho 75 is way way better and right next door...  Only plus of this place is they have  a huge menu"
    },
    {
        "id": 4,
        "text": "Pho is delicious!  Adding meatballs is a must.  They are so good. Fast and cheap with a $15 minimum for credit cards. All the phos are good but I especially like the seafood one.  Even though I've been many times, It's hard to go past the first page \n\np.s. if you're new to pho, add the basil leaves and lime to the broth.  if you want it spicier add some hot sauce.  Pho Hoa gives you a delicious base broth, but that doesn't mean you can't play with it."
    },
    {
        "id": 5,
        "text": "This Pho Hoa is just like the one I go to in California, except it's a lot cleaner, bigger, and generally nicer. When you open the menu, the first two pages comprise the entire menu at the Cali location I've been to. However, this place tacks on a whole extra menu about the size of a small dictionary. \n\nThe food is tasty and cheap, too. Some of the better Vietnamese I've had in South Philly."
    },
    {
        "id": 6,
        "text": "I've been to a lot of Pho Restaurant but this is the worst one.... \nI've been to this restaurant 2 times.... \nFirst experience, I would like to try the new place after porkie the Korean BBQ closed.....and they over charged the bill.....The bubble drink is supposed to be $3.50 but they add an extra $3.....When I asked why they said Oh it's because we put the tapioca.....The drink itself already serve w/ the tapioca; therefore I do not understand why the extra charge is necessary..... \nThe second time, I gave another try......I went with 11 people and ordered their pho......I found out that the flanks were shining green.....which was clear to me that the meat quality is bad....it has FUNGI....they're ROTTEN!!!! \nThe worst thing was that it was not only my bowls but also others....So we asked the server NICELY if we could just changed all to the rice dishes instead and pay the extra.....but the first thing they did, flew to the kitchen and brought us the rare flank and argue that the meat was fine.....Like duhhhh one bowl is ok but it's like all 8 BOWLS WITH ROTTEN MEAT!!!! \nThen the other server said, Oh I'm in charge and we couldn't change the food because it's already in the system....Excuse me, but I'm not there to eat for free and I said I'M GOING TO PAY FOR THE EXTRA CHARGES..... \nWe dealt with this for more than 20 minutes....just want to proof that they were right.......clearly they had no idea how to dealt with their customers....NO APOLOGIZE...NOTHING AND JUST KEPT ARGUING.....\nDefinitely the worst dinner ever.....and WOULD NOT RECOMMEND this place at all to anybody.....I believe that you do not want to pay for rotten meat.....\nBetter go to Viet Huong or Nam Phuong across from them....it's way better with the same price, better food quality and better service!"
    },
    {
        "id": 7,
        "text": "After sampling many pho places in Philadelphia, this is my second most favorite so far. Broth is strong but not salty. Meats are good and not too fatty but enough to keep it interesting. They have three ben bo hue. Very spicy broth, but not enough pigs feet. But they do have shrimp paste and shredded cabbage to go with this soup noodle."
    },
    {
        "id": 8,
        "text": "Great Pho and excellent crispy tofu.  They have a large menu, a bar, great food, low prices, and they take credit cards.  What's not to love!\n\nBut the mung bean pennywort smoothie tastes like a lima bean slurpee.  Not sure why others seem to be enthralled with it."
    },
    {
        "id": 9,
        "text": "Authentic Philly pho. Some of the best food in general. I could eat this every day especially with that huge variety of food and drink. If you're the owner and reading this, open up a restaurant in NYC. Better yet, let's partner up. We'll take it all the way to the bank!"
    },
    {
        "id": 10,
        "text": "Pros:\n* Private karaoke lounge upstairs has excellent sound system and selection of songs. Lots of current hits have the actual music videos, which is pretty unusual in my karaoke experience. The songs that have fake music videos are inadvertently hysterical. \n* We had a huge party with lots of people arriving at different times and drinking lots. Our waiter did a good job of keeping up with us and getting us food/drinks promptly. \nCons: \n* You cannot order pho in the karaoke lounge. So sad!\n* They ran out of vodka. (But our waiter gets bonus points for suggesting we switch to tequila instead. I like the way you think!)\n* Going through the restaurant to get to the karaoke lounge feels a little sketchy."
    },
    {
        "id": 11,
        "text": "This is probably one of my favorite places to eat in the city. My husband and I go here maybe twice a month. They know us by name. They know my parents by name....\n\nI love the pork spring rolls. Not quite as good as my best friend's mom's but still delish. The chicken ones are okay but not amazing. \n \nI LOVE the Pho. I have only been to 3 places for Pho but this one is by far my fave. \n\nIced coffee.... ooh I am getting thirsty....YUM!\n\nIt used to be a BYOB and we could go in there with a six pack and walk out having had dinner for $25 for the 2 of us... now they sell beer, but it's still pretty cheap. \n\nMight have to go for dinner tonight because I LOOOOOOOVE it here."
    },
    {
        "id": 12,
        "text": "I was once a regular at Pho Hoa in South Philly until I moved to the North East. This restaurant is probably one of my favorite Vietnamese restaurants to eat at. They make their pho quickly and send it out to you asap. The servers are on point when you need anything at all and a few remember me and what I usually order. I also recommend trying the bubble tea here as well. Great place."
    },
    {
        "id": 13,
        "text": "I had my first Pho experience today, well my first Vietnamese food experience in general. After reading some yelps about the local restaurants, I decided that Pho Hoa would be a safe introduction into the world of Pho. I checked out their online menu and then I went down and got some take-out. The women at the counter were super friendly. \n\nI got home and opened the bag and delicious aromas filled my kitchen. My honey loved his chicken Pho soup. He has a cold and it was just what he needed. He loaded in the jalapenos and made it really spicy. \n\nMe, on the other hand....I really wanted to love my seafood Pho soup, but I just didn't. The shrimp were bland, it had imitation crab meat which I loathe, and some other form of tasteless white mystery seafood. \n\nI don't know, either I am just not as adventurous as I'd like to be, or I just ordered the wrong thing. I love Chinese, Japanese, and Thai food...  I mistakenly thought I would love Vietnamese food just as much. But, I guess I'd be willing to give it another shot."
    },
    {
        "id": 14,
        "text": "Came back here to try a few more dishes & was pleased.\n\nPho with different kinds of meat (steak, tendon, tripe, fatty flank): the broth was very flavourful.  Noodles were slightly undercooked for me -- they weren't uncooked in general but just not soft enough for how I like my pho.  I didn't get as much variety of herbs as I would have liked, but the bowl was nice & comforting, all in all.\n\nLemongrass beef slices: very tasty, great flavour, well-grilled, fragrant with scallions on top.  The menu described the dish as having \"Fresh Vegetables\" but it was just some shreds of lettuce at the bottom of the plate.  Kind of annoying, because I wanted veggies, but I'll just have to come back next time & ask for more info while ordering.\n\nService is efficient.\n\n3+ stars"
    },
    {
        "id": 15,
        "text": "Pros: Photos of nearly every menu offering and various levels of pho based on how adventurous you are feeling (a choose your own pho-venture)\n\nCons: Their large should be called slightly larger than a regular anywhere else and their regular should be called small."
    },
    {
        "id": 16,
        "text": "Their egg rolls are the best!\n\nPho is really good and fast\n\ndecent prices =)"
    },
    {
        "id": 17,
        "text": "Ok, after a month in Philly, this is my favorite pho place. Pho Hoa is part of an international chain, which mostly sucks, so I've been surprised. They have also changed their menu from the generic Pho Hoa menu (they have the logo with the woman with noodle hair) to what seems like their own, and one that is much more extensive and like a typical Vietnamese do it all restaurant. (Maybe they left the franchise and went off on their own?). In any case, their pho is consistently good, and, for a Vietnamese place, their service is consistently good as well.\n\nOne time I was eating there an older white man came in. When the manager came to take his order, he said he couldn't, that he needed help from his favorite waiter who always chose for him. This guy had gone out to the grocery store to pick up some ingredients. The manager said he would be back in a few. When he got back, sure enough, he picked out a dish for the guy (eggplant) and the guy was happy. It was a kinda surreal moment because it reminded me of being in Thailand or Vietnam, where it's not so uncommon for the older white man to have a boy do simple things for him..."
    },
    {
        "id": 18,
        "text": "On a recent visit to the Phil, I did a little pho crawl. The following is a transcription of scribbles on a napkin.\n\nPho Hoa\nLate dinner (why is this the only place open at 10?). Weird menu. Pho organized by recommendations based on experience level - wtf? Broth should be hotter. beefy enough but lacking depth and sufficient spicing. msg overuse. can't taste anise, cinnamon. rare beef is very nice. paucity of tripe. tendon too thin and not tender enough. basil slightly wilted. there's some ngo gai, as well as a long strand of hair within the sprouts. skipped the sprouts. generic noodles but cooked appropriately enough. mediocre bowl overall, but probably better than most in nyc. msg taste still lingeriing 30 minutes on. msg weirdies an hour later. glutamate toxicity. not good. avoid. need to sleep it off."
    },
    {
        "id": 19,
        "text": "Pho Hoa says they are for the \"Health Conscious.\"\n\nI say: \n\nJUST EAT LESS, YOU HEALTH SEEKERS, AND TO-GO THEM CALORIES HOME!\n\nOverall, this place gets your pho out lightening fast. However, its dishes are generally pricier than other places because they have found health-saavy yet less pho-experienced customers who will eat the advertising up. (That would not be me.)\n\nFor several more quarters, you get above-average pho restaurant aesthetic appeal (fancier LOOKING menus, TVs that each play different channels so that Beyonce, gun shots from a horror movie,  and poignant orchestral music for Adopt-A-Puppy commercials will compliment your dining experience). And you get the mental satisfaction that comes from a  \"Health Conscious Food\" motto plastered on their menus. Plus more a more spacious, less hectic, cleaner dining experience.  \n\nBut here's the bugger: Pho is already health saavy, and this place does not enlighten the food triangle anymore than Nam Phuong or its store front on 5th St. I will admit that they reduce the amount of starch and carbs... \n\n...by serving you fewer noodles in your pho and shrinking the size of your Vietnamese crepe...\n...for prices that are higher than other places. \n\nand they skimped on my meatballs!\n\n$15 credit card minimum, bee tee dubs."
    },
    {
        "id": 20,
        "text": "I love the food here. Everything taste good on the menu especially the new item they have which is the hot pot. The fried fish they have is also very crispy and not oily at all like some other places. Also their appetizer with the raw beef and shrimp chips is delicious....would recommend all my friends to go there.\n\nI posted pics of the food with watermark Jerry Nguyen"
    },
    {
        "id": 21,
        "text": "I have eaten at most of the Pho joints in the city, and also nearby in Marlton, Cherry Hill... Pho Hoa is my favorite, (even though it is a chain) because the broth is the most flavorful. They also are generous with the lime, which makes a difference. Service is friendly and fast, and the Pho is very hot. I give it five stars with Pho 75 in Chinatown coming in 2nd."
    },
    {
        "id": 22,
        "text": "very solid fare.  definitely feels like a chain though. delicious food, but i would go elsewhere if you want ambiance."
    },
    {
        "id": 23,
        "text": "the pho was excellent and the restaurant clean\nwho knew this was a franchise.  i could not notice any franchise type shortcuts here"
    },
    {
        "id": 24,
        "text": "WORST MANAGER EVER!!!\n\nI've been here quite often and made this place one of my fave places to go. However since they changed the manager a while ago, I dont think its a good place to eat at no more. I had dinner with my family and my sis left an empty container on the table. It was EMPTY, it had no smell or disgusting leftovers inside. When we were about to get into the car (coincidentally we parked our car right in front of the rest.) sudennly the manager (even tough I dont think its appropriate to put a manager title to such an ignorant man like him) came out holding the container and asked us whether its our belongings (with a high tone and rude impression on his face). I said no thats just trash, and he said it out loud (again with the rudest face I've ever seen in my whole life) that I cannot leave my trash there. To cut the story short, I came back in to the rest and asked about it, and he argued with high tone. Right after I said to him that he needs to watch his attitude, he right away pointed his middle finger to me! Okay, my patience's gone. I didnt think I deserved any crap like this. Whats the big deal of leaving a container on the table??? Its just irrational and super crazy for a \"manager\" to make such a hassle about it! A true manager would've just shut up. He even still arguing and kept pointing his finger at me while we were walking out from the rest. He kept on yelling to leave the place and never come back no more.  Not enough for that, as we're getting into our car, he AGAIN pointed his middle finger and shook his ass!!! He then made a gesture like he was about to f**k me! At that time my bro was so mad and approached him, telling him to go back into the rest if he didnt want to get hurt. WTF! Hellll what kind of manager is that! Such an ignorant, uneducated, and snobbish person like him doesnt deserve to work in any fields especially being a manager!!! \n\nI will never ever come back to that place and ooohhhh its not gonna surprise me if the restaurant will crash one day with the attitude of \"THEIR GREAT MANAGER.\" People pay not only for food but also for its SERVICE!"
    },
    {
        "id": 25,
        "text": "My wife and I eat at Pho Hoa quite often. The food is great and it has a very nice atmosphere. This is a definite place to grab an inexpensive, filling meal."
    },
    {
        "id": 26,
        "text": "Fast, friendly, consistent, convenient, DELICIOUS. Simple as that.\n\nHave had better spring rolls, but the pho is spot on as well as the best hangover cure (depending on how much sriracha you can stomach, that is). Not to mention the unusual and entertaining conglomerate of patrons ranging from elderly Vietnamese couples to tough looking crowds of young Asian teens to marathon eaters to hipsters.\n\nOverall - LOVE."
    },
    {
        "id": 27,
        "text": "The McDonald's of Pho. It's a chain so bc of that I only have a few expectations.\n\nI expect it to be consistently good. \nI expect it to stay cheap. \nI expect the service to be mediocre.\nI expect the food to come out quickly."
    },
    {
        "id": 28,
        "text": "Look for Thien the friendliest dude here...the staff are courteous and there beside you on a wave of a hand. They have great Pho compared to Pho 75 and have a great new menu that really makes them more than just a Pho place. The Fried Rice is the best its a meal in itself and the spring rolls never fail to delight your glum summer day. The Pho Hoa soups and noodles are there to refresh you and indeed cleans your system. Yes the restrooms  have that newly cleaned scent to it . order a YANG CHOW fried rice a  Number 24 and the Number 5 or 6 and get a coconut juice to wash it down the hatch."
    },
    {
        "id": 29,
        "text": "yayy. I go here on a semi-regular basis with my bf. Their service is always fast and impeccable, pho is hot and filled with delicious noodles and goodies, and we always have a wonderful selection of hot things to add to the pho.  The prices are also quite reasonable."
    },
    {
        "id": 30,
        "text": "Great Pho with good service. Plenty of options on the menu."
    },
    {
        "id": 31,
        "text": "I've only been here once so I can't write much but it was a nice change to the Chinese noddle soups I am so used to. [Pagoda anyone?]\n\nThe waiter was super friendly and they even made me a bowl with tofu, which I didn't notice on the menu. Free tea and two bowls of Pho cost us only eleven dollars or so and we were full 'till the next day.\n\nIt's a fun place with a mixed environment of locals and college students looking for a cheap meal.\n\nCan't wait to go back so I can write more.\n\n________________________________________________\nUpdate:\nSo after a day of feeling not-so-well we headed to Pho Ha on our way home from work for something  filling and that would settle my stomach. \n\nI had the intention of ordering some soup but found the rice noodle bowls more appealing to my senses. I surprised myself by ordering meat for a change and I was in no way disappointed. The spring roll appetizer with shrimp and mint was even more of a delight, especially paired with my fresh limeade soda from the juice bar. Divine! There's nothing like a homemade soda on a hot afternoon. \n\nThe portions as usual were enormous for my tiny stomach so I would up taking a plate home for the evening, a plate I wound up sharing with our dog and one of our kittens who kept ogling the tender strips of pork. No worries, though, there was plenty to go around!"
    },
    {
        "id": 32,
        "text": "I come here for hang over cures with big groups of friends. The service is great, as is the pho. Parking is a little difficult (but we always park in that little viet plaza across the street, shhh), but totally worth it! It's cheap, it's the epitome of the typical pho place, and it's great. I'm always satisfied."
    },
    {
        "id": 33,
        "text": "this is our go-to spot in philly when we've got a craving for simple vietnamese food.  1 order of pho, 1 order of the bun w/ pork/eggroll, 1 lemonade, 1 pink jelly drink.  DIVINE!!  cheap and delicious, that's how we like it.  the grilled pork is super flavorful, i def recommend."
    },
    {
        "id": 34,
        "text": "What I expect when I go get Pho:\n\n1) huge portions\n2) fast service\n3) lotsa noodles but also a good balance of other soup ingredients\n4) ridiculous amount of choices\n5) cheap\n\nPho Hoa hits all these points. It took us a little long to actually get a waiter to come to us-- I think they were confused because our party staggered in at stages so I don't think they knew when everybody was there so giving them the benefit of the doubt. But they have an extensive menu and they let me order what I always like to order in my Pho-- shrimp and tofu and veggies. And it was delish. We were confused if this was a BYOB since they had drinks on their menu. So I don't think it is.\n\nI paid $10 for Pho and an appetizer. That's including tip. Life is good.\n\nOh and there were huge flat screen TVs so we could eat silently and watch the game. Exactly how I like to spend time with my guy friends."
    },
    {
        "id": 35,
        "text": "I guess I was really expecting an amazing experience because my friends eat here all the time and have hyped it up so much. I wasn't really super thrilled with Pho Hoa any more than I was let down. I ordered a big bowl of the chicken noodle Pho (which for those not in the know is a noodle soup.) I guess what let me down the most was how SPARSE the dish was: literally just some sliced chicken, noodles, scallions and broth. They do provide a plate of bean sprouts and basil for the table to break up and add to their dishes, but I guess I was just hoping for more. It was tasty but kind of boring.\n\nIronically my biggest gripe is the small selection of choices, especially starters; but my favourite part of the meal was my own starter, a fried tofu encrusted with cheese. Totally delish!"
    },
    {
        "id": 36,
        "text": "Hands down the best pho in Philly.  I find myself making excuses to come back days in a row, sometimes meals.  The staff is no nonsense, you order soup, you get soup in less than 5 minutes.  The broth is rich, soulful, and exotic.  Every part of their pho, unlike its competition, is perfect, and most importantly, consistent.  Fully recommend going out of your way to get down on this pho."
    },
    {
        "id": 37,
        "text": "Ok so now there is serious contention for my favorite pho place.\n\nI've been to Pho Hoa (note the extra o) a couple times in the past two weeks.  This spot is very large, and very clean.  They have a very extensive menu and their service is spot on.\n\nI know it's a chain, but I think it's every bit as good as Pho Ha.  The pho selections are very similar and they serve beer and wine.\n\nWe've eaten and taken out from this spot and been very happy with the prices, service and quality of the food.  \n\nAces."
    },
    {
        "id": 38,
        "text": "Love their pho.  I've only ordered take-out and get the same thing (no. 9 with extra meat), but it is so awesome!  I like how they put everything (even the plastic tub/lid) in a tied bag so it won't spill out in the car or the way home.  And they are fast!  Healthier then chinese take-out.\n\nIt is a fun project to create your own version of pho.  You get enough soup, meat, veg and basil to fill one of my big baking bowls.  \n\nThe things I would recommend is that they don't have the workers all up in the front of the restaurant near the door (never seen anyone sitting at these tables) making basil bundles.  Well, that is why I wash them really well when I get home."
    },
    {
        "id": 39,
        "text": "I thought this place was okaaaaay...  I've had a lot of good pho in my life, and I wouldn't put this in that category.  On the other hand, it's apparently better than most other pho places around here, soo if you're *really* craving pho this is the place to go.  \n\nThey have great TVs if you like to watch TV while you eat.\n\nThere was something off about the flavor of the broth, but I couldn't put my finger on it... but like I said, still better than other places around."
    },
    {
        "id": 40,
        "text": "pho hoa is this nuts chain that i've seen a lot in california before but this particular location was huge! the other one's i've been to only had a limited selection on the menu but this philly location could do it all. I had hu tieu and the broth was a little thick for my liking but it wasn't bad."
    },
    {
        "id": 41,
        "text": "What stood out in the pho for me was the firmness/texture of the noodles, I felt like I was eating high quality ramen something I have never experience in a bowl of pho before!"
    },
    {
        "id": 42,
        "text": "A good noodle house.  Tried the staple steak Pho.  I recommend getting the sprouts steamed so it doesn't make your soup cold when you throw them in.  The basil and limes were fresh, and the 33 beer was just what I needed after walking down on a hot day.  The staff was friendly, I was lucky that I went with two native speakers so I'm not sure if my experience would have been different but I doubt it.  \n\nP.S.  I didn't see any mice."
    },
    {
        "id": 43,
        "text": "As pho goes, the stuff at this place is pretty darn good. I admit, I'm a bit of a picky eater so I ordered mine dressed down, but the broth was still warm and flavorful and the thinly-sliced steak perfectly pink in the center when the huge bowl arrived at our table. My girlfriend ordered shrimp and crab rolls that looked so good I helped myself to one. Packed with seafood and few pesky veggies (I hate the green stuff) and fried to a golden crisp, they were the perfect accompaniment to the slithery rice noodles. The hostess saw I was struggling to eat the noodles with chopsticks and hurried over with a fork, saving me the embarrassment of asking for one. (I do know how to use chopsticks, but just can't seem to master the art of eating slippery pho noodles with 'em.)  My favorite part of the meal was the mango bubble tea. At least, I ordered mango bubble tea. What I got was more like a smoothie, thick and creamy and obviously freshly made. Though it had chewy tapioca balls in the bottom, I wouldn't call this bubble tea. I would, however, call it delicious. If Pho Hoa was open in the morning, I'd get one on the way to work for breakfast every day."
    },
    {
        "id": 44,
        "text": "had a small pho and some tofu summer rolls. the summer rolls were fine, the soup was not - the broth was mediocre and the meat tasted as bad as it looked (and it looked pretty bad). \n\nI spent the next six hours or so feeling like total crap from the megadose of msg, something I have never experienced before as a frequent pho eater. \n\nIve been there before and had a perfectly fine meal, but after this I wont risk a repeat experience."
    },
    {
        "id": 45,
        "text": "Tried the Bun (Vermicelli).  It's not bad.  Solid.  But I prefer thicker noodles -- they use thinner vermicelli, and I'm not impressed with the iceberg lettuce they throw in there.  Even green leaf or romaine, maybe, but iceberg?  More herbs would have been nice.\n\nBeef wrapped in grape leaves was interesting -- first time I've had Vietnamese grape leaves!  Tasty but they don't fit into my Bun experience that well.  \n\nPork and Shrimp were nicely chargrilled with that chargrilled flavour, but the pork seemed a bit overcooked.  \n\nThey have 2 hot chili sauces on the table (besides Srirachi).  One is roasted, the other is fresh.  The fresh red one is really nice, flavourful, and has a lot of kick -- if I needed chili sauce with my food, I'd definitely come here for that.  (I don't really need it for Bun.)\n\n3+ stars"
    },
    {
        "id": 46,
        "text": "*** vegan review ***\n\ni got probably the worst tofu dish i've ever had at pho hoa. it was basically fried salty spicy tofu and some green peppers, no other veggies. really bad. look elsewhere in this hood for vegan fare."
    },
    {
        "id": 47,
        "text": "Pho Hoa is my default place for pho, bubble tea, spring rolls, etc. Pho Hoa successfully expands beyond the pho horizons to offer a delicious, and at times overwhelming, choice of Vietnamese food.\n \nWhen I stray from my normal Pho Tai, I like to sample their variety of rice and vermicelli bowls. Should I get grilled pork? Maybe spring rolls? Or how about beef wrapped in grape leaves? No matter which one you decide on, they will all leave you with a smile on your face.\n\nThe bubble tea selection is ridiculous, and they have a flavor for everyone! I am currently obsessed with the Iced Thai Tea, which is almost like a dessert! It's sweet and refreshing, and cuts through the saltiness of the pho.\n\nMy only complaint is that sometimes the meat in the pho is sometimes a little \"off\", in the chewy sense. But it's still good!"
    },
    {
        "id": 48,
        "text": "Ate there today but I was surprised that the food wasn't as good as the other times I've been there. The good thing about the place is at least the waiters try to get the food orders right. I've had Pho there a couple times, but today it just looked and tasted as if well, it wasn't to good today. The Pho soup was very dark brown and it just didn't taste as good as my regular visits. I also ordered the broken rice with pork chop special to share and usually the pork chops are really flavorful with lemongrass but it was dry and there was no flavor. \n\nOverall, If your ready for a quick bite and hate waiting, its a OK place to go. \nThey have TVs for you to watch and its a pretty casual place to eat. \nThe servers are good because at least, they do try and get the order right."
    },
    {
        "id": 49,
        "text": "Had the chicken pho - it was good, my husband enjoyed that way more than i did.  Smelled really good though, and had some light spices we couldn't quite figure out.  \n\nI had the chicken fried rice (I'm so adventurous!).  It was probably the best chicken fried rice I've had in quite a while.\n\nIt's worth a trip."
    },
    {
        "id": 50,
        "text": "Pho Hoa is a block away from my house so I find myself eating here pretty often. \n\n The offerings are pretty good, with the Pho being good but not quite as good as Pho Ha down the street.  The steak and broth were noticeably better there.  I do like that their menu is pretty extensive, so you can have something other than pho, vermicelli, or broken rice dishes.\n\nI also love the smoothies! A must try is the avocado- delicious!!  Sometimes I'll stop by just to get one to-go.\n\nThe service is pretty good here- actually friendly and attentive, unlike a lot of places on Washington...\n\nOverall, as the stars suggest, I'm a fan!"
    },
    {
        "id": 51,
        "text": "What happened here? There was a friendly atmosphere, friendly servers, charming lady making the drinks. The staff would actually recognize us and say hello\nNow, the Vietmamese equivalent of Sgt. Joe Friday has taken over. He scowls around the place, sometimes takes orders without looking at anyone, looking away even, while chewing gum. He is a hospitality fail.\nThis place still has the Vietnamese clientele, still has the tasty dishes, but the welcoming ambiance is gone."
    },
    {
        "id": 52,
        "text": "This place is good if you need to have your pho explained, or if you want to get vegetarian pho (why is this so hard to find?), or if you want to order sides of vietnamese food that are not pho in addition to your soup, a luxury for some reason not afforded at other pho places in the area.\n\nI do love their extensive drink menu of various bubble teas and smoothies, but I think the food itself is only OK."
    },
    {
        "id": 53,
        "text": "Our favorite Pho place....I've disregarded that this is a chain....it's the only one in Philly, and for this type of food, it's okay....\n\nGreat Spring Rolls, Fresh ingredients, clean, attentive service, a great price for the quality and quantity."
    },
    {
        "id": 54,
        "text": "I have never had pho so subpar. I think the broth was just not very good. I hear it's a chain restaurant and they have a very extensive menu, but no one in our party enjoyed our meal here. Save your money and go to Pho ha a few blocks away."
    },
    {
        "id": 55,
        "text": "Finally went here, and I am so happy that I finally had a chance to try it.  I went with a large group so there was lots of opportunity to try a bunch of things.  The summer rolls were phenomenal - holy cow, so good.  I had the combo bun, which was perfectly sized and very flavorful.  Not quite as good as some of the more serious sit down Vietnamese places, but very good for a quick casual type place.  I also appreciated the good selection of bubble drinks that they give to you in takeout cups (that way you can take them home).\n\nOverall, a very good spot."
    },
    {
        "id": 56,
        "text": "I love my Pho, and for me, this is the best Pho in town.  This location is just a few months old, but it's the cleanest, friendliest and tastiest spot for Pho and Cafe Sua Da!!  The Rainbow Ice and Bubble Tea are all good as well.\n\nThe broth here is the key - it has the most flavor with very little oil/fat.  Portions are typical for Pho spots along Washington, so you won't be disappointed.\n\nWith several places to grab a decent bowl of Pho along Washington, it's the service, cleanliness, and of course food quality that puts this restaurant a step above the rest.\n\nDue to being fairly new to the neighborhood, this place is never packed and the restaurant itself is very large for a Pho house.  Please support this restaurant to make sure it sticks around for a long time!!\n\nThey also accept credit cards with no minimum limit, which some of the smaller joints do not and they are open everyday till Midnight!!!!"
    },
    {
        "id": 57,
        "text": "This was my first Pho experience, and I was honestly underwhelmed. \n\nWe got the veggie spring rolls to start with and they were delicious!!\n\nThen for the Pho, I got the chicken pho, which was dry and tough. The broth was really enjoyable though.\n\nMy boyfriend got the tofu pho and I liked his a lot better. He got a ton of veggies that were super fresh. \n\nWe also got the smoothies! I got taro and he got honeydew, and they both were really good. \n\nI'm not writing this off my list, I will definitely go back and try it again. If anyone has any pho tips or suggestions, please let me know!"
    },
    {
        "id": 58,
        "text": "This place serves up good pho food. not great, but very good. the price is good and you get a lot of food! The restaurant is clean and the staff are usually very friendly. Just dont go there half an hour before closing. They say they will serve you, but 10 mins before closing time they started bleaching the whole place and we about died from the fumes and had to leave. Not too cool.  Other than that its a good inexpensive place to grab a quick meal."
    },
    {
        "id": 59,
        "text": "I definitely have to give this place 5 stars for 3 reasons!\n\n1) The spring rolls were perfection\n\n2) The Pho was also just so yummy & delic!\n\n3) The food came out so freaking fast\n\nYay Yay Yay, I'm going back tomorrow with a friend because now I'm craving their awesome food!"
    },
    {
        "id": 60,
        "text": "A new place to the back of Chinatown, still a lovely portion and quick to serve.  While it has less meat than some places, everything was piping hot, as opposed to only regular hot compared to some other places.\n\nAnd my table also enjoyed the spring rolls, and the place was cleaner than most in the area, which is a definite point in their favor."
    },
    {
        "id": 61,
        "text": "Clean decor, tasty pho, delicious mung bean smoothies, reasonable pricetag for two\n--------\nNow don't take this the wrong way, but I wonder how this place is a franchise? I mean, do they license out their own brand of nuoc nom (fish sauce), or their specific brand of Monosodium glutamate for the soup base? They have franchises as far away as Canada and Alabama. \nNo matter, the decor was nice and clean (as was the bathroom, A+!), and their beef meatballs had a good amount of \"snap\". Not bad for Philly Pho. \nWorth coming back."
    },
    {
        "id": 62,
        "text": "This place used to be a standby for our family. We could count on them for cheap, healthy, consistently delicious eats. They changed their name, but management & staff were supposed to be the same, so we didn't think twice about hitting them up for dinner the other night. \n\nSadly, the food was terrible the night we went. My vermicelli bowl was full of limp, way past edible green onions & iceberg lettuce that was brown & tasteless like it was from a plastic package the was past its \"sell by\" date. The broth just tasted like salt & they didn't bring fish sauce until I found a server to ask. But the biggest disappointment was the vermicelli. It seemed like spaghetti instead of rice noodles. Maybe we just caught them on an off night, but I'm in no rush to go back."
    },
    {
        "id": 63,
        "text": "Best pho I have ever had! I'm addicted to this place, as I'm there once a week! The house coffee is delicious and the service is quick and friendly. I recommend it!"
    },
    {
        "id": 64,
        "text": "Great food at a reasonable price.  Great assortment of Pho and other Vietnamese specialties.  I strongly suggest trying the marinated raw beef salad. Doesn't sound that appealing, but once you eat it you'll want another order."
    },
    {
        "id": 65,
        "text": "like a true viet, i know my pho. it's the phood of my people! i come here with my family and if it can pass my parents' picky palette, then you all know this place is banging. \ni order the chicken pho. i ask for it with white meat. the broth is flavorful, hot, and filled to the brim and i get to add all the garnish. mint, beansprouts. limes. don't forget to add the squeeze of lime. i let my lime swim in my soup. hotsauce. hoisin sauce. more hot sauce. the beef pho is also good. the lunch specials seem to go fast, so if you want the special, get there early. \norder the chicken pho, get the bubble coffee, and for an appetizer, while they still have it, get the fresh/summer spring rolls with crab and shrimp! it is light and perfect for the spring days to come. also, end it with a fresh lime soda. ask for the fresh lime and they will add the carbonated soda.\nthe waiters are nice, the hostess all smiles, my family and i come here to eat pho, talk, get the vietnamese newspapers and eat an authentic vietnamese meal without cooking it ourselves! quality family time. quality pho."
    },
    {
        "id": 66,
        "text": "Great good, terrific service, clean restaurant!"
    },
    {
        "id": 67,
        "text": "Although it is cheap and quick, the quality of the food has gone down a bit from the first time I ate at this location. The service can be piss poor as long as I get my food done right but it just isn't doing it for me anymore. But it'll do for a quick fix since it is still cheap in price."
    },
    {
        "id": 68,
        "text": "This is a must stop for me when I'm up here for capoeira workshops. Their bubble tea is so yummy. I've tried several plates here and loved them. They can server large groups here."
    },
    {
        "id": 69,
        "text": "So far, the best pho I've had in Philly. In general I avoid Pho Hoa like the plague. They are an international chain and I've had them in many cities in the US and Asia. In general, the pho is mediocre or bad. But today it was pouring and I was parked in front of the restaurant, so what else is there to do but go in? Anyway, I was surprised. Compared to Pho 75 and Pho Xe Lua, I liked it. The broth was more complex (e.g. had more spices which are associated with the south, but that I also prefer). The ve don was intermediate (it was best at Pho 75 and worst at Pho Xe Lua).  I often think that the quality of the ve don is a good indicator of the pho in general. I prefer the crispy ve don with the texture of cartilage to the beefy/fatty kind. As the broth and ve don is very different between restaurants, while other ingredients are more similar, I take these to be very significant."
    },
    {
        "id": 70,
        "text": "One of my fav Vietnamese place. I brought my family here and they love it especially my dad. The price is reasonable especially in this economy. The service is fast and the staff are friendly. This place is clean compare to most of the pho place around Bella Vista area. I love their spring rolls and their pho. There also have a a great selection for vegetarians. Very important when you have vegetarian friends."
    },
    {
        "id": 71,
        "text": "I come here about once a month and get the same, traditional pho every time.  I happened to be there on their grand opening day back in spring of 2007 and fortunately, they have kept it their restaurant clean since then.  (I'm sure everyone's been to a pho place with greasy tables and messy decor)  The service is always fast for the pho noodle soup no matter how busy they are.  The place has a few flat-panel tv's that always has the important games on.\n\nIf you're lucky, there's parking right in front of the place on 11th.  There's also validated parking for the lot on Washington between 9th and 10th.  I don't know if that's valid on the weekdays though."
    },
    {
        "id": 72,
        "text": "They changed the name of this place from Pho Hoa to Pho Ta (or Pho Tai, or something like that). It's pretty much exactly the same inside. But what's in a name? That which we call Pho Hoa by any other name would taste the same.  \n\nWell, I beg to differ. The last few times I went to Pho Hoa, I'd noticed a steady decline in food quality. The meat was gristly, the veggies wilted and not very fresh.\n\nWe came back the other day and PRESTO! it was magically named Pho Ta, and as a result, the meat was magically not gristly, and the veggies were magically fresh. \n\nThe BBQ pork, shrimp and spring roll vermicelli was awesome. The meat was well-barbecued, with the properly-charred BBQ crust, and not gray and connective-tissue-y as barbecued meat shouldn't be. The pho looked the same as always. The menu is ginormous, probably even bigger than it was before, and everything is still cheap."
    },
    {
        "id": 73,
        "text": "A girlfriend of mine was going through a hectic move and needed to grab a quick bite for dinner. She suggested Pho Hoa, one of her favorites from college. I said sure, even though the menu online didn't look very vegetarian friendly. Luckily for me their menu is a lot more expansive than the website suggests and there were plenty of choices for us.\n\nThe service was fast, the portions were huge (giving her leftovers just like we wanted) and the food was tasty. I have no idea what the real name of what I ordered is, but it was #283 and at about $6 was enough for my meal, a late night snack for Clay and my lunch then next day. I also was happy to see they served beer because I was definitely in the mood for one. Our whole meal was about $20 with 3 items and 2 drinks so I will definitely be returning to Pho Hoa for quick, cheap bite."
    },
    {
        "id": 74,
        "text": "I'm completely obsessed with this place and each time I'm in the city this is my #1 go-to ! \nAlways great food , fast service and it doesn't cost much to get you full , portions are pretty big usually have left overs to take home !\n\nA must eat !"
    },
    {
        "id": 75,
        "text": "Oh dear, I'm so conflicted about my feelings here...\n\nThe fresh rolls are yummy, the pho not too oily and they have a huge menu that's relatively easy to navigate and find what you're looking for. The few non-pho dishes we tried were a little underwhelming. Overall a good bet for a quick dinner, so for that I'll leave it at 3 stars.\n\nI had been a couple times and was ready to make it my regular go-to-for-pho, until I tried the vegetarian pho one night and found a good number of ...undesired protein. Bugs. I sent it back several times to no avail, and to the waiter's growing dismay, until I finally, out of starving desperation, asked for simply broth and noodles and finally got a clean meal. I'm guessing/hoping it was a bad batch of veggies that weren't cleaned well enough or something, and I really want to give them the benefit of the doubt, but I don't think I'll be able to go back. Especially with so many other pho places around the block to chose from."
    },
    {
        "id": 76,
        "text": "The only corporate pho place in the neighborhood.  Very good broth, fresh veggies, and a good amount of meat.  If you are trying pho for the first time, I suggest Pho Hoa, the menu gives great descriptions of what you are ordering. \n\nA little nicer decor than some of the other pho places in the neighborhood, but also a little more expensive.\n\n(I ordered the pho with rib eye at  Nam Son, Pho Hoa, Nam Phong, Pho 75, Pho Cafe)."
    },
    {
        "id": 77,
        "text": "Dear Pho Hoa, I love you.  Your service is great, your food is great, and your prices are great!  I love your taro smoothies! You're accomodating and quiet.  The bun is so good-especially the combination bun with a spring roll, pork or chicken, and shrimp is a great deal and so, so tasty!  The pho is also awesome!  If you're on the run, getting food to go is no problem!  You only need to wait a few minutes!  They take cash or credit which is also helpful."
    },
    {
        "id": 78,
        "text": "This place is great. I am remiss to review a chain but I will let it slide considering there is only one Pho Hoa in Philly and the rest are either in Berkeley or Asia. I have to admit I have a soft spot for Pho Hoa since it was my regular Pho joint in Berkeley. However, the broth that they use for their pho is excellent and I would definitely get the #45 (flank, tendon, brisket) if you are at all adventurous. The wait staff is super helpful and their meals are always consistent.  You cant beat the prices either."
    },
    {
        "id": 79,
        "text": "The best cheap Vietnamese spot in Philly. Mostly pho (noodle soups) and bun (vermacelli bowls), and almost all under $10. If you can't find exactly what you're looking for on the breathtakingly extensive menu, you can customize virtually any order. I usually request extra meat. Do yourself a favor and start with an order of the crispy spring rolls."
    },
    {
        "id": 80,
        "text": "Ordered take out of chicken and rice.  I missed my evening plans because I had to throw away the entire meal and cook dinner.  The chicken was like jerky with hard over cooked strands of meat.  I don't even want to know how old it was or how many times it had been reheated."
    },
    {
        "id": 81,
        "text": "We love this place! When we're on a budget (often) and want to go out to eat, we usually end up eating here. Last winter we ate here pretty much every friday night.\nBesides the price, the quality of the food is good. Lots of bang for your buck too. Even though we could technically get one large bowl of pho for 8 bucks, and it would be enough to feed us both (and more), we don't. I can down a whole bowl even though i shouldn't!\nOne of our favorites is anything containing the grilled pork. Its amazing, magical even. Its great on the vermicelli bowls but also we've tried the platters which come with rice wrapper so you can do a make-your-own summer roll kind of thing. \nI've never been disappointed by anything I've eaten here, and no matter how many times I go I don't get sick of it!"
    },
    {
        "id": 82,
        "text": "I have nothing to complain about.  I've only had their Pho, but I've had it a zillion times and they are consistently deeeelicious, clean, fresh, yummy, and kind to dumb 'murricans.  \n\nParking is a bit irksome, which is the only reason I'm taking off a star...  though I acknowledge that's pretty unfair because they certainly try to hook you up with a parking lot a block or two away.  \n\nIt's a great place to be introduced to Vietnamese food, so go check it out."
    },
    {
        "id": 83,
        "text": "After reading the good reviews, I decided I would try this place out. I already have places I like for pho in Philadelphia, so I was curious how this place compares. The verdict? Not good at all.\n\nThe biggest problem with pho was the broth. It was too salty. I almost never think anything is too salty, and this broth was salty to me. The broth also lacked complexity. The saltiness was flat (compared to other places), as if they just added salt to the broth and thought that it was good enough.\n\nThe meat. The brisket, flank, fatty brisket was not nearly as good as other places (especially Nam Phuong). The meat broke apart to all over the place and it seemed messy.\n\nFinally, they got the order wrong on two accounts. I ordered regular and they brought large. And I ordered #44; they brought me #45. I wasn't going to argue over a bowl of soup that costs like $7 to remake the damn thing. But it would've been nice if they got the order right.\n\nI think they are lucky to get even 2 stars. Their portions are HUGE though. If you order a large bowl of pho, you're good to go, even if you're a hungry 18-year-old (I think). If you want a *good*bowl of pho, go across street to Nam Phuong or Pho Ha on 6th."
    },
    {
        "id": 84,
        "text": "I love this place. I crave Pho all the time.  Everything here is pretty good as far as standards for Pho go.  But the last time I came here, I ordered the mung bean + pennywort shake.  It was SO AWESOME. I'm kinda obsessed with mung beans (they have an amazing amount of protein in them), so I had to get it.  But when I asked our server what pennywort is, she said she didn't know.  I asked her what it tasked like and she also said \"I don't know. Americans don't like it.\" She really made us laugh even though it was horrible service.  We looked up pennywort on our phones and found out that it's like a miracle healing herb. So I'll definitely be back to get that. And some more pho. omg i really want to go get some now but I just ate dinner. I'm kind of a glutton."
    },
    {
        "id": 85,
        "text": "At Pho Hoa you will find some of the best Vietnamese food in the city.  Their menu is huge and very extensive.  Their Pho ranks among the best I have every had.  The fried tofu and lemon grass rice bowl are an inspiration and their bbq pork spring rolls are re-god-damn-diculous. \n\nThough it is often hard to find your waiter  (you know how it is at most asian restaurants...instead of waiters working specific tables, they float around working the entire room), the food here is outstanding. \n\nI do have to say that I nearly lost my appetite on my last visit. The men's room bathroom had a whole bunch of boogies all over the wall.  I would say at least 100 of them...all above the men's room urinal (see the picture I uploaded).  I was sooooo discussed (again, maybe it's a cultural thing. I'm just sayin....I see a lot of older asian people on the Market-Frankford El with their fingers WAY up their noses for all to see).  That coupled with the mice, of which there are also pictures, makes me not really want to eat there anymore....Which is a shame, because Pho Hoa's food is one of a kind."
    },
    {
        "id": 86,
        "text": "Went back to Pho Hoa and brought a whole posse with me , We were about 20 all in all with kids tagged along . We had a great time food was great as usual the spring rolls divine and the service flawless. We had a number of going back and forth with what order was made but they were really patient with us. Every staff was on the dot waiting for your whim, they can even read your eyes sensing you need something (psychic). \nPS. saw the Yelp sticker on the front door........"
    },
    {
        "id": 87,
        "text": "A pretty average Vietnamese restaurant. Good service, but not as cheap or delicious as some other options nearby."
    },
    {
        "id": 88,
        "text": "This place is called Pho Ta now.  It's still only the 2nd best pho in the neighborhood but it works.  There's also this massive shrimp crepe thing you can get that you'll want to go ahead and get.  Also if some in your party don't want pho, get the vermicelli bowls which are delicious, especially if you concentrate on the grilled-pork ones."
    },
    {
        "id": 89,
        "text": "Considering myself a South Philly resident, and a lover of Vietnamese food. I go to A LOT of different Vietnamese places for Pho and Vietnamese food.\n\nAlthough Pho Hoa is a chain, it's nice, bright and clean. Unlike some other places where they try to rush you out after you get done eating. \n\nOne of my favorite things to eat there is their carrot beef (ligament) stew soup, where you can either eat it with rice noodle or bread. Pho is a tiny bit expensive than other places, but definitely still affordable."
    },
    {
        "id": 90,
        "text": "This is my favorite place to come for Pho or Bun.  I'll admit that I put so much sriracha on my food that any subtle flavor differences would be hard to detect, but I definitely prefer their pho to the others I've tried in the neighborhood.  And the service seems a little better to me."
    },
    {
        "id": 91,
        "text": "Pho is my favorite food in the world. No restaurant could ever touch my mom's recipe, but Pho Hoa is the best in the city.\n\nI recently moved to Fort Lauderdale, down in sunny South Florida. Asian food, in general, is horrendous. My recent trip back for the holidays brought me to Pho Hoa once again! Broth was done right, bold and not overwhelmed with MSG (if they have it or not).\n\nPeople say coffee and advil is the real hangover cure, I will disagree and raise them with a bowl of Pho Dac Biet."
    },
    {
        "id": 92,
        "text": "Had a nice bowl of pho here a few weeks ago.  It's your standard pho chain kind of place.  You pick a size, and you pick what cuts of meat (or innards) that you want.  I always adulterate my pho with tons of sprouts and generous shots of sriracha. But I made sure to taste the broth before I customized it. I'm happy to say that it was nice and flavorful without any of my extras, a sign of a good bowl of pho.  The service was perfunctory, as expected.  The decor is shiny, and colorful, and there's several tvs, which is weird.  But the food is good, so I'll definitely be back!"
    },
    {
        "id": 93,
        "text": "Clean, great service, large menu. My first time eating pho and they even make it easy for pho babies to pick with the page on the menu for pho ranging from beginners to \"adventurous\". Though I don't really need help to know that I don't want tendon or tripe, at least not yet. Being easily skeeved out I settled for steak and brisket. Got the regular size which was plenty big enough and filling.\n\nThe spring rolls with the peanut sauce were magical. \n\nSince it was baby's first pho I don't want to give it high marks, having nothing to compare it to. But three stars is, just like it says, A-OK!"
    },
    {
        "id": 94,
        "text": "Everything was pretty good - I had the steak pho, my friend had shrimp and pork noodle soup.  The broths were both tasty and the meat was cooked just right.  We also had the Vietnamese crepe -  they were really generous with the filling, although it was a little greasier than I like.  All in all it was a solid meal.\n\nThe real plus is that they are open later than any of the other nearby restaurants.  We arrived just before 10pm on Friday night (post movie) after we had tried Nam Phuong, which was already closed."
    },
    {
        "id": 95,
        "text": "Good portions, clean, good Pho, even have a create your own Pho option :) I had steak and shrimp pho"
    },
    {
        "id": 96,
        "text": "Tried this place for the first time yesterday and I likey. I ordered the number 23 which had grilled chicken and a fried eggroll filled with veg and pork. My dish also came with rice and pickled vegtables. Service was relatively quick and dishes were cheap. I'll come back and try more. Yum."
    },
    {
        "id": 97,
        "text": "the pho smelled like mcdonalds hamburgers. no lie.\n\nbut, the meat was tender and not too fatty, the noodles were actually quite good, and there were plenty of bean sprouts served with it. I love pho, and was disappointed by this CHAIN (just fyi it is a chain). The broth tasted maybe like there had been mcdonalds burgers stewing in it for a day. As my Vietnamese friend said, it was \"pho for timid american beginners.\"\n\nbut! the vietnamese iced coffee was bangin'! I was jittery and talkative for at least two hours after drinking it. perhaps it was laced with coke? jk, but it was delicious, strong and fresh coffee."
    },
    {
        "id": 98,
        "text": "My wife and I used to go here every week. It's located near several other Vietnamese restaurants, but we always seemed to go to Pho Hoa. They have an extensive menu, and the food is fresh. Sometimes ordering a smoothie or bubble tea takes a little longer, but the food service is really quick, and the servers are personable and friendly. It's a good value."
    },
    {
        "id": 99,
        "text": "I never had Viatnamese food before I got the soup with the steak and an order of spring rolls they were both  good and I really like the different Hot sauces and hot oil  .I will definetly go back again."
    },
    {
        "id": 100,
        "text": "My first Pho! I loved it. It was clean, fast, cheap, friendly, and delicious. I'm not sure what else you could ask for. I had veggie spring rolls to start, and really I could have sat there and inhaled plate after plate of those little guys. Then I had the skinless chicken soup. I went for the small version, which was served in a bowl similar in size to one I make cake batter in at home - huge! It was so satisfying on a cold night. I did wake up the next day totally bloated with little sausages where my fingers once were, but that will not stop me from returning! Yum!"
    },
    {
        "id": 101,
        "text": "After visiting several Pho Hoa locations, this particular chain stands head and shoulders above the rest.  In three separate trips to 1111 S 11th street, the broth has been consistent into itself.  The broth has a heavy bone and marrow taste to it, that unctuous, mineral-rich flavour you get when you go heavy on bone in preparation of the stock.  Because of this, I'm invariably impressed.  This shop undoubtedly lands on my pho repertoire."
    },
    {
        "id": 102,
        "text": "Pho-nomenal!\n\nAnd the Bo Tái Chanh (marinated beef with lime and basil) is fantastic!"
    },
    {
        "id": 103,
        "text": "My time here was pretty good even thou me and my friends came right before they closed so we had to order fast and eat fast but the cooks took theyre time and even waited for us to eat not rushing us at all. The food was good first time I had pho and its uber cheap like 6.75 for a huge bowl!"
    },
    {
        "id": 104,
        "text": "The menu is too long?  The meat in their pho is too well done?  Their spring rolls are too fresh? They had too many sauces available to play with? The service was too fast? Too friendly?\n\nNope.  I just can't find a complaint about the place.  Still - it feels like the McDonald's of Pho places - but DAMN the food is good.  Oh - and it's a BYOB..."
    },
    {
        "id": 105,
        "text": "It's our Pho destination spot in South Philly. Always clean and consistent. I don't always get the pho (#2) because their rice plates and other noodle dishes are just as good. \n\nTry #151 (it has rice noodles, pork slices, shrimp, and ground pork with pieces of chinese celery) that gives the soup a different flavor- more porky than beefy. It's my favorite there. \n\nThey're also good for a big crowd as it can accomodate a large group."
    },
    {
        "id": 106,
        "text": "This isn't bad Pho, per se, and it gets 2 stars because it's just down the street from Pho Ha, which is so so so much better.  And given the choice between no Pho and mediocre Pho you should always go for mediocre pho.\n\nService at this one is inattentive and inaccurate.  And they are generous with their MSG.  I'm the kind of guy who LOVES MSG and this was still a little much.\n\nIn addition to Pho they have a vermicelli salad with grilled pork, lettuce, and mint.  You're going to want to get that.  It's going to blow your doors off.  If that was all I'd gotten tonight, this place would be getting three or four stars (silly me getting Pho at a Pho place).\n\nI also think they have a bar with daring drinks and shakes and that sort of thing, which Pho Ha may lack, and it has a more cozy pizza parlor type of feel, so if either of those are important to you, by all means go.  \n\nFinally, there are a lot more white people here than at Pho Ha.  We had a group of three young white men sitting next to us who were practicing their drumming with chopsticks.  These were grown-ass men.  So if that kind of thing is your scene, by all means go."
    },
    {
        "id": 107,
        "text": "I think this is the best Vietnamese in philly. I also like Vietnam Palace on the edge of chinatown. Def check it out, good and cheap."
    },
    {
        "id": 108,
        "text": "aight, y'alls knows i love this place\n\nbut i had the bun bo hue, which is one of the vietnamese must have noodle soups\n\ni found it kinda boring, no kick, like i usually am like, get that nasty purple fish paste away from me, but i was like, hmm, this needs some fish paste...\n\nyeah, it made me crave bun bo hue annam in san jose (see my post for that: there are two options: big or small, penis or no penis)"
    },
    {
        "id": 109,
        "text": "Despite its name, I usually don't order pho at this place.  I've tried it a couple times and was not impressed by their version of this noodle soup, the broth in particular.  Instead, I usually order something from their extensive menu of chef's specials.  I find the rice dishes to be some of my favorites because the meat that comes with the rice is very flavorful and well prepared.  The bun bo hue is also decent.  Not a big fan of the egg rolls here.  My favorite thing to order here would probably be the broken rice with charbroiled beef (com tam bo nuong).  Oh, and there are coloring sheets and crayons for the kiddies here.  That always keeps them occupied."
    },
    {
        "id": 110,
        "text": "I have found this place to be more consistent than Nam Phuong. Of course, the ambiance is nicer on that side of 11th.\n\nIf you are just not having a pho day and you are fond of rolling, they have great-big platters for this and don't skimp on the greens, herbs, and pickles like a lot of places do. I've uploaded a pic for your mouth watering enjoyment. This is the deep fried whole tilapia platter ($12.95). It really could feed two, but I'm greedy. It was perfectly cooked-crispy skin and moist/tender flesh. They have regular nuoc cham and the more smelly fish-paste based sauce, though they prolly won't offer that to you if you don't speak Vietnamese."
    },
    {
        "id": 111,
        "text": "Looking for an inexpensive restaurant that serves delicious food ? Pho Hoa is definitely the place for you!\n\nMy boyfriend and I always dine at Pho Hoa when we're low on a budget. We usually spend around $20 or under for the both of us. \n\nWhen craving a bowl of pho, Pho Hoa is usually the first place that pops in my head. I always order #44 or #45. Yep, I remember the number because I honestly go there a little too often. ;P Their service is typical like many Asian restaurants in Chinatown. They're not really attentive, but their delicious food makes up for it big time. Their smoothies are absolutely yummy. :) I recommend strawberry or avocado.  I also love their fried tofu appetizer and their grilled beef wrapped in grape leaves. I strongly recommend those for an appetizer. The only drawback is that you'll smell like onions and pho when you leave the restaurant, but it's totally worth it. I would definitely recommend this restaurant to anyone pho sho. ;)"
    },
    {
        "id": 112,
        "text": "Pho Hoa's special pho is delish, comes out wicked fast (they must have a vat in the back), and had a comforting broth. I didn't find it five-star worthy (it's a matter of taste), but I still enjoyed it, and it's practically the perfect hangover food if you're coherent enough to remember to not slurp it all down (the soup can be hot). Oh, it doesn't hurt that food is reasonably priced, and that they take credit cards, in case you're short on greenbacks.\n\nThis restaurant - and the various other nearby businesses - are popular, so parking can be problematic - after searching for 20 minutes, I dropped off my friends, and drove north of Washington Ave, and amazingly found parking minutes later.\n\nRandomly, the supremely awesome Chi N. (of NYC) and I both happened to eat there on the same day, at the same time, but missed each other!"
    },
    {
        "id": 113,
        "text": "My fiancé and I come here occasionally when we want a quick hot dinner or if we just have a craving for Pho.  But our most recent visit has made us change our mind about ever going there again.  They've always been about a 3 star place in our mind but lately we've noticed the quality has slowly and continuously declined.  When we went there a few nights ago, we had the worst experience ever.  First of all, it took the waiter a long time to come get our order and once we ordered, it took FOREVER to get our food. This was not our first time here and this is not our first time eating Pho, it doesn't take 20 minutes...seriously.  Ok, so, putting that aside (and hoping that our food was really really fresh that night), they got our order wrong!  They left out the meatballs in my soup, that I had specifically paid extra to add on, and they also switched the size and the order that my fiancé and I had ordered.  Our soup was also off...it had no beef flavor at all...it tasted more like water. And to top off the night, our hot tea tasted and smelled like bleach and soap.  Ugh!  Forget it, don't waste your time and money!!"
    },
    {
        "id": 114,
        "text": "The food is really good. The pho is great. You get so much pho for a good price. The other dishes I've tried are good as well. The beef fried rice is yummy. The general tso's chicken is just ok. The summer rolls are really good, and fresh. The bubble tea is delicious. They even offer it in a smoothie/icy form, not just the usual juice. My only issue with Pho Hoa is the service. It's not bad, but they aren't as attentive as other places. You really have to get their attention in order to be helped. Thankfully they are polite & helpful when you do get their attention."
    },
    {
        "id": 115,
        "text": "I end up eating at Pho Hoa at least 3 times a week.\nIt's crazy cheap. just one block from my house. obscenely delicious and super fast.\n\ncompared with other very similiar restaurants (same menu- word for word) very near by (across the street) it is by far the superior choice.\nthings are way fresher and tastier. \n\nmy favorite dishes are the salad rolls you can wrap yourself...\nthey come with your choice of protein...shrimp. beef. tofu. pork etc.\nlots of herbs, rice noodles, daikon and carrot thinly sliced, lettuce, cucumber, peanuts, and rice paper wraps...it's fun to build it yourself!\nor you can be lazy and order the salad rolls pre-fab. there is also an amazing pickle-y sweet and sour soup with pineapple in it!\nmmmm.\n\nas far as service goes, cross your fingers and hope to get young Tido tableside. he'll charm you cause he totally has no idea how powerfully adorable he is.\n\nafter dinner you could try any number of bizarre salted lemon sodas, strong vietnamese coffee or durian bubble tea concoctions. \nbut, i recommend running across the street to the supermarket for green tea mochi!"
    },
    {
        "id": 116,
        "text": "I visited here several months ago. I live in the OC. Some comparing pho hoa to home is such an unfair disadvantage. Pho here is decent, it doesn't have as much flavor as the other pho places I'm used to. It's pretty pricey here too, but if I go back to PA, then I'll probably eat here again because it's tolerable. It's good when you're freezing."
    },
    {
        "id": 117,
        "text": "I was very disappointed when I stopped by the other day to see what's all the fuss was about. The Pho I had very bland and it smell like instant Pho flavoring packets that you find in Asian Supermarkets( Full of chemicals and MSG)."
    },
    {
        "id": 118,
        "text": "Please select the correct answer - \nGo to Pho Hoa if:\nA. You don't want to spend a lot of money on your meal.\nB. You like Pho\nC. You want your Pho fast\nE. All of the above.\n\nI'll give you a hint - The answer is E."
    },
    {
        "id": 119,
        "text": "If I can give 0 star, I would. Go click on the photos section and see 2 photos that I upload on this place. Better yet, to save you all the trouble.. here you go: \n\n- http://www.yelp.com/biz_photos/3kiB39JzdovdlOhQj-nMCw?select=lWL5WuYmwQrta5IujuoauQ\n- http://www.yelp.com/biz_photos/3kiB39JzdovdlOhQj-nMCw?select=gRTeZnNzCr1SdauJQHZyIA\n\nA mice inside a restaurant.\n\nThe food was tasty.. but I'm starting to doubt if what my friends and I ate was a mice meat.\n\nI knew I saw something from the corner of my eyes even before I ordered the food. I was looking for what I saw and I couldn't find it. At first I thought it was a cat and then I thought it was the shadow of people's head passing the restaurant from outside. After me and my buddies finished our meal, one of them saw this 'pet'. And I was like.. ._. wtf.\n\nThe employee finally noticed it too and he came back with a broom, but then when he gets near, the mice ran away and he pretend that he was sweeping.. like there's nothing at all.\n\nI knew I shouldn't be charged for my food. I knew I shouldn't have to pay. I can easily win the case and call FDA on this place. But my friends has to go to work so I skipped the argument and vowed never to return and vowed to informed all my friends not to eat at this place no more.\n\nThe service was bad too. Ignorant like any other Pho place."
    },
    {
        "id": 120,
        "text": "Very fast service, friendly staff and very resonably priced. I go here just about twice a month and the quality of the food is always wonderful. Incredible vietnamese coffee as well!"
    },
    {
        "id": 121,
        "text": "I've been to Pho Hoa a bunch of times and it's what I call 'cheap viet eats'.  Usually we hit it up after a night of drinking, when we need some pho to soup up with.  I'm not a huge fan of their pho (well I'm viet and make my own) so usually I end up with one of the vermicelli or rice dishes.  \n\nThey also have bubble tea here!  Staff is usually nice since they recognize and remember what we typically order.  Parking is annoying here sometimes though."
    },
    {
        "id": 122,
        "text": "Great pho place in Philly!  They give you a HUGE bowl of pho which was really good, and I got a vermicelli noodle dish which had a variety of good stuff on top- fried egg roll, grilled pork, and - VERY good!!\n\nThey also have my favorite Vietnamese drink- suong song hot luc, a pink jelly drink!!  Great place!!  :)"
    },
    {
        "id": 123,
        "text": "Definitely a good place to nurse a hangover--though if you're JUST going to order pho then maybe you want to hit up pho 75 just down the road--as their brother at 75 has more flavor(pho hoa is a bit watered down) but if you intend on ordering other stuff like the summer rolls or any of the other plates--then its hard to go wrong here--try  finishing off your meal with the coffee with condensed milk or a taro bubble tea =]"
    },
    {
        "id": 124,
        "text": "Hands down the best bowl of pho on the Washington corridor."
    }
]