[
    {
        "id": 1,
        "text": "I've lived  a few blocks from this place for nearly three years now, and I thank Yelp for letting me know what I'm missing out on.  I went in for lunch earlier this week to try out the vegetarian hoagie... i had the veg special. It was delicious. The roll very crispy and fresh, the flavors very strong- jalepeno, cilantro, sauteed veggies, tofu, and some sort of yellow mayo that I always think is a dessert (mango pudding?) when I see it in the case.  Anyway the sandwich is delicious, and although prices are now $4 for a sandwich (up from $1.50) its still a steal for a quick lunch.  I also tried the rice and mung beans with coconut milk for dessert- delicious, an excellent way to add a little protein to a yummy dessert. Next time you're in the neighborhood I'd recommend stopping in to support this local business."
    },
    {
        "id": 2,
        "text": "Updating so soon just to say that Nhu Y really hooked up my hoagies today. \n\nAs usual we got vegetarians #5 and #8 to split. By \"we\" I am, of course, employing the use of the royal \"we.\" Maybe I was saving one for later. Those bahn mi had the perfect amount of hot peppers and herbaceousness tucked into that crusty roll. I get covered in crumbs by these things. I present that to you as a good thing, though, you may be ridiculed as a Messy-Marvin.\n\nI just want to add that it was pretty adorable to watch the older husband and wife team silently making my sandwiches together. Whatever, I'm being all mushy about things but it was sweet to me for some reason. So what? Monster have...feelings?"
    },
    {
        "id": 3,
        "text": "I was in the cafe today, and the customer ahead of us said something along the lines of: \"The owners went home to Vietnam for a month a while ago.  I wanted to kill myself-- their chicken banh mi is my favorite and when I went to another place it just tasted like cat food.\"  It's wonderful that a place like this could inspire such devotion.\n\nThe sandwich itself, of course, has all those ingredient contrasts one could want-- crunchy hot roll, cool soft meat/tofu, crunchy-soothing vegetables and spicy peppers.  The yellow pepper in our sandwiches today was a bit of a curveball from my normal banh mi experience, but a welcome one.  And the owners do it all in about 120 square feet of space, a marvel of engineering I don't think even the hyper-engineered chains can touch.\n\nAlso, a 1/2$ symbol is probably needed to account for the shop's $3 hoagies.  I'm not sure if I've encountered cheaper prepared food that has fresh vegetables as a major ingredient."
    },
    {
        "id": 4,
        "text": "It's been a while since I've had a Vietnamese hoagie, so I was eager to give Nhu Y a try.  It's a tiny little closet of a space - so take out only.  They offer about 7 or 8 different options- two are vegetarian (one regular, one special).  I attempted to inquire about the difference between the two, but did not really get a good answer on this so went with the regular vegetarian (tofu) hoagie.  It took only a few minutes to make the sandwich and it cost me only $3.50!  I started eating the sandwich on the way home- the baguette is rather skinny, so it may not be enough food for some people, but it was a perfect sized lunch for me.  The sauce was a nice blend of tangy sweet- mixing well with the spice from the jalapeños.  The cilantro and shredded carrots were fresh, the bread was crispy and didn't get soggy at all from the sauce or tofu in the sandwich.  I wish there had been a bit more of everything in the actual sandwich, but then again, I ate the whole thing and I'm full.  I'm definitely curious to go back and try the special vegetarian hoagie next time.  Recommended for a very inexpensive lunch or snack."
    },
    {
        "id": 5,
        "text": "Five stars and all that, but what this review is mainly for is my disbelief that there isn't more mention of the pork liver pate.\n\nVegetarian is great and all, and the pork is a good standby, but if you want that perfect, illusive, and characteristically combined Vietnamese/French hybrid, do yourself a favor.\n\nPate Party 2k10"
    },
    {
        "id": 6,
        "text": "i ordered the shredded pork banh mi and was left extremely disappointed. there's barely any meat on the sandwich, and mixed in with the pork is some unknown, clear, rubbery textured substance, of which i'm assuming is a vegetable, that turned me off very much. there also was little to no pate on the roll and they skimped out on the vegetables. i'm not sure if this is the way a traditional banh mi is made but i won't be going back here for another. and if anyone could tell me what those things are mixed in with the pork that would be great."
    },
    {
        "id": 7,
        "text": "With a crunchy bagette and delicious contents within said crunchy bagette, I am thankful that I live a good 20 blocks away from Café Nhuy.  It is through that resistance that prevents me from eating there morning, noon and night."
    },
    {
        "id": 8,
        "text": "If you're ever in the mood for vietnamese hoagies, Cafe Ngu Y is the place to go! \n\nI have been going to this hole in the wall place for years and they never fail to please my palate =) I usually go with the veggie, special or the meatball hoagie. I don't know what it is they do, maybe the bread...whatever it is, they're doing something right. Price is reasonable and service is great! Can't go wrong at this place."
    },
    {
        "id": 9,
        "text": "The name is Nhu Y (roughly \"as you like it\") not Nhuy.\n\nA tiny banh mi shop, we ordered the combo and the vegetarian (which others on here have raved about). The deli counter was a bit bare looking (not a good sign) and they took a long time to make 2 sandwiches (not a good sign, generally the faster they whip them out, the better it is - high volume and lots of practice).\n\nAnyway, the sandwiches were fine. They had a good moistness level. The vegetarian was surprisingly good for not having meat (I'm a former-vegan turned carnivore). However, we found both sandwiches to be too salty, and I'm a big fan of having more pickled veggies, cilantro, and chili in my banh mi than was the case.\n\nNot saying too much, but the best banh mi I've had so far in Philly."
    },
    {
        "id": 10,
        "text": "On Saturday I left my house in the pouring rain with one thing in mind: Vietnamese hoagies. HOAGIIIEEESSS. Like the peasants stormed the Bastille on that very day, 221 years prior, I set out to storm the shit out of Cafe Nhu Y.\n\nI made a brave trek across the city, stopping at PNC on 6th & Spring Garden for $10 from an ATM and then down to 8th & Christian for my second bahn mi ever. I ordered a #5 (vegetarian) and a #6 (chicken) for my significant other. Both were delicious! Great success!\n\nThe rolls were crusty on the outside and soft on the inside - [insert your simile of choice here]. The tofu was deliciously marinated and flavorful, but not too LOUD in my mouth. Perfectly present. Not too wet or slippery either - I love tofu, and sometimes tofu runs the risk of becoming slippery, and I do not like slippery things in my mouth. Sick. Is this review becoming vaguely sexual? My bad, you guys. My bad. \n\nAnyways, I heard the chicken was good, too. The veggies were perfectly crisp and balanced. Together, all of the elements of the sandwich joined forces to create an excellent lunch. Filling but not heavy - you know I love that in a meal.\n\nTwo 12\" sandwiches for $7 is a steal. The service was pleasant and efficient - just one woman hanging out in there, making sandwiches. It was absolutely worth my early afternoon adventure and I plan on returning for a cheap, easy, and tasty weekend lunch. 5 non-slippery stars."
    },
    {
        "id": 11,
        "text": "I just want to give their sammy's a hug.\nThey're great for \"on-the-go\" and they're insanely cheap (get diggin' in your couches folks!"
    },
    {
        "id": 12,
        "text": "Tried the vegetarian hoagie here today. At $3.75 it was fine, but nothing special. I found the fillings (the veggies especially) a bit paltry and completely bereft of jalapeños, so I don't know if you have to request it spicy or something. In a fight, the tofu hoagie at Fu Wah would totally beat Nhu Y's to a bean-curdy pulp. Too bad, I love bahn mi and am always open to finding a delicious new place. Maybe their meat hoagies are better?"
    },
    {
        "id": 13,
        "text": "Okay, if I close my eyes for a second- the second I take the first bite... alright it kind of feels like home. It does. I know that's not you dad behind the counter, but he does a damn good job at making those sandwiches I'd bring to school and get the quizzical looks from my fellow third graders. \n\nThey know what they are doing here."
    },
    {
        "id": 14,
        "text": "Nhu Y - purveyor of delicious banh mi.  Master of the perfectly toasted baguette and the Vegetarian sandwich, replete with marinated tofu, jicama, carrots, jalepenos, cucumber, and some delicious buttery mayo spread.\n\nI still will always have a place in my heart for West Philly's Fuh Wah tofu banh mi, but Nhu Y is now closer - and will fill the gap just fine.\n\nAm I totally missing the Sarcone's rolls, though?  I've never seen 'em here before!"
    },
    {
        "id": 15,
        "text": "If you want a hoagie that is not laden with enough cholesteral to choke an ox, a Vietnamese hoagie from Cafe Huong Lan is worth a shot.  Good for veg-heads and carnivores alike, there are many different options, some of which Americans may find a little intimidating.  My usual was the vegetarian hoagie because it was so damn yummy.  With seasoned tofu, fresh cilantro, some sort of buttery mayo and jalapeno peppers on a very fresh French baguette, it is so deliciously light and perfect.  If you really want to reduce the fat, get it without the buttery stuff.  It's still good.  I'm also a big fan of their tapioca-like plantain pudding dealie.  I know that's not the proper terminology but that's pretty much what it is.  It's delicious."
    },
    {
        "id": 16,
        "text": "I prefer Cafe Cuong over Nhu Y. Maybe because I was working on my third hoagie within an hour... Hmm... it sucks having a high metabolism.\n\nI'll be back to try their infamous Vegetarian special. Hopefully, I won't interrupt the owner's beauty sleep the next time I come. He was snoring pretty loud. I thought it was cute when he frantically stood up as soon as he woke up to see me smiling at him. :)"
    },
    {
        "id": 17,
        "text": "I really like this little hole-in-the-wall place my sister introduced me to...I like their chicken banh mi's with everything on top, but also their special and vegetarian ones are awesome too.  I think the highlight is really the bread...it's crispy and the crust gets everywhere so be careful eating it in your car if you care about that kind of thing :)  I wouldn't say it's the best banh mi I've ever had, but pretty close! (Fu-Wah is a close competitor...)\nPlus, the owners are super nice, and humble too.  Try to swing by here if you're in the area!"
    },
    {
        "id": 18,
        "text": "This place is amazing. I had the vegetarian special, my husband had the sardine special, both were completely delicious, and our total with two drinks was $10. $10! Seriously, don't go here unless you like eating delicious food and not paying tons of money for it. A+."
    },
    {
        "id": 19,
        "text": "The Squab brought me a Pate Banh Mi and a Pork one (which did not taste anything like pork, and was probably fish).\n \nThe Pate banh mi was okay.  The pork one was bland and was spicier.  The strips of meat (which probably wasn't pork) was meager in portion size."
    },
    {
        "id": 20,
        "text": "yummmmmm- my favorite weekend brunch- the most common craving my boyfriend and I get when we're waking up on a weekend and don't feel like making any food.  the tofu hoagies here are awesome, never fail to please.  we usually get 3 and split them- and for $3.50 each that's not a bad deal at all.  the bread is great, tofu good and flavorful, plus with yummy pickled veggies- quite tasty.  just prepare to get them to go- not much room for eating in here."
    },
    {
        "id": 21,
        "text": "fantastic sandwich.  I had the veggie special hoagie - it has grated vegetables, spicy peppers, and very flavorful tofu (and you thought tofu couldn't be flavorful!)  Sandwich is on a french roll that is light and not overstuffed.  The perfect sandwich!  Its a tiny shop, with no seating.  You order at the counter and pick up your sandwich as take-out.  If you like spicy food, like me, I had them add shiracha to my sandwich but it was definitely not needed for flavor."
    },
    {
        "id": 22,
        "text": "I still find it strange that I somehow got an ROTD for my last review because I wasn't the biggest fan. However, I decided to give this place another chance because I was craving a little something reminiscent of home and am so glad I did!\n\nThis second time around was MUCH better. I actually ordered two sandwiches, one for lunch and one for dinner, and was pretty happy with both. While nothing is going to compare to home, this satisfied my Vietnamese sandwich (YES, I called it a sandwich and not a hoagie) craving. I got #2 (Dac biet) and the #4 (Xiu Mai). Everything about both sandwiches were much improved! The baguette was much better this time (last time it was stale). There was more meat/pate and condiments as well. My only complaint, I still wish the pickled carrots/daikon was more thick (instead of shavings) and more sour. I'll be coming back :)"
    },
    {
        "id": 23,
        "text": "This tiny place makes such a delicious hoagie for only $3.50. It's one of my favorite sandwhiches in Philadelphia."
    },
    {
        "id": 24,
        "text": "Best Banh Mi in Philly, hands down."
    },
    {
        "id": 25,
        "text": "Came by with my friend, Fred, on a Saturday afternoon to check out these banh mi sandwiches.  We stopped in at around 4 and there was no line.  We each got 2 - the pork and the tofu - and were pretty pleased with how filling they were.  There are a couple seats in this hole in the wall, but we decided to walk over to the park at 8th/Fitzwater and eat on a park bench."
    },
    {
        "id": 26,
        "text": "Everyone knows this place.  No one knows its actual name, which is probably why I'm writing the first review for it.   I  guess everyone just calls it that \"Vietnamese hoagie deli on Christian.\"\n\nThe sandwiches here are absolutely delicious, and on one hand,  I hope that lots of people go here so that the friendly owners can get rich, franchise out their place, and buy a nice set of rims.\n\nBut at the same time, I hope they don't charge more than the $2.60 they currently charge, and I hope it never gets so popular that I have to wait in line to get my food.\n\nCan't have it both ways I guess."
    },
    {
        "id": 27,
        "text": "I give them two stars for the sandwichs. I ordered a couple and noticed they were a little thinned out. My coworkers joked with me and asked me if I was picking on the sandwichs bringing the order back. Wish I can tell them I was but I wasn't.\nThe space is tiny. So be ready to order as soon as you step in the door."
    },
    {
        "id": 28,
        "text": "I havent quite decided where my favorite Banh Mi spot is just yet in the city but Nhu Y is definitely my fave for their vegetarian one."
    },
    {
        "id": 29,
        "text": "The banh mi here is very good, especially the house special, which is filled with veggies and sliced, cured meats.  The daikon/carrot mix is more finely shredded than that at the other cafes, which I'm not sure if I like; the flavor is good, though, but it is sweeter than Ba Le's or Cafe Huong Lan's.  They use a seasoned butter spread on the Sarcone's rolls rather than plain mayo, so that gives the hoagie an extra flavor boost.  The sardines in tomato sauce banh mi is also pretty good, if you are: a)vegetarian or b)want a hoagie but not the usual banh mi.  The vegegie banh mi is probably the best option here; it is stuffed with plenty of jicama, tofu, potato, daikon, cilantro, peppers, and cucumber on a crusty, buttered roll.  Yes, it's slightly more expensive at $5 but it is a fantastic sandwich and a great veggie option that has all of the delicious flavors that a proper banh mi is known for.  The special and sardine are $3.50, and the other varieties are $4.00; it's also buy 10, get 1 free.  I would call in your order since it gets very busy and there is barely any standing room; the cafe is tiny with no air conditioning (there is a tiny table with 2 stools max).  Overall, a good pick for banh mi but I still like my banh mi ga from Cafe Huong Lan slightly more (and the seating a WHOLE lot more!).  Would def recommend the special and vegetarian here, though."
    },
    {
        "id": 30,
        "text": "Solid. But there is no need to write a two page review. Simple menu, good sandwiches, nice owner, quick service. BTW if you are not too particular about your hair cut, there is a lady next door who cut hair for eight bucks does a pretty decent job. You order, go get your hair cut, come back and sandwich is ready."
    },
    {
        "id": 31,
        "text": "I love these sandwiches.  Best in the city.  I live within minutes of a hive of bahn mi shops, but I will drive across town to get the bbq pork or tofu specials offered by Nhu Y.  Perfectly flaky french rolls, (that WILL explode all over you when you bite them -- best eaten standing up), delicious and zingy sauce, great all around."
    },
    {
        "id": 32,
        "text": "Found this place after the demise of my former love, o sandwiches.  At least once a week I stop in and grab a number 5 (tofu) and/or an 8 (veg special) with a chrysanthamum tea. Hey, don't judge me for getting 2, one's for dinner. I swear. Although it is really hard to wait that long.  \n\nAll I can say is that these sandwiches are absolute heaven. The bread can make a bit of a mess but they are among the best veg Bahn mi I've ever had.  Make sure you have a little time to wait, it takes the guy a little while to throw yours together, but the shop is always toasty this time of year and the food is worth the wait.  The only downside is they don't offer boba tea like o sandwiches, but then there's always the ba le bakery on 6th n Washington (good Bahn mi there too).  Oh and heads up, they appear to be closed on Thursday, at least around 2 when I tend to pop in before work."
    },
    {
        "id": 33,
        "text": "Oh I definitely feel like a lumbering oaf within the tiny confines of Cafe Nhu Y! It's so small that  I feel like I might break it... and great, juuuust great! Then there goes my most precious place to get bahn mi in Philadelphia. NoooOoo! Monster don't know monster's own strength. \n.\nWe've been enjoying the bahn mi from Nhu Y for years and they are our ever-crusty, enduring freshy favorites."
    },
    {
        "id": 34,
        "text": "Their vegetarian hoagies have been a staple of my diet for several years now.  I've never had a better one from any other place.  Everyone who I have introduced to the cafe is hooked."
    },
    {
        "id": 35,
        "text": "The best Vietnamese hoagies around. There are some others that are close. But these are my favorites. The pork and chicken are great. The tofu is also really good. I even order TOFU. So that is saying something. The little couple that work there are adorable, and the place is the size of a juicebox. They are not super fast, but they are certainly delicious! I can eat one as an appetizer or put down two if I am feeling no shame. Hey, if 2 sandwiches only cost $7 total, they are considered one lunch in my book."
    },
    {
        "id": 36,
        "text": "My first and still favorite vietnamese hoagie. I interned right around the corner from here and it was definitely the best eats around for someone on a tight budget. I always got it with chicken and was amazed at the harmony of textures and flavors- crispy bread, tender carrots, and some delicious sauce (no idea what it is, but I don't question). Still wish I was close enough to eat here all the time!"
    },
    {
        "id": 37,
        "text": "This is so hard ! \n\nI have been in the area and saw this tiny little shop with Vietnamese hoagies. Great, I stopped by to get one on Saturday. I was greeted by a smiling man who opened the door for me. Polite right? \n\nI said I was hungry and he pointed to the sign on the wall. I think they were all under $5. I picked the pork. He made my sandwich. Crispy chewy bread, crunchy veggies and sweet pork. \n\nThe problem? I KNOW he did not wash his hands when he made my sandwich. The place is small. You can see everything they do! Oh Man! I didn't complain because I'm tired of complaining and that might have made it worse, you never know with people. \n\nDo I want to go back for the veggie? Um, yes and no. Food safety is a must in my book. Therefore, buyer beware. Its yummy, but is it worth it? \n\nThree stars for EH-OK."
    },
    {
        "id": 38,
        "text": "It's Nhu Y, not Nhuy. \n\nSorry, I'm being a Vietnamese sandwich snob. \n\nBeing born and raised in CA, I've had my fair share of Vietnamese sandwiches or \"hoagies\" and can say this compares to the places that I would not not return to if I were back home. \n\nWith it's high rating, I was just hoping for something more I guess. This place is definitely meant to be for take out as it is quite small. The couple that owns the place is super nice and friendly. I ordered the Thit Nguoi Dac Biet ($3.00), which includes Cha Lua.\n\nMeat was good, pate was good, bread sucked, pickled veggies big time sucked. I guess I'm used to having my sandwich served on a French baguette but what I got instead was more of a hoagie. Not only that but the bread tasted crunchy in the way that it's been left out for too long. As for the pickled carrots and daikon... well, it wasn't pickled. It was completely tasteless and rather than having nice thin slices/strips, they were tiny shavings. Because the veggies were so tasteless and small, it could not balance out the saltiness of the pate and meat. It's just too bad because this is an easy mistake to fix."
    },
    {
        "id": 39,
        "text": "The tofu hoagie is great and an awesome deal, what a delicious treat!  Not much else to say but if this was closer to my house I'd eat it every day and look like a balloon!"
    },
    {
        "id": 40,
        "text": "The best bánh mì in the city.  \n\nThe fillings are generous - tofu, pork, and chicken, etc. along with the usual pickled carrots, daikon, and hot peppers.  The real clincher for me is that they use the crusty and delicious Sarcones baguettes.  I feel like a crusty baguette really allows this sandwich to realize it's full potential.  \n\nOne star off because on a hot day last summer, the gruff dude behind the counter made me a sandwich while not wearing a shirt.   Awesome."
    },
    {
        "id": 41,
        "text": "Have you had Banh mi? If not, this is a good spot to try it out. Many flavors, consistent quality. Great prices, of course.\n\nIts creepy. Its sort of dingy, maybe even dirty. \n\nBut it is kinda awesome."
    },
    {
        "id": 42,
        "text": "This place has the best f-ing Vietnamese hoagies in all of philly. I am Vietnamese and tried all those places, Cafe Cuong, Ba le, Q, all those place on Adams. No bueno.  Nhu Y does it right. Light, crispy bread, the right amount of filling. Amazing. I love their vegetarian hoagies."
    },
    {
        "id": 43,
        "text": "Fantastic, fresh, flavorful Vietnamese hoagies--vegetarian and non--on a scrumptiously crunchy roll, with lip-smacking sweet Cafe du Monde iced coffee. In a place no larger than your walk-in closet. Exceptionally air-conditioned on this steamy May afternoon."
    },
    {
        "id": 44,
        "text": "I kind of held off on this place because I used to live 3 blocks away from Fu Wah in West Philly and figured that was the apex of tofu hoagie-dom.  Fu Wah is its own amazing thing, but these tofu banh mi are much more similar to conventional Vietnamese sandwiches, which is to say GOOD.  On beautiful, slim, crusty baguette, with tons of fresh veggies (cuke, scallion, lettuce, cilantro, jalapeno) and thin slices of spiced tofu rather than the steak-like deal on the other side of the river.\n\nNot better or worse than Fu Wah-- just a different animal (same price though --$3.50).  And hey, there is definitely room for more than one tofu banh mi in this town."
    },
    {
        "id": 45,
        "text": "I love this place. They have a limited menu of about 8 sandwiches but they are delicious. My favorite is the vegetarian hoagie for $4. The sandwiches are on a crunchy roll that will leave a mess if you try eating it in your car but is well worth the mess. The veggies and whatever they season them with are so yummy and different than anything you would find in an American deli or hoagie shop. The sandwiches aren't that big but then again they are only about $4. This is a total hole in the wall and there are a couple of cramped tables and chairs in the corners when you walk in so I always order and then take it home or walk to the park and eat it. And I love that this is a family shop and the older couple with broken English that owns it are so cute. This is one of my favorite hidden gems in the Italian Market area.\n\nThe only thing I would change is the hours. They have some strange hours that change throughout the week but close around 6pm give or take an hour or so. I often crave a Vietnamese hoagie for dinner but don't get home in time to grab one before they close. And they closed for about a month or more over the spring/ summer."
    },
    {
        "id": 46,
        "text": "I came here for the tofu bahn mi. I was sadly not too impressed. I liked the bread and the presentation. And it was cheap, which is a good thing. But... the tofu itself felt bland and flavorless after the marinated goodness of Fuh-Wah tofu hoagies. It tasted like they just put a chopped-up block of plain tofu there without any sort of preparation on it. It wasn't bad it just... wasn't good. I'll stick to Fuh-Wah or Ba Le.\n\nMaybe the meat offerings are better?"
    },
    {
        "id": 47,
        "text": "I like this place. It's a no frills establishment that leaves you feeling as if you shortchanged the person who made your sandwich...actually sandwiches as I can't imagine leaving there without at least two in hand. These things are so good, and the price makes it even better.\n\nI also like how you're forced into either trying to not make eye contact with the lady shelling pistachios or the few people in line ahead of you, and debating on whether or not to try that can of whatever isn't an American soft drink in the cooler."
    },
    {
        "id": 48,
        "text": "I've been supporting this place monthly for 10+ years and seriously love the Vietnamese vegetarian hoagies! used to be 2.50 now I think they're 3.25 big deal, it is worth every penny! WARNING: MAY CAUSE A HEALTHY ADDICTION TO A GREAT HOAGIE!"
    },
    {
        "id": 49,
        "text": "My bf and I were devastated to hear that Cafe Nhu Y was closing.  Their banh mi thit nguoi (traditional Vietnamese sandwich), banh mi chay (vegetarian Vietnamese sandwich), banh mi thit ga (chicken Vietnamese sandwich) are sooo much better than any other place in South Philly (e.g. Cafe Cuong, Viet Huong).  We're always disappointed when we go to one of those other places...\n\nDuring our last visit before Cafe Nhu Y closed, they gave us a flyer that they would be relocating to somewhere on 4th or 5th and Washington Ave.  I figured it would be easy to find so I tossed the flyer into the recycling bin.  Since my bf and I are renovating our house, we are on Washington Ave and Columbus Blvd every weekend, shopping for renovation materials.  For monthssss, my bf and I have been in search of the new Cafe Nhu Y on Washington Ave to no avail.  We drove by very slowly on front through 7th and Washington Ave but could not find the new cafe for the life of us!!  It was so frustrating UNTIL we finally spotted the Grand Opening sign early December 2014!!  \n\nThe cafe relocated and has been rebranded as \"Lee's Cafe and Bistro\" at 522 Washington Ave. \n\nWe cannnn'tttt wait to try the new place!!!  Hopefully, it still has the mom-and-pop shop feel with the mom-and-pop taste and prices!!"
    },
    {
        "id": 50,
        "text": "I got there right after church on Sunday noon. Just couldn't wait any longer to get a taste of this infamous vietnamese hoagie joint. It is located right across the PNC bank, so you won't miss it. Plenty of parking spots in the area.. since it's not that close to italian market- well a block does count. \n\nAfter I arrived, at first I chose the porn.. err I mean pork one. But then I changed it right away since I saw this vegetarian special hoagie for $4.25. The description on that paper makes my mouth drooling even though I'm not a vegetarians. I say.. stay away from pork once in awhile won't hurt. So I quickly make a change in the order.\n\nThe bread, the veggies, and everything else inside are blended together so perfectly in my mouth. It gets better with each bite. I wish it wouldn't end so quickly though.\n\nI'll definitely be back to try on their Sardine hoagie. It sounds very interesting.. and yummy :)"
    },
    {
        "id": 51,
        "text": "Got a Banh Mi here recently it was good, but I've been searching for the best Banh Mi in Philly - and I haven't found it yet. But I would still go back to Cafe Nhu Y again if in the hood. The woman was very nice and the price was right, $3.50 or $4.00."
    },
    {
        "id": 52,
        "text": "Best in the city. I have ate most of their selection (sorry I can't eat tofu) and everything is awesome. Don't be scared to try the headcheese and pate Banh mi when they have it, it's not for everyone but it's damn good. The pork is still my favorite."
    },
    {
        "id": 53,
        "text": "I think the value and quality of the shredded pork banh mi is going to be hard to top. That being said, I've had better banh mi's before. I am moving two blocks from this place, so it is hard to say that I won't be back just because for $4 I can get a pretty filling and tasty sandwich.\n\nI am curious to try the other places in the vicinity of Little Saigon/East of the Italian Market area. Any recommendations for shredded pork banh mi's?\n\nKudos also goes to the very nice and charming woman working behind the counter."
    },
    {
        "id": 54,
        "text": "It was a Sunday. And all I wanted was a vegetarian hoagie.\n\nYelp told me Nhu Y was the place to get it. So off I went. A Fairmount to Bella Vista trek on an empty stomach was probably not the best idea. By the time I hit 8th St. I was starving. \n\nAt last I reached my final destination. ONLY to find a note on the door explaining that Nhu Y will be closed from January 18 through March 25. I wanted to cry. And then gorge myself with cake.\n\nYou have been forewarned, fellow yelpers. I'm coming back March 26th and then writing a real review."
    },
    {
        "id": 55,
        "text": "Tried the shredded pork sandwich. I'm not Vietnamese so I don't know if the sandwich here is more authentic than anywhere else, but I didn't end up loving it. It was okay, pretty small compare to some other places in south Philly. The prices have went up from the picture of the menu here on yelp."
    },
    {
        "id": 56,
        "text": "OK. I went back. I got the vegetarian and the chicken. Both were delicious. I ate the veggie and that thing was de-lish. Tofu, cukes, all sorts of stuff. Only complaint was a little too much mayo. \n\nAnd again no running water to wash hands before my meal was prepared. What do you expect for $4.50? Ahhhh-well. \n\nAnd another note, its strictly takeout no place to dine in. That's fine with me but it was previously mentioned that it had limited seating. I wouldn't want anyone to go and expect to sit. \n\nThe dilemma continues."
    },
    {
        "id": 57,
        "text": "Nhuy's cafe makes the best vietnamese hoagies in Philadelphia.  Ba Le Bakery comes second.  I wasn't a fan of O sandwiches.  Nhuy's for the win!  Only 4 bucks a sandwich.  Love the cilantro, pickled carrots, hot pepper, and cucumber.  Although I have had better viet hoagies mainly cuz I like my pickled carrots really sour and pickley, but Nhuy is good enough.  Downside: no space to eat inside and they take only cash."
    },
    {
        "id": 58,
        "text": "First Vietnamese hoagie I've ever had, introduced to me by my ex, and I was hooked immediately. Their tofu hoagie is so freakin' tasty it makes me do a little food dance. The sweet potato one is delicious too. The owners are friendly and make the sandwiches pretty quickly while you wait. It's the perfect take out for a nice weather day. We used to go and eat them on a bench in the park across the street. But beware, the rolls are so toasty and crispy you will have a mess in your lap. And definitely don't eat them in your car if you don't want to vacuum it out later. \n\nSince I don't live in the city, it has been awhile since I've eaten them (they close around 6-7:00pm), but I can't wait to get back there and bring some friends to try them out too."
    },
    {
        "id": 59,
        "text": "Wow and way wow. I've been hearing about Vietnamese hoagies a lot in the last 6 months or so. After missing the UYE a while back Banh Mi were high on my list of dishes to try. Pulling my vegan friend into the mix, we headed down to the Italian Market to give this place a shot. I trust Dave H., I don't know him, but I trust him. So if he says this is a good place, well, this is the place. It was awesome.\n\nI ordered the chicken banh mi and my friend ordered two of the special vegetarian hoagies. He said they were awesome but I was absolutely blown away. Granted this was my first, but boy have I been missing out! The crunch of the baguette, the crunch of the veggies, the slightly pickled taste of the chicken, the abundance of cilantro and the occasional explosion of jalapeno - well I'm hooked.\n\nI've already found a few of my favorite places in Philadelphia reside in the Italian Market - I guess I just have to add Nhu Y to my list of places to stop on my weekly visit. Ahh, such is life."
    },
    {
        "id": 60,
        "text": "I went to Nhu expecting a really awesome Banh Mi, but was disappointed. The bread was thin and crispy (check) and had some spice to it (check), but where was the meat? I ordered pork and between the buns there was very little meat and not many veggies to make up the difference. Fu Wah outshines this place, hands down. \n\nHowever, my friend and I arrived at the end of the day, so I'm willing to give this place another try-- this time with tempered expectations."
    },
    {
        "id": 61,
        "text": "Based solely on the food, I really like this place.  I always get the two vegetarian options and I love it.  You can ask for extra filling for a small extra charge if you like your sandwiches to be heartier.  I like it just the way it is.  I actually like this a little more than I like the other famous tofu hoagie here in Philadelphia at Fu-Wah.  Although I do really like both.  The sandwiches are different than the ones over at Fu-Wah.  Where as Fu-Wah has big, chunky pieces of tofu, this place has thinner, chewier pieces of them with cucumbers, pickled carrots, cilantro, jalapeno.  SO good.  IWhile we live right across the street from Fu-Wah, we're in the neighborhood of this a lot as our dogs' vet is nearish to here as are their food shops and my work place in Olde City, and we always make sure to stop by.\n\nThe other day I also tried their new sandwich, the sardine in tomato sandwich.  Not bad at all."
    },
    {
        "id": 62,
        "text": "They sell the best bahn mi's ever, and their prices are great!  I've become addicted to their vegetarian bahn mi and dream of it on occasion. Haha.  I'm so addicted that I make sure to finish my outdoor runs at their store, so I can scarf down a bahn mi on my walk back home. :)"
    },
    {
        "id": 63,
        "text": "Giving this one 3.5 stars.  First off, I like the mom & pop feel of the place.  My lady & I got a #5 (veg hoagie) and a #8 (veg special hoagie).  The rolls were real nice which definitely made both of the sandwiches.  The #5 was a 3 star sandwich, decent flavor, not enough tofu or veggies though.   The #8 was superior and fully earned 4 stars.  Lots of flavor in this one with great texture from the vermicelli.  Definitely will be back to this spot when I'm in the area."
    },
    {
        "id": 64,
        "text": "Both of the vegetarian hoagies here are as good as it gets. Great texture thanks to the sarcones roll & fresh veggies, savory flavors and at an incredible price - $4 for one and $3.5 for the other."
    },
    {
        "id": 65,
        "text": "Dropped in on a hot summer day for a cool, crisp sandwich...and was not disappointed. Like a Spring Roll Sandwich.\n\nLittle lady running the place was efficient and the prices were very cheap...$3 - $3.50 per sandwich\n\nI had the Pulled Pork...served on traditional Bahn Mi french loaf with  fillings...noodles, veg of carrots, cilantro, cuke...the pork had a slight sweetness to it, with a dab of fish-sauce. My wife had the \"Special, which was similar to my pork, but with sliced meat with more of a mayo-like condiment on it and had a little heat from peppers on it.\n\nWhile we were waiting a lady popped in to pick up her order...two \"Specials\" and a vegetarian, so it sounds like you've got an idea of what's popular."
    },
    {
        "id": 66,
        "text": "The tofu hoagie on Sarcone's bread is very good.  It's somehow light and satisfying at the same time.  It's different from Fu Wah, so don't expect that sandwich, if you rate it on it's own merits I think you'll be more pleased.\n\nPrices are great and you can get all the grass jelly juice you can drink/eat!!!"
    },
    {
        "id": 67,
        "text": "I'm really effing confused about how many five star ratings this joint has.  I mean, I loves me some banh mi, so I was stoked to check out a new spot.  However, both times I was left asking one question...where's the pork?  Like, really, where is it?  I mean, the bread and veggies and stuff were fine, but the pork was really scant and had no delicious porky flavor AT ALL.  Have I been discriminated against?  Do they think I can't handle the pork?  Cuz believe you me, I can handle it.  I can handle it like it's never been handled before.\n\nFor now I think I'll stick to Chinatown and Washington Ave for vietnamese love sandwiches."
    },
    {
        "id": 68,
        "text": "Tofu hoagies are 2nd best after Fu Wah.  Tiny place, so take out is best  :)"
    },
    {
        "id": 69,
        "text": "Please note: This review is for multiple visits during 2006/2007\n\nI broke by Banh Mi cherry at this place. Still one of the best Banh Mi's I've had.\n\nSpace is small. This is primarily a takeout type of place.\n\nYou walk through the front door and hit a dead stop facing a refrigerated deli case filled with strange looking bamboo wrapped and aluminum wrapped tubes. (Vietnamese headcheese and meats)\n\nA couple runs the shop and works off of a small prep table behind the deli case and toasts their french bread in a small oven toaster that is meant for home use.\n\nThey bustle in the back and in about 5 minutes, you are handed a butcher paper wrapped parcel. Open it up and you find a warm, crusty french bread slathered with special french \"butter\" and filled with headcheese, cilantro, pickled vegs.\n\nGet the Special Hoagie and the Meatball. Both are tasty.\n\nThey also serve delicious Vietnamese coffee as well. Get it iced."
    },
    {
        "id": 70,
        "text": "It's a great cheap alternative to actually going to brunch - and rarely is there every a wait. \n\nThere's no beating Nhu Y"
    },
    {
        "id": 71,
        "text": "I enjoy when places are unassuming and the product is spectacular.  I ordered a vegetarian hoagie and while the wait was a little awkward because I felt like the woman at the table kept looking me up and down, the price and the taste of that vegetarian hoagie made up for it.  I was so high off the flavor that I briefly considered moving to Bella Vista just so I could have them more often."
    },
    {
        "id": 72,
        "text": "I'd give it a sixth star for being a block away from me if I could.  Certainly one of the best meal deals in the city: wonderful sarcone bread, fantastic aoili, cilantro and jalapeno and cucs all in the right proportion. I've tried most of their sandwiches, the non-yam based vegetarian, the pulled pork, and the chicken are standouts.  I'd avoid the yam vegetarian and the meatball, but to each his own."
    },
    {
        "id": 73,
        "text": "These sandwiches are cheap and filled with goodness. I've gotten the pork, the vegetarian, and the vegetarian special. The vegetarian special is my favorite so far. It has a medley of tofu and other goods that are super flavorful. The bread is good too, but it leaves lots of crumbs so be careful where you eat.\n\nIt is definitely a takeout only spot, so grab one and head to a nearby park to enjoy."
    },
    {
        "id": 74,
        "text": "I have to say, that I really like this place.  \n\nI think the meat at Viet Huong is better and the amount of veggies at Ba Le is done right (and in some aspects the bread, too).\n\nBUT.. Nhu Y is pretty good with the overall package.  The bread they use is Sarcones (infamous for selling out of their bread by 11am at the Italian Market)  GREAT bread, but i honestly like the Ba Le lightness better.\n\nThe protein was NOT drowned in sauce, but the amount of fish sauce used might have been a bit too overpowering.\n\nThe amount of veggies was ... well it needed more.\n\n\nOH.. and the guy really, really could have washed his hands."
    },
    {
        "id": 75,
        "text": "Surprisingly approachable and delightfully crunchy Vietnamese hoagies.\n\nNhu Y turns out savory goodness in a perfectly toasted baguette. Filled with tasty pate, tender slices of meat (unless you go for a vegetarian one, which I haven't tried), and condiments galore, this is a spot I send tourists and locals alike. It's tiny though, so expect to get your sandwiches to go.\n\nTheir special banh mi is a good value, and one of the best tasting in the city."
    },
    {
        "id": 76,
        "text": "Nothing hits the spot like a perfectly toasted, personally made vietnamese hoagie.  The owner always has a huge smile and I have never left disappointed.  The only downside is their yearly vacation, back to the homeland I would assume!!  It leaves me craving their hoagies for months until their return.  Perfect for a spring picnic in the park."
    },
    {
        "id": 77,
        "text": "I've got em on my phone so i can call ahead for my order while on my walk with my dog.  It's always the same.  Anywhere between 1 and 10 vegetarian hoagies (bahn mi) depending on how many of my friends are having the same craving.  \nI don't even care that there's more things on the menu that I haven't even tried since the day I had my first bite 5 years ago.  I don't even care that I'm not even a vegetarian. It's just that friggin good.  \nI love it. The seasoned tofu, fresh french baguette warmed just right, the fresh cilantro, crunchy carrot, cucumber and daikon?, jalapeno's (I always ask for extra peppers, sometimes they understand me, sometimes they don't, depending on if it's the husband or wife answering)\nAnyways. yeah.  try it.  you have to.  and if you want a vietnamese coffee, order it.  it's delicious.  just say hot or iced.  using any more words and you're just going to confuse yourself."
    },
    {
        "id": 78,
        "text": "Pretty darn good sandwich. I went in there with the intention of ordering the veggie hoagie, but ended up ordering the veggie speical hoagie. The veggie special has a lot of root vegis - carrots, jicama, tofu, etc. And it is DELIGHTFUL. Like REALLY REALLY REALLY good. \n\nBig fan! I can't wait to go back and try the regular veggie hoagie. The bread is nice and toasty, the sandwich is really filling, and flavored well. Additionally, they have delicious juices to choose from including coconut water, mango juice, etc."
    },
    {
        "id": 79,
        "text": "This banh mi meets expectations. The tofu is fine. The sliced pork was OK."
    },
    {
        "id": 80,
        "text": "So simple, and so good!\nThis place is in an unassuming storefront, with a little fold up table and stools if you want to sit at the window, otherwise you have got to take it out to go. I got the standard banh mi, and the husband got the special veggie banh mi. They were made quickly and cost less then 9 bucks. How much better can it get? The taste was phenomenal! If I am in the area again, I would DEFINITELY go again. \n\nBEST BANG FOR YOUR BANH MI BUCK!"
    },
    {
        "id": 81,
        "text": "I would never have thought to try this tiny little restaurant were it not for the litany of fantastic yelp reviews.  There is no seating here, so it really is take out only.  I tried the chicken and thought it was really well-flavored.  You definitely can't beat the price.  We got two hoagies for 9.00.  So, overall a win-win, great takeout at unbelievable price."
    },
    {
        "id": 82,
        "text": "I showed up here right before close one day and ordered the house special, and two roast pork sammies.  $3/$3.50 each, which seems steep to me (basing this on Cali prices, people).\n\nThe owner was very nice and set to work at making the sammies.  On my way to meet Porko, I couldn't resist, so started nomming the house special.  It was fantastic: soft but crusty bread, cilantro, pickled veggies, good quality-ish cured meats.  I was an instant fan.\n\nBut then I tried the roast pork, which was a huge letdown.  The pork itself was suspect, and mixed with so much onion that there was absolutely no substance.  I thought it would be more of a char siu pork than a stringy relish mixture.\n\nAhh well.  I'd be back for the house special but NOT THE PORK.\n\nTiny place, seating for maybe five max, so be prepared to take out!"
    }
]