[
    {
        "id": 1,
        "text": "Veggie special -- mushroom, spinach, egg, salt, pepper, ketchup.  This is a heavenly, cheap meal (I think $4?).  Paired with a considerably more expensive coffee from Hub bub next door while you're waiting and you have my go-to breakfast when I have an early day at work.  It keeps me full and chipper until late afternoon."
    },
    {
        "id": 2,
        "text": "After years of living here (and prompted by some drinking the night before), I finally decided to try Bui's for breakfast.  Everyone has been telling me that their breakfast sandwiches can't be beat.  Sadly, they can.  Maybe I got the wrong thing (and by reading the reviews, it sure seems like it), but I found Bui's to be lackluster.\n\nI will say that for 3.25, I got an enormous warm hoagie filled with eggs, bacon, a smidge of cheese, with some salt, pepper, and ketchup to taste.  The cheese was barely there, the added salt and the saltiness of the bacon was overpowering, and the bread was so doughy and thick it took over the whole sandwich.  This would have tasted better if I was hungover or super drunk, not relatively sober on a Thursday morning.\n\nOverall, I think I just ended up getting the wrong thing, but  I really wasn't impressed.  At least it's cheap."
    },
    {
        "id": 3,
        "text": "Probably the best breakfast cart on campus. Doesn't give sandwiches dripping with grease like some of the other carts (unless you order something that should be greasy). Quick and consistent as well. Price is about the same as similar carts."
    },
    {
        "id": 4,
        "text": "One of the best, if not THE best, food truck in West Philly. \n\nAll of their sandwiches are really, really good - filling, tasty, and cheap. I'm a huge fan of the Mr. Bui and the Mrs. Bui, and get them with Bui's sauce - some sort of sriracha mayo thing, but it makes everything better. Everything else on their menu is great too, and you can get the staples like a BLT/egg sandwich/cheesesteak too. They also have Orangina sometimes as a beverage item, and who doesn't like that?\n\nMr & Mrs Bui are really friendly too, and once you've been there a few times, they start to remember your order. You can also call or text in your order for pick up which is really convenient if you're in a rush and want something quick to eat."
    },
    {
        "id": 5,
        "text": "Best egg whites and cheese in town!  Speedy, friendly service.  And for those of us that have to work while hungover on the weekends, this truck is a lifesaver.\n\nThe only problem I have with them is that they don't make coffee.  (This really only merits deduction of half a point but since that's not an option I have to round down).  But really, it's not difficult to make and it would bring in SOOOOO much more money.  This is a college campus  where all the undergrads and grad students are zombies without coffee...\n\nCome on, Bui's, make coffee so I can give you that extra star."
    },
    {
        "id": 6,
        "text": "You can't get much fuller for 4 dollars like you can at Bui's.\n\nWhat to get- egg, cheese, and...\nSteak if you're tryna do it up and be full (6 bucks)\nbacon, sausage, or ham if youre happy with any meat (4 bucks)\nmix veggie special if youre health conscious (4 bucks) ...but then maybe you shouldn't be eating here in the first place.\n\nAlso, get the Bui's sauce!!! Its definitely siracha plus some other ingredients that add to its somehow appealing glowing orange color.\n\nInsider tip: this is the only food cart around UPenn where you can text in your order. Imagine this- sunday morning you wake up with a terrible headache from last night. All you can muster up is... steak, egg, and cheese with buis sauce and salt/pepper. Take a shower, walk over 15 mins later, and your sandwich is done for you. How heavenly does that sound?"
    },
    {
        "id": 7,
        "text": "The special Bui sauce.. hm.. tangy, spicy, it's a mixture of some not so common Asian flavor. Price is cheap, but flavor is just ok. Also it only opens rush hours, so if the doors are shut, it means shut. I tried meatballs and some steak sandwiches. They are okay. I think meatballs is little heavy with binders and hard to taste the meat. I can tell the sauce is definitely some jar brand."
    },
    {
        "id": 8,
        "text": "\"Salt peppa ketchup Bui sauce?\" Always Bui sauce. Always always always.\n\nEvery breakfast sandwich from Bui's is on point on point on point. Super SUPER filling, delicious, cheap, and with quick service to boot! The long rolls are always so delicious and wonderfully chewy like some kind of magic French baguette.\n\nAgain, they're pretty fast, but even so, if you don't want to wait, you can definitely order ahead! :)\n\nLast I checked, unlike Lyn's, Bui's is open 7 days a week. Lazy weekend mornings are made all the better with a Bui's breakfast sandwich."
    },
    {
        "id": 9,
        "text": "Bui's is loved.  I like the egg and cheese sandwiches at different carts.  And this one is not significantly better than the rest.  But here is why they get everyone's loyalty: \n1. WEEKENDS - They are open on Saturday and Sunday. \n2. REMEMBER YOUR ORDER - I don't know how they do it, but they remember you.  I stopped going for several months and when I came back, they had it right. \n3. CONSISTENT FOOD - It is always good and they big roll is great when it is fresh. \n\nNOTE - For whatever reason, (hangovers?), they sell a lot of Gatorade with the egg and cheese.  Once I tried it, and it works."
    },
    {
        "id": 10,
        "text": "So much has changed in our lives in the two years that we've been eating bacon egg and cheese with Bui Sauce. You quit Pilam. I quit Cobb. You quit smoking. I moved back home. You started a new job, then another new job, then another one. I did, too. You came into your own as an artist. I came out as trans to my friends and family. \n\nIt's October and we wear turtlenecks almost exclusively now. (You joke that we killed a lot of turtles to get where we are.) Will we always wear turtlenecks? Probably not, you say. They'll come in and out of style. But they'll always be there for us when we need to come back to them.\n\nMr. Bui was gone for a while, but he's back now. Bacon egg and cheese with Bui Sauce is a dollar more expensive than it used to be. But it's alright. The sandwich is the same, and it's always there for us when we need to come back."
    },
    {
        "id": 11,
        "text": "If you're in the mood for some delicious sandwiches in UCity, Bui's is the way to go! After having heard so many good things about this food truck, I finally gave it a try. Since then, I have continued to come back almost every week! Bui's has cheap, great sandwiches AND they are prepared in a super fast manner. My favorite is the hangover special, a very popular choice among other customers as well. It's filled with a sausage patty, bacon, eggs, and their special Bui's sauce. The Bui's sauce is most likely a combination of Siracha and mayo sauce, but the way they make it has a tasty kick to it! It's a delicious addition to all their sandwiches! \n\nThe owners are Vietnamese and friendly! You also have the option to call ahead and make a phone order for pick up. I've also called and asked them what their hours are and it actually closes around 2:30-3p. Bui's is perfect for a breakfast or lunch sandwich!"
    },
    {
        "id": 12,
        "text": "I'm sad to not give it a 5-star review because I really do love this place, but I'm annoyed that my steak, egg, and cheese is $5.75 (their other sandwiches are significantly cheaper), and that the ends of my sandwich are always empty bites of bread. Also, I switched over from the bacon, egg, and cheese to the steak egg and cheese because they're skimpy on the bacon and it's not great quality bacon. Then again, the steak isn't supreme quality, but it's a lot more filling than the bacon. I also wasn't a fan of everyone's favorite Mrs. Bui. A combination of the fact that the chicken was of way lower quality than I wanted it to be...it was like thin little pieces of chicken like paper thin..It made me slightly uncomfortable. And I also wasn't a fan of the spicy mayo tasting stuff that is Bui's sauce. I know, I know, blasphemy.\n\nAside from that, I admit, I get a sandwich from this place probably about once a week, and it used to be much more often than that. They're pretty delicious. And so fast/conveniently-located on my walk to campus. Thanks Bui's, see ya soon!"
    },
    {
        "id": 13,
        "text": "A food truck, it has amazing breakfast rolls. Salt peppa ketcha always asked and a giant size - cheap, too, and always fast.  \n\nIf you ask for extra mushrooms, they will always put it on properly.  Bacon, ham, and sausage with cheese.. yum! Or extra mushroom & onion cheesesteak.\n\nEaten at them since 1998, and always go back when I'm close."
    },
    {
        "id": 14,
        "text": "Cure for a hangover:\n\nMore alcohol \n\nand Bui's\n\nI save this for Sunday mornings... and by mornings I mean early afternoon... but hell, it's morning to me!"
    },
    {
        "id": 15,
        "text": "I had passed by Bui's a million and one times, but never really thought much of it. I don' know why, but I just was not drawn to trying it.\n\nSo, the other day, like I often do, I whipped out my I-phone, pulled up my Yelp app, and decided to see what was near by and rated well.\n\nI was surprised to see after 40 reviews Bui's Lunch Truck had 4 1/2 stars, with a healthy littering of 5 star reviews.\n\nSo, I had to try it. A lot of reviews mentioned their breakfast sandwiches, but I am usually not the breakfast food for lunch type.\n\nSo, I decided on the Mr. Bui special sandwich. In a nutshell, it's a cheese steak with peppers and teriyaki sauce. The bread was a little on the crisp side. It tasted okay, but I prefer it a little softer. And, to be honest, for the extra buck, the peppers and teriyaki sauce were not worth it. But getting past that, the steak and cheese were good. If I was to go back, I'd get a basic cheese steak. Not one of their variations of a cheese steak. Either that, or I go for breakfast and find out what all of the rave is about."
    },
    {
        "id": 16,
        "text": "Tried the hangover sandwich. It was good but nothing special about it... The food is more expensive than other trucks. I'm not really picky (an egg sandwich is just an egg sandwich), so I'm not really benefiting from the more expensive, \"higher-quality\" ingredients in this truck"
    },
    {
        "id": 17,
        "text": "Egg and cheese with salt, pepper, Bui sauce. You truly can't go wrong. Friendly service and a little known fact-- you can order by phone!"
    },
    {
        "id": 18,
        "text": "I'm writing this review because I have a huge craving for an egg and cheese right now.  I'm a Penn alum from several years back, and a day of studying/cramming for an exam would always start off right with the perfect blend of the egg, cheese, and hot sauce on a toasted roll.  I wish I could get one now, but I've unfortunately moved to the west coast and can't quite make it over.  Definitely the best place to get breakfast around there.  Can't wait to make it back!\n\nTheir cheesesteaks I can still remember as well.  They are on the dry side.  This place is where I went for breakfast only."
    },
    {
        "id": 19,
        "text": "I love everything about Bui's. Food, quality, and service! Yes, service. \n\nI tend to binge on Bui's depending on what part of the school year I'm in. If I'm busy and lazy, it's Bui's for brunch everyday. Nowhere else on campus (and dare I say...Philly?) will you be able to fill yourself up on such good food with so little money. A foot long sausage egg and cheese sub for $3.50 is absurd in the best way possible. When ordering, don't forget the Bui's sauce! I suspect it's just a mix of mayo and Sriracha, but it's delicious nonetheless.\n\nWhile Mr. or Mrs. Bui's isn't going to serve you a sub on a silver platter, being able to text your order gives Bui's an A+ for service. Text your order 10-15 minutes in advance and they'll definitely have it for you!"
    },
    {
        "id": 20,
        "text": "For over 3 years, I've been a customer at this little foodtruck near the university's campus. As a family run business, they make their customers family as well-- getting regular customers, knowing orders, and hitting it out of the park every time. I haven't ordered in a while, so today I figured I'd see if I could get my favorite-- bacon, sausage, egg and cheese with salt pepper and bui's sauce! She stayed open an extra 5 minutes when I was a bit late and she was closing up, and had my sandwich waiting for me with a smile! \n\nThe bread is soft and perfect with the breakfast meats and buis sauce, which gives it an almost spicy flavor with a a great texture that isnt dry at all! Ask and you shall receive- if you want extra bui's sauce to make it saucier, do it! If you want more meat, order extra. Customize it the way you want and you won't be disappointed. I've also tried the chicken salad, tuna salad, and cheesesteaks, and they are all so full of flavor and packed with toppings. It's worth the extra few bucks to get the bigger, real meat, real toppings sandwiches."
    },
    {
        "id": 21,
        "text": "Whoa...the biggest food truck I've ever seen. You can probably fit a bed in there!\n\nThat probably reflects Mr. Bui's success. He (and others) serves things on a long French-like roll in large portions. I got something with egg, sausages, and mushrooms plus some Bui sauce. It was a short wait in the rain, and Mr. Bui had a yellow umbrella set up outside. Even at 10 30 AM, there were about 5-10 people at any one time on a Sunday morning at 10:30 AM.\n\nThis place is open even on the weekends, an affordable and convenient way to cure a hangover."
    },
    {
        "id": 22,
        "text": "Excellent breakfast sandwich (get the Hangover Special...DO IT!!) and a decent Philly cheesesteak. Prices are very reasonable and Mrs. Bui (if that's her name...) is so sweet! There is this one creepy dude though who speaks in a really high voice who works there (Mr. Bui?). I actually never really noticed until a friend pointed this out to me. But I digress...this is probably the best breakfast sandwich truck on Penn's campus, so go!"
    },
    {
        "id": 23,
        "text": "I absolutely LOVE Bui's. It's my go to place for breakfast and lunch, and I'm never disappointed. I always get the egg and cheese sandwich, which I know is very simple and plain, yet it's still so delicious. And it tastes even better with meat on it. I love how they have the option of wheat bread, as I prefer it over white bread. This is one of my favorite food trucks on campus. If you haven't tried it, you're seriously missing out."
    },
    {
        "id": 24,
        "text": "Generations of Penn students have frequented this lunch trucks on weekend afternoons as a hangover cure for a reason: Bui's serves the best Sunday brunch grease-bombs hands-down.\n\nWhatever you order, make sure to get it with extra Bui's sauce."
    },
    {
        "id": 25,
        "text": "BEST LUNCH TRUCK EVER. Delicious. So friendly. Learn your order after you come a few times. And the prices are incredible.\n\nOne star off for being closed when you say you are open! Makes me so sad! Why do you close at 3 pm ?!??! SO SAD."
    },
    {
        "id": 26,
        "text": "Sigh. I miss Bui's. I've graduated from Penn and am now many miles away and I still find myself dreaming about bacon egg and cheese with extra Bui's sauce. For the record, Bui's sauce is the only way to go, don't let the saltpeppaketchup camp tell you otherwise. For $3.50, this deal absolutely cannot be beat. Until we meet again, Bui..."
    },
    {
        "id": 27,
        "text": "Bui's is legit, I always get the breakfast sandwiches which are really cheap and the eggs are fresh. I get them with srichicha or bui sauce and sometimes with coffee or a juice. It is really cheap and when the line isn't long for lunch, i get a chicken sandwich gyro or chicken parm which are all on point. Mr. and Mrs. Bui are really nice people and wonderful cooks"
    },
    {
        "id": 28,
        "text": "They serve up a good cheesesteak and also have great specials. This is by far the best food truck in the area and they are fast."
    },
    {
        "id": 29,
        "text": "She serve me a soft Sandwich this morning. Terrible! Normally she would put the bread on oven to heat it up and make it crispy. But definitely not today, not for me. And there is not much people there in the line, so basically she is not that busy. But still. Terrible sandwich I have ever had. I will never ever buy sandwich there anymore!"
    },
    {
        "id": 30,
        "text": "Bacon, egg, and cheese. Enough said.\n\nBeen at Penn for three years and I come here a couple of times each week for a quick breakfast/lunch/I'm hungry moment.\n\nBui's has some pretty solid specialty sandwiches (e.g. Ms. Bui), but none of them beat the simple perfection that is their bacon, egg, and cheese. If there is one specialty sandwich I would recommend though, it's the Turkey BLT...the amount of turkey bacon they put in there seems extremely generous.\n\nQuick tip: If you have no idea what the dude is asking you after you place your order, he's most likely asking if you want \"salt, pepper, ketchup\" on your sandwich. :)"
    },
    {
        "id": 31,
        "text": "Favorite breakfast sandwich truck in Philly. You can't go wrong with a sausage egg and cheese (I'm not a fan of bacon) or the veggie special. They can easily do egg whites and wheat rolls for the health conscious, and I always ask for extra ketchup instead of their mayo-based Bui's sauce. \n\nIf you're in a rush, call in and place your order. No matter where you're coming from, it's generally ready by the time you get there. Or if you have a minute to enjoy the sunshine, you can chill in their lawn chairs and make some new friends. I would definitely call this place a University City staple."
    },
    {
        "id": 32,
        "text": "After coming here several times in the past week or two...I have gotta say that Bui's really does deserve 5 stars. You can text them your order and have it ready for pick-up . So convenient! Especially if there is a line."
    },
    {
        "id": 33,
        "text": "I always get a Mrs. Bui.  Solid sandwich.  \n\nThis is the best place to go for breakfast or lunch.  The sandwiches are fairly cheap, and the people are fast.  There will most likely be a line, but it is definitely worth it."
    },
    {
        "id": 34,
        "text": "Steak, egg & cheese. Every weekend for 4yrs to make the hungover happy."
    },
    {
        "id": 35,
        "text": "This cart has been here for ages, and it's a shame that I hadn't checked it out until now! Super cheap breakfast and lunch food with a smile. Make sure you try the Bui sauce, it's some type of yummy spicy mayo. Not sure what kind of bread they use, but the other reviewer's comment about it being very fluffy and easy to fill up on, is spot on. Not a fan of the bread because there could be more meat on the sandwich. Can't really complain though cause it's so cheap and delicious!"
    },
    {
        "id": 36,
        "text": "A lot of people have called this great hangover food but my best friend introduced it to me as \"Netflix food.\" She calls it the kind of guilty pleasure food you want to hold close to your chest and happily nibble on as you watch your favorite TV show and bum around on a weekend day (while procrastinating on homework, of course).\n\nI tried the turkey bacon, egg, cheese sandwich and was pretty blown away by how satisfying and tasty it was. Make sure to eat it while it's still warm.  I was also so pleased to be able to choose turkey bacon (instead of regular bacon) as an option.Can't find that in most places! Additionally, the spicy Bui sauce definitely takes the sandwich to the next level. I expected it to be a red sauce but it turned out to be white -- interesting! Basically a spicy mayo. Can't wait to enjoy one of these when I visit Penn again!"
    },
    {
        "id": 37,
        "text": "Someone better call the cops because Bui's deals drugs. Don't believe me? Have any of their breakfast sandwiches and you will be a believer. They must lace every breakfast sandwich with crack because I get all itchy when I can't get one. \n\nOn second thought, don't call the cops. I want this truck to stick around (:"
    },
    {
        "id": 38,
        "text": "order anything on the specials menu: notably hangover special, mrs bui, veggie special\n\nget all sandwiches with bui sauce. bui sauce is free.\n\nprices have gotten more expensive over the years. sandwiches went from $5-$6.50 and the sandwiches have been the same, maybe slightly less food"
    },
    {
        "id": 39,
        "text": "Awesome breakfast sandwich!  \n\nMy sandwich: I get egg, cheese, and turkey bacon (or sausage).  This comes on a toasted Amoroso roll. I always order Bui's special sauce, which adds a delicious siracha-based kick (i.e. this is a MUST to add).  I also say yes to salt, pepper, and ketchup.  A nice perk: Although I rarely do this, but you can also get all egg white if you want to make it healthier. \n\nBui's serves hungry college students at Penn.  This popular food cart is known as the place to go when you're hung-over, and it really hits the spot when you want a hangover cure.  But it also makes a cheap, yummy, and filling breakfast when you're completely sober and are on a tight budget. When I lived near campus, I would come here several times a month for breakfast.  Not the healthiest breakfast on the planet, but absolutely delicious....\n\nThis is the best egg sandwich I've had in Philly!"
    },
    {
        "id": 40,
        "text": "So glad I tried this food truck out finally! I live right around the corner and decided to try this place today. Cheap and good sandwiches?? AND fast service? All possible thanks to Bui's. Sandwiches range from $4-$6. They have a menu, but really, you can just tell them what you'd like in a sandwich, and they would make it for you.\n\n I ordered the steak and eggs sandwich today with onions. My boyfriend got the pork roll, eggs, and cheese sandwich. The sandwiches are pretty big and filling. You can order with ketchup, salt, pepper, or Bui's sauce. Bui's sauce is a mixture of probably sirarcha and mayo. Tastes like spicy mayo really. Good stuff to top your sandwich with! The steak and eggs sandwich was great for what it is. Basic sandwich and simply delicious! Wish I added mushrooms to it! That would've made it a whole lot better. The pork roll and egg sandwich was probably my favorite from today though. We got Bui's sauce to go with it, and it complimented it pretty well. If you're in the area and want to grab something quick, cheap and good, definitely come to Bui's!"
    },
    {
        "id": 41,
        "text": "Food trucks are an essential part of the West Philadelphia diet. They're everywhere: up and down Spruce Street, with a bunch on 38th and 40th. They're inexpensive, convenient, and many of them serve food that's surprisingly good. \n\nBut Bui's Lunch Truck manages to stand out amidst all the rest. Maybe it's the charming Vietnamese family that runs the joint, or maybe it's those perfect egg & cheese sandwiches that they put together in no time, but people form long, long lines on the weekend to land one of Bui's famous concoctions. Penn kids will tell you it's the perfect hangover cure. \n\nIf you make it there, definitely go with tradition: bacon, egg & cheese; sausage, egg & cheese; or just egg & cheese --- these sandwiches, on fresh Amoroso long rolls, are always your best bet. Ask for it with Sriracha-brand hot sauce, salt and pepper. Also, if you're watching your cholesterol, the Bui family can assemble a lovely egg white and tomato sandwich for you. Any of the above should run you about $1.50."
    },
    {
        "id": 42,
        "text": "Cheap and delicious. Bacon, egg, and cheese sandwich hits the spot every time."
    },
    {
        "id": 43,
        "text": "This place is amazing.  I am so happy they've been in business so long - I think I had my first Bui's in the 90's when my sister was at Penn, and can't wait until my next one.  \n\nThe sausage and bacon are equally good.  If you're in the mood to treat yourself at the expense of your health, get extra bacon.   Mmmmm.\n\nLove it.  The egg sandwich standard.  \"Bakea-egga-cheee!\""
    },
    {
        "id": 44,
        "text": "I've only been here once. Got a couple breakfast sandwiches that were pretty good. The bread was fresh, but they add a spicy mayo sauce that I didn't know about and that completely ruined my egg & cheese sandwich :( other than that it was pretty standard breakfast."
    },
    {
        "id": 45,
        "text": "Delicious, simple egg sandwiches with fresh bread. Fast service, cheap prices. What more could you ask for? \n\nService isn't stellar and it sometimes is hard to hear and understand the people from the truck, but it doesn't faze me too much."
    },
    {
        "id": 46,
        "text": "Very good and fast sandwiches.  Just had sausage and egg on a large roll for only $3.75.  Always gets you the sandwich quickly.  Open 7 days during College school year."
    },
    {
        "id": 47,
        "text": "I love their Vegetarian sandwich (special #4). the bread is toasted to perfection and the combination of spinach and eggs is mouth-watering.  Overall it is very tasty."
    },
    {
        "id": 48,
        "text": "The gym of Philly. Best tasting breakfast at very reasonable prices. Nice portion too. You can't find better value anywhere else. Make sure you get \"mr. Bui's sauce\" on it."
    },
    {
        "id": 49,
        "text": "The fresh and warm Amoroso bread was clutch, but too little egg and too little ham for a hearty breakfast sandwich."
    },
    {
        "id": 50,
        "text": "Hands down, the best egg sandwich in West Philly, maybe even in the city. Only Bui makes it just the way I like it \n\nwhole wheat + egg whites (spelled \"eggs white\" on the sign) + sriracha\n\nso fast, so cheap, so delicious, I can't get enough, and I rarely order anything else. Spinach is a nice addition, though, if you need some more vegis in your day."
    },
    {
        "id": 51,
        "text": "As far as a breakfast sandwich at a food truck can go, this is the best it could get in my opinion. \n\nI had turkey bacon with egg and cheese on their longer rolls with some creamy sriracha sauce. First of all, the fillings were incredible, but its hard to mess up egg and cheese. The bread was what really set Bui's apart. I've yet to have another breakfast sandwich with such delicious and fresh bread. Will go back for sure."
    },
    {
        "id": 52,
        "text": "FIY: Bui's sauce is a must\n\nBreakfast sandwich trucks are a staple around Philly, especially in the University City area where poor college students are always hungry for cheap and fast food.\n\nWHAT I GOT: Ham, egg, and cheese with pepper, ketchup, and Bui's sauce\n\nPROS: Extremely filling!! These sandwiches are a bit longer than your average breakfast sandwich, though to me, the taste is pretty much the same. The Bui's sauce, which is literally just spicy mayo, adds a nice kick and flavor.\n\nCONS: I wanna say about 1/3 of this sandwich is bread. Bui's uses different rolls from other food trucks I've been to (Lyn's, Happy Sunshine, and Pete's Little Lunch Box) in that the rolls are THICK. Like we're talking at least an inch in width if you measure it after they cut it in half. I'm pretty sure the full feeling you get isn't necessarily from the fillings, but it's mostly from the ridiculous thickness of those rolls. It's also makes it hard to actually taste anything but the bread and sauces and maybe the egg. Their prices are also a bit higher than other lunch trucks I've been too. Probably because of the size of their sandwiches but seriously though, if I'm going to shell out a couple extra dollars for this sandwich, I kind of want to taste something other than bread, ketchup, and egg. Like where the frick did my ham even go?"
    },
    {
        "id": 53,
        "text": "I have only had a breakfast sandwich from Bui's and frankly, I am not impressed. \n\nThe sausage, egg and cheese is way better at Hemo's."
    },
    {
        "id": 54,
        "text": "in two words:  THE BEST\n\nin a few more words:  this place is an egg-and-cheese mecca.  nothing beats spending pocket change on one of these heavenly sandwiches."
    },
    {
        "id": 55,
        "text": "Ohhhh babyyyy Bui's breakfast sandwich is trucky food at its finest.  None of this $8 gourmet nonsense.  If I'm going to a food truck I want fast, good food but most importantly, I'm looking for something cheap!  There's a place in the world for the lobster roll truck... there's also a place in the world for Bui's! \n\nI'd be lying if I said I've never had a Bui's hangover special (ham, bacon, sausage, eggs, and cheese- comes with a gatorade, awesome) but typically I go for a #3 (tomato, mushroom, spinach, eggs, cheese).  The secret here is to order the Bui's sauce.  It's not really anything too special- I think Bui's sauce is a mix of hot sauce, ketchup, and mayo... given that I like all three on my eggs it's the perfect addition to my breakfast sandwich! \n\nThe line is always long but thankfully you can text Mrs. Bui (856.630.7269) and she has it ready when you get to the front.  \n\nKeep food trucks cheap! Support Bui's!!!"
    },
    {
        "id": 56,
        "text": "It's hard to find a decent cheesesteak around u-city. Well I just found one. By far one of the best cheesesteaks I've had around here. Better then Abners!! Worked in u-city for almost 3 years and see this truck everyday, never even crossed my mind to stop. Came here based solely on yelp reviews. So grateful that I did. I got a cheesesteak with hot peppers and their special bui sauce which is some kinda like spicy mayo. And it hit the spot. Definitely will go back...maybe even tomorrow!!"
    },
    {
        "id": 57,
        "text": "Fantastic breakfast sandwiches!  Egg and sausage on a soft and fresh hoagie roll cures everything.  Don't forget the salt, pepper, and ketchup, and the hot sauce if you are in the mood for something spicy.  It's delicious."
    },
    {
        "id": 58,
        "text": "Pretty solid breakfast / lunch food truck. Lady serving was courteous and recommended I get the hangover. It was 11am and I was pretty sober but what the heck. She runs an efficient shop as I got the goods in less than 2 mins. Couldn't even fumble my cash (ONLY FORM OF CURRENCY THEY ACCEPT) quick enough to pay before she handed me my goodness in tinfoil wrap\n\n-The Hangover Breakfast sandwich ($6 cash money): would highly recommend you get it with the bui sauce, their homemade version of spicy mayo. White bread sub with egg, bacon, ham and sausage inside. Pretty standard breakfast sub but the sauce gives it that zing \n\nOverall, good food truck. Would come back again. Only improvement areas for me would be offering whole wheat sub and accepting credit cards"
    },
    {
        "id": 59,
        "text": "Definitely one of the best food trucks on Penn's campus. The breakfast sandwiches are an absolute staple and a must after a night out.  The bread is crispy and toasted before being layered with eggs, bacon and cheese.  The cheese steaks are also some of the best and the city and one of the best deals around at under $5."
    },
    {
        "id": 60,
        "text": "Cool little food truck on the UPenn campus. They have the two staples of any successful college business down pat: they are quick and cheap. There are dozens of sandiwch options, from breakfast staples, lunch staples, and an array of cheese steak themed options. We had a cheese steak with onions and peppers as well as a steak and eggs. Each was $6. It isn't exactly Jims Steaks quality, but it is pretty tasty, filling, and served on a soft, warm roll. Good stuff."
    },
    {
        "id": 61,
        "text": "After years of patronage, I can't believe I haven't written a review for Bui's.  This is the perfect food cart in my eyes:  family run, cheap, interesting, and delicious.  \n\nI'm ashamed to say we get the same damn thing every time, because we love both items:  Mrs Bui and the Hangover Special with Bui Sauce.  I swear, we drive twenty blocks each way just to get our fix on Saturday and Sunday mornings.  \n\nWhen you're in the mood for a filling, awesome sandwich, look no further!"
    },
    {
        "id": 62,
        "text": "I'm a Chinese visitor in philly and I always had a big problem with my meals, I have to say the Biu's totally solved my eating problem, I just love everything on the menu!!!!!"
    },
    {
        "id": 63,
        "text": "On Sunday mornings, sleepy college students recovering from the previous night's shenanigans wait in line at this food truck for the Hangover Special: sausage, ham, bacon, egg and cheese on a long roll from Amaroso's, plus a Gatorade. \n\nThe crowd is mostly students. The breakfast sandwiches are standard combinations (steak, sausage, scrapple, bacon, ham, scrambled eggs, cheese). The lunch offerings rance from the pepperoni pizza steak to the Mr. Bui (steak or chicken with bell peppers and teriyaki sause) and Mrs. Bui (steak or chicken with spinach, tomato and the secret mayo-creamy Bui's sauce).\n\nYour toppings are salt, pepper, ketchup, hot sauce (I believe Sriracha) and Bui's sauce.\n\nThis is the mecca for breakfast and lunch sandwiches.\n\nTip: When it's peak time, it's smart to call ahead with your order. Then you can quickly pay and scoop up your sandwich, beating the crowd."
    },
    {
        "id": 64,
        "text": "Deliverance from the vilest hangovers...now in truck form!\n\nSeriously, as attested everywhere in recent Philly history by college students, Bui's is your miracle cure for your nightime indiscretions.  No matter what the issue is, bacon, egg and cheese with \"salpeppaketcha\" on a perfect pillowy white bun will help you regain your footing on the path to tranquility.\n\nTake that first bite, bask in the sunshine and smile: bliss\n\nPARTING THOUGHT: Bui's staff is great about making unusual sandwiches.  For example, I'm a fan of the cheesesteak with egg and siracha!"
    },
    {
        "id": 65,
        "text": "Your breakfast sausage egg sandwich with Bui's sauce was probably the best breakfast I had this year in Philadelphia.  Great portion for the price paid.  Wish you were in California."
    },
    {
        "id": 66,
        "text": "The best breakfast sandwich in West Philly (and the best I've had in the city but I've not tried many outside of Univ. City).  \n\nThe rolls are the key.  Toasted, light, and fluffy. You tell Ms. Bui your order (probably bacon, egg, and cheese with salt, pepper, and ketchup) and it's up in about 2 minutes, even with a line.  Like the others have said, get Sriacha...I love it WITH ketchup as you get sweet and hot.  \n\nI've been to Bui's so many times it's crazy.  It's a Penn staple and it's worth going to if you live in Univ. City.  \n\nTheir lunches aren't bad either.  It's about as good of a cheesesteak as you'll ever get off of a truck."
    },
    {
        "id": 67,
        "text": "I never got why Bui's is so apparently awesome. I must've missed the memo...\n\nIt's alright. I've gotten a couple of the specials, and their subs are typically made with a combination or ham, egg, cheese, and/or condiments, wrapped in foil and ready to eat. I get that it's cheap and convenient, but so are most of the food trunks along 38th or Spruce. \n\nSomeone tell me what I missed, please!!!"
    },
    {
        "id": 68,
        "text": "Bui's was my first ever Penn food truck experience (thanks to an extremely hungover friend who asked me to get him a Hangover Special from Bui's) and I must say, it blew away the standard I held for food truck breakfast sandwiches! I had ordered a simple ham, egg white, and cheese on a bagel with light ketchup and pepper. Though the sandwich is uncomplicated to make, it's the fact that it wasn't greasy and sloppy - that is what impressed me about Bui's. The egg wasn't wet and slipping out, the cheese wasn't gooey and running down the sides, the bagel wasn't hard to chew - just none of that! It was a simplistic and beautifully prepared sandwich, especially considering since there was a crowd of hungover students waiting to get their food as well. \n\nBui's is definitely a good option to consider whether you're hungover or sober, taking a lunch break, or grabbing food to eat while binge watching Netflix,. Quick, cheap, and made with love, the people at Bui's definitely know how to make breakfast sandwiches."
    },
    {
        "id": 69,
        "text": "I absolutely love breakfast sandwiches and I came to Bui's today for the first time...despite the fact that I've lived here for four years. Bui's is a great deal. I was a little worried the man taking my order might have missed something (Mr. Bui?), but everything turned out fine. No complaints. Be sure to be clear when ordering!  I'll definitely come back here for a quick, filling lunch or breakfast. You can basically order whatever is on the menu in any combination. Really  quick and easy!"
    },
    {
        "id": 70,
        "text": "Good prices, lightning quick service, but the sandwich was only alright. Supposedly great for breakfast, not a great lunch place."
    },
    {
        "id": 71,
        "text": "Bui's sandwiches are perfect for mornings on the go--simple fresh-made goodness that's super affordable for students (cash only). Sandwiches can be topped with \"bui's sauce\" (which is essentially a delicious spicy mayo), ketchup, and s&p, so be ready to specify your condiments."
    },
    {
        "id": 72,
        "text": "A friend recommended Bui's after he heard me raving about Lyns...I will now only rave about Bui's. \n\nSimple concept: egg sandwiches on hoagie rolls. What sets them apart: Lots of ingredients (no skimping on eggs or veggies), fresh veggies (tomatoes, mushrooms and spinach) and of course, the famous special sauce (mix of mayo / ketchup). For $4.50 you get a huge, delicious and warm sandwich - perfect cold day fix. \n\nCan't wait to be back!"
    },
    {
        "id": 73,
        "text": "Having attended Penn, I can tell you that the reviews are right - their egg and cheese sandwiches are the best cures for a hangover. The breakfast sandwiches are a bit on the salty side, but nothing will make a Saturday morning (or afternoon) seem less miserable after a few too many drinks the night before. Even when there's a long line at the cart, the owners do a good job of moving the line and getting the food prepared quickly.\n\nI dock Bui's one star because their cheesesteaks are mediocre; I don't expect something at the level of Pat's, but there's not enough cheese to merit calling this a cheesesteak. If you're looking for an on-campus steak, walk up half a block to Steak Queen. Aside from that, though, the rest of the food here is solid if unspectacular. And did I mention that the food was cheap? Getting a footlong breakfast sandwich for $2-3 truly felt like a godsend some of those mornings."
    },
    {
        "id": 74,
        "text": "Finding Bui's closed at 8:15am, we called the number on the truck and were told that they would be opening in fifteen minutes. After contemplating finding another place to grab breakfast, we decided to cruise around and wait it out. Boy am I glad we did!!\n\nWe had the Hangover and the Mrs. Bui sandwich, both solid, Mrs. Bui exceptional. It was one of those experiences where my eyes widened and I found myself uttering a progressively louder \"yum...YUM...!\" with every bite.\n\nI think it says a lot that the best cheese steak sandwich I've had in Philly was at breakfast, from a food truck, made by a Vietnamese gentleman. And it only cost $5.50 a sandwich."
    },
    {
        "id": 75,
        "text": "The bacon, egg, and cheese on baguette is amazing.  Truly.  If I lived in the area, I would be here quite often.  It's literally pure happiness in a sandwich."
    },
    {
        "id": 76,
        "text": "Food (8.5/10) = After reading several yelp reviews, I decided to order \"the Hangover\" (Fried eggs, sausage, bacon, ham, and cheese, on a hoagie).  Added sriracha to it.  This is awesome breakfast food.  It's so simple, yet so phenomenal.  Really filling, and at a great price ($5).  If I lived or worked close to this place, I would make Bui's a weekly thing.  \n\nAmbiance (?.?/10) = it's a food truck\n\nService (9.0/10) = very friendly, great smile\n\nOverall = If you live or work around this food truck and haven't tried it yet,...what is wrong with you?  Go get yourself a \"hangover\""
    },
    {
        "id": 77,
        "text": "The best food truck on or near Penn's campus!  All their breakfast sandwiches coupled with Bui's sauce (and for some, their salt/pepper/ketchup) is by far the best (and cheapest) way to start off your day.  The Mrs. Bui's, a huge cheesesteak with spinach and tomatoes (which obviously makes it healthy), is also delicious.  If you go to Penn, Drexel, USP, or any of the surrounding schools, and don't try Bui's at least once, you are missing out."
    },
    {
        "id": 78,
        "text": "Typical cheese steaks and burgers, not sure why this place has so many good reviews. I was pretty underwhelmed."
    },
    {
        "id": 79,
        "text": "Best breakfast cart in University City. If you're a Penn student, you know Bui's as THE magical hangover cure on campus. If you aren't hungover, it's still a filling, cheap, delicious way to start your day. I usually get the veggie special with Bui sauce (some heavenly combo of mayo and sriracha) and I highly recommend you try it too!"
    },
    {
        "id": 80,
        "text": "It's one woman back there cooking and handling money so I understand that she's swamped and may take a little longer to get to you. The food is just so overpriced compared to the other food trucks. 4.50 for bacon egg and cheese is way too much. I don't know how they are still open when you can get the same at Hemo's for much less."
    },
    {
        "id": 81,
        "text": "Second best food truck in west philly, second to steak queen which has since closed. Best is the steak egg and cheese w bui sauce."
    },
    {
        "id": 82,
        "text": "Hangover cure: sausage, egg, and cheese on a hoagie roll with ketchup and hot sauce.\n\nThe hot sauce is not just any hot sauce but Sriracha, the best hot sauce ever.  It guarantees to make everything taste better, minus ice-cream b/c that's just weird.\n\nEither way, Bui's is awesome.  I also love how their rolls are warm and slightly toasted.  The people working there are super friendly."
    },
    {
        "id": 83,
        "text": "Yes indeed, the only thing I've ever purchased from Bui's is the egg sandwich.  Fresh roll + perfectly cooked eggs + made to order + *cheap* = bliss.  I keep it simple: egg whites with cheese on a long roll.  They don't look at me funny if I ask for just 1 piece of cheese or black pepper."
    },
    {
        "id": 84,
        "text": "I've always come here for the bacon, egg, and cheese sandwich with Bui's sauce (it's sriracha mayo).  It's pretty cheap and is always delicious.  And it's always made super fast.\n\nYou can also text or phone in your order 5-10 minutes before you get to the truck so you can just walk up to the truck, pay, and not have to wait if there is a line.  The woman who usually works in the truck is very hard-working, cooking, taking phone call and text orders, and keeping everything together.  She's awesome!"
    },
    {
        "id": 85,
        "text": "I love the grandfather who works here. He's always smiling!\n\nAnother of the food trucks on 38th between Walnut and Spruce (closer to Spruce), Bui's serves hungry college kids, specializing in the hung-over category. Home to probably the best steak eggs & cheese sandwich (onions optional) on campus, Bui's has great bread (crusty, yet soft), quick service, and loyal customers. The sandwich is large and filling. I normally get mine with salt-peppa-ketchup & hot sauce. \n\n**Tangent**\nSriracha hot sauce is hands down one of the best hot sauces out there. I highly recommend you getting a bottle of this Thai hot sauce. It's much better than any-old, boring tabasco. \n**End Tangent**\n\nAnother enjoyable sub is the Mrs. Bui's--a grilled chicken sandwich with tomatoes, spinach, mushrooms, and cheese. It bears an uncanny resemblance to Hemo's grilled chicken sandwich, however the sauce is spicier, and typically the wait is shorter. I think it's a good substitute and change of pace from Hemo's.\n\nEstimated wait time during lunch hour ~10-15 minutes."
    },
    {
        "id": 86,
        "text": "Bui's? Oh, you mean salt-pepper-ketchup.\n\nIt's completely fine. Not my #1 favorite food truck in University City, but it is for lots of people. I'm happy to eat breakfast there."
    },
    {
        "id": 87,
        "text": "This food truck is half the reason I moved to Philly. Kidding kinda. But really the breakfast sandwiches with Bui sauce are amazinggg. Always get the sausage bacon egg cheese with extra bui sauce. Don't forget the extra bui sauce, really makes the sandwich. Also love that you can text in your order to pick up. Highly recommend this food truck! The best hangover cure"
    },
    {
        "id": 88,
        "text": "These are legit breakfast sandwiches!!\n\nI always order the sausage, egg, and cheese sandwich, and it's always consistent, delicious, and filling.  I would suggest trying the bui's sauce at least once, it compliments the sandwiches nicely.  Also, this is really cheap and usually pretty fast.  Overall one of the best food trucks on Penn's campus."
    },
    {
        "id": 89,
        "text": "I think I ate Bui's many moons ago when visiting a friend at Penn during Spring Fling, but I, of course, don't remember. I paid Bui's another visit when I was in town.\n\n$5.75 for a sandwich seemed kind of steep when I ordered The Hangover. Until I realized that the sandwich is pretty much the length of a samurai sword. You have the option to add salt/ketchup. Which I did. The girl behind me tried to substitute the sausage with turkey sausage (come on, be a man) and egg with egg white. They can do the egg white substitution but don't have turkey sausage.\n\nDelicious ham, sausage, bacon, egg, and sauce. All sandwiched between perfectly toasted bread. I ate 3/4 of it while walking (with all the crumbs flying into my shirt and ketchup smeared all over my face) and ate the rest at 1:00am even though I wasn't remotely hungry."
    },
    {
        "id": 90,
        "text": "When I first started at Penn, an alumi gave me the full day Philadelphia walking tour. We started with a breakfast sandwich from Bui's.\n\nNow, being a CA transplant, I had NO IDEA the amazingness that sausage, egg, and cheese could become when served truckside. Seriously amazing.\n\nIn my three years in Philly, I've sampled and tasted my fair share of sausage/bacon/egg/cheese sandwiches, but I always come back to Bui's.\n\nThe BAGUETTE! They're Vietnamese after all! They know a thing or 2 about banh mi! So the roll is toasted perfectly, the sausage comes in great portions, and always say yes when they ask \"salt, pepper, ketchup?\" It really is the only way to go.\n\nNow I've moved further from University City, but I sometimes come up here just for a breakfast sandwich. I love it so much I take all my visitors to try this sandwich AND I haven't tried a single other thing on the menu -- I just can't get over this sandwich.\n\nDefinitely the best breakfast option out there, from a girl who doesn't usually like breafast or eggs!"
    },
    {
        "id": 91,
        "text": "Turkey bacon, egg, and cheese. Bui sauce and ketchup.\n\nThat's what I get every time. i call Rachel about five minutes ahead of time, and it's always ready for pick up when I get there.  \n\nBest breakfast sandwich and that Bui sauce! Creamy with a kick! And the baget is always toasty with the right amount of crunch."
    },
    {
        "id": 92,
        "text": "Breakfast sandwich is\nPretty good and comforting\nI'd eat another"
    },
    {
        "id": 93,
        "text": "Oh Dr. Bui and your instant hangover cure...I never actually ordered anything other than what's on their breakfast menu, so I can't tell you how good their cheesesteaks are. It doesn't matter though, since nobody goes to Bui's for anything other than their glorious breakfast sandwiches. Forget Steak Queen- Bui's has perfected the art of the fried egg sandwich. Back in the day, I rarely deviated from my staple of ham and egg with saltpeppa, and that's the way I liked it. At $2.25 a sandwich (cheese was an extra twenty-five cents, I believe), Bui's was (and is) by far the best bang for your buck you can get in University City. I'm pretty sure they singlehandedly raised my cholesterol by twenty points between my junior and senior years at Penn."
    },
    {
        "id": 94,
        "text": "One of the keys to Bui's breakfast sandwiches-- they toast the roll. Giant $2 lightly crisped egg and cheese sandwiches (available at lunch time too- they don't run out of eggs and force you to buy cheesesteaks after 11am).\n\nThey will also remember you and your order -- one of my friends will show up in the crowd and they will start making his sandwich (egg & cheese with sausage) when they see him."
    },
    {
        "id": 95,
        "text": "I had the pleasure of being introduced to the Bui's food truck through friends that went to UPenn. They raved about the breakfast hoagies and they were right!\n\nThe truck opens very early and it always smells so good. Simple menu, I love getting a sausage, egg, and cheese with salt, pepper, ketchup. It's a large portion, enough for 2 sausage patties and the egg and cheese is nice and gooey. Even with its size, I could go for 2 sandwiches because the taste is so great. \n\nThe Asian couple running the truck are nice and efficient. It's a no hassle operation and great bang for your buck. I wish I had this food truck out in California. \n\nAlways a stop when I'm visiting Philly and need a more-than-satisfying breakfast hoagie!"
    },
    {
        "id": 96,
        "text": "I skipped another session of gym today because of this. Went straight after work in early morning around 07:30.\n\nParked my car couple feet from the place. Get off from the car. Walked fast toward the food truck. Saw the menu. Did a little happy dance in my mind. :D\n\nNumber 5! THE Hangover Special. egg AND cheese AND bacon AND ham AND sausage AND salt AND pepper AND ketchup. Mixed them all up and put it on the soft warm roll. Total cost = $5.00\n\nThe service was very quick. About 2 mins. The lady that was working that morning was very friendly. She offered me if I wanted hot sauce on it. At first I said yeah.. and she asked me again to make sure. And I said yeah the second time. Couple second later I decided not to put the hot sauce haha.. I'm such a wimp. Anyway I asked her not to put the hot sauce no more. She smiled and said.. 'its too early in the morning eh?' .. I just smiled back and said yeah.. Well the truth is.. I wanted to get the actual taste.. without the spicy flavor on it. Next time I'm going there, which is pretty soon, I'll order one with the hot sauce on.\n\nDude.. you need to believe this.. it taste awesome. Like I'd go to this place if I want breakfast sandwich than going to McD, Wawa or alike.\n\nI'm not sure if I want to try something else from the menu.. Don't get me wrong, they all sound good. But I'm already in loved with THE Hangover Special."
    },
    {
        "id": 97,
        "text": "Bui's will always have my heart. \n\nShe's the most reliable food truck on campus- whether you're getting a sandwich as simple as an egg and cheese or as complicated as a hangover special with vegetables, always. get. bui's. sauce. \n\nYou can also text ahead if you're running late. \nBut I'll always be back for $5 #3 Mix Veggie with everything :)"
    },
    {
        "id": 98,
        "text": "Overall great food truck. The owner is a nice lady who always wants to make you happy as can be!\n\nShe has a lot of specials ranging from cheesesteaks (chicken available as well), grilled chicken sandwiches, egg sandwiches, the list goes on.\n\nOne of the best things to do is to add the famous Bui sauce to whatever you get as it adds a lot of flavor to the meal.\n\nI had the egg and chicken sandwich with onions and Bui sauce and it was delicious. Very worth the 5 or so dollars I paid.\n\nMy only complaint is that I wish it were open longer!"
    },
    {
        "id": 99,
        "text": "Dear Mrs. Bui (whoever you are),\n\nYour namesake sandwich is the bomb. I'm pretty sure Bui sauce is just a warm version of the spicy mayo that comes with a standard spicy tuna roll, but there's something about putting it on chicken, bread and spinach that make it's extra awesome."
    },
    {
        "id": 100,
        "text": "The wheat bread wasn't impressive. I think most people avoid paying the extra 50c for the wheat bread, and go for the regular bread. Thats likely why the wheat bread was almost stale. \n\nI am not sure why the mixed veggie doesn't come with cheese in it. I have to say the spinach is sometimes a bit suspect. Its certainly not the freshest spinach out there, but it sometimes smells a bit stale. Oh and the mushrooms are out of a can. Which given my distrust of the spinach can't be a bad thing at all. They taste fine.\n\nOverall, this is a foodtruck that sells its rolls for $3. Don't expect the world. Overall, I'm very happy with the 'regular' that I have here - double egg, cheese WITH mushrooms, bui sauce and hot sauce. I've had it on innumerable occasions now, and like the lady who makes it in a jiffy."
    },
    {
        "id": 101,
        "text": "Meh. Don't get me wrong, I love food trucks. But the cheese philly I got was lacking big flavor. There were so many great reviews that I was expecting some serious food here.  Prices were great...but I wish there was more flavor."
    },
    {
        "id": 102,
        "text": "Penn's famous sandwich cart. I'm always a fan of supporting my fellow Viets, and when I found out there were making sandwiches of all things(and not Banh Mi), I didn't know what to expect. Ordered from the specials menu because that's where it's at, and got the Hangover Special w/Bui's Sauce and the Mr. Bui w/steak.\n\nHangover Special(3.5/5): I guess I really don't get these breakfast sandwiches for the most part. It is indeed a filling sandwich, and I was not unhappy with it. But given the ingredients(egg, cheese, bacon, ham, sausage), it's not terribly complicated to make and something I feel I could easily re-create at home if I bothered to.\n\nMr. Bui(3/5): Seemed like a beef teriyaki sandwich essentially. Nothing to write home about. Didn't hate it, didn't love it. \n\nI'd probably stick more to the breakfast based sandwiches though because they pair better with Bui's Sauce(gotta love mayo and sriracha). As a sidenote, I find it funny that the most popular sandwich carts in Philly are owned by Vietnamese people, but don't sell the most popular Vietnamese sandwiches(Banh Mi, where you at?). While none of the flavors are particularly impressive, the combination of Bui's sauce and breakfast classics means that Bui's will never let you down for a consistently tasty and filling sandwich."
    },
    {
        "id": 103,
        "text": "A five star food truck? Is it possible? Is this the apocalypse?\n\nBui's wins on almost all criteria:\n-Taste? Check, that Bui's sauce is a must for any sandwich\n-Cost? Check, $4-6 dollars for anything. Cheaper if you're looking for a simple breakfast sandwich or cheeseburger.\n-Convenience? Check, call or text your order in and you can enjoy your walk over to 38th Street in peace.\n-Service? Check, Mr. and Mrs. Bui are super friendly and will always put a smile on your face.\n-Hours? Check, open seven days a week for all three meals of the day. No other place can boast that kind of commitment.\n\nFive criteria, five checks. This puts Bui's in lofty standing among food trucks."
    },
    {
        "id": 104,
        "text": "Best hidden gems. I order number 9 cheesesteaks. It so tasty and delicious. The Bui sauce make all the difference. Give this place a try and you won't be disappointed. Don't let the hole in the wall look fool you."
    },
    {
        "id": 105,
        "text": "Based off of the reviews here I was expecting something more substantial in terms of portion size. The sandwiches here are pretty large but it could do with a little more meat. I've ordered the hangover as well as a scrapple egg and cheese. The food itself is pretty delicious, no complaints about that.\n\nThey're friendly and they're fast in getting your orders out to you. I've ordered at the truck as well as phoned my order in. I recommend doing the latter if you're in a rush or if your office happens be a bit of a walk from the truck."
    }
]