[
    {
        "id": 1,
        "text": "This place is extremely clean and lovely. The owner couple is very sweet and friendly. My wife and I ordered pho deluxe here and we finished the entire thing! The owner was so happy when he saw this and was proud to mention the soup takes 6-8 hours to prepare. Strongly recommend!"
    },
    {
        "id": 2,
        "text": "Amazing service and food! Came in and ordered the shrimp summer roll, steak and meatball pho, and the iced coffee. The owner was super sweet & made us feel like we were visiting a friend. The food itself was large and tasteful! Honestly the best pho I've had in the city."
    },
    {
        "id": 3,
        "text": "Delicious and fresh. Some of the best pho I've had and you can't beat how well they package all of the components for takeout. The staff is also very lovely and friendly. Highly recommend!"
    },
    {
        "id": 4,
        "text": "Really glad there's another great pho place north of Washington street. Great service, broth is excellent and portions are sizeable. Looking forward to trying more options here. Owner seems very nice."
    },
    {
        "id": 5,
        "text": "Our new go-to Pho restaurant! Their vermicelli and pho are both incredibly good and comparable to other pho places in the city. Plus, every time we go there they are always so nice and helpful. There's really no sitting room, though, so plan to grab and go!"
    },
    {
        "id": 6,
        "text": "It's a pleasure to have a solid pho place nearby! The quality of the beef and broth are both excellent in the pho tai, and the place is very peaceful for a quick evening meal and some people watching."
    },
    {
        "id": 7,
        "text": "Flank was cooked perfectly and as a delivery order; they were FAST. Photastic!\n\nHighly recommend."
    },
    {
        "id": 8,
        "text": "The best pho I've had in a long long time! I'm usually a bit skeptical about new restaurants with all five star reviews because they are most likely written by the owners' family or friends. But this one definitely deserves a five star! I got the deluxe pho and the soup was super delicious. I know I am going back soon for sure!"
    },
    {
        "id": 9,
        "text": "We got 2 grilled pork vermicelli noodle dish and the grilled pork spring rolls. The vermicelli was pretty good. I'd give it 4/5 -- the noodles are thicker than what I'm used to eating at other Vietnamese restaurants so that was a personal bummer. I prefer the thin rice noodles over what they have so if you don't like thicker noodles, don't order it. Those noodles were also in the grilled pork spring roles so also a 4/5."
    },
    {
        "id": 10,
        "text": "So happy finally an amazing pho restaurant opened up in rittenhouse! The pho was delicious and fresh! The owner was very nice and gave me instructions on how to reheat. And $11 is a price you can't beat!"
    },
    {
        "id": 11,
        "text": "I was so glad to find this place on Yelp as I was craving for some pho and this was the only option around Rittenshouse square, and turns out to be delicious and affordable too!\n\nWe got the deluxe pho and grilled chicken broken rice dish. The portions were very generous. While both dishes were great, if I must pick, I'd get the pho over the broken rice."
    },
    {
        "id": 12,
        "text": "Found this little tucked away place recently and fell in love on the first bite! At first sight I was a bit nervous because there's not a lot inside. It's a small bar stool area with 4 chairs facing the window to eat at. So I'm assuming many people do take out there. But if you decide to dine in- it's BYOB!! \nThe food was overall a great price and a great taste. Especially for this area of Philly. The menu is Steiger forward with no thrills- you get the basic Vietnamese favorites. It's a great spot for a quick bite or try something new!"
    },
    {
        "id": 13,
        "text": "Very small inside but clean and nice. I had chicken with broken rice, nicely cooked with some salad greens, tomato's on side. Big portion. Spring rolls very fresh tasting, not overly fried. Can't wait to try the Pho"
    },
    {
        "id": 14,
        "text": "I came here for lunch today and had a bowl of chicken pho. Never had anything better! The owner told me he marinaded the broth for 10 hours!! It is the best bowl of Pho I have ever had. Will come back to try the beef Pho the next time!"
    },
    {
        "id": 15,
        "text": "Great quality in their Pho broth! Very friendly owner as well. Solid pricing for the foods and portions. Hidden gem!!"
    },
    {
        "id": 16,
        "text": "We ordered the pho deluxe and it was delicious. The broth was wonderful and the portions were huge! We had enough for leftovers the next day. Highly recommend!"
    },
    {
        "id": 17,
        "text": "Fast service and great pho. The broth is really clean and has a good star anise and fish sauce flavor. Fresh garnish and steak, and would come back again. The inside is small and looks to be mostly take out."
    },
    {
        "id": 18,
        "text": "Very small space but there are a few counter seats which is nice when you want a quick bite. Pho is good and reasonably priced for the area. Would also recommend the Vietnamese coffee and spring rolls."
    },
    {
        "id": 19,
        "text": "Instead of Pho Mi, they should call this place \"heaping mountains of tasty food for really cheap. Just look at the photos of the food, they speak for themselves"
    },
    {
        "id": 20,
        "text": "These Phò devours come all the way from Phò Mi Rittenhouse express Vietnamese cuisine. This very small establishment is very clean and has a very upbeat update it feel to its presence. The owner is very nice and very helping very polite. This small establishment is very clean and very up-to-date with its technology. They offer only indoor dining and take out. The menu was very easy to navigate, and the food was very reasonably priced. While here, I ordered the Shrimp Phò. The shrimp were A nice size, and the broth was very flavorful. It was also fresh and me directly in front of me. This establishment made me very grateful. If you ever find yourself wanting some quick Vietnamese cuisine please stop bye Phò Mi restaurant  and tell them that Shimmy sent you! #philadelphia #seafood #philly #crab #shrimp #food #foodporn #foodie #foodstagram #foodphotography #foodblogger #lemongrass #water #broth #rittenhousesquare #express"
    }
]