[
    {
        "id": 1,
        "text": "Came here for lunch on a very cold day, convenient location right around the corner from my office. A had a few co-workers tag along so we ordered to-go.\n\nIt's nice they have two options for ordering, a self serve kiosk as well as though a cashier. We all opted for the kiosk. \n\nReally interesting the deluxe pho is the same price as all of the others. I found this as a bonus because I prefer multiple goodies over choosing only one protein.\n\nService was quick but we found ourselves waiting around for those who ordered bahn mi sandwiches. When we got back to the office everything was packaged great, no spills etc. I liked that they give you all the sprouts, noodles, basil etc in a separate bowl...however you'll find at the bottom of that bowl is a tiny plastic cup of hoisin. Not sure why they decide to hide it at the bottom, but some of my overeager coworkers poured their broth in before fishing it out!\n\nI was really happy with the pho I thought it was super flavorful and I will definitely be back soon!"
    },
    {
        "id": 2,
        "text": "I think the secret is now out about this place. The day I went, a Friday, it was packed with a big bunch of everyone, a lot of office workers, grabbing lunch.\n\nThis is a fast, spacious, bright, comfortable, spotlessly clean, well managed, counter-service local Vietnamese chain (also locations in Bryn Mawr and Springfield, Montgo. Co.). They take your order via touchscreen and serve reliable Vietnamese standards: pho, bun (vermicelli), banh mi, and broken rice plates. Service is friendly and speedy. Portions are on the large side. It's a little more expensive than the Viet dining options you would find on Washington Ave., but you're paying for convenience and speed. The pho is delicious, the vermicelli servings are generous and topped with crunchy fried shallots, and the banh mi are stuffed full of crunchy, brightly colored carrots and veggies. You can add on typical toppings like sriracha, hoisin, nuoc cham (fish sauce), and crushed peanuts. Everything looks even better in real life than on the touchscreen menus. Even if there's a bit of wait, it's still quick and definitely worth it.\n\nThis is a such a dependably tasty place to go for lunch, if you're anywhere near JFK Blvd. or Market, or on the west side of Center City, or even if you're visiting from out of town and walking up to the Parkway from the Rittenhouse area. For folks who live in CC or Fairmount, it's conveniently located across from Trader Joe's and easy to get to in just a few minutes by trolley from University City or West Philly. Thank God they opened a Center City location. I could pretty much stand to eat lunch here every day!\n\nIts location is convenient for daytime Vietnamese eats, but it would be awesome if a Vietnamese place like this were open during late-night hours around the 13th St. corridor, on the east side of Center City, or within walking distance of Center City bars. It would, I predict, make bank."
    },
    {
        "id": 3,
        "text": "New restaurant in the neighborhood. Finally opened on Saturday. We wandered in with high expectations. Good variety of Vietnamese food. Ample amount of food and tasty.  Good value."
    },
    {
        "id": 4,
        "text": "The best Vietnamese food by far compared to the typical Vietnamese food found on Washington Ave.  I recommend the spring rolls and the vermicelli with grilled pork.  There are also vegan options as well."
    },
    {
        "id": 5,
        "text": "Authentic, fast and delicious. \n\nHard to come by the traditional taste with proper broth, and fresh vegetables to compliment the quality of Flavor."
    },
    {
        "id": 6,
        "text": "Desolate. Uninspiring. Depressing. \nThe employees are very attentive and polite. I give them 4 stars. \nThe food? 1 star. Boring."
    },
    {
        "id": 7,
        "text": "It's so wonderful to have a delicious to go to pho place  around Logan square, now that I don't need to go to Chinatown for a good bowl of pho. I only tried their steak pho and summer rolls and they're pretty delicious compared to other great pho restaurants in Chinatown and south Philly. Minh is one of the owners and he was so kind. there were issues with my order but They provided professional and Great service and accommodated my issues. I will deff be back for more! I can't forget to mention that your order will come out really quick!!!! :)"
    },
    {
        "id": 8,
        "text": "Very good casual launch experience from start to finish.  Ordering was fast on a touch screen kiosk, and my food was ready within 5mins.  Seating area was clean and there was wifi and there were outlets available if I wanted one."
    },
    {
        "id": 9,
        "text": "This was a really good place to go for lunch. They were very fast in serving the food and you can order online in case you want the food to be ready when you get there. Seems clean and staff is friendly. It is a new place so hopefully service stays the same way."
    },
    {
        "id": 10,
        "text": "As someone who resides in the Logan Square neighborhood, I was happy to see Pho Street open its doors after being under construction for several months. At last, I can have some quick Vietnamese food within walking distance and not need to take the subway ride to Chinatown... or an even longer subway ride to Washington Ave. \n\nThe ordering kiosks were easy-to-use and it was fun to customize my bun or pho. Ample room to ease your way from the kiosks to the self-service station where you could grab some nuoc mam and other condiments. The staff was friendly and helpful, and they put a lot of care into each order they received (a lot of communication behind the kitchen line).  \n\nThe menu as of now includes pho, bun, com tam, banh mi, and goi cuon. I'm excited to see their menu expand in the next months to come as business picks up.\n\nI recommend their bun and pho. I liked being able to carefully choose the meats and toppings I wanted through the ordering kiosk. The bun was big and it was delicious with their house-made nuoc mam pha. The pho had a tasty broth that didn't need any additional seasonings. Lots of good pieces of tripe, beef meatballs, tendon, and flank steak. I did not try their com tam, but my SO did have the pork chop com tam. It looked quite tasty with generous portions of bi (shredded pork skin) and cha (egg meat quiche). I also tried their banh mi but something was off. The bread tasted bland/unseasoned and it made the rest of the banh mi tasteless even though all of the components were there. Not a deal-breaker whatsoever - maybe my taste buds were wonky that day.   \n\nLooking forward to see the continuing growth of Pho Street in Center City!"
    },
    {
        "id": 11,
        "text": "UPDATE AT BOTTOM!\n\nThe first time I came here, it was really good! The staff was nice and the food was really good!\n\nBut the last time I came, I went with my boyfriend and I had a bad experience with one of the staff members. We went up to pay with cash and the guy didn't even want to take our order; he asked someone else to. He took one look at us and I could tell he was upset. When he called out our number, we didn't hear him the first time and he got really angry. When we got up there, he was pissed and one of his co-workers said, \"Why are you getting upset over just one ticket?\" \n\nI really don't want to assume. It could've been anything; maybe it was because we're an interracial couple, maybe it was because my bf is a little older than me, maybe it was because my bf is a dwarf, or maybe he was just having a bad day. Again, I don't want to assume so I'm going to go with a bad day. \n\nHe was mean but the food was still good! :)\n\nUPDATE:\n\nThe owner reached out to me and has informed me that this employee has been let go. Please don't be turned off by this review because most of the people are SO nice and the food is really good. You get a lot of bang for your buck as well."
    },
    {
        "id": 12,
        "text": "The food was sooooo delicious. Definitely coming back again and bringing my family and friends.. totally worth it"
    },
    {
        "id": 13,
        "text": "This was exactly what I needed after a long workday. Nothing can restore you better than a good bowl of pho. And this was exactly I got at Pho Street.\n\nThe bowl of pho of huge (dare I say, yuge?). The pho itself was delicious. One of the best phos I ever tried.\n\nSome people complain about \"ambience\". Who cares about ambience when you have an enormous bowl of damn good pho to keep you busy?\n\nFive stars."
    },
    {
        "id": 14,
        "text": "Clean, on the big street, safe , big space,food delivery fast, delicious and no tips required; -)"
    },
    {
        "id": 15,
        "text": "Wow, now we can enjoy excellent Vietnamese food without having to drive down to Washington Ave. Loved the vermicelli... The pork and chicken were so nicely flavored and the portion was monstruous. \n\nAs a suggestion, though, I enjoyed the summer rolls on two occasions so far and would prefer a thicker more peanutty sauce if that is at all possible!  Thanks."
    },
    {
        "id": 16,
        "text": "So happy one of these popped up in Center City! This location is set up fast-casual style, so you order from a kiosk then pick up your food at the counter. The restaurant is huge and clean with plenty of seating, and food comes out quickly even during the lunch rush. My boyfriend and I like to meet here for lunch during the work week, and we'll split a bowl of tofu pho and a vermicelli bowl with pork. The portions are huge and reasonably-priced (roughly $22 for both) and we always leave stuffed and happy."
    },
    {
        "id": 17,
        "text": "If I could I'd give this place 10 stars. I come here so much that it might even be unhealthy. Who am I kidding, pho is never unhealthy for anyone.\nPros: it smells amazing. super fast service. Consistency in food quality. Not as Americanized as the other pho place around the area. Good quantity for the prices. Reasonable. They have WiFi if you ever need to work. Oh and the coffee is strong. What more could you ask for? \nCons: I honestly couldn't tell you a single one and I've been coming for about two months. \nTips: if you're new to Vietnamese food just ask an employee for a recommendation, they're always helpful in describing what is what and how everything taste. If it isn't busy play around with the kiosk like Another reviewer said the build your own option is the best because you get to pick and choose what actually goes in."
    },
    {
        "id": 18,
        "text": "My friend and I were trekking along Market street in search of a good place to eat. We passed Pho street, and it seemed like the most appealing option. Pho street has a simple interior design, with orange and purple colors - sounds funky, right? But it actually looks cool In person. \n\nStepping in, we perused the menu on the wall to the left, and made a selection. We placed our order via a touchscreen a little further back, and we ordered the beef noodle soup with eye round steak and brisket to share. There were other options to customize the soup (I.e. more noodles) or building your own pho from scratch. We waited for our order number to be called, which took about 10 minutes. We collected our soup with the fixings (bean sprouts, jalapeño peppers, and basil) and grabbed our spoons and chopsticks.\n\nFor starters, the pho was large enough to properly feed 2, so if you plan on having a bowl, come hungry! The broth was very tasty and light. The noodles were the perfect texture and I appreciated that they were generous with the steak and brisket - both of which were nice and tender. \n\nThis place was great for a for quality pho in a timely manner. Truly a pho-nomenal experience (okay I admit that was pretty terrible)."
    },
    {
        "id": 19,
        "text": "Quantity over quality. Big portions of pho but average tasting. While there is some sheen there isn't that delicious fatty sheen on really good pho. This place is like a chipotle for pho except instead of picking what you want through a case, you do so on a kiosk before waiting for your number to be called and receiving your bowl on a brightly covered tray. The atmosphere is a dorm cafeteria vibe. If you want real Mexican food, you don't go to chipotle. If you want real pho, maybe don't come here. Don't get me wrong it's still good but it definitely does not taste like the love put into some dishes in a real, hole in the wall delicious pho spot where grandma is in the back making the good stuff. If you're drunk or are aching like a fiend for some basic pho, this big bowl will do the trick."
    },
    {
        "id": 20,
        "text": "Not the same as china towns pho or all the Pho places by little saigon city on Washington ave. It's like you just can't have Spanish people cooking Italian dishes, this pho tasted blandish as if it was cook by Christmas elf's or something, the whole thing was just off. Not enough Ginger Spice lacks proper taste. Very bland."
    },
    {
        "id": 21,
        "text": "Really great addition to the neighborhood. Stopped in one day when i got home too late to cook dinner. Ordering from the kiosk was super efficient, food was tasty (we got Pho and Vermicelli) and packaged well for take out. Staff was even very friendly with my rambunctious, chatty three-year-old. \n\nWe'll be back. My only complaint is that I wish it was open on weekends, but the cashier told me they will probably expand hours soon. Fingers crossed!"
    },
    {
        "id": 22,
        "text": "Broth amazing. Eye round steak nice and soft/fresh.  They have all the condiments and sauces. Largest portion of pho I've ever had, I had to pack the rest to go. Will be back for sure."
    },
    {
        "id": 23,
        "text": "Amazing pho. You can order on a touch pad and customize your order any way you want. No more forgetting to ask without cilantro. Ordering for takeout is an option. Portions are huge, so come hungry. I think that's why prices are a bit higher than most typical pho places. Also the customer service is great and the place is very clean. There is also free WiFi. \nIf you're a tofu lover, the tofu pho is so good. Nice and soft."
    },
    {
        "id": 24,
        "text": "Great service and had a good experience.  Never had pho so really an overall great time. We ordered incorrectly and they still offered to remake it due to an allergy. \n\nWill definitely come back and try it again. Keep in mind the portions are huge so it's awesome."
    },
    {
        "id": 25,
        "text": "Tasty food and great prices. The service was also very pleasant. It's not a large place, and it isn't fancy, but it is perfect for casual nights out."
    },
    {
        "id": 26,
        "text": "Pork Banh mi was amazing!  My husband said it was the best sandwich he'd ever had! The pickled carrots and light crusty bread made it over-the-top good. Chicken pho was very good (but I'd prefer dark meat) and beef pho was excellent. Huge servings of pho. Bang mi was smaller. Lots of fresh Thai basil and bean sprouts for garnish on the pho Good iced Vietnamese coffee. Nice and strong."
    },
    {
        "id": 27,
        "text": "Everything I ever wanted from a Vietnamese restaurant. So glad they are here! Touchscreen experience isn't the -most- intuitive but that's hardly worth docking a star. Multiple visits show the food is fantastic and fast and perfectly priced. What's not to love."
    },
    {
        "id": 28,
        "text": "The spicy beef noodle soup is SO flavorful and had the perfect amount of spice. I got it to go and the broth came in a good pint sized container with the noodles, beef, bean sprouts, and jalapeños on the side. The portion was HUGE and lasted me 3 meals. I will always come here as my Vietnamese go to."
    },
    {
        "id": 29,
        "text": "I'm so happy more Vietnamese restaurants are popping up in center city! This place is a great addition to the neighborhood. It's conveniently located within walking distance of my apartment and similar in taste to the other places I like to go to in South Philly.  Staff is super friendly and prepare your order quickly. The restaurant itself is very large and clean.  Its turning into one of my favorite spots to get Pho. It's a little on the pricey side compared to other Vietnamese restaurants. However, that's true for all center city restaurants and the serving size is large. I'll need to come back for bahn mi and coffee!"
    },
    {
        "id": 30,
        "text": "Wow this place is great! The soup part of the pho is the best I've had, large generous portions. There is absolutely NO service, you don't even order from a person, so know what you're getting into here. Also, there's no hand holding, so I feel sorry for anyone attempting to navigate Vietnamese food for the first time. \n\nBUT, if you know what you're getting and you don't need a human cashier you are in luck. \n\nBeautiful spring rolls, tons of side garnish, and incredibly flavorful soup. I'll definitely be making this a regular lunch stop.\n\nI can't wait to try their Vietnamese Iced Coffee!\n\n--EDIT--\n\nTried the iced coffee: YUM!"
    },
    {
        "id": 31,
        "text": "I didn't expect any good vietnamese restaurant in center city since so many good one located in north & south philly. Therefore, I picked this place on a cold day just for the experience & to satisfy my pho craving but I was surprised with the Pho. It was so good. The meat, the broth, the flavor were great. \nAfter the good experience there, I returned the next day along with my coworkers this time. They tried pho & liked it a lot. I tried the broke rice with pork chop & egg quiches this time. It was not as great as other viet restaurants, so I will stick with pho next time. This is really a great place. Definitely coming back more often for my pho fix."
    },
    {
        "id": 32,
        "text": "Solid quality of food comes in very generous portion. I have tried pho, banh mi and vermicelli. All good experience. I am glad this opened up in city!"
    },
    {
        "id": 33,
        "text": "We popped in before our run to Trader Joe's (we have a rule to always eat before Trader Joe's-- or else it gets bad), and we were more than pleasantly surprised! The food is SO good, and the portion sizes are HUGE. When we got our pho, I legitimately was in awe. We got the pho, a vermicelli noodle dish with pork and egg roll, and a \"hoagie\" with pork- which was essentially a bahn mi. The food tasted fresh and the service was great! I 100% am glad to find a pho place in the city so I don't always have to make the trek to Chinatown! Will be back again and again!!"
    },
    {
        "id": 34,
        "text": "Great value for the portions of your food. Quick service and seating. It's super casual and a quick bite!"
    },
    {
        "id": 35,
        "text": "Fast,convenient , comfortable , and good. Sometimes you don't feel like dealing with going to Chinatown and Washington ave is too out of the way. The rest of the Vit places are bleh"
    },
    {
        "id": 36,
        "text": "Food is pretty good and portions are quiet big. The price is not very high and the food is worth the money! For the money you spend you get good food! Servers are nice too! Recommend the beef pho for sure :)"
    },
    {
        "id": 37,
        "text": "Very convenient, just bummed out it's not open on weekends. You order off of a kiosk; everything is customizable. Pho is unique, and definitely has a different overall broth compared to Pho 20 or Pho 75. It's pretty clean and meaty. Bean sprouts and other garnishes were fresh and well prepped. Good, quiet spot to grab a bowl of pho on the weekday."
    },
    {
        "id": 38,
        "text": "I always pass by this place, but I finally was able to try this last week. I have been to their Springfield and Bryn Mawr locations. I enjoyed the flavours from these 2 locations, usually a bit more in price range compared to South Philly, but when you are running errands in the suburbs and craving Vietnamese food Pho Street is a great option. The 21st street location is also convenient if you cannot get yourself to South Philly. Unlike the suburban locations this 21st location follows Honeygrow and other modern eateries - using smart screens to order and pay for the food. I don't know how others feel about Pho Street's screen, but I personally felt it was a bit difficult to maneuver compared to my experiences at Honeygrow and other places. It also had difficulty processing my credit card so I had to manually punch in the numbers. \nThe food came out pretty fast, and the flavours were also good. I like the fact that you can customize the ingredients for your dish. \nAside from the screen, I was turned off by the dirty tables, and tray rack area where you are supposed to take your tray when you are finished (like IKEA). When I sat down to eat the rack was full, but it wasn't bad. By the time I was done it was overflowing... The table I sat had built in hot sauce where I had to rub really hard with a baby wipe to clean. The tray rack area was a mess, and since the rack was not cleared people just put the trays on a counter where the screens were (to order and pay). \nThere were only few tables occupied so they weren't that busy to wipe the tables and clear the rack. I want to give them the benefit of the doubt, so I probably will go back again and see what happens."
    },
    {
        "id": 39,
        "text": "Pho, summer rolls, iced coffee, vermicelli, broken rice plates, all the staples in a quick-service format. Mid-priced and great for lunch. Come right when they open at 11:30 to beat the lunch rush.\n\nNew digs with a clean restroom. For now."
    },
    {
        "id": 40,
        "text": "The food here is great. The problem is the customer service. They don't answer their phone. I tried several times to place a 'take out' order. Finally when my husband decided to order via the yelp app (or it could have been another delivery service app...I don't exactly recall) when he went to pick up, the person behind the counter yelled at him about how yelp, and other delivery options online except for their own website take 20% and from now on we should only order via their website. Ummm....how is this our problem or fault? As a business owner myself that's the cost of doing business. Again their food is good but I will never go back considering how rude the staff was. Also who yells at a customer for trying to give them business? And for the record, pick up your phone so people can make a order and not have to go through your own website. There are plenty of other amazing pho places in town willing to take my money and not yell at me or anyone for using a 3rd party food ordering service."
    },
    {
        "id": 41,
        "text": "Went here with a co-worker.  We were afraid it wouldn't be good, but to our surprise it wasn't bad.  They use a kiosk service that you order your food through and pick up from the kitchen.  The service was fast and easy. It's almost like instant pho ordering. Loved that! They didn't have different sized phos so they're all a medium/large.  Also all the pho are the same price = $11/bowl.  The only con I could find is that it was a bit pricer than your typical pho shop, but then again i guess where it's located could factor into the pricing. Overall, the experience was good and the pho was yummy."
    },
    {
        "id": 42,
        "text": "Absolutely amazing food. 100% recommend the chicken & broken rice and spring rolls. Hidden gem in Philly!"
    },
    {
        "id": 43,
        "text": "Very impressive pho. The place is new, clean and spacious. There are over 20 tables. They have a modern form of ordering, with intuitive computer screens for ordering and paying. I approached and ordered a large pho with rare steak and meatballs. My pho was ready in about 5 minutes. The pick up counter was up a ramp behind the ordering screens. I picked up my giant bowl of soup, and found one of the many tables in the spacious seating area. I really enjoyed the pho here. The broth was tasty and not overly greasy. The portion of noodles and meat was awesomely huge. I managed to finish my bowl, because when it comes to pho, I got no chill. But I was full for a long time. Nice addition to market street!"
    },
    {
        "id": 44,
        "text": "Underwhelmed. I really don't have too much to say about it. \n\nIt looks new and modern. The pho didn't really have a taste like I expected. Pretty disappointed tbh."
    },
    {
        "id": 45,
        "text": "Curb your enthusiasm, because this place is pretty good. Pretttttttty, pretttttttttty, pretttttty good. The Grilled Pork and Spring Roll Vermicelli is excellent. Need I say more?"
    },
    {
        "id": 46,
        "text": "I wish the food here took a little longer than 5 minutes to make just so the flavors were melded together. As far as pho goes this wasn't bad. It just wasn't the best pho I've ever had. It tasted thrown together, and like I said, not melded. The service was very fast which was a bonus but I'm not sure if I'd go here again should I want a bowl of pho"
    },
    {
        "id": 47,
        "text": "Such a welcome addition to the neighborhood. The chicken pho was particularly tasty, with lots of well prepared white meat chicken. The beef pho was also good, as were the summer rolls.  And a friend had good things to say about the rice vermicelli with roast pork. A nice room with plenty of space to spread out.  Check it out."
    },
    {
        "id": 48,
        "text": "We absolutely love this place! The pho broth is delicious, the noodles are awesome, the shrimp is fabulous, and the staff is always so friendly and helpful.  Highly recommended for a tasty lunch or evening meal, even better if it's cold outside!"
    },
    {
        "id": 49,
        "text": "I tried the brisket pho was seasoned right. They give plenty of basil. The service is fast and friendly. You get to build your pho, and the screens are user-friendly. Be prepared to take leftovers. I got a free roll! I spent around $11"
    },
    {
        "id": 50,
        "text": "Great fast casual spot! You may think $11 for a bowl of pho is a lot, but it is so worth it. Huge portions and absolutely delicious. The banh mi (listed as Vietnamese hoagie) is $7 and also more than worth it. The staff is super friendly and gracious and the spot itself is spacious and clean. Definitely check it out!"
    },
    {
        "id": 51,
        "text": "I ordered the Pork and Chicken Rice Vermicelli, crispy spring rolls, and Vietnamese coffee. I really like that you can customize everything with the self-service ordering feature so you may avoid what you don't like and double-up on what you LOVE without the difficulty and challenge of a language barrier. The coffee wasn't sweet enough but my personal preference tends to be on the sweet side of everything. The spring rolls were very delicious as was the rice vermicelli. The mean was tasty and there was a nice balance of mint and cilantro. All the fresh produce was bright green, not brown at all like some other Vietnamese fast-food restaurants. Overall a great experience and delicious food."
    },
    {
        "id": 52,
        "text": "I love everything about this place especially the customize your own pho; the bowl size was huge and broth was excellent!!  The kiosk ordering system was especially cool, the dining area was clean and spacious, and the service was excellent.  Highly recommended!!!"
    },
    {
        "id": 53,
        "text": "Kick ass, super tasty and super satisfying pho! I love the touch-screen ordering and the price point is ideal. Great for a casual bite,"
    },
    {
        "id": 54,
        "text": "Great lunch by the office.  Walked over to this clean, big and well organized operation.  Ordered and was on my way in less than ten minutes for take out.  The Pho Chicken was delicious.  Filled with tons of meet and veggies with a tasty broth.  Cilantro, jalapeños and bean sprouts added great flavors.  Noodles were plentiful and hit the spot on a cool spring day.  Worth a try."
    },
    {
        "id": 55,
        "text": "There are 3 stations where you place you order and then you wait to pick it up. It's very spacious and beautiful and clean. The portions were very big and with those prices it's a total deal. \n\nThe pho ready in 10min and it had meatballs in it. The broth was very hot and taste. There was a slight sweetness to it. \n\nThe vermicelli took a little longer to come out. Maybe 3-5 later. It has lots of veggies and I could not finish it all. \n\nIt's a great deal. You can totally stop by and get a nice hot meal."
    },
    {
        "id": 56,
        "text": "Great pho in the middle of the city! Soup is very addicting and satisfying. Owner Is very friendly and nice! Their spring rolls are the best I've ever tasted so far. But why 4 stars? If they only had better meat quality and selection, that would have been awesome! I like flank but they don't have it. Sometime I can notice the frozen taste on the meat."
    },
    {
        "id": 57,
        "text": "Easily the best pho I've ever had! The portions are huge, so the $11 pho ends up being two filling meals. The broth is so flavorful and everything tastes incredibly fresh and vibrant. The guys there are super friendly and personable. I will definitely be back!!"
    },
    {
        "id": 58,
        "text": "I ordered take out from this place twice and it was excellent. I love their veggie summer rolls! they are fresh and super flavorful. My partner had a rice dish and a vermicelli one and he was very happy about it. We were both impressed by our fresh the food was! We ordered it online and the food was already waiting for us when we got there! definitely a place worth trying."
    },
    {
        "id": 59,
        "text": "Like the fast food pho place, easy order and nice flavor. Price is reasonable. Summer rolls are always my favorite"
    },
    {
        "id": 60,
        "text": "Sirloin pho with added shrimp and vegetarian spring rolls. Everything was delicious, but they didn't get my side orders of sauces quite right. Everything was packaged perfectly to go!"
    },
    {
        "id": 61,
        "text": "I came here with a couple of coworkers around noon. It's much bigger inside than it appears from the outside. They have touch screens to order if you are paying by card and there was no wait to order. It is very reasonably priced - I got the plain pho for just $7.50. It was a decent wait until they called my number. Both my coworkers got sandwiches and that took 3-5 minutes longer. Definitely a lot of people waiting for food. \n\nIt was my first time having pho (rather than ramen). It was okay. Just noodles and bean sprouts really. They also give you lime wedges and jalepenos which I opted not to use. Portion size was good. Worth a shot once but I don't think I'd go back."
    },
    {
        "id": 62,
        "text": "I just waited 40minutes for a simple chicken pho. And they call themselves pho street. If you are hungry and want pho, don't go to pho street. All I got was a simple, \"we are backed up\" - unreal."
    },
    {
        "id": 63,
        "text": "Not sure when this place opened, but I was really glad to find it after searching Center City for pho and nothing came up I suddenly came across this joint...meant to be - delicious, fast service, clean and pleasant atmosphere."
    },
    {
        "id": 64,
        "text": "Pho is solid. We do delivery from them at least once a week. They're not cheap on the meats and veges, which is super nice cause Viet meals usually come with a garden. They're bang in is pretty good. Can't say their rice dishes are great."
    },
    {
        "id": 65,
        "text": "Pho Street is very unassuming. The decor looks a little sterile and weirdly corporate. It reminds me of one of those corporate office cafeterias with fake \"ethnic food\" because of the largeness and lack of \"asian\" decorations. I suppose it really caters to the business lunch crowd. I came after noon on a weekday and it was not super busy - maybe being newer. The appearances are deceiving. I was very surprised at how great the pho was! \n\nYou order at these little screens which take credit/debit in the back part of the place.  The food gets out very, very fast in 5-10 minutes. Then you get your order at a raised area further back in the place. The pho itself looks great and the first thing I noticed was how MASSIVE the bowl was. I ordered the Pho deluxe ($11) but looking around you can see that the bowl is normally that size. It can seriously feed two people. It was great value so much that I felt a little wasteful because I couldn't finish it.\n\nEach of the ingredients was plentiful and they do not skimp on the beef slices nor the tripe. I had those beef ingredients AND beef meatballs. It was really satisfying. The broth itself was great too. Very, very savory without being too salty and heavy - and even a slightly sweet note. The nice sliced onions were perfect too. The veggies on the side were pretty typical and again given in large portions. The noodles themselves were great too - though a little bit clumpy.\n\nOverall I would love to come back again and try the other menu items."
    },
    {
        "id": 66,
        "text": "Went for lunch for the first time today. It's been so cold that I was really craving pho. This place is great! They have a variety of Vietnamese food including pho, broken rice, rice vermicelli, banh mi, and spring/summer rolls. There is a large area for seating and you can either order on a screen using a card or go to the counter to pay cash. I got the deluxe pho without tripe. It came out in less than 5 minutes and it is HUGE with tons of meat! It cost $11.50 but I will easily get two meals out of this generous portion. I suggest bringing a box for leftovers or you can always ask for one at the counter. The staff is very friendly and efficient. It is also very clean and there is an area to bus your trays and a bathroom inside. I will definitely be back to try the other menu items!"
    },
    {
        "id": 67,
        "text": "Pho Street helped warm me up on one of the earlier days of winter. The atmosphere is very open and the ordering is streamlined through a touch screen pos system. I had the chicken pho that was served in a very large bowl filled nearly completely with broth and very few noodles or chicken. The pho itself was par and the interior/atmosphere was sub par resembling a clean fast food chain. Though only three blocks from me, should my craving resurface I will probably venture elsewhere. If you're in the area and looking for quick food or a place to warm up, it may be worth your money."
    },
    {
        "id": 68,
        "text": "Generic pho but satisfies a craving in a pinch.  Ability to customize the pho via the computer screen is a nice option.  Spring rolls were crazy greasy.  Broth is ok but not that flavorful."
    },
    {
        "id": 69,
        "text": "Had an hour to kill at 30th St Station so I walked over to grab a sandwich! I had the Vietnamese hoagie. Crisp veggies, perfect bread, great flavors! The machine where I placed my order was fast and easy to use, and my sandwich was ready to go in 5 minutes. I saw the soups and vermicelli bowls going by and they looked great (and, like the sandwich, appeared to be very  generous portions.) Recommend if you're looking for a quick lunch."
    },
    {
        "id": 70,
        "text": "Delicious pho, fast service and great space. I've never done fast-casual pho and I have to say I'm a fan. I stopped in here for lunch one day and got takeout which was packaged pretty well (all separate) and held up for transport, walking a few blocks.\n\nThe price is great and I really liked the ordering screens - if you know what you want it can be really fast, or if you want to peruse for a few minutes you can do that too. There were also a lot of pictures so you can see what you're getting - if you haven't checked yelp first!"
    },
    {
        "id": 71,
        "text": "We pick up from here about once a week sometimes twice. It's hot, fresh, tastes great. You can customize just about anything. Sandwiches are great too! Used to have a ton of people eating in there. Now super quick, easy and clean to pick up!"
    },
    {
        "id": 72,
        "text": "On cooler or rainy days, I tend to crave soup or soup noodles. Pho Street does not disappoint. The ordering on touchpad was simple, it came out quickly and the portion is HUGE. The bowl for the pho is bigger than my head with generous amount of meat. About half of it is soup but it will still fill you up even if you don't drink much of the soup. It is hot and tasty, can't really ask for more.\n\nIf I must nitpick, you have to manually enter the credit card number instead of slide/insert, so if you are paranoid about people seeing your credit card number....well. Anyways. Do not come if you want a small/light bite to eat. Come if you are hungry or craving soupy hot pho."
    },
    {
        "id": 73,
        "text": "Loved this place!  Open modern with good pho!  Easy ordering and super friendly.  Highly recommend,  great flavor"
    },
    {
        "id": 74,
        "text": "So wandered in here on a random Tuesday. I wasnt expecting too much, but god damn are the banh mi good. HUGE sandwich, and really cheap. They put it on a class cheesesteak roll which is a little different from the french bread im used to, but it works. Great flavors, efficient service, and dirt cheap prices make this a must try if downtown"
    },
    {
        "id": 75,
        "text": "Delicious, fun and way too much food. Pho Street is a cafeteria style self serve self clear Vietnamese fast-food restaurant featuring the classic Vietnamese favorite dishes of pho, broken rice and bun style dishes. They don't serve classic Vietnamese coffee just the ice coffee pre-mixed version.\n\nService - automated 4/5\nIt's a little confusing b:c the entire menu isn't posted anywhere and the payment process is a bit awkward. You order through a kiosk and then wait for your number to be called. I recommend staking our the tables closet to the serving area because those bowls of steaming soup are huge and the ramp taking you to the main dining room daunting when attempting to walk down the ramp with boiling hot pho.\n\nHuman Service :) 5/5 \nThe human part of the service is when they call your number and you pick up your order and they're very nice there. \n\nFood...\nPho with eye round & meatballs 4/5\nThe soup was flavorful and the eye round was good. The meatballs are quite tough and rubbery. I'd probably not order the meatballs again.\n\nPho with brisket, eye round & sirloin 4/5\nBestie ordered the above and she enjoyed everything except the brisket which was well overly brisket-y.\n\nIce Vietnamese coffee 3/5\nThe t only full the cup halfway and at $4: serving that's like a $1/1.5 oz which is steep especially since it's not made to order and reminded me of melted coffee ice cream good but not $4 good. We could have gone across the street to Trader Joe's and purchased a pint of coffee ice cream for the same price. \nIf we go back one order of soup I'd more than enough for two people so next time we will share it. \n\nSo if you avoid the brisket, meatballs and ice Vietnamese coffee and stick with the other options you'll have a 5/5 experience."
    },
    {
        "id": 76,
        "text": "Try: Deluxe Pho with an Iced Vietnamese Coffee!\n\nWhy: On a cold rainy winter day this really hits the spot! I thought the broth was flavorful and appreciate they were not shy on the eye round steak, brisket, meatballs, tendon, and tripe. \n\nNotes: We came for lunch and really liked the convenient digital ordering. The food came out in less than 5 minutes, which is helpful when you're limited on time needing to head back to work. It was a modern fast food style Vietnamese restaurant, which was a first for me but I liked it. We also ordered Crispy Spring Rolls, Shrimp Summer Rolls, and a Vietnamese Hoagie (Banh Mi). They were good. I did think the Hoagie was light on the meat but liked the peppered pate. The soda machine and condiments were by front entrance. The napkins and utensils were actually separate in front of bathrooms next to tray disposal. The bathroom does require a code. They also share space with an Auntie Anne's."
    },
    {
        "id": 77,
        "text": "Finally a pho restaurant in Center City! I've been waiting for this for the last 7 years that I've worked here. I've eaten the Pho here and I would say it's just as good as the Pho restaurants in Chinatown but not nearly as good as the ones on Washington Ave or Adam's Ave.\n\nIf you need a quick Pho fix, this will definitely do the trick.\n\nThe price is 100% reasonable at $11 (after tax) for a bowl of Pho.\n\nWill be coming back on the regular."
    },
    {
        "id": 78,
        "text": "Came here for lunch with an old coworker of mine and it was a pleasant experience. Ordering is made easy on the touchscreen pads and I could take my sweet time agonizing over what I wanted. \n\nMy friend and I both got vermicelli since it was a hot day and we were not feeling a hot steaming bowl of pho but we saw plenty of other people eating it (Asians too which is a pretty good sign to me that it's actually good and somewhat authentic). The vermicelli was good! Crisp and fresh ingredients, pork was marinated and seasoned well, and portions were very generous. I am not Vietnamese and cannot attest to how authentic it was but I will say it is comparable to the vermicelli I usually order in Washington Ave where there are a lot more Vietnamese establishments. \n\nPrice was very reasonable. My friend got the shrimp summer rolls but she didn't like them much (as I don't like summer rolls in general, I did not even try them). The basil they use is quite overpowering. Other than that, really no complaints about the place. Good lunch place to hit up if you're working in the area and craving Vietnamese."
    },
    {
        "id": 79,
        "text": "Go to weeknight place as they are open til 9. They started out solid when they opened a few months ago but their pho noticeably improves from good to great - one of my favorites now. Delicious with huge portions super fresh and affordable. I love coming here by myself on a weeknight and grabbing a quick bowl."
    },
    {
        "id": 80,
        "text": "Ehhh... what can I say? Houston has way better Vietnamese food (and cheaper). \n\nI came around lunch time, there was only 2 people in the restaurant. We order at the kiosk, and go to the front to pick up the food. \n\nThe most shocking part was that spring rolls costed $6 for 2. Man... I've never paid so much for spring rolls! It did come super thick though lol. My boyfriend did not like his banh mi at all, the bread was different (started with a H), there was A LOT of pickled carrots, it masked the whole flavor of the banh mi. He ended up throwing away 2/3 of it. I had the rice dish, it was average I guess."
    },
    {
        "id": 81,
        "text": "I have gone here countless times since they have opened in my neighborhood! The place is huge. You start by ordering on computers towards the back and pick up at the large counter in the very back.\n\nThis place is perfect for a quick pick me up or a tummy warmer in the winter. I usually order the pho with shrimp or the pork bahn mi. Though I love this place and will not stop going, their depth in flavor could be better. The many viet places I go to in San Francisco (my hometown) have a deeper flavor to their broth."
    },
    {
        "id": 82,
        "text": "Fast Food pho, it's a thing now.\n\nThe program they have on the touch screen kiosks could be a bit more advanced, but for opening pretty recently, it'll do.\n\nYou can customize your pho and summer rolls and other dishes which is nice. I got the brisket and eye round pho with extra cilantro and grilled pork and shrimp summer rolls without noodles which i loved (for those who are trying to eat less carbs)\n\noverall service was fast and pho broth was good. but i definitely have some constructive points for the staff to take into consideration\n\n1) there needs to a better \"dine in\" option. this place is pretty huge and unless you're sitting and waiting right next to the cashier you're not going to hear your number being called. either having some type of big screen announcing the order number or one of those vibrating buzzers will be useful when this place is more crowded and more people are dining in.\n\n2) walking down their ramp with a huge bowl of hot pho is not my favorite thing to do. i felt like i was going to slip and fall and drop this big bowl of pho on the floor or worse on myself. i think patrons would appreciate it more if maybe someone on the staff could carry the pho out or provide smaller but deeper bowls so the quantity of the pho doesn't change\n\n3) the meats in the pho were perfect. brisket was tender and eyeround was a bit chewy but flavorful. the grilled pork however was not as juicy and very thin from what i'm used to. i think for the price, it should be juicier and not as thin since the price matches most viet town restaurants.\n\n4) summer rolls were a bit dry by the time i got them. the rice paper was almost completely dry which made the eating experience a bit weird. i would definitely recommend that they use very hot water to moisten the rice paper so that it doesn't dry up too fast.\n\nAll in all, I think this is a great concept, almost like a panera for pho, and with some minor improvements it can be a 5 star dine in experience."
    },
    {
        "id": 83,
        "text": "Pho Street is a block from where I work and I've always loved Viet food (especially Pho).  Once I heard they were open, I made it a priority to get in and check them out.  They rewarded my early visit with a free summer  roll!\n\nWalking it, you see they have plenty of space to work with. It is all clean and organized so you can order from a pair of terminals (if you are paying via credit).  I chose the Pho Deluxe but have to say it I wasn't quite sure what was included to make it Deluxe at the terminal.  I was able to customize my greens and make other requests for my dish.\n\nI'll be honest, their pho was probably only 3-star worthy.  My noodles initially seemed too hard and I had to let them soak in the broth. However, their summer roll was amazing - both well packed and tasty.  Staff and their service was friendly as well.  Netting it all out at a 4-star for now and planning to get back to check their broken rice dishes."
    },
    {
        "id": 84,
        "text": "Was hesitant because of the fastfood look. Quickly became my favorite Viet restaurant in Philly. (I am Viet so I know). Decent portions, authentic flavors and fast, clean service. What else do we want? I had a com tam (broken rice with pork chop), and it was on point."
    },
    {
        "id": 85,
        "text": "I really enjoyed their pork bahn mi, which they call Vietnamese hoagie, a nice way to explain it to those who are learning more about Vietnamese food. The bahn mi was a foot long with balanced amount of pork, carrots, cilantro, and cucumber with sauce. Nice, clean place. Staff was friendly. Def going back for more and to try their pho."
    },
    {
        "id": 86,
        "text": "Just had the most delicious avocado smoothie!! The perfect not too sweet treat and very filling! I also ordered the summer rolls and they were extremely fresh! Extremely fast! Great take out experience overall!"
    },
    {
        "id": 87,
        "text": "Solid fast casual Vietnamese spot. I've been several times now since it's around the corner from my place. The spring rolls and pho are both delicious! Large portions make it easy to save some for leftovers. Love the touchscreen ordering system and friendly staff. Not quite as good as the real deal on Washington, but very good!"
    },
    {
        "id": 88,
        "text": "We all really enjoyed Pho Street. We didn't plan our visit, but were happy to have happened about this place. It's casual with plenty of seating and you can order at a kiosk, which is much appreciated.\n\nI did a quick scan of the reviews to know not to order the pho. I ordered the grilled pork vermicelli bowl (bun thit nuong with cha gio), my sister had the Vietnamese hoagie (banh mi thit nuong), and my brother-in-law ordered the broken rice (com tam) with a cha gio side. Everything was excellent. The pork was super flavorful and there were tons of fresh vegetables and herbs in my bun. My sister said the bread on her banh mi was great. And my BIL loved his perfectly cooked and delicious com tam. We all appreciated the crispness of the cha gio. Even my baby niece enjoyed the vegetables we gave her. I love that they have a house-made fish sauce, which add depth to everything.\n\nI'd stop here again if craving Vietnamese in Center City."
    },
    {
        "id": 89,
        "text": "Maybe it's better for dine in. Soup was delivered in a plastic bag. All the soup is sitting in a dirty plastic bag because the cup was broken. Seriously. Good job. Thanks for the inedible food."
    },
    {
        "id": 90,
        "text": "The food's got big portion pho sho but the quality is meh. The noodles kind of broke into small pieces. The other add-ons are good. Not too expensive compare to other restaurants in center city. \n\nThe Vietnamese ice coffee is good, just a bit too sweet."
    },
    {
        "id": 91,
        "text": "We went to Pho Street on our last visit to Philly (pre-COVID), and I've often found myself wishing we had a casual Vietnamese spot like that near our apartment during the pandemic. The food was tasty, the portion sizes were generous, the prices were reasonable, the people were nice, the dishes were packaged well for takeout, and back when we went, there was a large, spacious seating area.\n\nWe ordered a lot (for two) during our visit, trying out the shrimp summer rolls, pho, rice vermicelli, and banh mi (Vietnamese hoagie) with cold cuts. What stood out was that all the vegetables and herbs were really fresh. Out of everything we got, I liked the rice vermicelli with pork and spring roll (which also came with bean sprouts, lettuce, mint, cilantro, pickled carrots, peanuts, shallots, and scallions) the most, and it's been one of my favorite versions of this dish so far. Hoping we can return for more tasty Vietnamese food whenever we next visit Philadelphia!"
    },
    {
        "id": 92,
        "text": "Okay there is something to be said about fast food but Pho? I would say no. This Pho Street location is a cafeteria. Self-order and self service. I think I'm okay with self reliance but the taste of pho-fast- food is not what the Pho founders intended. When you walk into a pho restaurant your stomach should sing because the smell of a pho is just so delicious. Not here. \n\nMy bowl of pho is full of overcooked noodles, a few strands of beef, chewy stripes, and dark looking meatballs. The broth? Yes, the broth was tasteless. \n\nI applaud the idea making Pho easily available and fast but if you don't retain the taste then it's meaningless."
    },
    {
        "id": 93,
        "text": "Wow! I've been eaten a reasonable amount of Vietnamese food, and never have I tasted anything this good. It was out of this world. The pork and spring roll vermicelli was absolutely the best. I will without a doubt be eating here again. \n\nThey also have the benefit of having a touch-screen ordering system. It makes it fast and easy to get your order in the system. \n\nI'm looking forward to my second trip."
    },
    {
        "id": 94,
        "text": "It wasn't bad, but it certainly wasn't authentic. Then again, I am used to viet food straight from chinatown or my mom's kitchen. We got pho and two different rice dishes. The rice dishes were alright -- the pork chops themselves had a good flavor but everything else (the sauce, egg quiche, and whatever that weird powdery brown stuff was) was left uneaten because it simply didn't taste good. The pho broth had a good flavor but was a bit bland. We got takeout and over 50% of the bowl were veggies (mostly bean sprouts) instead of noodles."
    },
    {
        "id": 95,
        "text": "I like that there is a Vietnamese spot in this area but I'll most likely trek to another place further away as their pho just wasn't doing it for me. It was good enough to warm me up during this crazy weather that's been hitting Philadelphia but otherwise eh.\n\nI loved the screen ordering concept but I wish it was in Vietnamese as well since I'm just used to those names. My only major complaint is that I had to bring my own bowl to the table. That was kinda stressful as I was nervous I might trip and drop the whole tray of hot soup on myself.\n\nI might possibly return and try their rice dishes one day."
    },
    {
        "id": 96,
        "text": "This was a fantastic place to dine when it opened.  The food is great, fresh, and different - but pretty pricey.  I always get take out and lately, they are short changing orders.  People in my office have noticed the same thing.  I ordered Shrimp Fo which comes with 4 shrimp, so I paid for 4 more because we were splitting it.  I came back with 6 shrimp, not 8.  I ordered Shrimp Spring Rolls which used to be 3 in an order, I came back with 2 for the same price.  Sometimes, they are out of ingredients, but they don't tell you that when you order.  Many dishes are not the same and pretty meager if they are out of bean sprouts, mint, cilantro, or other ingredients.  Oh well, it was great while it lasted......."
    },
    {
        "id": 97,
        "text": "I placed an order for pick up. The order was ready in 2 mins.\n\nThere packaging is ordinary. No real difference in packaging from a cart on the street. I ordered broken rice with chicken. \n\nIt was as simple as the name sounds -- pieces of grilled chicken on the side with a fistful of white rice and some salad.\n\nMay be the experience is different when you are sitting in the restaurant as eating.\n\nI would also like to add that what you pay is what you get completely applies here :-)"
    },
    {
        "id": 98,
        "text": "take-out was packaged perfect so no leaks. tasted so delicious. picked-up and it stayed hot well past me getting to my destination."
    },
    {
        "id": 99,
        "text": "This place is GREAT!! I got the Chicken noodle bowl and it was HUGE!!!! It's enough for 2 people really!!! Highly recommend ... very clean\n\nThe only thing I wish was that they offered \"add ons\" like meatballs etc like some Phi places do"
    },
    {
        "id": 100,
        "text": "Ordered take out and requested a specific pick up time. When I got there a few minutes early, my food was ready to go. I ordered Pho with Shrimp and chicken. The broth was delicious!!! Very little shrimp though. I literally had just 3. The flavors were so good I looked past that part. I will definitely be going back again."
    },
    {
        "id": 101,
        "text": "Fresh and full a flavor. PHO bowl so big you could share it with others.  Atmosphere is really clean and relaxing"
    },
    {
        "id": 102,
        "text": "Pho Street is one of my frequent go-tos for quick, reliable, and delicious takeout! Service is fast and portions are huge! I usually get the shrimp spring rolls which are super fresh and the chicken/pork vermicelli which usually lasts me a couple meals. The meat is always perfectly flavored and cooked. The pho is consistently good as well and my go-to on a cold evening - coming from the Bay Area, I've had better Pho, but the Pho here is definitely solid for Philadelphia! Tip: fill up with extra peanut sauce at the side counter for the spring rolls!"
    },
    {
        "id": 103,
        "text": "Ok, I need to infuse a small dose of reality here. The pho is good and I would willingly come here again, but it's not 5 stars good (though keep in mind that Little Saigon in Orange County carries the standard for me).\n\nCame here at lunch with some co-workers and the place was packed - we were lucky to get a table. You have to order at a somewhat confusing kiosk and if you need an itemized receipt you have to ask the person manning the pick-up counter - there is no table service.\n\nI ordered the pho with beef and meatballs. Flavor was decent, though I would probably pass on the meatballs next time. Happy that they had all the necessary accoutrements for a satisfying bowl of pho - bean sprouts, basil, jalapenos, sriracha, and hoisin. Vietnamese iced coffee was good. I imagine I'll be coming here fairly regularly in the future."
    },
    {
        "id": 104,
        "text": "Plenty of seating, super clean and convenient kiosk ordering. Not sure about the people who are griping about prices and portions here. 2 bigass summer rolls ($6) and a pho the size of my head ($11) were more than enough as well as a perfectly delicious lunch on a chilly Philly afternoon"
    },
    {
        "id": 105,
        "text": "After entering the building, my friend and I immediately appreciated how spacious the restaurant was. Ordering at the kiosk was also very simple, but there seemed to be no way to find exact ingredient details for menu items, so it felt risky to order the deluxe pho (e.g. which meats are included?) It definitely felt comfortable to dine in given the emphasis on physical distancing and minimal contact. \n\nWe ended up ordering shrimp + pork summer rolls, deluxe pho (it seems like the extra meats included were beef tendon and tripe) and eye round steak + beef meatball pho. My friend and I both found that though the food came out pretty quickly, the stuffing in the summer roll and the beef meatball (strange taste that differed from what I am accustomed to) did not seem fresh. Additionally, the summer roll was dry and difficult to finish. \n\nThe $11 pho price was pretty reasonable given the large size of the bowl. $6 for the rolls seemed too overpriced. Other reviews seem to compliment the freshness of the food, so perhaps my experience was just unlucky or a result of dining in around noon/lunch time rush."
    },
    {
        "id": 106,
        "text": "The ordering system UI is actually soooo outdated here; we had to literally input our credit card information manually after the card reader didn't work! I feel like my data isn't safe lol. Besides the dire need of a technology upgrade, the food is decent and the portions are huge. It's definitely not one of the best phos i've had, but a good meal nonetheless. Service is pretty fast too. Summer rolls were good and really big ($6)!"
    },
    {
        "id": 107,
        "text": "Wow, it's actually pretty good. The restaurant decor  is clean minimalist and modern. With tons of seating (In fact we were the only one :p).\n\nU order with a touch screen computer at a specific area than pick it up once done. You are able to make various changes via the screen.\n\nThe broth was actually very good and flavorful even without the usual hosin sauce and hot sauce. The eye of round (raw beef) was put in the soup which I didn't like since usually those are served on the side or on top so it's barely cooked. U are also able to add tendon. \n\nOverall a pretty good experience and the pho was fairly good."
    },
    {
        "id": 108,
        "text": "Pho Street is a large and spacious pho restaurant right next to the fire station on Market Street. I ordered takeout here through Yelp (fulfilled by Grubhub) a week ago. To be honest, I'm not sure takeout pho is a good idea. It comes in all these tubs and you need to mix everything yourself - it doesn't stay as hot, and it gets kind of messy in your home, and it's just not the same eating experience. I think the pho here would be good for dine in, but just keep in mind it's trickier (and not as appealing in my opinion) as takeout or delivery."
    },
    {
        "id": 109,
        "text": "I had the chicken and bbq pork summer rolls and they were both delicious. I also had the grilled chicken hoagie and that was also good. The main reason why I am giving this place 3 stars is because of the shredded pork hoagie. I got it home and after taking a bite I thought they had put vermicelli noodles in my sandwich. It was the most disgusting texture. I called the store and they told me it was shredded pork rind aka pork skin. I wish they had put on the menu that it was pork rind as I would have not ordered it. It totally grossed me out and had to throw it away."
    },
    {
        "id": 110,
        "text": "Yawn.  Another Pho Street location, another place to get reasonably-priced, delicious Vietnamese food.  The people are always friendly, too.  We are regulars at their Bryn Mawr and Springfield locations.  The food is the same at all three locations I have visited (one of my kids has visited four).  \n\nI usually get shrimp summer rolls and shrimp pho.  The food is always flavorful and fresh.  It's better than a couple of places in Georgetown DC that are known for pho, too.  I highly recommend it."
    },
    {
        "id": 111,
        "text": "Great food, I order take out from here often. My go to items are the vermicelli noodles with pork or chicken. The ban me is also pretty good. I like the flexibility with the online ordering, they let you add and subtract different ingredients to customize almost any item on the menu."
    },
    {
        "id": 112,
        "text": "I really like this Vietnamese venue. There's also a location in Springfield PA, but that location is full service with waiters. I like the Philadelphia location for it's quick order yourself kiosks. The entrees and appetizers are quick to appear in the self pickup area."
    },
    {
        "id": 113,
        "text": "I was very disappointed with this Pho. The spring rolls were over cooked and tasted bland. The rice vermicelli was also not the most flavorful. I've been meaning to try this place but not going back after this experience"
    },
    {
        "id": 114,
        "text": "Pho Street is a place I have passed by many times on my way to Trader Joe's but only stopped in recently on a Wednesday night. The pho here is reasonably priced at $11 for a huge bowl (including tax) and is pretty tasty. I have only been to other one Pho place in Philly, so not much comparison, but I was satisfied at both places so I think Pho Street is a good option if you are looking for some Vietnamese. \n\nThey also over spring rolls, rice bowls, and a few other food options if Pho isn't your thing! The ordering process in here is also easy - they have touch pads you can see when you walk in near the back. Just order, pay, and wait for your number to be called. I should note the machines are CC only, so if you want to pay with cash you have to order at the register, under the sign. When you are done, just put your tray on the racks near the trashcan. There is really limited/no interaction with the staff here so if that's your vibe this place is for you!! \n\nThe atmosphere is very casual -  pop music fills the restaurant and the music video of the song plays on one of the TVS. Not much decoration but I didn't mind - this is more of a fast casual kind of place so expectations weren't high there. \n\nI would definitely come to Pho Street again"
    },
    {
        "id": 115,
        "text": "Excellent place, was debating on going here for a while and finally gave it a play.\n\nStraight forward digital ordering system with many customizations available. As a vegan, I needed to remove butter from an item and found it without issue.\n\nFood was delicious and very filling.\n\nEven being fully packed, my to go order was prepared very quickly."
    },
    {
        "id": 116,
        "text": "Quick and easy ordering through a kiosk if you're using card! Pretty busy during lunch time. Huge portions and don't need to tip so $11 for a giant bowl of pho is pretty decently priced. Broth is a bit salty but pretty good for a quick pho lunch."
    },
    {
        "id": 117,
        "text": "Update: having just ate at the renowned Pho 75, I thought I would come back here to say the Pho Street is super comparable. Perhaps the noodles at Pho 75 were a little softer/less 'commercial'-feeling but I gotta tell ya, Pho Street is pretty amazing. And much more convenient."
    },
    {
        "id": 118,
        "text": "Used to be one of my favorite place to go pho, but recently they increased the price by adding tax but also make the portion smaller. Usually I won't be able to finish the whole pho but now I still feel hungry after eating the whole thing.  The taste is good and the food come out quick.\n\nUpdated: I was there 10/26/19 and 11/16/19 during lunch time"
    },
    {
        "id": 119,
        "text": "One of my favorite pho places in Philly. The broth is great! Decent prize and comes with decent size!"
    },
    {
        "id": 120,
        "text": "I love it! Order at the counter Pho! \nPho Street is great, I've eaten here twice already and will keep coming back. I don't think there's many other Pho restaurants within walking distance, so its nice to finally have Pho in center city!\n\nWalk in, smell the deliciousness. Ahhh so good! Then, walk straight to the computer screens, where you place your own order on the touch-screen monitors. How creative! Great for the working lunch crowd also. I love the DIY ordering system, because it lets you customize your Pho.  Choose from several chefs specialty options, or, create-your-own Pho. Chose the meat/tofu, and all toppings. I love ordering extra cilantro and bean sprouts (for free!) \n\nThe chicken is thick cut chicken, very tasty. The tofu is lightly fried, and the brisket is my favorite. The Pho is so delicious! My other favorite item is the shrimp summer rolls. I can't get enough of the light delicate wrapping, and dipping it into the peanut sauce! Yummmm\n\nI'll be back! I just wish they were open on Sundays..."
    },
    {
        "id": 121,
        "text": "Ordered delivery and the food took over an hour and a half to get here. When we called the restaurant, there was no answer. When we finally did get it, the soup was spilled all over the bag, which was leaking. The sandwich in the bag got wet from the soup. And the food was cold. The pho had the plastic cup of sauce hidden underneath the noodles. Would not order again."
    },
    {
        "id": 122,
        "text": "3 stars if I cared for their service. Been here a handful of times as it's close to work and no dish has stood out. Everything is pretty plain. I'll say the kitchen seems to be clean and dishes prepared with fresh ingredients. The service is weird and what prompted me to write this review. While gawking around I always notice one thing: the asian guy in the kitchen - seems like management - is always outgoing and nice (often overly blatant in his effort) to everyone except other asians or at least asian guys. To asian guys he's even cold when they pick up their order! Not even kidding. I've witnessed this maaaaany times so I'm confident in my assessment. Thus for that reason I will never return here again."
    },
    {
        "id": 123,
        "text": "FYI: Do a build your own, I believe it's only 50 cents more expensive but much more customizable and with the pho, you can add a lot more meat.\n\nPROS: I cannot begin to tell you how much I enjoyed the banh mi I got. First of all, they have it listed as a \"hoagie\" so don't get tripped up. Second of all, it's pretty big and packed full of your typical banh mi ingredients. Those pickled carrots were amazing and balanced out the richness of the butter and grilled pork beautifully. I got mine with extra carrots and extra butter but no cilantro or jalapeños cause I did the build your own option. We also got the grilled pork summer rolls, which were pretty good too. You get a taste of every ingredient and the roll doesn't fall apart on you. This place is definitely going to be my go to for a banh mi fix and I honestly can't wait to go back again for another one.\n\nCONS: This isn't really a con but the place might be too big, it looks very empty and spacious but that might be because it's new so it isn't really known yet.\n\nFiancé's corner: I got the build your own pho. You can add up to 6 meats for it's normal price and have options to customize the veggies that go in. We got the food for take out so that affects pho more than banh mi but the noodles were pretty good and the broth was great even after sitting for a bit. My recommendation would be to eat at the restaurant if you want pho so you can better add basil and bean sprouts as in take out it's just stuffed in. But overall, very good pho, especially for center city/rittenhouse area!"
    },
    {
        "id": 124,
        "text": "This is a super convenient and quick place to grab pretty good Vietnamese food! They offer a ton of food for a great price, which was evidenced by my $11 huge bowl of pho with three different types of meat! They also give you all the sides and trimmings you need for pho! This location is nearby my apartment, but I would definitely order take out or sit and eat here! Lots of space."
    },
    {
        "id": 125,
        "text": "I love Pho Street. As someone who orders from here around once every 2 weeks, I can assure you it is consistently perfect. Both the pho and the summer rolls are excellent."
    },
    {
        "id": 126,
        "text": "Go to restaurant for vermicelli bowl and banh mi sandwich, I find they give a lot of protein in their sandwiches, for $7.50 or so , such a good deal and tastes amazing! Have probably gone to them 10+ times by now, and will be going back when I'm looking for a quick, yummy, well portioned Vietnamese food!"
    },
    {
        "id": 127,
        "text": "They get this vegan's vote for having a really nice vermicelli pho with vegan stock."
    },
    {
        "id": 128,
        "text": "This is my go to spot for a cheap, satisfying meal within walking distance. It's super spacious and you order via 3 touch screen kiosks. The awesome thing is that you can then customize your order so I choose no cilantro and no bean sprouts. There's also a side area to customize your own sauces. \n\nWe like to order the deluxe pho and deluxe vermicelli. I love that the pho portions are massive. My boyfriend always gets the deluxe pho, and the flavor of the broth is reallly good. They stuff it with so much meat (tendons, meatballs, tripe, eye round, sirloin steak, brisket) that you actually run out of noodles before the meat. The deluxe vermicelli comes with shrimp, spring roll, and grilled pork, and I love the variety of flavors/textures to mix it up with the vermicelli. \n\nIn my opinion, Pho Street is the best place for pho/Vietnamese in Center City!"
    },
    {
        "id": 129,
        "text": "Pho Street, located near Rittenhouse Square on Market Street, offers a cafeteria-like dining setting with a lot of pho. You order at some digital cash registers, and then essentially serve and bus your own service. They make the food pretty quickly, and it's relatively cheap. For $11.50, you get a giant bowl of pho with up to 6 different protein choices. \n\nThe pho is large in quantity, and pretty good overall for taste. The bowl of pho was definitely more than I expected, and they weren't too cheap with the protein adds. I got a decent amount of beef, but only two shrimp with that choice. They have a lot of sauces to choose from as well. \n\nAll in all, I enjoyed my large bowl of pho. The setting is great for groups looking for a chill environment to just hang. It's really casual, and expect to see a lot of college kids around."
    },
    {
        "id": 130,
        "text": "Amazing pho, noodles, and sandwiches for great prices! I have come here several times. 1 star off because I have found hair in my takeout twice."
    },
    {
        "id": 131,
        "text": "This is the best place for Vietnamese in the Center city so far. I'm pleased to have this option here. Very comparable to the food you may get on Washington Ave.  it's a massive place where you place your order on a kiosk and wait for your number to be called. \n\nI ordered a pork with spring roll vermicelli.  Love the ability to modify your order to your liking.  The spring roll is spot on and would eat a handful if I could. Perfectly cooked pork and fresh veggies really make the meal. \n\nGreat spot and will have to come back to try the rest of the menu"
    },
    {
        "id": 132,
        "text": "I really like the vermicelli here. It tastes very flavorful and authentic (my parents approve). I come here multiple times a week (mainly because I live so close) and am never disappointed with the vermicelli. The pho is good, not great. It's definitely passable but if I'm really craving pho I would travel somewhere else. \n\nOverall, I love the \"street style\" where you wait for your order to be called and grab your utensils, sauces yourself to your table and then bring it to a centralized trash area when you're done. It really creates that Vietnam street food vibe. I also really like how the touch screens make it especially easy to customize your order. The owner is also very friendly."
    },
    {
        "id": 133,
        "text": "Normally I wouldn't be caught dead paying $11 for a bowl of pho but honestly the portion sizes here are worth it! \n\nIf you're gonna get the pho, I recommend going with the build your own option - you get 6 toppings for an additional 50 cents - $11.50 in total, no tip required. \n\nI like their cafe/kiosk ordering style. It's easy, quick and efficient. The layout of the restaurant is open and spacious with plenty of seating and you wouldn't feel weird about dining solo either.\n\nI haven't found any decent Viet restaurants in UCity so the best part for me is that Pho Street is only a couple trolley stops away from 33rd & Market. I'm looking forward to coming back and trying the other stuff on the menu!"
    },
    {
        "id": 134,
        "text": "The only pho place I trust in philly, and I've had a lot of pho. So good and always perfect. Bravo for being so delicious"
    },
    {
        "id": 135,
        "text": "So I ordered two days in a row because I loved the shrimp hoagie with beef, omg it was perfect. I love a good Vietnamese hoagie and this hit the spot. \n\nI also ordered brisket pho and shrimp summer roles.\nThe pho was okay and I don't like that they don't separate the hoisin and siracha for to go orders, but it's better pho in the city even without that minor issue.\n\nThe shrimp rolls were average, but the peanut sauce left me confused because again I had better.\n\nSo let's talk about this hoagie , whoever made it Monday afternoon perfected it so much so that I ordered another one the next day . The second one wasn't as good as the first but still tasty. It was a huge portion size Monday compared to have the portion on Tuesday. Maybe they have a different chef each day ? Or maybe I got lucky one day but if they made hoagies like that everyday, I would take everyone I know to eat there. I give the hoagie 4 starts and the rest of the food a 3 so I'll leave their rating at 3. Also I asked for utensils and I'm not sure they read notes but two days in a row I didn't get utensils so make sure you have your own pho soup spoon"
    },
    {
        "id": 136,
        "text": "I got the pho soup that has tripe, steak and eye round steak in the create your own section! My boyfriend did his with shrimp and tendon as well, we both got fountain drinks. The food was amazing to me! The store is kind of like order yourself on a screen or pay cash at the register and they'll call your number out when it's ready. Lots of seating and it was a bit quiet so it felt nice and we actually ended up watching a show on my phone while we ate. It was great."
    },
    {
        "id": 137,
        "text": "Just randomly looking for a place to buy take-out, and we happened to pass by this place. So we ordered from their kiosk and after a few minutes, food were ready. Took it home, and happy how big the serving were. We were all a happy camper. Spring roll is a winner."
    },
    {
        "id": 138,
        "text": "No frills place that hits the spot when I'm looking for something warm and soupy! Not as authentic as Pho 75, but much more conveniently located for me\n\nDuring the pandemic I learned that you can order takeout with uncooked noodles, and that was a game changer, since takeout noodles always get overly soggy."
    },
    {
        "id": 139,
        "text": "I got the beef pho for takeout. Ordering is online or at the kiosks inside, and pickup at the counter in the back. Would recommend the deluxe for variety of meats. There's a lot of space inside for seating, but it was pretty deserted on a weekday night. The broth was still warm when I got home and you can get extras of a few toppings for free (I got bean sprouts and extra hoisin) so I very much enjoyed the meal! Would definitely return."
    },
    {
        "id": 140,
        "text": "Delicious, fun and way too much food. Pho Street is a cafeteria style self serve self clear Vietnamese fast-food restaurant featuring the classic Vietnamese favorite dishes of pho, broken rice and bun style dishes. They don't serve classic Vietnamese coffee just the ice coffee pre-mixed version.\n\nService - automated 4/5\nIt's a little confusing b/c the entire menu isn't posted anywhere and the payment process is a bit awkward. You order through a kiosk and then wait for your number to be called. I recommend staking out the tables closet to the serving area because those bowls of steaming soup are huge and the ramp taking you to the main dining room is daunting especially when attempting to walk the gauntlet with a giant slipping around bowl of boiling hot pho!\n\nHuman Service :) 5/5 \nThe human part of the service is when they call your number and you pick up your order and they're very nice there. \n\nFood...\nPho with eye round & meatballs 4/5\nThe soup was flavorful and the eye round was good. The meatballs are quite tough and rubbery. I'd probably not order the meatballs again.\n\nPho with brisket, eye round & sirloin 4/5\nWork bestie ordered the above and she enjoyed everything except the brisket which was well overly brisket-y.\n\nIce Vietnamese coffee 3/5\nThe cup is only filled halfway and at $4/serving that's like a $1/1.5 oz which is steep especially since it's not made to order and reminded me of melted coffee ice cream good but not $4 good. We could have gone across the street to Trader Joe's and purchased a pint of coffee ice cream for the same price. \n\nIf we go again we will share one order of soup. It was more than enough for two people and at $11/bowl I'd rather share it. \n\nIn summary:\nSo if you avoid the brisket, meatballs and ice Vietnamese coffee and stick with the other options you'll have a 5/5 experience."
    },
    {
        "id": 141,
        "text": "I like the idea of build your own food. When you come in you place your order on the screen. If you pay cash you will go to the back where they prepare the food. I built my own spring rolls and it took over 10 minutes to make three. I hope they can speed it up. Only one order stayed in tack, the other two are torn or busted out. \n\nThe shrimp is fresh and the veggie version is very tasty with pickled shredded carrots and slices of tofu. The one with the pork has several thin slices of pork. The dipping sauce is very delicious with chopped peanuts. \n\nThere are plenty of seatings and several TVs."
    },
    {
        "id": 142,
        "text": "People working along West Market Street will be happy to know that they have yet another great lunch (or dinner) option in the Rittenhouse area!\n\nI was a bit skeptical before Pho Street opened because other newly-opened Vietnamese/Asian places in the area have been pretty lackluster. However, after trying some of the food here, I'm happy to say that this place nails it in terms of value and flavors! (I heard Vietnamese coming from the back of the kitchen - always a good sign.) \n\nAlthough I usually test new Vietnamese places by trying their pho, I decided to switch things up this time and try one of their broken rice platters. I went with the Vietnam Special broken rice platter, which came with a slice of grilled pork, grilled shrimp, Vietnamese quiche, shredded pork, rice, and some veggies. While $11 is a bit higher than what you might find on Washington Ave, (we are not on Washington Ave and) the portion was very generous and everything was fresh. \n\nThe pork and shrimp tasted fresh off the grill and were both nicely marinated. They had a nice char while still remaining tender/juicy on the inside. The quiche had plenty of pork in it, and the rice was freshly cooked (warm, aromatic, with a nice bounce to it). The lettuce, tomato, cucumber, and pickled carrots that came on the side were fresh and added a nice touch. They also did great on the sauces - which can be found on a side counter near food pick-up. \n\nThe restaurant is clean, bright, and spacious. Food is ordered via touch screens and then picked up at the counter when they call your number. Service was also nice and the booth seating was comfortable. Overall, it might be a bit pricey to eat here every day, but, all things considered, it's still a good value."
    },
    {
        "id": 143,
        "text": "I rarely order from Vietnamese restaurants when not traveling since I typically prefer home cooked Vietnamese food.  I should post pics of my food, lol. That said, it's unfair to my coworkers who love a culinary Adventure and there's only so much Thai or Chinese one can eat sooo went in search of some Vietnamese delivery near the hospital.  There were 2 that caught my eye but we chose this one since there was a much larger selection. Prices are higher than usual south Philly/north Philly prices but seems typical for university city area. Everything from apps, noodle dishes, rice dishes was available. As a group we tried summer rolls (good), lemon grass chicken and noodles (my coworker inhaled this), vegetarian spring rolls (burnt but tasty), vegetarian pho (delicious per coworker) and I had the pork chop rice combo (pork chop was alright, their egg quiche though was amazing!). The iced Vietnamese coffee was also delish! Delivery was super fast! So we found a solid Vietnamese restaurant in the area!"
    },
    {
        "id": 144,
        "text": "Can't go wrong with anything on their menu but the Pho and Bahn Mi (grilled pork hoagie) are my favorites with the vermicelli noodles in close third. The portions are so large so if you're not ridiculously hungry prepare for leftovers. We've done takeout a lot and it's always prepared on time and easy to reheat at home (for the pho mainly). Excited to continue coming here for lunch whenever back in the area for work!"
    },
    {
        "id": 145,
        "text": "I was looking for an inexpensive, convenient place near work to grab some Vietnamese food for lunch, and decided to give this place a try. My overall first impression walking in was this akin to a fast food joint (minus the disgusting, greasy smells) except for Vietnamese food. You order your food via touchscreen kiosk. The menu and all the options are clearly labeled, which made for a straightforward and quick ordering experience. I ordered the chicken pho, which is my usual go-to. The gentleman behind the counter showed me where utensils and condiments were whilst preparing my food. In about 5 minutes, I had a nice, piping bowl of pho in front of me. The portions here are VERY generous; amp meat and plenty of noodles; definitely more than other places give you. I'm officially hooked; I think I've found a new favorite lunch spot! I look forward to exploring the rest of the menu."
    },
    {
        "id": 146,
        "text": "Finally!!....a semi-legit Vietnamese restaurant in the city!\n\nI really thought they were going to over simplify the dishes because of this new location (center city), but I'm glad that they didn't.  I've ordered take-out from here several times and have been pleased with the quality so far.  Pho deluxe....delicious!  The broth was really good; this matters most and they didn't skimp out on the meat combinations at all.  Broken rice and Pork Chop w/quiche was really good as well.  A big piece of pork chop paired with a good sized portion of quiche on the side.  Fish sauce that was served was really nice as well.  Beef vermicelli and chicken pho were also solid dishes.\n\nFinal thoughts......you're going to pay a little more than usual for this food since its located outside of South Philly, Chinatown..etc... and that is absolutely fine by me.  In fact, it annoys me when people complain about the price for a bowl over here versus other locations....com'on guys....you're in the city!  Some suggestions for improvements as i really want this place to succeed....\n\n1 - Put some music on please....your guest will appreciate some background noise.\n2 - Faster food prep (saw folks annoyed as they waited 20 minutes for their food in an empty restaurant).\n3 - Decorate the place a little please....such a large place with nice walls....all empty.  Some eye-candy would be nice when folks walk in.\n4 - Better packaging......the employee struggled putting my food into those flimsy cheap plastic bags.  Maybe upgrade your bags....maybe even include a logo?"
    },
    {
        "id": 147,
        "text": "After my last review I went here twice. Each time I was happy with my food. Moreover, the tray shelves were efficiently cleared. The tables have been clean, and overall a wonderful dining experience. Thank you!"
    },
    {
        "id": 148,
        "text": "Great food great atmosphere and awesome staff.  I love the way they allow you to customize however you want."
    },
    {
        "id": 149,
        "text": "Best pho spot in the heart of center city!  I love one pho restaurant on Washington Ave where all of the Vietnamese restaurants are clustered. But Pho Street ranks with the best. Recipes are the from the owner's family. Pho was loaded with white chicken meat, and the broth was very aromatic. Very clean restaurant with two TVs for the weekend football addicts.  So glad we found this place, and we will be regulars."
    },
    {
        "id": 150,
        "text": "Ordered a delivery today. Hugh amount of food! Most important, I told them to serve well-cooked meat and steam bean sprouts, and yes! \n\nThe soup base itself is really delicious and I also ordered extra beef and extra tripes. Then I learned the word \"extra\" One order with 2 extra portion of meat fed me and my husband."
    },
    {
        "id": 151,
        "text": "Wow that was a good ass beef hoagie I just ate.You guys are awesome and provide quality food on a consistent basis. For all you newcomers to Vietnamese food, grab a sandwich from this place the next time your craving a cheesesteak."
    },
    {
        "id": 152,
        "text": "Love the tech and quick, pho grabbing vibe at Market. I'm so excited to have an Asian cuisine in CC, but I was so disappointed to see the employee's facial hair in my pho... twice in one bowl. That ruined my appetite. Otherwise, it's a decent place to grab a quick lunch/dinner."
    },
    {
        "id": 153,
        "text": "Got Pho Street catered for a Vietnamese cultural dinner. The main performer and speaker at the event attested to its authentic quality and ended up taking a tray of hoagies because he enjoyed it so much. \n\nOrdering online and emailing Pho Street was relatively easy. I just asked for a variety within our budget and they were more than pleased to accommodate our request. \n\nWhen the food came, we were surprised by the size and quantity, which is a plus. We ordered beef, chicken, and tofu hoagies. All of these were fantastic and had a little bit of a spicy kick. The vermicelli was also fantastic. The star of the show were the crispy spring rolls. We ran out within 15 minutes. It's perfectly fried and crunchy."
    }
]