[
    {
        "id": 1,
        "text": "Slow service. Under par food. Overpriced Asian goods. Cashier seems more busy organizing deliveries than serving customers IN the store. Not impressed at all."
    },
    {
        "id": 2,
        "text": "The hospitality was really good. I had the jungle curry with fried tofu, and it was yummy. Nevertheless to say, the Thai iced tea they have is one of the best I have had! I would recommend this restaurant to anyone who wants to try Thai food!"
    },
    {
        "id": 3,
        "text": "Amazing food and just the right quantity. I didn't need to add any seasoning or sauces--it had a wonderful taste on its own. The Singapore noodles are so great. They also sell all of the necessities to make your own sushi at a reasonable price."
    },
    {
        "id": 4,
        "text": "Cute and cozy! The staff was very nice and the Pho was great. They also had things you can use in your Asian cooking. Will be going back."
    },
    {
        "id": 5,
        "text": "Manayunk has been needing a place like this. The hangover cure - their Pho is awesome! Noodles are just right, plus the broth and meat are very flavorful. \n\nVery clean and new. They also have a number of other Asian dishes plus Asian groceries which is unique.\n\nRecommend coming if you have a delight or interest in Asian foods."
    },
    {
        "id": 6,
        "text": "I can only comment on the already made to go food. I got the red curry and a drink for $9.75 which is a steal. I took it home and heated it up later for dinner and the curry was delicious. The market is small but definitely convenient if you don't want to trek to an HMART. Will definitely be back."
    },
    {
        "id": 7,
        "text": "*i went here Thursday night for dinner* the woman taking our order was adorable and extremely friendly. They had a lot of Asian snacks like chips and pocky near the register which looked cool. The restaurant had a chill and relaxing atmosphere. The food was very good and prepared perfectly. The pork pho was well seasoned and the grilled chicken was delicious. Perfect for a weekday dinner or lunch."
    },
    {
        "id": 8,
        "text": "Great variety, excellent flavours. Unique concept with a sit down cafe style menu and a specialty grocery store"
    },
    {
        "id": 9,
        "text": "I'll admit this place seemed a bit confused as to what exactly it wanted to be at first, so I can understand those initial customers' frustration. However, I've been here a few times now and they've really stepped up their game. The shop is quaint and cute, the food is good (coming from the same kitchen as Chabaa), and the to-go products are a nice touch. It's also cheaper than expected, as Thai cuisine is unnecessarily pricy for some reason. \n\nOverall, I hope Binto becomes the Thai version of Manayunk's Smiley's, as takeout places on Main Street are few and far between."
    },
    {
        "id": 10,
        "text": "I come here for all my Asian grocery shopping! The owner Moon is super friendly! I enjoy the chicken & duck pho here. Nice to have a place like this available in Manayunk!"
    },
    {
        "id": 11,
        "text": "I got the meifun Stir Fry with beef was flavourful.Beef was tender.My husband got Soup with Roat Duck with Ho Fun.Delicious Broth.Drinks Thai Iced Tea and Oishi Green Tea the Bomb."
    },
    {
        "id": 12,
        "text": "This little cafe is a heaven on earth. Extremely friendly staff. Food was authentic and amazing. We ordered jungle curry and noodle soup. Very fresh, light and flavorful. But if you are looking for a fine dining experience, this is not the place for you"
    },
    {
        "id": 13,
        "text": "Love love love this place! Great for a quick dinner or a Thai iced tea. My personal fav is papaya salad with grilled shrimp. Jungle curry is also a must try!"
    },
    {
        "id": 14,
        "text": "Off top: a star is removed for the price. Super expensive pad Thai and pho $40 and it's not even a real dine in restaurant, seating is very limited. We had to ask for water as we weren't sure if dinner came with water. You are able to purchase Asian groceries to make your own meal which is interesting. Pad Thai was edible but didn't have that Asian flair. \n\nI wouldn't go back but if your desperate for Asian food bc it's Monday, go. But no, instead go across the street to Han Dynasty. Or just stop in to say you Been To (Binto) It...get it. Okay cheesy but seriously you can skip the place and save your money."
    },
    {
        "id": 15,
        "text": "Got the pre-prepared red curry chicken and rice as well as the coconut soup with chicken. Both were amazing! The red curry wasn't too spicy and was really tasty. The service was great as well. Highly recommend for a quick, healthy, high-quality take out option on Main St!"
    },
    {
        "id": 16,
        "text": "I am very disappointed with this place.  I loved Chabaa Thai before it closed.  It was pricier than most places, but I thought the flavors made the prices worth it.  When I found out last year that they will be reopening Chabaa and also Binto as a casual market, I was very excited.\n\nBut three weeks after opening, this place was just a complete mess.\n\nFirst, the people working there had no idea what was going on.  They didn't know the menu at all, and they struggled to convey basic information about what was available in the market to eat.\n\nSecond, the food is all over the place.  What are they going for?  Are they a take-out place?  A lunch eat-in place?  Who is their clientele?  For the most part, the food was pretty mediocre (a big surprise, given how good I thought Chabaa was), the portions were small, and the prices were high for what you get.\n\nLastly, the market was terrible.  There was some cold stale food packaged up, along with various food-related items ranging from Thai to Japanese and Vietnamese items.  It's basically a pretty bad Asian-related food items being sold at a high markup.\n\nI really wanted to like this place.  I've been waiting for a year.  I was so disappointed.\n\nDon't be like me.  If you have to go to check it out for yourself, lower your expectations considerably."
    },
    {
        "id": 17,
        "text": "I've been saying Manayunk needs pho for years. Absolutely love it here. High quality pho and food."
    },
    {
        "id": 18,
        "text": "Small portions for big prices!\n\nMe and my wife really like Chabaa, but their market place next door that they are connected to is a rip off. \nFirst, the place is a cafe so I understand the portions won't be as big as a restaurant, but the prices were restaurant prices with such small portions. \nSecond, the meal was good that I ordered. I got pad thai chicken and it was delicious, but like I said the price was close to $18 and it didn't come with any side items. Just one plate of the stuff and not a lot on the plate. \nNext, the place is small as far as dining seating it was extremely cold in there. \nNext, the wings my wife ordered were Bangkok wings and they were meaty, but only get like 6 wings for like 7 bucks. \nAnyway, definitely will not be going back for the price we paid with one mango drink it came out to about 28 bucks. My wife said she felt like we got ripped off and I agree."
    },
    {
        "id": 19,
        "text": "CLOSED   Sad to see this place go, they made great bahn mi...\n\nI wish a lot of other places had closed instead of this one."
    },
    {
        "id": 20,
        "text": "Such a cute little Thai spot! I always think of it when craving comfort food and the best thing is the Thai iced tea that comes in the to-go bottles! Please treat yourself to their noodle options because they are to die for! Wish the food could be a little warmer sometimes but overall pretty yum!"
    },
    {
        "id": 21,
        "text": "Came in here looking for pho. Because it was the only place for pho in manayunk acording to google. What they served me was a plate with noodles and about 5 oz of broth. I told the woman that it was missing the soup and asked her for more broth. This terrible server goes in the kitchen and comes back out to tell me that the pho they serve is not a soup. It's a noodle dish, and refused to give me the soup. So I paid $10 for a plate of noodles and some chicken. It was the worst pho i have ever eaten and the service was terrible. It took them 20 minutes to serve my pho and I was the only customer. F this place and the snotty waitress."
    },
    {
        "id": 22,
        "text": "Don't get me wrong, the food wasn't bad but it wasn't great either. I'm sad as I was hoping I'd love this place but overall it was just OK. \n\nMy Bf and I were craving some thai (especially thom kha soup) so we decided to take out food since we live nearby. We just moved and I'd walked by so I was excited to try it. \n\nThe woman on the phone was very nice and explained some menu items to me which I appreciated. We picked up the food 20min later.\n\nWe ordered:\n-Thom kha soup with chicken: I knew something was off when I took the first sip. I'm used to a slightly spicy but very flavorful soup due to the mixing of the hot/sour soup and the coconut milk. It wasn't bad but lacked flavor 3/5\n\n-Thai fried rice: this was delicious but the veggies in it were awkwardly not bite size and were not cooked all the way 4/5\n\n-Spring rolls: no flavor, without the sauce to dip I wouldn't have eaten these. They were also very oily and one was super burnt. 1/5\n\n-Chicken with vegetables in garlic pepper sauce: this was okay (nothing special) but the portion was very small! 3/5\n\nOverall, I was disappointed by Binto but I wouldn't say I'll never go back. I may try eating there next time and trying some different menu items."
    },
    {
        "id": 23,
        "text": "This restaurant is excellent through and through! \n\nI ordered Tom Yum with with mixed seafood and rice vermicelli noodles. It was the bestest!!! Yes I know it's not a word but it's the word I need to describe my dining and culinary experience. \n\nThe dish was fresh and piping hot. I had a range between 1 and 5 for spicy. I love spicy so I went for a 3 yesssss it was the perfect hot. Hot enough to experience the tiny and thinly sliced jalapeños floating in the broth. The seafood oh my goodness tasted like it came straight from the ocean. The shrimp were succulent, the scallops were tender, and the squid was perfect and not tough from over\n cooking and the mussels were on the small side but it didn't take away or add to the dish but it won't diminish this review. The noodles were necessary and not sure why I had to pay $3 more but as they say you get what you pay for. \n\nThe restaurant was spic and span. I didn't see any dirt and all trash was in the trash can. I'm not sure if there's a restroom but I know they offer WiFi lol. During my next visit I'll get more details to update my review. \n\nThe service was expedient with a friendly and genuine smile. I'm definitely returning and I saw kimchi and seaweed salad both which I love. I'm willing to try some of their Togo dishes like chicken curry with white rice."
    },
    {
        "id": 24,
        "text": "This place is interesting. It is the sister company next to Chabaa Thai. I like how this corner of Main Street has multiple asian eateries. Han Dynasty is probably the most popular.\n\nThe guise behind this eatery is simple... noodles or soup bowls. Can choose protein and noodle and that's pretty much is. Around the $20-$30 range for a meal for two people.\n\nMy wife got the pork soup and I got the pork see ew. Both portions were good \"lunch\" sizes although I was relatively full even after. They bring sauces out to put on the meat including sriracha, chili garlic, sweet chili and hoisin. Hoisin was my go to. Noodles were soft and well seasoned. Vegetables were fresh. My only complaint was the pork was a little dry. Seems like they nuke it to warm it up and it overdoes the outer coat. Other than that perhaps the chicken or beef may be softer. \n\nAlso got banana milk! And they have a cute little shopping side where you can pick up essentials like soy sauce and rice... and they have wonton skins in case you want to make your own wontons! \n\nTry it!"
    },
    {
        "id": 25,
        "text": "This boutique Thai/Asian market opened a couple weeks ago adjacent to their main restaurant, Chabaa. As you walk in, you'll notice the variety of Thai cooking sauces, chili pastes, and other grocery items lining one wall of the establishment. There is some dine-in seating, but the market offers the convenience for you to grab and go with a prepared salad or chilled meal.\n\nYou also have the option to order off their \"hot menu\" which is depicted on a large chalkboard. Presumably all the meals are prepared in Chabaa's kitchen next door. I decided to sample a container of the steamed shrimp shumai, a beef Pad Thai entree, and a container of their fried bananas. The market attendant asked my spice level preference for for the Pad Thai (on a scale of 1-5), and as I wavered between a 2 and 3, she advised to select conservatively.\n\nThe food was all tasty. The shrimp dumplings had good flavor, especially when dipped in the soy sauce. The Pad Thai had a nice medley of textures, with the crunch of the bean sprouts, the tenderness of the meat, and the nuttiness of the crushed peanuts. I was disappointed that the dish completely lacked the element of spice/heat - next time, I will definitely ask for a 4. Finally, the fried bananas had that ideal balance of savory and sweet.\n\nThe prices are a little bit expensive, but the portions are decent."
    }
]