[
    {
        "id": 1,
        "text": "Great spot for pho! Broth is very good. I ordered No. 51 (small) and it was filling. Would definitely come back again when I'm in Philly."
    },
    {
        "id": 2,
        "text": "Went here for dinner on opening day and was SO HAPPY I DID!! Great atmosphere, lovely staff, and food on fleek!! Green tea (PHO PHREE) was so satisfying, summer rolls and spicy peanut sauce were DELISH, and pho was PHONOMENAL! Definitely making this one of my regular hot spotz as I eat my way through Fairmount!"
    },
    {
        "id": 3,
        "text": "We ordered the pork roll spring rolls and were extremely disappointed with their dry consistency and suspicious contents (primarily tendon?). Overall, the pho was mediocre, but does not compare to Vietnam palace. \n\nWe may continue to go for the convenience."
    },
    {
        "id": 4,
        "text": "I was so looking forward to a Pho joint in the neighborhood.\n\nno anymore !   \n\nFour neighbors went at different times and all had the same opinion as we did.\n\nI know that they are new , but at this rate, they won't be around much longer."
    },
    {
        "id": 5,
        "text": "Good food, great service. I had the vermicelli bowl the last two times I ate here and pho the first time. Delish all around."
    },
    {
        "id": 6,
        "text": "I love pho and this place did not let me down.  I had the pho with rare flank and brisket.  The broth was heavenly, the meat plentiful, the noodles cooked to perfection.  I will definitely go back for more.  The price point is more than fair.  I had the medium bowl and it was more than enough for one person.  Highly recommend!"
    },
    {
        "id": 7,
        "text": "Okay Vietnamese restaurant if you want Vietnamese and this is only one in the neighborhood. They are doing a good job catering to the crowd here. But for me I have to  travel to other neighborhoods for a more authentic and good tasting Vietnamese food.\n\nTheir portions are smaller. Pho isn't great. Pho is always about the broth. So when you don't have that foundation everything else falls apart."
    },
    {
        "id": 8,
        "text": "This restaurant is in a great location near my apartment and I have ordered from them multiple times.  The fried egg rolls are delicious by my favorite dish is the shrimp pho.  The staff are friendly, the food is delicious and the atmosphere is nice.  My only suggestion is to work on a website because the website on the front of the door is no longer in use. Otherwise, this will remain one of my restaurants in rotation."
    },
    {
        "id": 9,
        "text": "I dont leave reviews but had to as my experience tonight left a really sour taste in my mouth.\n\nWalked in the restaurant to place a take out order for two pho dishes. Paid by card & left a 4$ tip on a 22$ takeout order. \n\nAs they gave me the food i asked if i could have hot sauce as well and was told by the young man that thats 1$ extra... i had no cash only card but i was surprised because i was just there yesterday cus my bf is sick and picked up an order with the hot sauce without having to pay anything for it. The older man yesterday was super friendly to me and said if i ever need sauce to just ask so i was baffled that now i had to pay for it. Additionally this is the same sauce that is sitting on the table. I didn't ask for extra sauce! I let the young man know that if he wanted to charge me a $1 to go ahead but i had gotten it for free before to which he replied the rules have changed. And when i said that was yesterday he mumbled and walked away and begrudgingly filled a container for me and as he handed it said next time its a 1$... \n\nWhy do i have to pay extra to get the same sauce sitting on the table which i got for free the other day. Secondly i tipped u $4 on takeout. Ive worked in the business. People rarely tip for pickup so you still have the nerve to be a dick... I walked away with the food pissed off that this really just happened. and he had the nerve to yell nothing is free as i was walking away. All this commotion occurred with customers in the store.  Great customer service! \n\nOh and when i get home only one bag of toppings was provided for two orders, with only 1 lime wedge to be shared by two people... \n\nSucks as this is the only pho place around and i finally grew to like their pho. Refuse to go back and give my money to that little twerp."
    },
    {
        "id": 10,
        "text": "Wow!! Great addition to the hood!\nMy girlfriend and I had our first meal there at 5 pm yesterday, and loved it. We ordered 4 dishes, a total of about $33($40 with a tip), and had a little trouble finishing everything and licking the plates. \"I could eat 2 green papaya salads myself\" was my thought.\nThe large chicken pho came piping hot with a bunch of mung bean sprouts, a bouquet of basil and 1/2 a lime on the side. Next time, I'd get even more sprouts. So good. \nThe Shrimp Summer Rolls and sweet peanut dressing were delicious.  The Broken Rice/Chargrilled Pork looked like it would be our least favorite but was incredibly tasty. My friend who'd live in Thailand near the Vietnam border thought the rice was cooked perfectly. \nService -now this was late afternoon- was congenial, quick and sensitive, with 3 different waitstaff tending to us-without hovering. Since the food is so tasty, the price is right, and it's a new business, it's understandable that at rush hour, things could get hectic. Our solution, until the minor popularity kinks get ironed out, is to just eat early or not during peak hours. Hey, popularity has a price!"
    },
    {
        "id": 11,
        "text": "So stoked to have a pho place in the neighborhood! We went for breakfast this morning and left feeling like this is a great addition to the neighborhood!\n\nI had the #46 steak and flank pho, we shared spring rolls, he had some kind of spicy Thai influenced soup with a variety of meats and hollow noodles. \n\nGlows:\nClear, fairly flavorful broth.\nGood texture noodles.\nTender meat.\nFresh sprouts, jalapeños, Thai basil.\nClean space and appealing decor.\nFriendly service.\nReasonably priced.\n\nGrows:\nSpring rolls were just okay, and had an odd meat flavor. (Fake crab meat?) \nPho Broth could have been more complex and flavorful.\nHis soup was lukewarm, not supposed to be. \nThe awkward string curtain by the ladies bathroom clings to everyone and gets stuck in the doorway.\n\nOverall, I am so happy to have a decent enough pho place closer than Washington Ave. Doesn't hold a candle to pho 75, but more authentic than trendy Stock, and better than any pho in Chinatown."
    },
    {
        "id": 12,
        "text": "I love pho, and this place gets it right.  The broth is perfect, which seals the deal for me.  Nice place.  I'll be back for sure."
    },
    {
        "id": 13,
        "text": "We wanted to love it here. Waited 50 minutes and didn't get any food. All of the tables around me were without food as well. The menu looked amazing but I can't speak to the food at all. We left after hunting down a waitress to tell her. We will give it another try, because I want the restaurant to work. They just really aren't ready to be open yet."
    },
    {
        "id": 14,
        "text": "The food--chicken pho, beef/brisket pho, and some summer rolls--was solid, what might be expected from a four-star reviewed restaurant. The service was some of the worst I've ever experienced: we were seated after another couple walked in behind us, given dirty water glasses, and left unattended for the majority of our stay. We saw several tables around us stuck without food and/or receiving the wrong order multiple times. \n\nThe waitstaff was more than incompetent they were rude at different points of service. (The hostess turned several groups of people away for both eat-in and takeout orders, one waiter told a friend not to eat there right in front of us, another couple of waiters discussed a table's food right in front of them as if they were not there). I've never felt so uncomfortable at a restaurant."
    },
    {
        "id": 15,
        "text": "We want to love this place since it is right around the corner and Vietnamese is our favorite cuisine. This neighborhood needs some variety! I'm really hoping they can pull together the service and the food in the next few months. \n\nI'll second a lot of the reviews already posted but seems our experience was not quite as bad as some. We went on a Saturday afternoon right about lunch time with a friend so it was busy but there was a table for three and we were seated promptly.  The hostess seemed quite unfriendly but our server was all smiles but she would disappear for long periods. We did receive water and menus right away.  Most other pho places the food comes out in 10 minutes, we waited about 20 minutes so not as long as others have commented on. Two of us ordered bun with spring roll and neither got the spring roll.  We managed to finally get the hostess' attention (no idea where our server went) and she did bring out spring rolls for us, seemed she started pitching in when things got really busy.  No one came around to ask how things were after the spring roll correction.  It's not that big of a place compared to most Vietnamese spots around town so I would expect better service. They clearly need more help and more seasoned wait staff.  \n\nWe did see a few people walk out when no one came to greet them after a while.  That's just not good business. We never got our check, couldn't find our server, or manage to flag anyone down. We had to go up to the register to pay after waiting about 20 minutes (which incidentally is how most pho restaurants operate).\n\nTo the owners of iPho, if you are reading this, the neighborhood would very much like you to succeed.  Here's a few suggestions that might help:  \n\n1) move the register to the front so that a staff person (or two) is always there to greet customers and make more space in the front for waiting customers and takeout orders.  You can move some tables closer to the kitchen once you move the register from the back. \n\n2) have customers pay at register when leaving like other pho restaurants\n\n3) bring take out orders to the front at the relocated register so people can get in and out fast. \n\n4) hire a few more seasoned servers and work with the kitchen to get the timing down. People expect pho to be a meal served quickly! \n\nOverall the food was decent and if they can pull it together I'll definitely be a weekly regular!"
    },
    {
        "id": 16,
        "text": "Never answer the phone, the website is impossible, the food is decent but you can't order it so that's irrelevant!!!! So annoyed."
    },
    {
        "id": 17,
        "text": "Very good , very limited vegetarian options , authentic and well done.        I visiting twice and was happy ..... and the prices are great ... you can have a great dinner below 20 bucks ..."
    },
    {
        "id": 18,
        "text": "Love this BYO Pho place. So glad it's getting cold again, just to have an excuse to go out for Pho here. Prices are very reasonable and the food is delicious."
    },
    {
        "id": 19,
        "text": "I ordered takeout despite knowing from reviews it would take a while.\n\nI had to call three times for someone to pick up the phone. Once they did, they were nice, took my order, and told me my food would be ready in 20 minutes.\n\n45 minutes later, my husband came home with what he was told was our order- my husband confirmed what we had ordered too! We ordered two soups and ended up with one completely different one and a shrimp rice platter. We still don't understand how.\n\nDespite the food roulette that we played, we ate what we were given bc I'm pregnant and we have a toddler to also feed. The food we received was tasty- no complaints despite the wait and mixup- so we are hopeful that once this place figures out a system, it will be a staple in our foodventures in Fairmount.\n\nFor now we have learned our lesson and will try again perhaps in two months. We can drive to south philly, eat, and come back in the time that we waited for our wrong order today."
    },
    {
        "id": 20,
        "text": "Well for starters the service was non existent no one came to even refill waters after being there for 30+ mins and not even the egg rolls had come out yet. I watched three tables get up and leave due to no food and messed up orders. Maybe I'll try again in a month when they figure out how service works."
    },
    {
        "id": 21,
        "text": "We went last night (second night of the place being open). Food was fantastic. Ignore the negative posters on here who have nothing better to do than denigrate a restaurant because they don't understand the concept of brand new restaurants figuring out the kinks. I'm a big pho fan and wasn't expecting too much because it's a brand new place but man, it was worth the wait. It's also byo. Hope this place stays for years and years bc pho and byo, what more do you need? Will probably go back weekly"
    },
    {
        "id": 22,
        "text": "Super thrilled with pho coming to Fairmount! Not only is it awesome to have it here the pho is excellent. Quick service, nicely packaged for take out options- loved it! Will be frequenting here :) way to go!"
    },
    {
        "id": 23,
        "text": "I came here after going to see the eastern state penitentiary for a quick lunch and it was pretty good. Everything waz really clean, the ataff were pleasant and the prices weren't too bad. I was dissapointed when the server told me they ran out of milk for the iced soy milk, but otherwise it was really good. The pho was pipping hot and the soup had a really clean flavor to it. It wasn't oily like a lot of places I've seen, and the noodles were thicker than other places. I got the small bowl and it was able to keep me satisfied until dinner. Great pho place!"
    },
    {
        "id": 24,
        "text": "It's good and consistent but not the best pho I have had . Make sure to ask a lot of questions ."
    },
    {
        "id": 25,
        "text": "I absolutely love iPho. I've been coming here quite a lot for their vegetarian pho, summer rolls and banh mi's. Every time I go the food is incredible. The tofu is crispy perfection and the banh mi's taste sooo, so good. Their vegetable broth is also amazing and I prefer their pho over anyone else's overall. On top of that, our servers are always very polite and accommodating!"
    },
    {
        "id": 26,
        "text": "I really wanted this place to be awesome. I eat pho very often. I arrived at 11:30 and they told me that the kitchen wouldn't be ready for another 20 minutes. Okay, I had some coffee at mugshots and went back. I ordered the steak and tendon pho. It took 20 minutes to come out, and it didn't have tendon. I brought it up and they brought me out a plate of tendon. The large is very large, so I asked for a container. They had me wrap it up. The check came and it was for 2 entrees I didn't order. I brought it up and they refunded my card and charged the correct amount. All in all, it took about 1.5 hours to eat a bowl of pho. It should take 30 minutes, tops."
    },
    {
        "id": 27,
        "text": "I have never tried Vietnamese food before and I must say my first try was pretty tasty. We ordered a take out, I got rice noodle salad with fried pork egg rolls and chargrilled beef and a bunch of other stuff in it. It was very good, I absolutely loved the egg rolls. Next time I order I'll probably ask for more fried egg rolls. The prices are also relatively cheap for fairmount area. I will definitely come back"
    },
    {
        "id": 28,
        "text": "Chicken noodle soup I am feeling like just drop bottle water nothing test like on Delaware ave !!!!!! Chicken very dry !!!"
    },
    {
        "id": 29,
        "text": "Good pho at good price and service. Been here alot and never had a bad experience. Not the best I've had but consistent and above average."
    },
    {
        "id": 30,
        "text": "I dont wanna be mean but theres a lot of hipsters if you know what I mean by that..... doctorate degree in arts those types of people.... and that's a fact! Always If you go to south philly around Washington square, you'll find alot kite asians with way more better pho at a good price. When you first walk in you are greeted by a waiter and you are given water and menu. I ordered the goi cuon as my app. It was like your normal tasting goi cuon. For my pho, I ordered pho dac biet. The wait time was about 20 minutes because there was only one guy working in the back so I felt empathy for the guy and I didn't want to bother the waiter. When the pho came out, it looked good. The key thing for a pho is the broth. You can have waygu beef but if the broth is not good then be ready to file for bankruptcy lol. This place broth didn't have that sweet broth to it. Kinda tasted watery. The meat was actually very good but again, the broth has to be good. The prices for these bowls is not what you'll find at a normal pho place. Price for large is $11 and the bowl is not big. With more hipsters moving into fairmount ruining pho, expect overpriced, tasteless broth, good meat, and tiny bowls. Service here is actually better than other pho restaurants which is pretty rare in philly for pho. Overall rating: 3/5. Could've went to 2 but service and the meat saved it."
    },
    {
        "id": 31,
        "text": "The kitchen is very overwhelmed in their first couple weeks open.  The restaurant was very busy and everyone was waiting 45 minutes to an hour for food and overheard customers considering leaving.    Unfortunately, when it finally came the food was very average - nothing close to what you would get in Chinatown or Italian Market, for example.    Meat in the pho had fat that should have been trimmed off.   It might be a good idea to hold off on offering delivery and take-out until they can get the sit down restaurant part figured out.   Sad to see the big Blue Cat mural painted over with bamboo mural.  Hoping with time IPho might improve?    What a great idea for Fairmount but just not executed well yet."
    },
    {
        "id": 32,
        "text": "We were meant to be friends. We were actually meant to be best friends \n\nI ordered (by phone) last night a beef pho with flank, meatballs, tripe, etc and it was SO great! \nI ordered tonight (yes, I have an addiction) and this time, it only came with flank and the wrong order of spring rolls (I ordered summer rolls). I'm just so confused as to how I could have said the same thing on two different nights and this is how different the orders were. \n\nI think this place needs to get sorted out (according to other reviews as well) but if it is a paying service, they would have figured this out sooner. \n\nI'm just disappointed but oh well. Maybe its different dining in?"
    },
    {
        "id": 33,
        "text": "NEEDED TO IMPROVE!! as an international foodie. These are my honest opinions: \n1. Menu items don't match! For example, #32 and 33. If 32 comes with a small size. Then why 33 even exist says: all above the same expect for a smaller size pho. Then small 32= 33 right??? Also the 81 pic doesn't match! The pic says its avocado smoothie and in the menu it's another thing:((( \n\n2. Environment. Please seriously Decorate the place. Not just replacing with cheap decos. Use your heart to make this place nice. Put more cultural decos! Think more before you open. \n\n3. Service. The waiter doesn't even know which item is which he has to use numbers to replace. SAD... I'm sorry I don't want to be rude but he need to ask us which one we ordered... And he doesn't even know which pho is which... Please be more motivated and familiar with the menu.\n\n4.FOOD. The most important thing. First, in a good papaya salad, the papaya should NEVER be shredded should be chopped. And shouldn't have so much watery underneath!! It's a salad not soup. The salad is badly chopped ;( don't mean to be rude here. And the color doesn't feel like exciting. I ate great papaya salad before and it has mango, red radish and shrimp and spice. It should be a colorful appetizer not watery something. \nI ordered a small delux pho and it doesn't even come with everything says in the menu:(( SAD...it's doesn't have beef meat balls which says on the menu. Also the taste. It's not bad but NOT GOOD either. It doesn't trigger appetite. I mean it's not a bad cooking pho but also not a good cooking pho. \n\nPlease have glasses instead of plastic cups to serve. \nI may says too much negative things but I really want you guys improve. Thanks! Not mean to be mean."
    },
    {
        "id": 34,
        "text": "Great food, huge portions, and friendly attentive service!  The pho is very flavorful."
    },
    {
        "id": 35,
        "text": "First week open and super busy.  The Pho is the best I've ever had.  So clean and healthy.  Try the grape leaf rolls."
    },
    {
        "id": 36,
        "text": "Have great selection of pho and taste great. The broth is tasty. Downside is the service. They don't stick to hours posted and they try to rush people out. Pho takes time to enjoy and I do not like burning my mouth. Please stick to the hours posted or change them."
    },
    {
        "id": 37,
        "text": "My fiancé and I really like this place. The pho is really good, and the menu is quite large. The only reason for not giving this place more stars is the lengthy wait one must go through till the food arrives at one's table. But once the food is there it really is good. Probably going to use this as a take out location rather than sit in the restaurant waiting."
    },
    {
        "id": 38,
        "text": "I was really excited about visiting this restaurant. As others have said, the service was very slow. I ordered the beef cubes, only to be told five minutes later they don't have any. Not the end of the world. I ordered the Pho. The sideplate came out with only one stallk of basil leaves. Again, not the end of the world and I'm sure if I had asked for more it would have been provided. The broth itself was exquisite. However,it was a little light on the meat. That is unacceptable! It was almost impossible to get my waitresses attention. There's also a serious language issue. And as others have mentioned, my water glass remained unfilled throughout the course of my visit. I'll wait a month and give it another try."
    },
    {
        "id": 39,
        "text": "Like most people who live in Fairmout, I've been waiting for a Pho restaurant to open up. Sometimes traveling to China town or to Washington Ave to hit up the usual suspects is a little too far and a hassle on its own. But thank god, we finally have a spot in our little town that's walkable and delicious. \n\nWith that being said, I've read some of the reviews and I'm confused with all the bad ratings. Not to insult you, but if you gave this place a bad review, you are an idiot. I'm putting this place up there with some of the greats.  The quality of ingredients and the authenticity of the taste is way above your average pho, and better than your moms kitchen. \n\nIf you get a chance stop in and see what I'm talking about!\n\nPs: Have fun in Niagara!"
    },
    {
        "id": 40,
        "text": "Had the pho and spring roll for lunch. Broth was creamy and rich in a good way. What more can you ask."
    },
    {
        "id": 41,
        "text": "I'd been wanting to go here for some time since they'd opened and finally got the chance. While this is a cute little quaint spot, I didn't have the best food experience. The first issue for me was My appetizer. I had ordered a spring roll with shrimp, however the shrimp did not look nor taste like shrimp at all. It actually looked like tofu. When I'd asked about it, the waiter couldn't tell me why it had that consistency. My entire was noodles with shrimp, it had no flavor whatsoever. Now the shrimp in my noodles looked and tasted like shrimp, so idk why the ones in my spring roll were different. My friend had some dish with beef in it but there seemed to be some unfamiliar looking piece of meat. He didn't eat it and again the water couldn't describe what it actually was. The fact that our waiter couldn't answer any questions left a really negative taste (pun def intended) in my mouth. Idk if this is normal Pho cuisine and I am just not familiar with it, but I'm certain I won't be returning here."
    },
    {
        "id": 42,
        "text": "I am a huge fan of pho and, coming from the west coast, have had my fair share. In my opinion, the pho here is authentic, except it is a hit or miss. I ordered the same thing on two different days and the first time the soup was very diluted, but the second time was perfect. I would not recommended getting grilled meat with pho and do NOT get chicken, as in both cases the meat is dry and overcooked. If a first timer, go for the deluxe..dont let the tripe scare you! It takes on the flavor of the delicious broth.\n\nAlso, portion sizes are impressive and prices are reasonable for the area. I'm glad to see this in the area and hope they work on their consistency."
    },
    {
        "id": 43,
        "text": "I understand that they just opened and there can be kinks to be worked out but I still found the service to be completely unacceptable. In no way should it be ok for it to take over 45 minutes for an appetizer of spring rolls to come out and then another 20 minutes for the main dish of pho to come. It also took an additional 15 minutes just for a server to take our order to begin with, and even longer to get the check. The food itself was alright if you like poor quality fatty meat and mediocre broth. Given the circumstances I'd much rather head to Washington ave or Chinatown for far better pho and service."
    },
    {
        "id": 44,
        "text": "Definitely one of the best and most reasonably priced restaurants in the area. The waitstaff was incredibly friendly and really gave the restaurant an enjoyable ambiance. The menu had most of your basics on it--I like the vegetarian bun the most. My only issue would be that whenever I ordered a meal with chicken in it, the chicken was dry. I would try a different protein if I were you. Overall, I would highly recommend!"
    },
    {
        "id": 45,
        "text": "I eat here probably about once a week (I live on the same block) and never get tired of it. I eat Vietnamese all over the city and this isn't far in terms of quality from what you can get at Pho Ha  or Nam Phuong. They had a couple kinks in first couple months open but that should be expected for any new business and now I find them really consistent. I always order extra broth for takeout and am a big fan of the papaya salad with shrimp and pork. Great addition to the neighborhood!"
    },
    {
        "id": 46,
        "text": "It's a total shame !!!!!\nI wanted to absolutely love this place since I'm a TOTAL pho addict!!!!\nI go to the wonderful Vietnam Palace in China Town a few times a week,  so much so that they don't even give us a menu anymore. They just say hi & bring us our regular order.\nRegrettably iPho Fairmount couldn't hold a candle to Vietnam Palace...\nIf it were as good I'd probably eat there daily since its around the corner & wouldn't have to deal with the nightmare of China Town parking.\nDespite the fact that our server was amazingly good looking the eye candy couldn't make up for the flavorless, bland food...\nIf I had a dollar for the amount of times I've said \"Fairmount needs a Pho place\" I'd be retired, unfortunately this place was not what any of us have been hoping for in our neighborhood...\nThe Pho broth tasted oily & the noodles mushy & had the consistency of a glue stick - just blaaaaaah!!!!\nThey \"forgot\" to bring us bean sprouts, jalapeño, mint leaves, lime etc for our pho... Aaaaaawwww!\nI think the team from iPho needs to go eat at Vietnam Palace & take a \"mint leave\" outta their book!!!!\nI genuinely hope iPho gets it together it would be fantastic for Fairmount!!!\nI would have given my first visit one star but giving an extra star for our good looking waiter!"
    },
    {
        "id": 47,
        "text": "We stopped by on Sunday night around 7 and were told that the kitchen was slammed so we'd have to wait 45 min for food. I had a major pho craving and was fine with hanging out. \n\nWe ordered the summer rolls and two large chicken Phos. \n\nThe summer rolls were great and tasted just like ones we had at Mekong River in South Philly. \n\nThe server brought out two small chicken Phos because the kitchen didn't have enough chicken left for large bowls. The server was extremely nice about the issue and offered us a bubble tea and pork chops. \n\nThe chicken pho was GREAT. I'd say it tastes better than a lot of the places we've tried on Washington. Very fresh and the broth had a lot of flavor. \n\nDon't leave without having the honeydew bubble tea. It. Was. Seriously. Amazing. So good. \n\nAnd finally, the porkchops. Very tasty!\n\nAll in all, ipho was great and I'd definitely come back. I think they need a few weeks to get off their feet. They just opened on Tuesday. \n\nGreat addition to the neighborhood."
    },
    {
        "id": 48,
        "text": "Terrible, completely terrible quality. They are ripping off people with their takeout!!! My boyfriend came home with a mango bubble tea that tastes like chemicals and has excruciatingly hard boba. All for $4.50. Not the first time it happens! How on earth are these people still in business?"
    },
    {
        "id": 49,
        "text": "Decent for Fairmount, but not as good as the places in China Town or on Washington Ave.  Also - don't get take out.... I got raw steak in a plastic bag and had to re-heat the broth until it boiled and add the steak in.  Sort of disgusting and not what I wanted to do before eating."
    },
    {
        "id": 50,
        "text": "This is our neighborhood spot! The food is consistently great. The pho and banh mi are delish.  We strongly recommend this place for a casual meal."
    },
    {
        "id": 51,
        "text": "This place may not have the best pho, but you can't beat the price, especially in Philly, plus the restaurant environment is good. They also have bubble tea and smoothie with interesting flavor, e.g. durian"
    },
    {
        "id": 52,
        "text": "Echoing the sentiments of poor, slow service.  Really want this place to succeed as it's in my neighborhood but they seem like they have a long way to go.  Also where are the vegetarian friendly items?  Would be it be too much to ask adding on a tofu bahn mi or bun bowl?"
    },
    {
        "id": 53,
        "text": "My husband and I decided to give iPho another go because we had a less-than-stellar experience during their grand opening time. Definitely has made a 180 change from before. Normal to no-wait times, courteous staff. The food is as good as it always was :) We are very happy we tried it again. Looking forward to going back!"
    },
    {
        "id": 54,
        "text": "I always like to be fair. I had visited this restaurant the second day it was open, and I did not have the greatest experience. Well, I went back last night. The stuffed grape leaves were fantastic. Probably some of the best I've ever had. I also had the Pho, medium size.  It was delicious. Although, I thought it was still a little \"light\" on the meat. I ordered mine with  tendons and tripe.  I was a little hard-pressed to find the tendons and the tripe.  But overall, it was a great experience and yes, I will become a regular."
    },
    {
        "id": 55,
        "text": "IPho has decent pho, but we haven't enjoyed the other dishes like the spicy beef noodle soup we've gotten there; it contained ingredients not listed in the menu description, a huge amount of oil, and it looked nothing like the image on the menu. The duck on their duck and cabbage salad is more bone and gristle than meat. While we'd likely return when we're not in the mood to cook, we wouldn't stray too far from the pho menu."
    },
    {
        "id": 56,
        "text": "The food here is absolutely amazing. I have yet to find something on the menu I didn't love. Will continue to go back for the food and the great people."
    },
    {
        "id": 57,
        "text": "Yummy pho tai and iced coffee. Quick and friendly service. Spotless interior. Just a couple blocks from Bookhaven :)"
    },
    {
        "id": 58,
        "text": "I really enjoyed this new pho spot on Fairmount. It's walking distance to bars, ice cream parlors and the Eastern State Penitentiary. It is a friendly and quaint neighborhood spot to meet friends or family for a filling lunch or dinner. I loved the 2 walls that had Vietnamese hats and the other wall had a painting mural of a bamboo forest. \n\nThe prices are so reasonable and the pho bowls range from Small-Large ($7-10).  I got the large but should have gotten a small or medium because it's SO MUCH food! ONE Large bowl is good enough for 2 people to share. This pho is way better than spots in DC because it flavorful and not just a bland chicken or beef broth that was poured into a bowl with noodles and meats. I ordered the #32. I will definitely try it again on my next visit to Philly."
    },
    {
        "id": 59,
        "text": "Pho is pho. There was nothing different. But the staff were very friendly. The atmosphere is great and the neighborhood is nice too."
    },
    {
        "id": 60,
        "text": "Oh dear. Was so looking forward to my Friday night Bun. Sadly, it was not to be.\niPho, we were so pleased to see you land in our neighborhood. Vietnamese food! In Fairmount!  We wanted to support your arrival in Fairmount.  But we were so disappointed by the reception on our first visit, we decided to leave before ordering.\nBasic customer service was seriously lacking. 101 for a restaurant host is to smile, greet the customer warmly and provide them with some helpful info (or better yet, a table!). Do not leave them flailing by the door, and then shove them on the window counter, when there is space for at least another 8 people at tables (because you haven't figured out how to separate two tables for 2).  The hostess was neither friendly, nor did she seem to have a clue.\nOnce seated at the window, we were told that it would be a 30 min wait to throw together a bun.  It was 9pm, so hardly dining rush hour.  And it's bun, so most of the ingredients are cold!  We cut our losses and went to the fun Japanese BBQ place on Callowhill instead.  \nOk, we get that it was opening week. Mistakes get made. It's busy.  But employ staff who have basic customer service skills and treat local customers with some courtesy, otherwise they won't come back. \nWe're going to give the delivery / takeout service a go this evening.  But if that fails, we won't be returning.  Customer service really matters in a big city like Philly. There are heaps of other great places to eat that have customer service down, so if you want to compete, let alone be a loved neighborhood eatery, fix this, and quick!\n\nUPDATE on takeout - Zero customer service on the phone either. We're going to Pho Cali in Chinatown instead - ten mins wait for takeout bun and noodle soup (they know how to run a takeout business).  We might try iPho again in a few weeks, if reviews suggest they've got their act together."
    },
    {
        "id": 61,
        "text": "Food was very good, place is neat and clean but not the friendliest or  most knowledgeable staff. The young waiter was very friendly but clueless about the menu.  I asked a few questions about the food and he didn't know nor seeked the answer elsewhere. The lady in the front didn't say hello when I entered or thanks for coming as I exited. But the food was very good so I'd give them another try."
    },
    {
        "id": 62,
        "text": "I ordered takeout from here tonight (Sunday) and thought it was only okay. I opted for the pho ga (chicken) in the small size since I was not super hungry. It turned out to be the right amount of food, but had I been hungrier, I certainly would have wanted to size up or add on an appetizer. \n\nThe pho was a 6/10. I've never before thought that any Asian soup needed more noodles, but I did find myself thinking that when I somehow had at least a third of the broth remaining but no more noodles or chicken. Although I found the chicken portion generous, it was very dry and I therefore wasn't crazy about it. The broth was fine but nothing special. The toppings, which were fresh and flavorful, were probably my favorite part of the dish.\n\nRegarding mechanics, I found online ordering easy and convenient. I was given a pickup time estimate that was about 20-30 mins after I placed the order, and then I received notice via the order tracker that it became ready for pickup about 5 mins earlier than the 20 min estimate (i.e., approximately 15 mins after I placed the order). The food was packaged up tightly, so it would've been hard to make a mess out of it, even with a bit of a distance to travel. This packaging also helped keep the broth warm, though I imagine it would've needed a tiny reheat had it been a cooler evening.\n\nGiven this neighborhood's relative proximity to a couple excellent Vietnamese places in Chinatown, I probably wouldn't choose iPho as a destination. That notwithstanding, it's nice to have an easy takeout option right down the street that's a step up from greasy Chinese or pizza."
    },
    {
        "id": 63,
        "text": "Grabbed dinner here recently with my sister. Pretty decent pho place in the Fairmount area. We ordered the fresh vegetarian spring rolls for appetizer. For the pho we both got medium sizes and it was just the right amount and left us full! It had plenty of noodles and tasty broth. I got the vegetarian pho and it had a generous amount of veggies and tofu. Great bang for your buck here. Definitely worth a stop here for some pho on a cold night."
    },
    {
        "id": 64,
        "text": "iPho has become my favorite lunch spot. Their food is delicious, fresh, and always great! There is nothing as comforting as Pho on a cold day, it's like a warm hug, that leaves you feeling full, but not miserable like you just ate too many french fries. Their portions are generous and very fairly priced. The staff is polite and attentive, delivering just the right amount of service! This is a huge compliment from me, as I'm usually annoyed by servers that feel the need to articulate every thought and upcoming action out loud, which of course, is not necessary. Clean and consistent, I LOVE this restaurant... and if that's not enough, they even have bubble tea, yay!"
    },
    {
        "id": 65,
        "text": "So good! Always get my brisket and raw steak pho and it never disappoints :) the bowl sizes are huge! I recommend the small if you don't want to drown hahaha! Love the extra sprouts, lime, Vietnamese leaves they give! I always add them to my soup. all the apps are so good. Great service! I always come here for bite"
    },
    {
        "id": 66,
        "text": "I was so glad to have a pho place in the neighborhood, so I'm rooting for these guys!  They just need to work out some of the details.  Decor - clean, tasteful, Asian-inspired but contemporary. Food - I ordered the pork spring rolls and a bowl of pho with rare flank steak and brisket.  Spring rolls were crispy, not oily, and tasty. The pho had fresh ingredients (Thai basil, sprouts, lime, good quality, tender meat).  Alas, the broth was not very flavorful compared with some of the places down on Wash. Ave.  It's lacking that \"stewed for hours\", hearty beef flavor I've come to love at places like Pho Ha or Pho 75. That's a big one they'll need to work on.  Service - started out strong, then fell off a cliff.  I was seated quickly, ordered quickly, food arrived quickly, then....hey, where'd everybody go?  No one checked in to see how everything was, my water glass was empty, I had to wait for my check (after I waved down the hostess, who was very friendly), then I had to wait for them to pick up the check when I was ready to pay.  Someone who appeared to be a manager was futzing with the lighting and the thermostat (we'll get back to the temperature in a second), but no one seemed to be paying much attention to the dining room, and not for lack of staffing.  One more thing - there's a blast of cold air every time the door opens, and the dining room was freezing.  They need to put a heavy drape or something between the door and the dining room in the winter.  I'll be back to iPho to give them another try because I love a good, hot bowl of pho.  I'm hoping the next time will be a little bit better."
    },
    {
        "id": 67,
        "text": "First time here - really great food and experience! We got some appetizers and two small bowls of noodle soup. The small bowls are plenty of food for one person. After a summer roll appetizer, I couldn't even finish the small bowl. The serving sizes are really great for the prices. I'll definitely be coming here again with friends and family."
    },
    {
        "id": 68,
        "text": "Too American style and soup is just chicken base and little missing Vietnam species. It was just ok but little pricey."
    },
    {
        "id": 69,
        "text": "After visiting the Eastern State Penitentiary, my boyfriend and I were a little hungry so we decided to stop by here for lunch. We each got a small pho and it filled us up just enough until dinner time!\n\nI got rare steak with tripe and he got rare steak with meatballs. Overall we paid $18 pre-tip, not too bad for pho! However, if we weren't planning on eating dinner 4 hours later, it would not have been a big enough portion at all.\n\nThe restaurant itself is very clean and the staff are friendly and attentive. I only took one star off because I found the broth to be on the salty side."
    },
    {
        "id": 70,
        "text": "They have vegan pho!  Satisfies your 'fix', but tastes okay.  I've had much better. Broth is too sweet.  The veggies include fried tofu & shitake shrooms (both yummy), as well as radish & carrots (both soggy, so not good).  I included a pic.\n\nOther good things tho - they have 3 sizes for pho, small medium and large.  And overall the food is typical vietnamese.  Great go-to place in Fairmount if you need your pho fix."
    },
    {
        "id": 71,
        "text": "Aw man, I really wanted to like this place. I love Vietnamese food and felt stoked about the possibility of being able to get my fix within walking distance of my apartment. Unfortunately, the food is god awful. For reference, my dining partner and I tried the pork summer roll, bun bo hue, and bun cha gio. I'm not really sure what was inside the roll's rice paper but the shredded \"pork\" tasted like cardboard and I had to restrain myself from spitting it out. The broth of the bun bo hue had heat but lacked any flavor (not even a hint of lemongrass; womp, womp) and the noodles were way overcooked. The bun cha gio was semi-edible. Noodles, herbs, and fish sauce were all fine but the mini fried spring rolls were oil soaked pieces of garbage and I am positive you can find better spring rolls in the frozen section at Walgreens. \n\nThis place does not do Vietnamese food justice at all. If you're in the mood for Vietnamese, save yourself the heartache -- gtfo of Fairmount and head to Washington Ave."
    },
    {
        "id": 72,
        "text": "3 stars for the service, 4 for the food.\n\nThis new pho place is right down the street from me. I make a point to try out all the new places in my neighborhood, so I stopped in here on a busy Wednesday night.\n\nThe interior is simple, with coffee shop-style seating with two-tops and no elbow room. The menu, conversely, is expansive, with over 60 menu items including appetizers and entrees. I had the pho with brisket and flank and tripe and it was delicious. The meat was cooked perfectly and the broth was flavorful. I will be coming back here to try the rest of the menu."
    },
    {
        "id": 73,
        "text": "We had dinner here last night. Based on some of the earlier reviews, it seems like they've gotten their act together and I'm glad we waited a few months before stopping in. We ordered the summer rolls, Pho Tai (steak) and Pho Ga (chicken). For me, the broth is the real taste test. iPho's broth had lots of flavor and was really good on its own. There was a good amount of meat in my Pho Tai and even more chicken in my bf's Pho Ga. The medium sized order was still a pretty big portion and definitely enough for dinner. Can't wait to go back!"
    },
    {
        "id": 74,
        "text": "I've been to many different Vietnamese restaurants over the decade + I've been in Philly. This spot I would describe as \"pho lite\", better than chains like pho 75, but not as authentic tasting as Pho Saigon or some of the Washington Ave spots. The broth tastes more like beef buillon and not as full bodied as some of the other stocks I've tried.  Despite that, the cleanliness and service here rates much higher, which is appreciated. I ordered the Tai Gan which came with a large portion of rare steak and soft tendon, not the random pencil eraser stuff you can sometimes find. I will definitely order again!"
    },
    {
        "id": 75,
        "text": "The service is lacking.  My boyfriend and I both ordered pho and the waiter never brought out the garnish, which is essential to eating pho. We had to ask for it after he brought it the pho. The broth was very simple and lacked flavor.  Perhaps it needed to simmer longer? Or needed more spices? We also ordered the pork and crab egg rolls which didn't taste like anything special. You actually can't even tell that there's crab in there so I wouldn't both getting it."
    },
    {
        "id": 76,
        "text": "iPho was a nice experience. The ambiance was nice, the service was average and the food was alright. No real complaints from the evening but not the best Pho I've had!"
    },
    {
        "id": 77,
        "text": "A decent place to fulfill your pho craving. My usual go-to pho places are near Washington Ave but this was not a bad place to stop by if you're in the area. They have three different pho sizes to choose from and a wide variety menu. It is slightly pricier though.\n\nFood we got:\n\n-Pho with rare steak (steak is small but tasted fresh)\n-Vermicelli combo\n-Fried srping rolls (Pretty good but if you want to try the BEST fried spring rolls, check out Vietnam Cafe in West Philadelphia).\n\nService: We went with a group of 16 and everyone got food at different times but overall the service wasn't bad.\n\nDecor: Clean and more upscale compared to the pho restaurants in South Philly."
    },
    {
        "id": 78,
        "text": "I was so excited to see a pho place open up in Fairmount, an area that is more or less a food desert. Welp, so much for my excitement.\n\nI can't properly review their food because I wasn't even able to eat it. We went in there at a normal dinner time and...... they had run out of meat. All meat. Wow, seriously guys? Pho takes a grand total of like, 3 ingredients to make.\n\nSecond, this place looked and smelled like a high school cafeteria. Dim lighting, staff that looked like they had no idea how to be in a restaurant and didn't much care to learn either, and the whole place was cold, drafty, drab, and generally depressing.\n\nOh, and I forgot to mention one thing: The first thing you see when you walk in is a wall full of (wait for it...) Asian rice farmer hats. Not kidding. Just a wall full of maybe 40 rice farmer hats hanging as pretty much the only decor in the restaurant. Ummmmm.\n\nAnyways, I'll try again in a few months when they get their act together. Or maybe not."
    },
    {
        "id": 79,
        "text": "I love iPho but was incredibly disappointed by them  this evening, alas the 2 stars (if I was reviewing off of tonight they'd be getting 0). I called ahead and drove there for a carry-out order of a medium sized bowl of pho tai and an order of summer rolls. I waited an additional 15 mins for the order to be prepared, and when I got home, I had a completely wrong order. Some sort of soup with vegetables and tofu, and summer rolls with no peanut sauce at all. \n\nI know they deliver, so I called and asked if they would deliver the correct order to me. Their response was that their delivery person wasn't working currently, so I'd have to come pick it back up (after hanging up the phone I went online to Grubhub to verify this, and it looked to me like they were accepting delivery orders). I don't live close enough to walk, and it's pouring out. I explained that I have a soy allergy, so I could not even eat the food I was given. Finally, after them telling me they would not bring me the correct food, the man I spoke to told me that next time, I need to order in English, bc what I said was something completely different. I have been to iPho (and many other Vietnamese restaurants) multiple times, and I order that dish the same exact way every time and have never had an issue! I used to order from the using the menu numbers, but the numbers change so often I stopped doing that bc I've gone home with the wrong order multiple times before. Really rude. \n\nI was told I'd get a refund next time I came in, but he never took down my number or gave me anything official so I doubt that'll happen. At this point, not sure if I want to go back since I just spend $15 on food I am allergic to. Disappointing.\n\n***Update - I found pho toppings in my bowl of vegetable soup. So clearly they understood me.***"
    },
    {
        "id": 80,
        "text": "Delicious vegetarian pho! BYOB and cheap, what more could you want? The noodles are delicious and tasty and they serve you a large portion, I got a medium and still had leftovers. Definitely coming here again!"
    },
    {
        "id": 81,
        "text": "They have lost my business without even trying the food. I decided to get a delivery today from IPho. Their menu clearly indicates they deliver but when I called them to place my order they told me that not only they don't deliver but they don't take orders over the phone. They told me I could order through GrubHub. OK fine I'm already ticked off they won't take my order directly but now they are forcing me to use a third party to place an order. I proceed to order my food only to get to checkout and have GrubHub tell me it would take 70-80 minutes to deliver the food. No food is worth waiting that long for delivery."
    },
    {
        "id": 82,
        "text": "We'd like to review based on the food, but we never got a chance to even sit down. When we arrived with a mobility scooter, the server LITERALLY wrinkled his nose in disgust, rolled his eyes and said, \"I don't think we have room for that thing.\"\n\nThe place was mostly empty and moving one table 6 inches to the right would have done the trick. Living in Philly we are used to making sure places are wheelchair accessible before going out and this time was no exception. My partner (a disabled marathoner living with MS) stopped in a few days before and spoke with a manager who assured her everything would be fine. \n\nIt wasn't. Obviously. We were made to feel like a distasteful burden and even after giving the server another chance to say ANYTHING not quite so offensive, he just stood there looking us in the eye without an ounce of empathy or even common courtesy.\n\nAfter that staredown we said, out loud, \"F**k it. They don't want our money.\" Again, NO RESPONSE. At all.\n\nWe left and went and tried the brand new Bar Hygge at 1720 Fairmount instead. It was far more crowded there and yet somehow they were VERY happy to accommodate us. It was awesome."
    },
    {
        "id": 83,
        "text": "Five stars because it met all my expectations.  The pho comes in three sizes, the large is colossal and less than $10 - chili-oil on request, staff very friendly.  New, modern, comfortable place, in a gentrified neighborhood."
    },
    {
        "id": 84,
        "text": "Glad to have a decent pho place in the area. Had the beef  ball pho and pork chop rice dish. The Pho broth was good. Got a large bowl to share and it was plenty! The rice dish was also good. The pork chops was well seasoned and good portions. \nNice decor. \nStreet parking. \nGood service."
    },
    {
        "id": 85,
        "text": "5 stars!! We had amazing times here. The room was so comfortable and look really nice. The food was absolutely spectacular and delicious. The waiters were friendly and nice. Especially please give our thanks to Nam! The best waiter I ever had. He so nice and knowledgeable. We did not need to order coz he already knew what we want. He always made us satisfied with everything. Thanks Nam too much! Once again, what a place!"
    },
    {
        "id": 86,
        "text": "This had got to be my favorite place to get pho. I drive about 30 minutes to eat here. The broth is amazing and the portion sizes are huge! I get the large pho deluxe I recommend you try it. The service is fast and extremely nice."
    },
    {
        "id": 87,
        "text": "(Pick up & delivery ordering) Absolutely the most AWFUL place you can order food from. They ALWAYS messed the orders and give you some tofu shit instead of what you ordered. They forget stuff from your order and have to reimburse you for it. \n\nSince they work with a numbering system, the person on the phone don't want to hear the actual name of the dishes, they ask for numbers and since THEIR website is NOT up to date with the menu, all this f*** up could be avoided.\n\nIf I could give a ZERO I would."
    },
    {
        "id": 88,
        "text": "Bad service but the restaurant just opened so I cut them some slack. Don't listen to the people dropping one star reviews because there food took more than 20 seconds to be ready, it's not like they have anywhere to be anyways. Food came out hot and ready and the Chà Giò egg roll was amazing not to mention the Beef pho which tasted like it was straight from Vietnam. One more thing that I love is that the food is healthy. I also love the modern yet traditional design and atmosphere of the restaurant. Definitely my new favorite place on Fairmount avenue. Can't wait to come back again next week!!"
    },
    {
        "id": 89,
        "text": "Good food and quick service. Not very busy. A bit drafty in the winter but still good. Quiet spot and great pho. Would go back again for sure."
    },
    {
        "id": 90,
        "text": "Some of the best food I have had in Philadelphia. The price is unbeatable for the amount of food you get. It is so fresh and so clean and naturally seasoned with cilantro lime and lemongrass. Their pho is awesome but I suggest their cold noodle bowls with charred beef, chicken, fish, or vegetable whatever your thing is !! Their appetizers are great too!  Make sure you order the Soda Chanh Mui(salty lemonade ) I know it sounds weird but it works. Their marinated beef wrapped in lemongrass is so clean and flavorful. Their shrimp summer rolls are perfectly cooked shrimp wrapped in rice paper are a must. Their crispy vegetarian spring rolls are fire. Honestly anything I have ever had on this menu is good... my favorite in their char grilled beef over noodles !! 10 dollars for a bowl LOADED with flavor and not going to make you feel like a load afterwards ! The perfect portion so you are satisfied but not having to unbutton your jeans !!"
    },
    {
        "id": 91,
        "text": "Great spot for a cheap, quick meal. If you're looking for the best pho you've ever tasted, then I'd say keep looking -- this is not the place for that. But the food is decent, good portion size, and you really cant beat the prices."
    },
    {
        "id": 92,
        "text": "Passable food but much too overpriced. Barely any meat in giant ball. Mostly msg soup"
    },
    {
        "id": 93,
        "text": "I ate there today 12/21/16. My wife is allergic to MSG. Nowhere did the menu indicate they used it. When questioned, the waiter said they did in fact use MSG. My wife felt queasy and we asked for the check. I said I would not pay for her Pho, but they but both servings on the tab. When questioned they gave us a blank stare.\nMSG should be indicated on the menu as many people are allergic. They did not seem to care.\nI live in the neighborhood and will not return."
    },
    {
        "id": 94,
        "text": "Food was good for a Viet Rest., out of NY but beware prices on the site & on yelp are old. Basically everything is at least 1-2 more than you see. A small at $10 is a NY small at $7 & a small in SF at $5. Service charge was added to our large party we were still waiting for \nwater & it wasn't even that busy. \n\nIn Philly quite often now will definitely go back to the Viet mall next time for old school authentic food & desserts."
    },
    {
        "id": 95,
        "text": "Excellent experience with wonderful selection of Vietnamese cuisine. I had the beef pho which was perfection however the beef bahn mi was to die for as well the rice vermicelli-bun na gong was my favorite. Grilled chicken on a bed of light noodles with carrots, celery and cilantro. Defin plan to make it back."
    },
    {
        "id": 96,
        "text": "We had been going to this Pho place for a couple years, since it's the only one in our area. However, in our last takeout order, there was a fingernail in my husband's Pho Tai Nam. He PULLED THE FINGERNAIL OUT OF HIS MOUTH. Seriously - a hair in our food would have still been gross, but understandable - but a freaking fingernail? WHO CLIPS THEIR NAILS IN A RESTAURANT KITCHEN??? We were both so thoroughly disgusted that we stopped eating immediately and threw the rest of the food out. That's just nasty."
    },
    {
        "id": 97,
        "text": "I visited this place on a casual Thursday for dinner. It was a traditional looking Vietnamese place. Our sever KAY was extremely sweet. I wanted an appetizer but unfortunately everything was made with pork. The only thing that was not made with pork was spring roll (clear version) which I am not a fan off. I order a small pho a guaog with grilled chicken. I asked for it to be spicy but they only had sriracha sauce. We received  our food swiftly. Kay gave me extra spice sauce in additional to the sriracha which made the pho 10 x better. There was a side plate with bean sprouts, jalapeño, and lime! Overall I think this place was a little above average I would go one more time to see if they changed anything on the menu or added!"
    },
    {
        "id": 98,
        "text": "Good place to grab some pho.\nWe both ordered pho and got the medium size, which was a big portion! Broth was flavorful. Tons of noodles. The flank was really fatty though.\nLots of seating. Food came out quickly. Service was friendly.\nDecent place to get pho."
    },
    {
        "id": 99,
        "text": "Love this place, the soup base for the pho is delicious. I would burst my stomach to seep down the last drop. They used to have avocado smoothie in the summertime, but not at the moment. That avocado smoothie is refreshing and delicious!! I miss it very much. Bahn mi is good too. I've never been a big fan of the broken rice dish so I can't comment on it."
    },
    {
        "id": 100,
        "text": "The Beef Pho is exceptional! They give you a decent amount of meat and the service/delivery is quick."
    },
    {
        "id": 101,
        "text": "My family and I had been craving Vietnamese food for a while and really wanted some soup on a cold day. Serving portions are HUGE with lots of noodles and protein. Employees were all extremely knowledgeable and attentive. Really recommend!"
    },
    {
        "id": 102,
        "text": "I should have known the moment I realized that nobody was dining on Fri evening.  I should have walked right out.  I don't even know where the 5-star Yelp ratings are from.  They can't be for real.  \n\nFirst, they said they aren't serving drinks because of short staff.  But I was the only customer in the entire restaurant and I didn't ask for a fancy cocktail.  All I asked was a bottle of Sprite, and the beverage refrigerator was right next to my table.  Second, 10 mins after taking my order, the owner came out and said they have no white rice or fried rice.  This is like a bakery running out of flour or butter or Starbucks running out of coffee.  How can an Asian restaurant run out of rice?  Lastly, 30 mins after order, the owner came out and said they ran out of pork.  At that moment, I walked out the place.  This place has no professionalism, no consideration for customer's time and most importantly essential ingredients for the cuisine they serve.  I still upset that I sat there wasting my times. They didn't know that they ran out of rice and pork at the time of order placement at 6pm on Friday? Game over!  What a shame.  Stay away.  I have never been to a worse restaurant than this one in my whole life."
    },
    {
        "id": 103,
        "text": "Ipho never disappoints! Food is always great and the staff are quick and friendly. The portion sizes are huge and more than fill you up! I always go with the 66 and it has just the right amount of heat. 71 is a great meal as well. It's the best spot to go to on a dark and rainy night!"
    },
    {
        "id": 104,
        "text": "Pho is fine, but customer service is terrible. I will not be returning to this restaurant."
    },
    {
        "id": 105,
        "text": "The service is lacking.  My boyfriend and I both ordered pho and the waiter never brought out the garnish, which is essential to eating pho. We had to ask for it after he brought it the pho. The broth was very simple and lacked flavor.  Perhaps it needed to simmer longer? Or needed more spices? We also ordered the pork and crab egg rolls which didn't taste like anything special. You actually can't even tell that there's crab in there so I wouldn't both getting it."
    },
    {
        "id": 106,
        "text": "I've been coming here at least 3 times a week. I love their pho, but other dishes are great too. I love their broken rice and bahn mi sandwiches. \nThe service is awesome and there is usually enough parking."
    },
    {
        "id": 107,
        "text": "The pho was fantastic! The owner is a great guy and very helpful. He's awesome! We also had 2 appetizers that were great. Highly recommend"
    },
    {
        "id": 108,
        "text": "I really like this place. I recommend the fried pork egg roll and chargrilled pork Vermichelli bowl, rare steak pho."
    },
    {
        "id": 109,
        "text": "Good pho, but lackluster customer service which ruins the experience. Showed up at opening time, was told it would take 15 minutes as the only customer, patiently waited over 40 minutes for a bowl of pho. No apologies, no thoughtful \"can I get you anything in the meantime\" - no nothing. I've been here many times - consistently lackadaisical service."
    },
    {
        "id": 110,
        "text": "Love this place \nVeggie pho is delicious although the broth is so flavorful i'm not sure if it's vegetarian or not, grilled chicken pho was very flavorful and the veggie spring rolls are great !"
    },
    {
        "id": 111,
        "text": "The pho was awful! Service was really long! Over cooked egg and no utensils! \n\n\n\n\n\nBit into gristle or bone idk it was nasty"
    },
    {
        "id": 112,
        "text": "Despite it being a Friday afternoon, it seems as though this place had two people working in total. Being understaffed meant that the service was incredibly slow as our main dishes took 40 minutes to come out. We were hangry and frustrated but eventually the owner served us our dishes himself and profusely apologized for how long it took for the food to come out and thanked us for waiting. The food itself was amazing and at a great price. I got the bún thịt nướng as my main course along with the summer roll and fried spring roll as appetizers. Everything was so tasty and delicious, nothing disappointed me. Would definitely come back again when visiting Philly but just be mindful that service might take a bit of time!"
    },
    {
        "id": 113,
        "text": "The Pho here was quite delicious.  The Pho broth was well made and very flavorful. The Pho comes in small ($9.95), medium ($10.95) and large ($12.95). I shared a large bowl of Pho and it was more than enough for the two of us. The bowl was huge! Definitely go with the large if you have the option to share with someone. \n\nI also ordered the summer rolls, which were nicely wrapped in rice paper with fresh ingredients. I liked the accompanying peanut sauce too. \n\nThe interior was clean and spacious. Service was fast and efficient. The food is good, prices are great, and portion sizes are awesome. I would definitely eat here again if in the area."
    },
    {
        "id": 114,
        "text": "Solid pho and really nice folks. My partner and I decided to eat in when we got takeout and realized we were really hungry and there were only two other people eating indoors. They seated us and brought us waters, checked on us several times, and even didn't charge me for the tea I later ordered even though I offered after we'd already paid for our to go order."
    },
    {
        "id": 115,
        "text": "This place has many options and the owner is absolutely sweet and very helpful! Ordered the fried egg rolls with pork and crab meat, which were delicious! The pho was good too, but I just wasn't a fan of tendon and tripe. Next time I will order a different version, but if you're into that order it because it's their best seller"
    },
    {
        "id": 116,
        "text": "Disappointing. This place has slipped. I ordered summer roll which was rubbery. I also ordered Bun #19 in the past this had been a delight, this time bland and tasteless. Also prices were higher than on menu or on the web. Just lazy not to update. \nI'm done I Pho is off my list."
    },
    {
        "id": 117,
        "text": "I stopped in with my 8 month old baby around lunch time. The service was friendly and super accommodating. The guys in the shop brought me a highchair, played peek a boo with my baby, brought us extra napkins and a small plate for baby. The Vegetarian pho was tasty but the crowning jewel were the employees."
    },
    {
        "id": 118,
        "text": "The restaurant has a great atmosphere- Vietnamese infused modern look (I also enjoy the novelty of the lime green plastic chopsticks that coordinate with the bamboo wall art). \nThe food is fantastic and I honestly can't get Pho anywhere else now that I've had theirs!! The broth is properly made from bone and has just the right balance. It's the best pho that I've had in the US!\nPrices are great and the staff is attentive. \nFavorite spot for Vietnamese food!"
    },
    {
        "id": 119,
        "text": "Got a large pho tai to share with my girlfriend. The portion is huge and they give a good amount of meat!"
    },
    {
        "id": 120,
        "text": "Great neighborhood spot for some amazing pho. I get takeout from here often and it never disappoints."
    },
    {
        "id": 121,
        "text": "Favorite place in fairmount! The pho is out of this world! And the staff is wonderfully pleasant"
    },
    {
        "id": 122,
        "text": "A very clean restaurant with a large menu and delicious food, especially the Bahn Mi sandwiches.  I love that it's only a 1-minute walk from my house!  Very friendly staff as well....I'll definitely return."
    },
    {
        "id": 123,
        "text": "It was my first time trying this place. I usually go to Washington ave if I want a good vietnamese dish. \nSo I ordered chicken and rice, the waiter told me they ran out of chicken. \nOkay, so I asked for the pork chop and rice. He told me they also ran out of pork chop, but they had charbroiled pork and rice. So I told him yes I'll take that. \nMinutes later both of my friends received their pho, and I patiently waited for my \"charbroiled pork and rice\" .. 20 minutes passed by, and my food still never arrived. My friend went up to ask the host, which then the waiter came back and told me they \"ran out of rice and he forgot to tell me!!!!\" \nSo I said \"oh so are you saying I don't get to eat dinner tonight? all my friends already finished their food\" .. he apologetically tried to offer me \"pho\" which he claimed will be quick. But I actually don't eat pho. He then offered me the beef vermicelli, and I didn't want beef. So he goes we can make you the charbroiled pork with vermicelli and we won't charge you for it. Okay .. so that made up for it.. \nMy food came and it was a good dish.. then we asked for the bill... and lord and behold he still charged me for the dish!!! .. what a mess! \nIn the end he did fix the bill.. but the whole entire service and experience left me like WHAT THE F ..."
    },
    {
        "id": 124,
        "text": "Not a pho expert by any means, but this place has gotten me hooked. Portion size is great and the staff has been friendly every time."
    },
    {
        "id": 125,
        "text": "DO NOT ORDER from this restaurant. I just picked up a take-out order and discovered when I got home that they had served all three dishes on romaine lettuce (see the CDC warning about e-coli). When I called to ask about the use of romaine, the employee was completely ignorant about the issue, couldn't be bothered to address my concern, and hung up on me. When I called back to state how appalled I was at their customer service, I was told that I could \"throw out the food\" if I wanted. Because, of course, everyone orders take-out only to throw out the food when they get home. This is the worse customer service I have ever experienced at a restaurant and definitely will never be returning. I'd warn others against ever visiting too, especially if you care at all about food safety."
    },
    {
        "id": 126,
        "text": "Their ban mi sandwich is the most tasteless thing that I've had in a very long time - a real tragedy given how flavorful it's supposed to be! Don't waste your time - go elsewhere."
    },
    {
        "id": 127,
        "text": "I've been there twice..take out.  everything was fresh and delicious!  Prices very reasonable. Great addition to GAMBA  area. Will be returning soon. Staff very friendly, too!!"
    },
    {
        "id": 128,
        "text": "The pho soups are delicious built it up with basil, bean sprouts and any meat you want and as a desert item add on one of the bubble teas....mango was my favorite"
    },
    {
        "id": 129,
        "text": "Best Phuckin Pho in Philly. The food was amazing, especially liked the hu tieu mi. I also really enjoyed the decor-- bright and clean. Great location."
    },
    {
        "id": 130,
        "text": "I was very disappointed.  This was my first time dining here and the staff were rude.  They never came to check on my table to ask if we were ok. I paid with my card and didn't leave a tip because they were rude.  The next day I checked my bank statement only to see that they took it upon themselves to take a tip anyway. When I called the restaurant to speak with someone they gave me a hard way to go about refunding my money back.  I told that guy on the phone that I didn't leave a tip for a reason and them taking a tip without my knowledge is called stealing.  Long story short the guy agreed to refund my money back.  I'm never going back again and the pho wasnt that good anyway. Please check your receipt and bank statement after you dine hete6"
    },
    {
        "id": 131,
        "text": "Pho was good.. I got the Grilled PorkPho which was coooked to perfection. However; the food & the coffee took a while & there were only like 6 customers but I guess you can't rush Greatness. Also it be great if their was a greeter when you walked in. Family of 3 walked in & the waiter softly yelled from the end, then the middle of the restaurant\n \"sit where ever you want\"  but only untill the 3nd time did the customer hear him."
    },
    {
        "id": 132,
        "text": "I think I found a new favorite! Delicious food  friendly staff  clean restaurant  inexpensive prices . We came here on a Saturday evening and there were probably 3 tables occupied. The restaurant is calm and clean and I'd say of medium size.\n\nWe asked our waitress for recommendations and thankfully she recommended exactly what we were looking at. We ordered a large beef pho deluxe #36 on their menu. We got our without the tripe and they were nice enough to let us get more of one of the other meats. The large pho sets you back $10.95. Let me tell you this portion is huge and they do not skimp on the meats at all like most places do. Our pho was delicious and more then enough for two people.\n\nWe also order the Com Bo Luc Lac #74 on their menu. The cubed beef sirloin was cooked perfectly and oh so tasty! The manager came by and chatted with us a bit. Our bill for both items was $23 which is amazing for the amount and quality of food we got. Can't wait to go back, definitely a neighborhood favorite!!"
    },
    {
        "id": 133,
        "text": "I wish I could give this zero stars. I tried to get Pho from this place around 7pm on a Monday. The open sign was lit and the door says they are open until 10pm. A few other people were inside eating. \n\nI had my dog so my friend went in to order takeout for us and came back out puzzled saying he thinks the place was closed. I went in to see and the guy behind the register was extremely rude. He said then screamed no and motioned increasingly wildly when I tried to order and then calmly asked if they were closed now (which he didn't actually say, but I assumed from his refusal to take an order ‍) when could o come back that they would be open, since I live nearby and have been wanting to try it. The man's screaming attracted the attention of the/a woman working in the kitchen, who came over to ask what was going on and then tried to take my order. \n\nThe man LITERALLY HIT THE WOMAN ACROSS THE FACE, full arm swung on her across the head and race with an open hand. Less than 6 feet in front of me. I wasn't even the only person in the place and the guy seemed totally unembarrassed. The politely tried to continue taking my order, but I said \"no, I'm leaving\". I will never ever give this place my business. \n\nI honestly considering calling the police, but I decided it was not place. The reaction of both the man and the woman after this incident let me know that this clearly was not a one time occurrence. I'm disappointed because I really was excited to have a Pho place close by, but I'm much more sad for the woman and I hope she is ok!"
    },
    {
        "id": 134,
        "text": "It's been awhile since I've had Pho and this really hit the spot. Heads up - the large size is HUGE, and I got three meals out of it!! Got the fried pork dumplings for an app and went with the rare steak and crispy flank pho. Egg rolls were great, as was the pho. Came with enough basil, sprouts, and spices to add in.\n\nI must say the outside really makes the place seem inauthentic and trying to be super modern, which has turned me off from coming for awhile. But, the food was delicious and the service was great."
    },
    {
        "id": 135,
        "text": "Place is a gem!\n\nFood selection is amazing! But the owner seems unable to keep up with demands due to staff shortage. Still the basic meals are great!\nI really hope they can sort out staffing issues so they can get back to pre-covid menu and flavors. Until then I'd recommend an updated menu with less choices. It is disappointing to order a dish and have the waiter come back to inform us it's not available.. still like I said, the basic pho dishes are available and delicious."
    },
    {
        "id": 136,
        "text": "I've been going to this place for a while and love their vegetarian pho and other options. I'm really disappointed to report that I had a bad experience today. The food I ordered was clearly bad, there was a potent sour smell that was definitely the onions, which were also slimy (they were raw). The smell was so off-putting I couldn't eat it. I called to ask for a refund. Said it in a super nice way, something like \"hey I know you guys are doing your best, but this specific item has gone bad and you should look into it.\" The owner yelled at me on the phone and said he would absolutely not refund me or even look into his foul onions. So I just hung up. And I guess I'm never going back."
    },
    {
        "id": 137,
        "text": "Coming from  California, we always found subpar Pho places here in Philly. This spot is totally legit ! Good prices abd authentic taste."
    },
    {
        "id": 138,
        "text": "visited on a saturday during lunch time. their pho is pretty classic and definitely a great comfort food option. would definitely recommend to anyone in the area!"
    },
    {
        "id": 139,
        "text": "Everytime I come visit my mom, THIS IS OUR GO TO PLACE!! \n\nwe've been coming here for a while now, and let me tell you their food is amazing, the ambient here omg its just super nice. The interior as well for their restaurant is super cool. \n\nWhile we're still in the pandemic, its just the owner who operates this restaurant atm..  The wife is the cook, and the husband( Van) is the one who takes the order. \n\nYou guys should definitely check them out, support amazing small business!!!"
    },
    {
        "id": 140,
        "text": "Nice little Vietnamese restaurant in Fairmount. \n\nFocus is clearly on Pho, and they have a variety of Bahn Mi options.\n\nTheir food was okay, nothing to really write home about. I would suggest takeout, the interior of the restaurant is really just meant to seat you, and that's it. \n\nTheir service is great though, very friendly."
    },
    {
        "id": 141,
        "text": "This place sucks. The food that I have tried is good so I will give them that much, but they are horribly inefficient. I have been here twice now. The first time I tried to order an item off the specialty menu. I was briefly told that they did not have the ingredients to accommodate. Fine whatever, they're a small business so I'll give them a pass this time. I ordered pho and it took like a cool 45 minutes to come out. I was annoyed but whatever it is what it is. The second time I eat here I try ordering the same item that was not available the last time. I am given a different excuse about how they do not want to because they would need to make a whole new pot. Excuse me but that is not my problem, and aren't you a restaurant? Making more of a food is literally your business model. Whatever I don't want to get into it so I begrudgingly order another pho. It takes another 45 minutes this time and I'm fed up, I want to know their deal. I ask the guy behind the counter and he said they had to MAKE A NEW POT. You are reading that correctly, they denied me the first dish because they needed to make a new pot so when I ordered pho the solution was to make a new pot. Cool thanks, I'm never coming back."
    },
    {
        "id": 142,
        "text": "This place has amazing vietnamese food at an affordable price. Their Pho, bahn mi, spring rolls, summer rolls, etc. are all incredible and delicious. Definitely as good as or better than the pho shops down on Washington Ave."
    },
    {
        "id": 143,
        "text": "Some of the best pho in the city! This place is a super low key spot on Fairmount Ave and their food is unbelievable.  So flavorful and perfectly sized portions. Their summer rolls and beef pho is my favorite order - I crave it once a week. \nThe owner (or at least the guy that's always there that I assume is the owner) is SO wonderful. He's always cracking jokes and is very friendly. \nBest part - it's BYOB!! Not to mention the prices are very reasonable for the area. \nI recently ordered pho somewhere else and it wasn't half as good as iPho - it reminded how lucky I am to have this place so close. I'm too afraid to stray and try new places now because I'll just regret it and wish I went here."
    },
    {
        "id": 144,
        "text": "Great pho place with TONS of options! I only wish that I knew more about pho or that they had more photos. \n\nI got #51, and it was great. I personally like my pho to have more complex flavors, so I wound up adding some spice, soy, and hoisin."
    },
    {
        "id": 145,
        "text": "Wow so great. The vermicelli is so good. I was looking for a healthy place to eat for my mom whose very picky. We both loved it so much I had to write a review. The customer service was so amazing as well."
    },
    {
        "id": 146,
        "text": "My favorite pho restaurant of all time and I've been a pho fanatic since I was a child and I've been to quite a number of places. The service is on point - your water never falls below halfway, the food is prompt. I suggest anything with the grilled pork (including the bahn mi) and you can't go wrong with their pho. I go too often to admit"
    },
    {
        "id": 147,
        "text": "Decent spot for some delicious pho.  Location is definitely cleaner and brighter than the typical places on Washington Ave., but the broth doesn't have that deep, complex, warm-your-soul goodness as standard staples along Washington.  Overall, if I'm in the area, I would stop by again, but wouldn't necessarily go out of my way."
    },
    {
        "id": 148,
        "text": "Grilled porkchop vermicelli. Didn't particularly when my heart because the pork chop is not really on the bone it was pretty dry and It was really try and chewy. it is my first time here so I'll probably give it a second try it is on the price side for Vietnamese food for me. I just wish to meet was not dry and chewy. I'll try again next time with some pho soup based. And edit my review"
    },
    {
        "id": 149,
        "text": "Cozy place; typical vietnamese Pho and other vietnamese cuisine; very nice Ambiance and very clean.\n\nI tried the vietnamese iced coffee for the first time....quite strong and compliments very much after a hearty meal."
    },
    {
        "id": 150,
        "text": "I had been telling the universe for 10 yrs to open a pho place in Fairmount. Growing up on Viet food, I didn't like any of the Viet places in Chinatown and would go to Washington Ave at least once a week for a bowl of pho. iPho makes spring rolls exactly like my Aunties in VN and their pho is fantastic too. I like that they have S, M or L size bowls. Many pho places do S or L. I agree that iPho had a rocky start but many new restaurants take time to figure out their rhythm. iPho's service has improved greatly and is my new go to spot."
    },
    {
        "id": 151,
        "text": "I didn't get to try their pho (it was awfully hot today) but found my meal to be pretty satisfying nonetheless. I had their Pork Banh MI, and while it was pretty different from all the other Pork BanhMis I've had at other places -- they might have used a different cut, cooked it different etc -- it was still pretty good. Our server was extra friendly, and we didn't wait long at all! Excellent and wide selection of choices on the menu. \n\nWhile I wouldn't call iPho a \"Must Visit\" place in Fairmount, I will say that it's a pretty good option if you're looking for Asian takeout at a decent price. I'm still raving about their Banh Mi, and will definitely come back just for that, and to try their pho. I thought the quality of the bun of my Banh Mi to be top notch, you could hear the crisp of the bread crust and feel how soft it was on the inside! The pork was well marinated, and overall very well put together. \n\nThe only real downside with my experience this time round was that they didn't have their durian smoothie, and their avocado smoothie was ridiculously grainy. It was lacking in proper flavor, they may have put too much ice, not enough honey or sugar etc. I wouldn't recommend this smoothie at all."
    },
    {
        "id": 152,
        "text": "I ordered my usual spring rolls today for lunch & they made me the wrong thing (rice paper wrapped veggies...which tasted HORRIBLE). Super hungry and so upset, I took them back hoping they would make me what I actually wanted. They told me they would not make me what I wanted AND told me they will not repay me. So now I'm down $10 and no lunch  :( never coming back here & I suggest you do the same! Horrible business they're running."
    },
    {
        "id": 153,
        "text": "They always charge more than prices posted on their website/menu then claim the website is out of date. Which has been going on for a while now. If you're a legitimate business you should post accurate pricing at all times.\n\nAlso they've made several mistakes with our take-out orders and then don't offer to make the situation right when you call back to make them aware of the mistakes. The employees don't have enough authority/autonomy from the owner(s) in these situations.\n\nDo yourself a favor and head to the better Vietnamese spots in Chinatown or South Philly (or if you're into banh-mi's, Brown Street Coffee nearby has legit banh -mi's).\n\nThat being said, food is decent and it's the only Vietnamese spot around the neighborhood (aside from Brown Street coffee which only has banh-mi's)..."
    }
]