[
    {
        "id": 1,
        "text": "The pho here is one size only, and it tasted a bit bland. For the price, I don't think it's worth it. It cost $12.95+ for pho. We ordered only pho, so I cannot comment on any of the other food here. \n\nI think it was their first day of opening today, so the workers here were a little lost when we were ordering. However, they did keep coming to our table to refill our cups and ask how we were doing or if we need anything. Friendly service for sure.\n\nIt's worth checking out. I would come back again to try their other food. Parking was also easy since there is a lot."
    },
    {
        "id": 2,
        "text": "My husband was craving for pho and this place is the closest pho restaurant around us, that is how we first visited this location. For now, we have been there for a good number of times. \n\nParking: They have their own decent size parking lot so there's no need to look for street parking. \n\nLocation: The restaurant is located very close to the Philadelphia Mills, aka Franklin Mills.\n\nServices: Employees were nice. They check on you throughout your meal or are available when you need them. \n\nCovid: All employees are masks on. They do tried to sit you apart from other customers if you requested. Most customers are sitting at the booth on the side back to back from other booth. \n\nFood: Pho taste not bad, at a good average level. Sometimes I do feel the soup broth might be slightly a bit salty, but overall not bad at all. Around the upper Northeast area near Bensalem, the food quality is consider pretty good. Portion wise maybe a tad bit small compare to other Vietnamese or pho restaurants.\n\nPrice: Their price are consider on the high end but not the ridiculous price I have seen at other locations. It is still acceptable. Maybe because I'm paying this price, I might expect a bit more out. \n\nWould I recommend this restaurant? Yes, I probably will if you want to eat pho or looking for some Vietnamese cuisine around this area."
    },
    {
        "id": 3,
        "text": "Clean ambiance and attentive service, food was a bit too sugary and on the pricy side for a vermicelli bowl."
    },
    {
        "id": 4,
        "text": "We went in at 9 pm and it was nice and quiet. Food was served and boy was it delicious. We had the typical combination Pho and the grilled pork chop over rice dishes. I always seem to order that and it's one of the best I've had in a long time. I'm definitely coming back for more. Portions were great for the prices and the interior was well updated and modern."
    },
    {
        "id": 5,
        "text": "This place has a simple beautiful decor. Very spacious. The servers were very friendly. The food was a bit pricey for a bowl of pho. The other dishes was on par with pricing compared to other Pho places.  Maybe a dollar or two more with certain things.  But everything we tried tasted good. Great portion size as well. If I were to give them a little advice, it would be to offer a small size bowl for the Pho. Or at least have a kids size. They only have one size for a bowl of Pho and my daughter couldn't finish lol. Other than that we loved this place.  I would go again. Sorry, the one dish i forgot to take a picture of was the Pho."
    },
    {
        "id": 6,
        "text": "Pho Nam Giang (village) is the new Vietnamese kid on the block in southern Bucks County. It sits on Franklin Mills Drive, one of the access roads around the now \"Philadelphia Mills.\" The room is spacious and utilitarian; comfortable and attractive in a Spartan kind of way. \n\nI sat alone in the back corner to give myself and everyone else sufficient space to remove our masks and feel confident in this renewed COVID social environment. The room wasn't crowded, but there were enough customers to keep the staff busy. They were efficient and friendly. I ordered Chicken Lemongrass Dumpling Pho and the Roast Pork Banh Mi, and settled in and waited to be served, sipping a plastic glass of hot tea (orange pekoe?).\n\nPHO - I liked the variety of noodle soup offered on the menu. The choices were much broader than just traditional spicy beef base and thin cuts of steak, tendon, meatballs, etc. The Chicken Lemongrass Dumplings were plentiful and very good, even though the lemongrass flavor was not pronounced. The complexity of the stock could have been more subtle as well, but with the addition of jalapeno slices, Thai basil and squeezed lime wedges, it was a solid enjoyable slurp. The nest of thin rice noodles beneath the surface were tender and held the broth well as I sucked them up through whistled lips.\n\nBANH MI - Excellent sandwich on very good french demi baguette, stuffed with lots of roast pork, cucumber, carrot and daikon strips with sprigs of cilantro across the top. It was a solid bite and chew, made better with a light touch of combined sriracha and hoisin for extra punch and smooth smokey sweetness. Definitely, one of the better banh mi's I've enjoyed in the past few years in Philly. \n\nPho Nam Giang has a real chance to succeed if it maintains its standards and spends a little more time enriching its base beef and chicken stock. It uses quality ingredients and keeps its facility clean. There isn't much competition nearby, so with effort and good fortune their road is clear ahead."
    },
    {
        "id": 7,
        "text": "Been having difficulty finding great Pho places around philly until I tried this place! Pho Nam Giang gets 5 stars for the authentic taste, friendly service, and clean atmosphere. Food is fresh and servings are generous; I highly recommend to all Pho fans."
    },
    {
        "id": 8,
        "text": "Really excellent Vietnamese food.\n\n We had a big bowl of pho, Spring rolls and vermicelli with grilled pork.\n\n Usually to get authentic Vietnamese food we we have to drive all the way down to Philadelphia to the usual spots.\n\n We are very pleased to say that we now have a place that is much closer to home and totally hits it on all cylinders with really good fresh authentic cuisine in a modern Clean setting"
    },
    {
        "id": 9,
        "text": "I've been waiting for years for a Pho restaurant to pop up in the Northeast that is actually good. Pho Nam Giang doesn't disappoint as the food here is actually better than most restaurants by Adams Ave (NE) and Washington Ave (SP).\n\nWe've been here a few times and have only tried the Pho Dac Biet and Bun Bo Nuong, the portions are plentiful and they don't skimp on the meat either.\n\nThe service was great; this isn't your typical Vietnamese restaurant where they only show up to take your order and send your food out. The server and even the manager came by to see how we were doing and refilled out glasses of water when they were empty.\n\nThis place is clean, obviously it's new but probably one of the cleanest Vietnamese restaurants I've ever been to, so there's zero complaints there.\n\nI've read in a few other reviews that the prices are high but most restaurants are raising their prices and even the other Pho restaurants in Philly might be $1 less per dish, not a big deal...\n\nI would definitely recommend giving this place a try if you're in the area or after you're done shopping at FM."
    },
    {
        "id": 10,
        "text": "Very decent Vietnamese place ! \nWe were hiking in the area and we were in a mood for a good pho . \nEverything tasted like homemade, was very fresh and delicious \nWill be back !"
    },
    {
        "id": 11,
        "text": "We were in the area and decided to stop by this restaurant for dinner. \n\nThis place is pretty good. I really like the pho because the rice noodles weren't sticking together and easily separated when I was mixing it up. The Bun Thit Tom Nuong was also very good. My fiancé usually don't try out new dishes but he decided to give this a try. He devoured it without stopping because of how delicious it was. \n\nThe staff is also very attentive and we don't have to wait long to be served. They made sure we enjoy the food and we were able to get everything we needed without an issue."
    },
    {
        "id": 12,
        "text": "When it comes to Viet restaurants and pho they all taste the same to me anywhere so by my standards it's tough for one to stand out...until I ran into Pho Nam Giang. \n\nI believe this is a fairly new restaurant. I was throughly surprised by how big the restaurant is and the cleanliness of the place. \n\nI went with the classic pho that has everything in it. Flavor profile was really good. Lots of noodles in the bowl and the most important thing is that the soup was piping hot. Not many pho places serve the soup base hot, but this one did. I was impressed that I went back again. \n\nCan't wait to comeback on a cold day. Now that would be a delicious bowl of pho."
    },
    {
        "id": 13,
        "text": "Great spot! I had the Deluxe Pho. You will not be disappointed! Service was awesome waiter was very knowledgeable."
    },
    {
        "id": 14,
        "text": "Pho Nam Giang is finally open! Ive seen the building with the name which appeared at the start of the pandemic, and have been patiently waiting for the Grand opening. I enjoy a good bowl of Pho more than a few times a year, I am by no means an expert but I know what I like. So, first the restaurant, they owners have fully updated this place inside. I don't remember what this place has been through the years at Philadelphia Mills, but all remnants of previous history inside are gone. It is completely updated, open floor plan, modern lighting, nice tile work and very very clean.\n\nI've tried a few dishes so far, so let's get to it! The chicken lemon grass dumplings were very good, and came out hot and crispy (though in most places they ask if you want steamed or fried, this was not requested, they came fried. Just noting for those that watch fried foods). These are a great appetizer for 2 people, because their serving sizes for their main dishes are BIG!\n\nSo for the mains, I've had the Bahn Mi Bo Nurong (forgive me if I butchered that), it's the grilled ribeye Vietnamese Hoagie. It had the crispy roll, cilantro, fresh cucumber slices, pickled carrots and daikon. It was a decent sandwich, but the chicken version was much better. The only reason was how they prepare the ribeye (which was 100% quality), it was sliced ribeye (think Steve's or wit or without) chopped up. It had hints of the viet grilling flavor, but it reminded me of a steak sandwich without cheese and having veggies. Not a bad sandwich, but I enjoyed the chicken version much better.\n\nNext was the Pho, excellent Pho! Good Flavor Broth, Good Size, plenty of meat options (including traditional options for the adventurous like Tripe), all of the fixings, lime, bean sprouts, Thai bazil, and Jalapeños, it was just a good bowl of Pho. While I enjoy Pho year round, I can't wait for winter when I enjoy the most. They have the Viet Meatballs, Flank, Brisket, Tripe, etc.... And they even have a build your own if you like (choose 4). I didn't see a chicken Pho for anyone that would rather, but I know they have chicken broth for their shrimp Pho, so I am guessing they might make something for you if requested (to be confirmed), most Pho places are more than willing.\n\nThen we shared the Rice Noodle Bowl with Chicken and Spring Rolls, it's a big helping! Rice Noodles, Veg (lettuce, cucumber, pickled carrots, daikon), grilled chicken, fish sauce, and ground peanuts, topped with a couple of Spring Rolls. The chicken was great! Marinated throughout, plenty of noodles, fresh veg, a good squeeze of Hoisin Sauce and you've got a good meal!\n\nOverall I was very happy with the food over 2 visits, the staff were very attentive, and the service fast. If you enjoy Pho, I recommend. if you've never had Pho, I highly recommend getting out of your comfort zone and giving it a try! It is very very good food, and Pho Nam Giang is a good place so far to start!"
    },
    {
        "id": 15,
        "text": "Get out of the cold and come try this place and enjoy an excellent bowl of Phó. I got the veggie one and it was delicious. Actually came here two days in a row as I'm stuck in nearby hotel. Trust me - this place has tasty Vietnamese food and great soup!"
    },
    {
        "id": 16,
        "text": "We came here a couple times and tried several dishes. Pho is very decent. Dumpling is also good. Happy to see a pho restaurant open up in this area. Price is also reasonable. All of the pho restaurants in Philly has raised their price, so $13/bowl is actually in the lower price range."
    },
    {
        "id": 17,
        "text": "So delicious! We also ordered spring rolls and chicken teriyaki dumplings. Plenty of seating and fast service."
    },
    {
        "id": 18,
        "text": "I have been wanting to try this place since it opened. Finally last night I was able to place a to-go order. And let me tell you me and my family eat Vietnamese food all over the tri-state! I must say this is not only super close to us but also our new favorite place! I didn't get to take pictures because we are so hungry but we ordered Crab Rangoons, Pork Dumplings, Pho Gà and Bun Gà Nuong (Vermicelli with grilled chicken). Everything was so fresh. I am so glad they chose to open in Northeast Philly. Can't wait to try more on the menu! We will be back very soon!"
    },
    {
        "id": 19,
        "text": "Great food . Great place to eat pho if you want to and in the area. Quick service and great food."
    },
    {
        "id": 20,
        "text": "If your looking for a nice authentic Vietnamese cuisine this is your go too right here amazing quality food tender chicken, beef, pork you name it the bahn mi is out of this world and the scenery is beautiful perfect place too gather down at for anything type of occasion also very clean and establishment I been too the buffet and other restaurants nearby Philadelphia mills and what they lacked was quality once pho bam opened up THERES no Turing back if you want a bang for your buck stop by here after a long hard day of shopping at Philadelphia mills for a quick bite to eat"
    },
    {
        "id": 21,
        "text": "I love Vietnamese food and I'm not reluctant to try new places. I'm grateful this Vietnamese restaurant opened up near by. I will be a regular. The pho hit the spot!. It was a beautiful dish the levels of taste- fresh herbs, satisfying beef, hot broth, spicy shots of Jalapeno and siracha, sweet-salty-smokey hoisin, and al dente noodles. Enough about the pho... the ambiance of the restaurant is gorgeous!! But I cannot say enough about the staff who go above and beyond providing excellent customer service for the first encounter to the last. I will be back!"
    },
    {
        "id": 22,
        "text": "New Viet spot at Philadelphia Mills (Franklin Mills). I've been waitinggg for a Vietnamese restaurant to open near me so I was super excited to try.\n\nHowever, for the price ($$) and the food was just okay. Not sure if they just opened and everything was new but food was OK. I ordered a variety of different entrees for my family. We had 5 different platters; some rice and some vermicelli. The grill pork/pork chop over rice: it was regular white rice and not broken rice, portion of rice was small, and the pork was dry. The beef and shrimp vermicelli: the beef was dry since it was the thin beef from pho and the shrimp was over cooked/dry. \n\nSince they just opened and it's nearby, I will give it another try. Most likely order something else and see if it's better. I ordered takeout and the food looked alright.. so I didn't take any photos of the food."
    },
    {
        "id": 23,
        "text": "This was on a whim. And I'm glad we found it. The ambiance is great. The service was amazing.\nWe were seated immediately. They had us and other guests spread out nicely. \nThe food came out quickly. I started with the spring rolls. They were very fresh. Very hot, had to let them cool. But, they were very good. I ordered the Pho with nothing but noodles. First the broth-I've had some greasy broth. This broth was pure perfection. It wasn't salty at all. The noodles were great. The noodle:broth ratio is perfect. Hands down the best pho I've ever had. The service was fast, efficient and SO FRIENDLY!! \nWill definitely will be back."
    }
]