[
    {
        "id": 1,
        "text": "I can't give a lower rating, asked for very simple by the menu orders, two burgers in the two for five deal and one value meal burger and the two for five burgers were both not only wrong (different burgers) but the buns were stale and each one only had some of the toppings and one was missing a meat patty ( supposed to be a double). The value meal burger was supposed to be a double with bacon and BBQ sauce. Was given a single plain cheeseburger. They got the drinks right and the fries were the wrong size so basically we were overcharged for everything. There was no line and no one behind us so they weren't even busy. Avoid this location."
    },
    {
        "id": 2,
        "text": "I love checkers food and was so excited to get a late night meal. We ordered a cheeseburger and two spicy chicken sandwiches. What did we get? Two burgers and a regular chicken sandwich. While in line I also want to add someone ran up to the drive through window and was begging for more honey mustard. It was a bizarre place-go here if you want a good laugh"
    },
    {
        "id": 3,
        "text": "When I want a good  burger at a good price either it's beef or chicken I come here not McDonald's or buyer king!"
    },
    {
        "id": 4,
        "text": "Don't waste your time or money here.  Shitty fast food for long waits, absolutely unacceptable."
    },
    {
        "id": 5,
        "text": "It's a dirty burger joint in North Philly. If you're hungry and need something fast, its ok. The fries are great, but the burgers don't nearly compare to Five Guys or Bobby's Burger Place."
    },
    {
        "id": 6,
        "text": "If I could give a 0 I would. My strongest and best advice for anyone is to avoid this place at all cost, ESPECIALLY at night.\n\nNot only are the employees incompetent, they are rude and are far from clean while handling food. Never once have I ever seen anyone wearing gloves, even after handling money. \n\nI can't count the number of times that I've stupidly went to this Checkers because they were the only late night option. To give you a sense of just how bad this place is, I'll break it down simply:\n\n1. Walk in and stand in a line while trying to avoid the trash that litters the floor. Hopefully your cellphone battery is almost full because you'll need a distraction while waiting for the abysmally slow cashier to finally come to the window and greet someone, let alone acknowledge them.\n\n2. When its finally your turn to order, stand and continuously try to make eye contact with any of the employees joking and playing around and hope that they finally come over to take your order. 90% of the time they do not. Once they actually decided to let the line move  and come to the window, be sure to get your order out as quickly as possible before they slam the window shut to continue laughing with their coworkers.\n\n3. Great. You've finally managed to place your order and it only took you about 20 minutes. All you have to do now is wait for your food -- when they actually start to sloppily make it. Be sure to stand near the pick up window because they have a habit of just opening it and standing there with the bag in their hand and expecting you to read their minds on which food belongs to you. \nStill with me? Okay, so now you have your food. Make sure to check the contents and see if there are any mistakes. There's a good chance something is wrong. \n\nThis is not an isolated incident. As I said earlier, I can't count the number of times this has happened. It's almost routine. Even when the store is empty they will make you wait. I once showed up an hour before closing and standing there for nearly 30 minutes (was very tipsy and needed food) watching them in the back as they watched me and kept on with their conversation. When she finally decided to come over, she informed me they were closed. I pointed out the time and she just stared blankly, although I can't say that I was surprised by this. When I demanded to know why they didn't come up sooner and tell me they were closed, she lies and said she didn't see me. Right. \n\nThis place is by far the worst Checkers (or fast food restaurant) that I've ever been to. \nAVOID AT ALL COSTS!"
    },
    {
        "id": 7,
        "text": "If I could give this checkers zero stars I would. I know when I went it was Late but it claims it is open till 6am. I even called before I went to see if they were open...I drove here only for the employee to tell me his computer was down..and they were not serving... Complete waste of my time..."
    },
    {
        "id": 8,
        "text": "The only reason to eat here is theyre 24 hours on Fridays and Saturdays so chances are your tummy is grumbling and youre pretty desperate. \nThis is the worst customer service chain , it is almost constant at every branch, somehow they have thrived in Philly. \nThe Buford and the Chicken strips are good and the milkshakes but expect to wait 20 minutes for it. If youre scrimping on gas do not wait via drive thru but if you value your life since the shady people waiting at the take out booth by all means burn that fuel. \nI wish Sonic Drive thru would someday could rescue this city from Checkers."
    },
    {
        "id": 9,
        "text": "NEVER go here. Went here with my friend; they got the order wrong and charged us a lot ($17 for shitty fast food). tried to get refund because we didn't order 17$ worth of their shitty fast food-- long story short the manager started screaming ghetto at us saying \"we don't do refunds,\" threw fries at us, and hit my friend through the window (you can't talk to them unless they open the window).  \n\nGet your money back by calling checkers headquarters in FL (813) 283-7000 they are much more professional, thank god.   Enter at your own risk....."
    },
    {
        "id": 10,
        "text": "I've tried this restaurant on a Sunday night and my complexed orders was made right and fast. He added other promos that really help me saved money.  I don't know who the guy was at the drive thru but he a good customer service. This is a good place for late night food. The only reason I didn't given them 5 stars was that their are hoodlums soliciting around the restaurants and the homeless coming up to people's car windows for money while I'm at the drive thru. That environment makes me feel a little unsafe."
    },
    {
        "id": 11,
        "text": "The atmosphere of this place is truly relaxing. The staff are more than helpful and super friendly. They went above and beyond and I could taste the love that they inserted into my burger. The decor is feng shui and I really felt at home in this lovely establishment! Viola¡"
    },
    {
        "id": 12,
        "text": "This place is a hazard. Tire popped on the way out with dangerous lack of signs and razor sharp concrete everywhere, they spit in my food and the manager literally ignored me when I brought it up to them. You can see the massive number of cars that have been broken on their dangerous curbs. This place is 15 osha violations and I am reporting them."
    },
    {
        "id": 13,
        "text": "Checkers Rally's recently released strawberry soft serve ice cream. The sign showed a bright pink ice cream on a cone, and I knew I had to try it (even though it's freezing cold )! Although I tried it for the color, the taste was somewhat nostalgic and reminded me of the pink strawberry shortcake ice cream bars I used to eat as a kid. Overall, not the best, but it was fun to try! Also, if you haven't had them yet, the fries here are amazing!\n\nLocation review: The employees were very friendly and kind.  The glass walls made it difficult for them to hear my order, so unfortunately I had to repeat myself a few times. This location has a small interior with little room. However, there is a drive thru for to go orders, and there are benches outside if someone wishes to sit there and eat. The outside area didn't look too clean though, so this place is probably better if you're looking for fast food to go!"
    },
    {
        "id": 14,
        "text": "Checkers is the high point of culinary experimentation in North Philadelphia. These renegade chefs are whipping up a plethora of boldly flavored dishes and appetizers. It is difficult to imagine how someone could possibly pack so much perfectly viscous (and delicious) grease into toasted mess piles of bacon, toast and \"burger.\" You may be tempted to go to the McDonalds across the street, and you also may be the dumbest person alive. These burgers are the bomb dot com. You like milkshakes? These milkshakes are the bomb dot com. You like weird semi-outdoor ordering areas? This semi-outdoor ordering area is the bomb dot com. Additionally, you will almost definitely be offered Oxycontin on market pricing. I don't know any foodie that doesn't like to \"get his downer on\" before feasting on the finest marbleized Kobe beef in this area. This beef is the bomb dot com. \n\nMy only real problem with this location is the patio-style terrace seating outside of the weird, semi-outdoor ordering area. I can deal with the slightly-slower-than-average service, but this tiny seating area is really unacceptable. I had to listen to so many cars during my meal. Sure, the restaurant is located on the busiest street in Philadelphia, but I expect better soundproofing from a restaurateur like Mr. Checkers. Maybe they could put up a large bush or something? I'm not a sound-proofing expert, so I will not step outside of my bounds here. \n\nIn short, come for the best cuts of beef in the northeast and stay for the drugs."
    },
    {
        "id": 15,
        "text": "comical how horrendous this place is, in terms of customer service and quality of food. i used to live down the street, and because of their hours i wound going many times despite previous nightmarish experiences. no matter if i ordered 2$ worth of food or 20, the wait was ALWAYS 25 mins or more. mind you, with maybe one or two other customers. i have personally witnessed employees drop meat on the floor and put it right back on the bun. this place is so bad i remember there was an incident in the paper where one of the employees actually came out and shot someone they were arguing with(not sure if it was a customer or not) disgusting subhuman employees, decent food if handled propertly, and the absolutely worst customer service in the world."
    },
    {
        "id": 16,
        "text": "I have no other Checkers to compare this location to because it's the only one I've been to. \nThat being said this location is awful. My friends and I decided to stop walking to campus by after a long day in center city. We all ordered different meals and were intrigued by the low prices and frozen drinks. I didn't expect all of us to end up on the toilet not even two hours later. It was an awful experience and the low prices were surely not worth it."
    },
    {
        "id": 17,
        "text": "On three separate occasions at this exact location my debit card was over charge they swiped my card for my actual order then a second time for god knows what use cash only at this location and check your bank statements someone is stealing they charge my card $15.54 for a two for three meal"
    },
    {
        "id": 18,
        "text": "If you're into self depreciation and regret come to Checkers!\n\nOrder yourself a cheeseburger, extra greasy fries and a coke. \n\nBut remember, the feeling is only temporary."
    },
    {
        "id": 19,
        "text": "This is one of the worst drive-ins I've ever been to, hands down. It should be called Hotel Checkers. Because once you are in line, you'll never leave. At least almost never. The previous reviewer was not kidding about the 20 minutes part. I've gone through complete sports radio cycles/news radio cycles and back into the rehash before even getting up to the drive in window. \n\nMe: I'd like the Mongo Burger with fries\nlong pause\nThem: What do you want(Their voice laden with static)\nMe: (yelling because I\"m not sure they can hear me over the tin can speakers) I'd like the Mongo burger with fries\nThem: Would you like anything else?\nMe: No\nThem: Pull around\n\nAt this point time slows down into 9th St Post office/glacialness. The cars in front seem to stand still. Meanwhile the assorted and random characters drift across the parking lot. Multiple Philly cops go screaming up and down Broad Street and Girard. You start to think, crap, maybe this wasn't such a good idea. By this time, someone's behind you so you figure ok, I'll stick to it. After several commercials and various comments on how the Phillies aren't getting it done and people hoping the Eagles will go to the Super Bowl, you finally pull up to the window. \n\nHere's where the Checker's differs from the other drive-ins. First of all you have people randomly walking up to you asking you for money. And then there is the occasional guy that just stands there looking at you. And no one from the Checker's store goes out and shoo's these guys away. \n\nThen there is the joy of dealing with the register person. My last and final trip to this establishment, I had the \"I\"m too busy talking on the phone to my friends to give you good service\" person. She took at least 3 minutes to even acknowledge that I'd pulled up. Then she opened up the window, took my money and started cursing on the phone. This wasn't a simple s or f-word. This was a swear laden rant that would have impressed a sailor. Now I\"m not saying I don't swear. But when I have to deal with the public, I refrain from it unless someone drops a 10 ton desk on my foot or I nearly get run over. Evidently this person hadn't gotten the corporate memo on \"Appropriate behavior during your drive thru cashier shift\".  She finally disengages herself from the phone long enough to give me my change. Then I wait another 5 minutes for my food. This time I had some joker come up to me and ask for change for a dollar. Last time I checked, that's what a cashier was for dude. \n\nFinally I get my food. No apology for how slow it was, no thank you. She just returned to swearing at whomever it was on the other end of her phone. I leave with my gas tank almost empty, I'm hot, pissed off, and amazed at how crappy service can be. \n\nI'd rather poke my eyes out with a sharp stick than go here again."
    },
    {
        "id": 20,
        "text": "Staff is hella rude. Inside looks way too dirty for a restaurant and again, the staff is HELLA RUDE. Food was ok, but overall place is terrible."
    },
    {
        "id": 21,
        "text": "Was in a MOOD for some Checkers fries and I was in the area visiting a friend. Fries were highly disappointing. I should have went to the location on Broad and Champlost cuz the fries are always hot & fresh there (at least for me)."
    }
]