[
    {
        "id": 1,
        "text": "Ok this is an aberration from my city foodie reviews but I figured I'll take the time and review some of the local establishments that I order from on a consistent base while working in Bensalem, P.A.  Without further adieu...\nGeorge's Chix is good.  I'm always satisfied with the food and value each and every time.  I haven't branched out seeking much more than a good deal each time and trust me I'm not looking to find the healthiest option on the menu (usually I get the nugget/fries/soda deal, the chix fingers/fries/soda deal, or Ceasar wrap/fries/soda deal- $8 or $9 after a nice tip) but the food is alright.\nGive George's a try if you're in town and looking to get down on some fried grub!"
    },
    {
        "id": 2,
        "text": "My family has been customers of George's for years. You pay for what you get. The quality of the food is premier and they don't hold back on portion size. Their cheesesteaks are amazing (chopped steak) and their chicken cheesesteaks are made from the same chicken as their Char platters, which is legit. Their Char platters come with some of the best and juciest grilled chicken I've ever had. They make their own sauce, so just that alone puts their wings above the other restaurants in the neighborhood that just use Franks Red Hot. I have yet to have something on their menu that I didn't like."
    },
    {
        "id": 3,
        "text": "The three star rating is related to inconsistency.   First time I got the fried chicken - it was really salty.  Second time - it was delicious, third time- not too much flavor and greasy.    I have now opted out of the fried chicken and now get the grilled chicken breast platter.  It tends to be fairly consistent and tasty."
    },
    {
        "id": 4,
        "text": "I used to love George's Wings. I ordered from them this weekend and it has gone downhill. Their boneless wings aren't good anymore. Giant pieces of chicken and the chicken is gross. Too much breading and drowned in sauce. The girl at the counter was extremely rude to us as well. I'm disappointed they were one of my favorite places but I will not order from them again."
    },
    {
        "id": 5,
        "text": "Best Wings in the neighborhood. Also there is an amazing lunch special.  \n\nI have been going here since they were called Mr. Wings back in the day. The service is great and owner is really nice.  I love to support local small business, especially in my neighborhood. \n\nThe wings are great and 'hot' wings are the perfect spice and amazing taste. They are not overly hot and spicy like alot of places - so you can actually enjoy them.  Im really not sure where else in the far northeast/Bensalem area you can get high quality chicken. (Steak and hoagie I guess is my 2nd won't place due to the cheaper prices (but quality as service is choose George's Wings in a heartbeat)!"
    },
    {
        "id": 6,
        "text": "This place is my favorite take-out/delivery restaurant in the northeast. I have never had a bad meal. They have probably the best wings in the area and not to mention there charbroiled chicken platter is the bomb!!!! All around awesomeness on every level!!!"
    },
    {
        "id": 7,
        "text": "Cant go wrong with this local gem.  Have ordered from here many times in the past 4 years and love all of their food.  Its everything under one roof-great cheeseteaks, tender wings, tasty wraps and confort food.  Although priced a little higher higher than competition, the quality of chicken they use is great-all white meat and juicy so its worth it in my opinion."
    },
    {
        "id": 8,
        "text": "We've always loved the food, so much so they were 1 of 2 take out spots we'd physically call because we're diehard Grubhub users. George's just got onto GH & we were SO excited. It seems GH didn't quite get their menu right so our order wasn't perfect, but George's was SO nice and accommodating when I called. Not only did they promptly being the correct order, but they gave us some extras, a coupon and this adorable note! You now have solid in-love forever customers, George's Wings!!! Well done"
    },
    {
        "id": 9,
        "text": "LOL to a few of these reviews! I've been dining here for the last 15 years, from the grilled chicken to the fried chicken everything is made fresh to order. Recently, I have been ordering the Mexican which is authentic and so delicious. And for a place that just added pizza to their menu, I am surprised how tasty it is! This is my go to spot in the Northeast! Check it out peeps!"
    },
    {
        "id": 10,
        "text": "Nothing special really. \n\nThis place is around the corner from my apartment and I've wanted to try it for a while. I ordered 10 MEDIUM wings. I chose to pickup, so I sat inside and waited. It was a reasonable wait. \n\nAbout 10 minutes go by and they announce that 10 MILD wings are ready. I continue to wait. They give the order to another customer and then she turns to me and says I think this is your order because I should have more wings than this. She returns the wings to them. There was then some bickering behind the counter and then someone turns to me and says this IS your order. I stated 10 MEDIUM wings and they assured me oooo yes 10 MEDIUM wings.\n\nThey were no where near MEDIUM. There was barely any sauce on them at all, it was all in the bottom of the container. \n\nI doubt I'll go back"
    },
    {
        "id": 11,
        "text": "I was not impressed with the wings at all. Very disappointing for a place with wings in its name. They weren't cooked well and where slimy. The sauce was pretty good but that's all I can say about them. SLIMY"
    },
    {
        "id": 12,
        "text": "Omg.... Finally great fried chicken near home. Crunchy, moist and finger lickin good! Came with rice that has some veggies and chicken. It was okay... Little over cooked. The chicken in the rice was white meat, which I  prefer. Highly recommended the chicken!!!"
    },
    {
        "id": 13,
        "text": "Mr. Wings is this dinky little take-out/delivery place in Morrell Park Center, just off of Frankford Ave., and I just love it.  They've got really great chicken everything - wings, cheese steaks, fried, you name it.  They've also got other sandwiches, burgers, spare ribs, seafood platters, etc.\n\nWhenever I want to get a big order of wings to take with me to a friend's house to watch football, boxing, or some other sporting event, I always order from Mr. Wings.  Their buffalo wings are superb - crispy, tangy, meaty, and ready in a jiffy.  The staff is also really nice.\n\nIf you are getting wings for the Super Bowl, I suggest calling the night before or early that morning to place your order.  That's what I did, and my wings were ready at the time I said that I needed them.  This place is great."
    },
    {
        "id": 14,
        "text": "Great food and reasonable prices. They even offer items on the healthier side like broiled chicken."
    },
    {
        "id": 15,
        "text": "Used to be a lot better. The food is good but they close at 10 and on several occasions we have called at 920-930 and they refused to take our order. Also constantly forgetting the sauces which are the reason we order the chicken!!"
    },
    {
        "id": 16,
        "text": "Really disappointed in the boneless wings. Dropped $25 through grub hub for 15 wings and fries. Didn't realize I clicked boneless, but hey, all good. Sadly, the boneless wings tasted like frozen nuggets put through the microwave then drown in sweet baby rays bbq sauce. I'd like to give their regular wings a chance in the future but now, I advise against the boneless wings."
    },
    {
        "id": 17,
        "text": "Very fresh and tasty chicken. They make it fresh after you order instead of giving you something sitting under a heat lamp, so order in advance if you can."
    },
    {
        "id": 18,
        "text": "Small wings like micro dwarf sized wings that they charge over a dollar each for them lol. Yeah they taste fine but completely not worth it at all. Sad"
    },
    {
        "id": 19,
        "text": "Tried them for the first time a week ago.  Food arrived hot (despite the storm we had) and delicious.  Cannot recommend enough if you like wings.  On top of that, they threw in 10 Honey BBQ wings on the house!!"
    },
    {
        "id": 20,
        "text": "I've been eating here since it was named Mr. Wings in the late 90's.  I only ever get one of two things. The 2 piece char platter or the grilled chicken salad.  They probably have the best grilled chicken I've ever had and the platter hasn't changed.  The salad on the other hand has gotten dramatically smaller and includes way less chicken for the same price.  Not sure why they're got skimpy but that's the reason for the 2 stars."
    },
    {
        "id": 21,
        "text": "Fantastic pressure cooked fried chicken. Always liked that it was made as I ordered instead of laying around. I've made some very large orders for parties through here. The staff were always extremely grateful, even throwing in some extra chicken, sodas and such. \n\nOn the, very small, down side, some of the other items I've had here aren't quite as memorable. Nothing in any way bad, but just not as good as the fried chicken. Though both the fries and onion rings are perfectly acceptable. \n\nThe fried chicken is the real reason to go here. And when I order it, I'm never disappointed."
    },
    {
        "id": 22,
        "text": "Best food in NE philly area, hands down! Best delivery drivers, amazing fried chicken, good crunchy fries, they are quick and always polite! Awesome food for decent prices!"
    },
    {
        "id": 23,
        "text": "I ordered the mild wings and they were very good.  They gave me a large portion of mashed potatoes and gravy and 2 halves of corn on the cob.  I ordered online and delivery was set for 45 to 50 minutes but my order arrived within 25 minutes. I'm satisfied enough to want to order again and try other things.  Update: Ordered a cheesesteak, cheesesteak hoagie and grilled chicken caesar wrap.  The wrap was packed with chicken and very good.  My friends said the steaks were good too.   I ordered a side of fries not knowing fries would come with the sandwiches so ask if they do before ordering them."
    },
    {
        "id": 24,
        "text": "Wings, wrap and Mega Fries were all just average. Not sure if I'll order here again. Wings wee tiny."
    },
    {
        "id": 25,
        "text": "Wings are second best in area.  Grilled chicken platter is best value.  Get the hot sauce mixed with honey barbecue.  Only complaint about wings is that they tend to be on the small side.  Definitely not pudgy wings.  Go boneless instead of bone in.  Place never disappoints."
    },
    {
        "id": 26,
        "text": "This place has pretty great fried chicken. The sides are always good too. Good service, and nice staff. Only complaints is that their hamburgers, while they are homemade, are incredibly salty, and overcooked. The bun to meat ratio is also terrible. With chicken as good as this though, I should have never ordered a burger. They recently added burritos to their menu, and they are pretty good. The nachos were a huge soggy sloppy mess. All in all this is a good place though. \n\nWeird that they included the old name on their new sign though.... GEORGE'S WINGS formerly mr. wings."
    },
    {
        "id": 27,
        "text": "I've given George's a few more tries because it is convenient. If Yelp let me do 1/2 stars I would give update my review to 3 1/2. I've been getting the grilled chicken wrap which is really good. I'm still not a fan of the french fries or the wings so I just don't order them any more. I'll stick with the chicken wrap and continue to order when I don't feel like cooking or going out."
    },
    {
        "id": 28,
        "text": "Wings are fine.  Just way overpriced"
    },
    {
        "id": 29,
        "text": "This place is awesome. Quick delivery/pickup. Super good food! The charbroiled chicken is my favorite meal. Keep up the good work!!!"
    },
    {
        "id": 30,
        "text": "Was told by someone to try hear, and glad I did. \n\nReally good food. They pile the meat on the cheese steak and not at all greasy. \n\nThe wings are so crispy and good. Definitely worth the money and reasonable to."
    },
    {
        "id": 31,
        "text": "Fries are insanely good, and the wings are great.\n\nHowever, recently the past few times I've ordered there, the chicken has been undercooked.\n\nBoth in the boneless wings, charbroiled chicken, and on the grilled chicken hoagies. It's disappointing because the food is usually great and convenient. Not to mention the lunch specials (til 3 I believe) are a steal."
    },
    {
        "id": 32,
        "text": "As of this posting I've ordered from here twice.  Can't complain about my order.  I get the boneless wings and I get them hot and boy are they actually hot.  I've had better from other places but the fact that they are a few blocks from my house is a huge plus.  The order arrives quickly and so far with no issues."
    },
    {
        "id": 33,
        "text": "I got theirs mild wings with garlic and Parmesan added well done- and they were soo good I had to go back again today for another order!!!!"
    },
    {
        "id": 34,
        "text": "I ordered a cheesesteak tray for a bachelor party in the Poconos and the guys loved it. They were able to package it up to be eaten later that night. Best price for the tray I could find and they were able to get together with one day notice. Always great service. Love their caesar salads, buffalo cheesesteaks and buffalo wings."
    },
    {
        "id": 35,
        "text": "I think they are ok nothing sets them above the rest woth their wings . their biscuits are homemade and taste good . their sauces come in small containers . their blue cheese is good cause if you eat wings and order blue cheese you know there is good and bad blue cheese and Georges is good . cannot comment on rest of food . i ordered online and picked up place looks to be clean people were friendly."
    },
    {
        "id": 36,
        "text": "Meh, I ordered tonight and it was okay. I ordered the Georges burger and the honey bbq wings. The burger was just okay, it was over cooked and so were the fried onions. They were so hard I had to take them off he burger. As for the wings, they were very good. I ordered them well done because I like them crispy. They were cooked perfect, but the sauce! They were a little heavy on the sauce, which then made some of them soggy.  I still think Pats pizza still has the best wings around. Delivery was fast, which is always a good thing. Overall I will give them 3 stars, I may or may not order from the again."
    },
    {
        "id": 37,
        "text": "Very poor customer service. I believe it's the owners son who has no respect for customers or staff from what I can see. Being someone respectful to others, being disrespected in a establishment is humiliating. Very uncomfortable feeling and situation. I did not at all appreciate aggressiveness and the tone that I was being spoken to in. Being in customer service I understand the right and wrongs the should be precautioned when dealing with customers and clients & from my experience it was completely unprofessional of someone who owns a business. It would've been acceptable had it been respectful."
    },
    {
        "id": 38,
        "text": "Placed a order today at 8:38pm on their website, for a simple order of 15 wings. Said it would take about an hour.  Around 9:52pm we realize we made the order so we check the site.  It says DELIVERED! but yet NO WINGS are in my hands.  So I run down stairs to the front door, and after waiting for 5 min, I go back upstairs. Only for my girlfriend to tell me they now canceled the delivery!   \n\nNow we've waited an hour, no food, and now everything in the area is closed because it's past 10pm.. \n\nBut wait! There's more! NOT ONLY DID WE NOT GET OUR FOOD BUT THEY KEPT THE PAYMENT TOO!  and they would not answer the phone the 30+ times we called.  \n\nLoved their wings,  BUT I WILL NEVER GIVE THEM A CENT OF MY MONEY AGAIN!"
    },
    {
        "id": 39,
        "text": "My fiancé and I have lived in the area for about 2 1/2 years and find it hard to find good take out. When we first moved here we would order from George's a lot. At that point I would have given it 3-4 stars. The past few months have not been so good. On our last order we ordered wings, buffalo chicken tenders and mega fries and have decided not to order from here again. The wings were not crispy or cooked well, the buffalo chicken tenders were okay at best and the fries were terrible. The type of fries that they use are not very good, they use fake cheese wiz and bacon bits that seemed to come from a shaker. In the past we have also had their burgers, cheesesteaks and chicken sandwiches and all were mediocre. Overall, its not terrible but I'd rather go somewhere else for better quality food."
    },
    {
        "id": 40,
        "text": "This place used to be good back when it was called Mr. Wings. Wings were soggy and slimy. Too much sauce. It's a shame the wings are good sized. Corn on the cob was overcooked in a styrofoam container half full of butter water that spilled all over in bag. Garden salad was ok as well as fries. No celery with wings. For a place that uses Wings in the name of their business the wings are pretty disappointing. This is the second time I was really disappointed in the wings. I decided to give them another try. You are better off with Wingstop across the street. I won't be back."
    },
    {
        "id": 41,
        "text": "I havent been to georges in a min, since i moved. But they had good wings def. Good sauce. Better than average. Ive been a bit of an explorer lately so once i round the circle of trying whats out here, ill come back to give Georges a proper review."
    },
    {
        "id": 42,
        "text": "I really enjoy these wings. If you're a fan of really big wings then you won't like these. I prefer smaller wings with good quality meat and that's exactly what these are. My go to place when I'm in the mood for wings. Chicken Cesar wrap is very good too!"
    },
    {
        "id": 43,
        "text": "I never leave bad reviews ever or rarely ever leave reviews in general, but was so taken back with their customer service today. We've been going here for a while and always place good sized orders and I always tip a few dollars even on takeout, last few times we ordered platters all the sides were together in same styrofoam carton and the broccoli juice & butter have been drenching the fries and chicken making it mushy and tasting horrible like straight butter....no huge deal so I thought as we'd start asking for the broccoli separately when we order it, the last few times we ordered sides separately it still didn't come separate and today when I placed an order and asked for the broccoli to be separate from the chicken and fries they said they cannot do that, I asked again if they could just not put it in the same container (seems the girl then asked another person nearby) and then said no they can't, so I said I'd have to cancel my order then and they said ok, haha crazy! I thought I was making a very basic request and wasn't asking for much as I just don't like butter getting on my fries and chicken, but for some reason they just wouldn't accommodate that. It's a shame as we liked their chicken and liked to order from here and small businesses in general. What makes it even weirder is that a salad comes with the platter and I tell them I don't want the salad so if it's about them not wanting to give me another container it'd actually even itself out as I don't take the salad. Just overall bad business"
    },
    {
        "id": 44,
        "text": "I am so so so disappointed in our wings tonight. We used to order from here ALOT so we figured lets give them a call for some wings! I have had a long day at this point and starving so I would eat anything at this point, however our WINGS were literally UN edible! I work at a place that sells wings so i know a bad wing. My wings were clearly pre cooked then when ordered cooked again and fried hard. Literally the meat was barely left on them and the skin was so crunchy and hard I legit couldn't chew it. I felt like bringing them right back after they were delivered. I hate to write this review but I just don't want anyone else left without a meal because your wings were not edible."
    },
    {
        "id": 45,
        "text": "Im totally disgusted and never ordering from here again. They are not only overpriced but they are filthy! I found an eyelash last time I ordered from work. I gave them the benefit of the doubt but after finding a long black hair on my wrap I'm  done with them and so are my coworkers. Tell your staff to wear hairnets!!!!"
    },
    {
        "id": 46,
        "text": "George's Wings is decent. Food's mostly good and their fries are my favorite. I could get like 5-8 servings of their fries and be fine with that. My only gripe is the wing sauce (buffalo, not bbq or whichever) is a little too watery or something and drips off and pools at the bottom of the container. Other than that the wings are pretty great.\n\nAs far as the staff goes they're always great and friendly and delivery is always not only fast but faster than most places so the food's hot."
    },
    {
        "id": 47,
        "text": "The charbroiled chicken is and will always be my favorite. If you're trying to be healthy, but still want to eat out with the family, this place is for everyone. I always get the char chicken with a side of the chicken and vegetable rice, which is flavorful and different from any other side dish for a platter at any take out restaurant I've been too. The quality of the food at George's blows every other restaurant in the neighborhood out of the water. \n\nThey're also on grubhub now and have their own website, for those of us who want to order from the convenience of your computer/phone"
    },
    {
        "id": 48,
        "text": "I received a Georges Wings menu in the mail a few days ago and my sister suggest that we give it a try. So we order a butterfly shrimps platter with mashed potatoes and two chickens pieces with gravy and mashed potatoes. The guy delivers our food to our door. We took a bites and boy, they are good and delicious and is fulfilling. Thank you for making us a delicious meals and keep up the good work. P.S. The chicken were fresh as it say on the menu."
    },
    {
        "id": 49,
        "text": "I ordered 25 wings and only received 20. Not a huge deal but when the wings are almost a dollar each it adds up. Plus, I ordered 25 to split 10 and 15 with another person. When I called an employee (female) got on the phone and asked me (in a condescending tone) if I was sure and implied that i was wrong about my count. She stated that the cook said they checked it before it went out so there was no way for her to know for sure. I have an extensive order history with them and have never had an issue before so now to have one and have it implied that I was wrong, when the 20 wings were laying right in front of me, was a little insulting. As if I would call them to try and get 5 free wings from them. So instead of just sending me my wings I was offered a 5 dollar credit for a future order. I will never order from them again. There is a right way to treat a customer and then there is George's way."
    },
    {
        "id": 50,
        "text": "Their chicken ceasar salad cost me $5.66. Its a side salad with only lettuce, croutons and chicken and there wasn't even parmesan cheese.  Their excuse for why such a small salad at a high price was its a quality salad.  Bullshit for a $1 more I can get a regular size salad with parmesan cheese and eggs from The Works.  Thats what a real Chicken Ceasar Salad is."
    },
    {
        "id": 51,
        "text": "Fantastic!!! The menu of this place will absolutely meet all your craving criteria. From wings to fried chicken, sandwiches, hoagies, burgers and so much more. A variety of fries and styles like curly and wedges etc. Very small establishment mainly because its a take out place. The employees are very professional and sweet. I ordered 20 wings, a buffalo sandwich and 2 drinks and the bill was about $30. I also ordered a cheese steak and it was very good! I am looking forward to trying the pizza steak lol sounds interesting. They also offer platters (full meal) with mac and cheese and other sides that you could choose from. It is an endless menu of yummy, freshly made finger food. I am glad I found this local gem... Football season is here and we all know how much we love to skip the kitchen and order wings. They charge .35 cents or so for debit card usage on top of your bill, but they tell you before they swipe it. If you want to avoid the charge just carry cash. A lot of places are now charging for card usage, cash is making a \"comeback\" haha. Oh they have personal pizzas and fltabreads too. Definitely recommend this place!"
    },
    {
        "id": 52,
        "text": "Used to be my favorite, now they are overpriced tiny wings. As my man Trump would say ..... SAD!"
    },
    {
        "id": 53,
        "text": "I've never had such delicious grilled chicken from a fast food joint....very tender and juicy. My girlfriend got a greek salad and quesadillas, both of which were delicious. I live in East Falls, but I make it a point to stop by this place if im in the Northeast. The staff is very friendly too. There is huge TV which plays nothing but ESPN/CNN so if you're waiting, you're not really bored. Fried chicken takes a little while to cook, but soooo worth the wait. Make sure you get a platter so you can add mash potatoes, corn and a small salad. Nom Nom Nom!"
    }
]