[
    {
        "id": 1,
        "text": "I know I shouldn't expect much but everything I asked for that was on the drive thru menu was not available. I was actually afraid of what I was going to get once I did get it. I saw the movie \"waiting\".  Word of advice stay clear of this arch. Just so you know I was only trying to order a beverage how pathetic is that."
    },
    {
        "id": 2,
        "text": "Dirty bathrooms and very slow service, but I was pleased because they had a TV on with subtitles and the volume on, and it was turned to the news!  A good place to pass some time with a tasty Mc-snack and a hot coffee while in Philly during a chilly day!  We stopped here on the way to a football game and found it a very pleasant and relaxing place to hang out for a while."
    },
    {
        "id": 3,
        "text": "That's a shame! \nThis place is full of junkies customers \nThe staff and the service is fast \nIt's just too much like homeless or you can tell the addict people all coming here and soliciting"
    },
    {
        "id": 4,
        "text": "was in this location today at 4:40. I ordered two (2) angus bacon and cheese burgers. I asked for no onions which I got nothing but the cheese, pickles, bacon and meat on one and NO bacon on the other as well as the lettuce and tomatos on either. I feel completely ripped off. I also tried to order a sweet tea which the girl at the counter told me they had no ice.. Now this is the 3rd time I've been told that by this location, that is completely ridiculous. You serve drinks you should have ice. This location is a very poor excuse for a restaurant! \nIf I could give this place a ZERO star I would."
    },
    {
        "id": 5,
        "text": "want some heroin with your cheese burger? this is the mcdonalds for you!"
    },
    {
        "id": 6,
        "text": "I went in here for an egg mcmuffin, and it was made with the wrong kind of egg! It's not often I make in time for mcdonnalds breakfast, and I was really disappointed. They could have told me! Next ill go to another location..."
    },
    {
        "id": 7,
        "text": "Don't expect any pleasantries\nHeck, don't expect much at all.\nDefinitely not a \"Thank You for your order\", or any smiles or additional service or gratitude for your patronage.  If I could prepare you to expect anything, I'd say be ready for a run-down dilapidated franchise with ratty duct-taped chairs run by a skeleton crew of disgruntled minimum-waged part timers.  How could this system be improved? will the proposed minimum wage  hike improve friendliness and morale? Perhaps.  But for now, I just want to grab this mcmuffin and get outta here"
    },
    {
        "id": 8,
        "text": "Bought a happy meal for my daughter through the app. They didn't honor the paid meal. I presented the receipt, they wanted no parts. They let me drive away empty handed with no meal. The customer should not be paying for the lack of communication with their partner. They could have comped under the circumstances until their communication problem was resolved."
    },
    {
        "id": 9,
        "text": "Its 11:46 am and the out buttermilk crispy tenders.... BAD MANAGEMENT ... need a New MANAGER"
    },
    {
        "id": 10,
        "text": "I ordered a sausage egg & cheese mcgriddle from the drive through, and I had to pull over awkwardly and wait 15 minutes while they cooked it. It was at 9am on a weekday, why don't they have that ready to go? Boooooo to this McDonald's."
    },
    {
        "id": 11,
        "text": "Service was fast and pleasant.\n\nWhat I didn't like was when the lady handed me the food and she was like \"here\" but she said your welcome when I said thank-you. \n\nThe McDonalds got renovated at this location and it looks better."
    },
    {
        "id": 12,
        "text": "It's McDonalds, yo. \n\nLeast mean of them all in Philly (notice I didn't say nicest; truly the glass is half-empty and not half full). And least dirty. \n\nYou can see it when you spot out the singular golden arches. \n\nNo Reese's McFlurries, yo."
    },
    {
        "id": 13,
        "text": "Just go to another one. Place is dirty.  People in the bathroom drinking  beer, taking showers.   More like a reststop for the homeless.   Just keep going.  You will find another McDonald's."
    },
    {
        "id": 14,
        "text": "The employees are nice, but it's so slow and inefficient. Ive sat in the drive thru for more than 15 mins more than one time. If there's more than four cars in line don't even try it!"
    },
    {
        "id": 15,
        "text": "This McDonald's location is good for uberEats and this is the way I usually order my food from this particular location. I haven't had any major issues with the quality of food that they provide, but sometimes my order is delivered incorrectly. I initially thought this was to the fault of the UberEats driver but I realized the order is transmitted directly to the restaurant and they make it to order before the driver is dispatched to pick up the order. \n\nI have attempted multiple times to try and eat in the dining area of this establishment but it's either too crowded or the service is shoddy at best. \n\nI'll continue to order from this place as an UberEats choice, but I'm not too sure I'm going to be stepping foot inside unless I visibly see it isn't busy."
    },
    {
        "id": 16,
        "text": "Ye gads. Literally the rudest people at the cash registers ever.  The one who took my order couldn't even be bothered to stand straight up. She just draped her tired body over the top of the register. God knows what buttons her boobs were pressing on the touch screen.\n\nShe laughed at what I ordered (kids meal with 4 chicken nuggets, chocolate milk, no toys needed because it was for me).\n\nMy order number on my receipt was something like 201.  They called out 101 numerous times. After waiting for quite a bit, I finally asked if 101 happened to be the same order as what my receipt showed. It was. They were just too stupid to call out 201."
    },
    {
        "id": 17,
        "text": "Updated with one extra star in recognition of their recent efforts to become ever-so-slightly less horrible."
    },
    {
        "id": 18,
        "text": "It's McDonalds, if you're looking for salty fries, a double cheeseburger and a fountain Coca-Cola after a long days work. Go and indulge.\n\nHonestly, I like this McDonalds because the staff at the windows are super nice. Things like, \"here's your food, boss\", \"I like those sunglasses\", they just have positive energy."
    },
    {
        "id": 19,
        "text": "I got five mc chickens and two large fries from this McDonald's. It was sooooo good. Literally I was in McHeaven it was sooo good. Now I know most people think McDonald's makes shit food but not this one. The chicken was perfectly cooked , juicy. Would recommend this McDonald's."
    },
    {
        "id": 20,
        "text": "If you have a craving for McDonalds don't expect this location to satisfy your needs.  The last time we went there they were actually OUT of burgers and last night my friend was having a Big Mac attack but they don't serve them on their \"late night menu\" AND they were OUT of coke.  Unbelievable.  If you must have McDonalds visit the location on Grey's Ferry over by the Pathmark instead.  The drive thru there is open 24-hours.  The Grey's Ferry location is also known locally as the ODB McDonalds as a rap artist known as Old Dirty Bastard was apprehended by the police while dining there."
    },
    {
        "id": 21,
        "text": "It's pretty bad even for a McDonald's, guys. For about three months after they opened, it was awesome--the staff was well-trained and polite! But now it's the usual tough-talking teenagers whose priorities are, in this order, 1) talking to coworkers, 2) talking on their phones... 96) running a cash register. Getting your food takes forever no matter what time of day or night. And the extremely loud TVs blaring CNN make me want to kill.\n\nIN SUMMARY\nFood freshness: cold by the time you get it\nOrder accuracy: average\nOverall staff attitude: laughably bad\nCleanliness of dining area: very good\nCleanliness of bathrooms: ?\nRefills on drinks: yes\nCondiments, napkins, utensils: out in the open\nKid's play area: no, although there are some perplexing McDonalds-themed souvenirs in plexiglass cases which they could look at \nDrive-through: yes"
    },
    {
        "id": 22,
        "text": "This McDonald's doesn't really take your order it decides what you will have for breakfast.  I ordered 2 egg mcmuffin meals with orange juice and the restaurant decided i needed the 2 egg mcmuffin deal a hash brown and an oj which is nice and all if i was eating by myself but when my friend put his hand in the bag, his OJ and hash brown were missin,"
    },
    {
        "id": 23,
        "text": "Horrible service takes 20 + minutes on McDrive to get the order done and no chance to skip the line as you stuck in it! And the funniest thing was the plate which announced '100% customer satisfaction!' Are you joking, Guys???\n\n-1000 stars"
    },
    {
        "id": 24,
        "text": "One word to best describe it. Crazy! My gf and I came here 7:30am before work to grab a breakfast sandwich. Waited for a good time in the drive thru lane only to find out that NO ONE is taking order. We came up to the counter and a young lady was sipping her drink ignoring us. We parked the car to order inside and the door is still locked. The sign posted on the door saying that it is open at 6am. One of the chain employee is sitting outside while smoking by the side door, when I politely asked, \"are you open yet miss?\" She just looked at me like she is high after smoking a joint while pointing at the front door of the restaurant. I went up to the front of the restaurant only to found out that it was locked as well. Great job McDonald, I'm not lovin it."
    },
    {
        "id": 25,
        "text": "Crispy nuggets and a quarter pounder on a French baguette. They even honored a 7:45pm reservation on a Saturday night. Great service and the restroom was immaculate."
    },
    {
        "id": 26,
        "text": "Called several times to ask if they have pancakes. They didn't answer, phone was ringing for a minute each time. I used to work at a McDonalds and our staff always answered the phone, sad to see this location doesn't do the same, despite me even calling back when they hung up on me without a greeting. I thought I called the wrong number when they hung up so I checked the numbers on google and yelp. \n\nI just wanna know. Do they serve pancakes all day at this location?"
    },
    {
        "id": 27,
        "text": "How?! I just don't understand how!!! I know I shouldn't be eating fast food in the first place, but sometimes you need a little Mickey D's fix. Anyway... so, we decide that we're going to cheat today and get a couple of McGriddles, a Bacon McDouble, a shamrock shake (because, you know, it's that time of year), and a large coffee, black with three sugars....\nLet's talk about the McGriddles... I have come to LOVE these!!! And when I haven't had them for a while, I'm gonna be excited to get them. But, to my chagrin the bread - the best part - was stale and hard as a rock on one of them. And both WERE NOT EVEN HOT !!!!!! Like, come on... you make me wait for a mobile order that I placed far in advance, I wait patiently in the store, and my food is not even hot?! \nThe Bacon McDouble was fine, but my coffee was gross tasting and tepid! TEPID!!!! You have a \"Caution I'm hot\" message on I literally could've  chugged the coffee and not get burnt. But I wouldn't chug it anyway, because it was GROSS!!!!!\nOh and lastly, I know it's McDonalds on South Philly, but can we work on customer service skills, please?!?!?"
    },
    {
        "id": 28,
        "text": "Yesterday will be the last time I frequent this McDonald's. I ordered the buttermilk fried chicken sandwich with fries and a large drink it was completely busy so I waited 15 minutes for my food. when I got home, after I completed the food, within two hours my stomach was killing me. I have had terrible stomach pains and have emptied my bowels at least 25 times. Frequent this McDonald's with caution"
    },
    {
        "id": 29,
        "text": "Doesn't deserve one star we waited 30 mins for our food. They let people sit inside without ordering. There were people in there drugged up falling asleep. Do not go here."
    },
    {
        "id": 30,
        "text": "This is virtually like any other McDonalds in Philly. It would be nice if they updated the decor and donated more of their moneys to charity."
    },
    {
        "id": 31,
        "text": "Stopped here last night around 10:30 pm. It took 11minutes to get my order, I must admit there was one car in front of me. The place is filthy on the outside. The food tasted like decent McDonald's food."
    },
    {
        "id": 32,
        "text": "They are overwhelmed by Uber eats and the owner/management hasn't seen fit to hire or train adequately. The staff -- including the manager -- has no real concept of customer service; not even by low McDonald's standards. The food is the standard adequate fare that we occasionally crave. And a craving plus the open (if less than clean) restrooms are the only reasons to come here."
    },
    {
        "id": 33,
        "text": "They all are just bullshit i saw a big hazard in my sandwich when i talked to the cashier they told me \" I don't give a f**k we cook whatever we want\" this is my advice to all of the customers who are going there please do not go to this McdDonald's they hired those kind of people who eats their own shit so imagine do they give a damn about you??? And i am going to sue this store because i have the proof"
    },
    {
        "id": 34,
        "text": "Don't expect any pleasantries\nHeck, don't expect much at all from some of them here.\n\nDefinitely not a \"Thank You for your order\", or any smiles or additional service or gratitude for your patronage.  Some may do it, not all of them are that bad. But if I could prepare you to expect anything, I'd say get ready to see a run-down dilapidated franchise with ratty duct-taped chairs run by a skeleton crew of disgruntled minimum-waged part timers.  How could this system be improved? will the proposed minimum wage  hike improve friendliness and morale? Perhaps.  But for now, I just want to grab this mcmuffin and get outta here\n\nUpdate, Breakfast Day 2 \nLook how thrashed the place is.  This morning at 10:45AM I saw a guy packing his crack pipe from a tiny plastic bag sitting in here. Iced coffee was refreshing, though.  They are slow at this McDonalds, but that's a common thread for all center city Philadelphia fast food places."
    },
    {
        "id": 35,
        "text": "Horrible McDonald's. Normally people go through the drive thru to pick up something quick... BUT NO NOT THIS ONE! It took 25 minutes to get food. Plus once we got it, IT WAS WRONG... Surprise surprise. They also were out of Diet Coke! I've never heard of that! Just terrible for a service that is so simple and the workers to be incompetent."
    },
    {
        "id": 36,
        "text": "This mcdonalds has THE worst costumer service in the world. The workers are rude beyond belief. TRY to not come here if you don't have to."
    },
    {
        "id": 37,
        "text": "The Worst McDonald's ever. My childhood was filled with Happy Meals and French fries so yes, I have days where I want McDonald's.  Maybe once a year some years and some years once every two months. I feel like I am in a McDonald's anonymous meeting confessing my addiction to something I know is bad for me.  Anyways, I truly believe McDonald's at one time was able to make unknown ingredients, economical friendly products taste real good. BUT this McDonald's I believe has made it so I will not crave another Big Mac for a very long time.\n\nThis place is sloppy, service slow, rude, food to the nth degree horrible, and just really really bad. I feel like even if I made a Burger with my toes, it would be better than what I received from this McDonald's. I also feel bad for the students from the school across the street because this is the example of the McDonald's they are receiving. Hopefully it will deter them from eating it as an adult as I did today. Save yourselves! Do not go to this McDonald's."
    },
    {
        "id": 38,
        "text": "Poor management, incomplete inventory, place is dirty. Employees don't greet customers."
    },
    {
        "id": 39,
        "text": "The torn Red Furniture has been removed.  While still a low-level, low-class establishment, their disposal of these eyesores alone  is worthy of one additional star for ambience improvement."
    },
    {
        "id": 40,
        "text": "The website says this McDonalds closes at 12:00 AM; however, I just went through the drive-thru (along with 4 other cars) and all of the workers were crouched down hiding and when we knocked on the window they said it was \"closed.\""
    },
    {
        "id": 41,
        "text": "On Wednesday I visited this McDonald's to make gift card purchases for an event my employer was hosting. I had to purchase 50 gift cards, which had to be individual transactions. The staff were so accommodating and patient with my request even though I know it completely disrupted business and they had to spend about 30 minutes ringing me up for each gift card. Tanisha was so helpful and understanding and I just think this store should be recognized for their customer service. Thank ya'll so much!"
    },
    {
        "id": 42,
        "text": "Every time I go to this place they refuse to make breakfast sandwiches. At least 5 times I've tried in  one week. It's horrible. Stay away."
    },
    {
        "id": 43,
        "text": "Definitely needed after a long day/night of drinking for Saint Patrick's Day. Food is what you would expect. The drinks had soda spilled all over the cups, making a mess in the car. They had us wait seven minutes to serve lunch which was kind of annoying but necessary I guess. They also forgot to give us one of our sandwiches."
    },
    {
        "id": 44,
        "text": "I do not know why I continue to come here- the food tastes like crap- and the service is even worse! I only come here for my daughter who enjoys the happy meals. Kids have some weird taste. \n\nBut I would only come back here once in a while for the fact the service always pisses me off, and whether they get the order right is hit or miss. I don't see how it's so hard working there and putting the right items in the bag. \n\nLuckily I haven't been to McDonald's in a while and this review is a couple weeks overdue! When you are thinking fast food- McDonald's is not the way to go! Unless you want to \"go\" to the bathroom right away!"
    },
    {
        "id": 45,
        "text": "If I could give no starts I would. Never get the order right. Ever. No one cares. Gets it wrong when we get it sent through UberEats."
    },
    {
        "id": 46,
        "text": "I ordered three McDoubles and nuggets and they served me them with the patty off the bun the cheese wasn't even between the burgers and the bread was stale, if you don't like your job than quit. Corporate really needs to come thru and change this place and do some work. Unbelievable my nephew was upset and his nuggets weren't even warm they were cold like they've been sitting for an hour. I get it it's McDonald's...but this was unreal"
    },
    {
        "id": 47,
        "text": "listen... i get it... its McDonalds but come on! This place has the worst attention to detail i have ever had to deal with. I ordered a bacon egg n cheese biscuit with a coffee (2 creams hold the sugar). What i got? a bacon egg n cheese mcgriddle (ewwww) with  black coffee.... ugh\n\nsucks that they dont get the orders right. so be warned CHECK YOUR ORDER before you drive off......"
    },
    {
        "id": 48,
        "text": "The other reviews are correct; the service is terrible   I rarely if ever eat fast food but on the few occasions I have been there the experience was extremely poor even by McDonald's standards. The real concern is the activities that occur on and near the property. It appears this location is a regular \"hang out\" for drug users/dealers and beggars. Given all the improvements to the area, its residents would be far better served with a healthier and safer environment.  I do not expect much from a fast food restaurant but this is beyond unsafe"
    },
    {
        "id": 49,
        "text": "It's McDonald's. Definitely not gourmet, but it's fast and convenient for the kids. At this particular location, they could have a better supply of napkins and ketchup at the customer's disposal, but like I said: it's McDonalds. You generally go in knowing what to expect."
    },
    {
        "id": 50,
        "text": "Worst. McDonalds. Ever.  They ran out of Shamrock Shake mix prior to 2pm on the day before St Patricks day.  Bad planning."
    },
    {
        "id": 51,
        "text": "i went there today. I saw 4 young ladies working and except for the nice girl working at the back window w her mask on properly, every single other employee i saw had their masks on wrong, exposing their noses. I feel like this defeats the purpose, especially when they could breathe on the food and spread covid like that. the food was decent but my 10 piece nuggets only had 9, unfortunately."
    },
    {
        "id": 52,
        "text": "This is a hard review to write because I've had so many mix ups here but one top notch experience.\n\nWhen I'm feeling weak and hungover I sometimes pop in here on my way to work for a #1 with a small oj..more times than I can remember the order gets messed up. The drive through takes forever and by the time you get your bag you're frustrated and late and you drive off without noticing you got a bacon biscuit sandwich instead of your egg McMuffin....devastating lol\n\nNow recently an employee was moving to california to work remotely and as his going away party we catered in McDonald's (kind of a gag party but you should give it a go). I went inside because I knew this wasn't a drive through order..I ordered probably 15 mc doubles half without onions.. 10 4 pc McNuggets.. flurries..several Big Macs..fries..pies..etc..we went all out. The woman at the counter was so nice and I got all that food faster than any drive though experience. What's even better is instead of ringing up everything separately she rang them in as pick twos for $4 or something...I spent way less than expected! \n\nLesson learned no drive through for me..but large orders are surprisingly a yes here!"
    },
    {
        "id": 53,
        "text": "Sorry excuse of an establishment. Can't believe this place has the audacity to consider itself a restaurant. Incredibly long wait times even for orders placed ahead of time, rude staff, dirty interior. Don't do it to yourself, get chipotle next door instead- you'll thank yourself for it and save yourself the frustration."
    },
    {
        "id": 54,
        "text": "I loathe McDonald's and fast food in general, but I did go here once out of sheer desparation, hunger and broke-ass-ed-ness.  I got a $1.00 McChicken Sandwich, no pickles - It came to $1.07 and I just barely had the change scraped together.\n\nWhat a humbling experience.\n\nI pray it won't happen again."
    },
    {
        "id": 55,
        "text": "Had to reorder my meal twice and was wrong once I received the order. The sandwich had a plastic label inside of it. Customer service was awful!!! The staff need customer service training and safety protocol education!"
    },
    {
        "id": 56,
        "text": "Found long hair in my fries on 2/7/2021. Some workers not masked. Those with masks did not have their noses covered."
    },
    {
        "id": 57,
        "text": "I would give this place 0 stars if u could. It's just ratchet in here. Every person that works here is ratchet. They are fighting behind the counter. They have meek mill blasting from a boom box in the back. The manager with the nasty wig is horrible too. The place is RATCHET. Takes forever to get food yet everyone is chillen in the back"
    },
    {
        "id": 58,
        "text": "The worst service ever. Waiting in line with one register open but eventually 2 open. I only ordered hot cakes but took forever to get my order. I asked if they have McRib but nobody knows what it is. One girl said if I meant McGriddle. Other customer helped me to describe what it was. One girl said she didn't know what I was talking about. I never go back here again"
    }
]