[
    {
        "id": 1,
        "text": "I ordered the meal deal with his six nuggets and fries and BBQ sauce and a large  sweet. Receive my order and I touch my fries and they was cold. Is be young guy in the window to your have any hot fries so I gave him my the cold fries and he hollered back to the person that was cooking. They said yes we have hot fries. So he went back to get them and when he was walking to the window he just hand me the hot fries in this hands. He should have put them in a bag or wrapped a napkin around them so I got another order of fries."
    },
    {
        "id": 2,
        "text": "I have been at a slowe McDonald's in my life. I go there because I work in the mall. With limited time I sat 10 minuted waiting for a soda. I went elsewhere. Unreal"
    },
    {
        "id": 3,
        "text": "Just walk to this mc Donald right now 6:06 am n it's still closed n two workers are waiting for it to open so they can start working. Seems like this place is always late when it comes down to opening n also very slow service."
    },
    {
        "id": 4,
        "text": "This McDonalds is incapable of taking an order. They will mess it up every time. Truly pathetic that you can't handle the simplest of tasks."
    },
    {
        "id": 5,
        "text": "Service was horrible!! Took forever. My order never got put in the system. I just wanted 6 chicken nuggets. A lady behind  me was catering a wedding or something and her order was filled long before mine."
    },
    {
        "id": 6,
        "text": "Stay away from this Mc Donald's. Extremely rude and disrespectful staff. If you ever use the drive thru, they'll keep you waiting for 10 or 15 minutes. Also their dining area and the kitchen looks extremely dirty. Often times they'll give you cold food. Overall avoid this branch."
    },
    {
        "id": 7,
        "text": "They say it's fast food, but always have to wait so long for food. Should be called slow food, \n\nThe only thing. that's great is there $1 menu, \n\nBut when is it comes from one of the cleanest McDonald's I've been  to. \n\nThey could do a little better on how they wait on customers and make sure they give them what they order. But other then that it's okay. \n\nDon't ask for extra sauce for your chicken nuggets because there charge you extra for it."
    },
    {
        "id": 8,
        "text": "Came here the other night after working a 10 hour shift, really important part of the story here, outside on the McDonald's it says 'open till 1 am' so I pull up to the drivethru at about 12:10 and wait about 2 minutes after saying hello multiple times, I go to the window to see the employees not working and just kinda sitting around, so after waving my arm trying to get the employees attention I honk my horn, a girl noticed and came up to the window and screamed in my face \"we closed\" I said \"on google maps it says 1 am, also says it right outside\" she goes \"we fucking closed bitch\" like 1) eh s'disrespectful 2) y'ghetto as fuck 3) terrible customer service 4) if you closed at 12 why is that not readily available for customers"
    },
    {
        "id": 9,
        "text": "Where is the button for NO STARS, or even NEGATIVE STARS? This is the most disgusting McDonald's on the face of the earth. The employees were rude and inattentive.  No one seemed to be in charge.  The area behind the counter was FILTHY.  The employees were playing grab-ass and cussing.  Three of the female employees were catering to (fawning over) some dude in a purple suit who was sprawled out in a booth... could he have been the franchise owner?  If so, McDonald's needs to send him packing. Filthy, dirty, disgusting. Not exactly a McDonald's trademark moment."
    },
    {
        "id": 10,
        "text": "This place was good before n it's bad n getting to the worse. They fight n argue with the customers n the manager just sat and do nothing. For the services you have to wait 2 or 3 minutes on the front of register to get serve, so at least need 20 minutes to get your food"
    },
    {
        "id": 11,
        "text": "The old lady at the drive through taking money was rude af. Yelled at me as if I was doing something wrong. The staff here needs better training."
    },
    {
        "id": 12,
        "text": "The manager a middle aged indian woman is not at all friendly. Doesnt say thank you. The help around her is not so good either. Even if the goof was worth it i woyldnt go. The manager shoyldnt haveva job with the public."
    },
    {
        "id": 13,
        "text": "When guests only have one option to enjoy their experience, make it a positive one to the best of your ability. I wanted in a long line, as to be expected. The person in the drive thru kept telling me to move forward, move forward. They have two speakers. There was a car at the speaker in front of me. I couldn't move forward. Then after I placed my order, I was instructed to move around the car in front of me and go to the window. What? He was done literally 10 seconds after me. Had I moved in front of him, that would've been wrong and pointless. We both ordered a combo meal. What tops it off for me is though....the delightful, gracious, smiling happy faces that waited around the bend for me. First, to take my money, then second, hand me the bag like I was extending my hand with the virus itself extended to her. No smile. No thank you. No eye contact. And worst of all, no freakin napkins!!!!!  You people are the worst. I'm not lovin' it."
    },
    {
        "id": 14,
        "text": "I got in the drive thru line.  The speaker has the automated after waiting 10 minutes I drove up to the window.  2 cars were in front of me. The hours say open til 11pm. After waiting 10 more minutes and trying to get the attention of several employees who just waved me off I decided to call the store.   The person who answered said they had a problem with the speaker so they closed.  But if I orders Uber eats or door dash I could purchase food.  I suggested maybe putting a sign at the drive thru.  As we were pulling out of the drive thru line the girl out the window yelled to us \"are you u we eats\".... we said no, then she yelled we are closed the speaker is broke.  I said a lot of things are broke and she proceeded to yell you think your smart.... and they yelled your an asshole.  There were other customers at the window.  This is the epitome of unprofessional behavior."
    },
    {
        "id": 15,
        "text": "Literally the worst McDonald's I have ever been to in my entire life. Pulled up to the drive-through was asked what I wanted then I get cut off after trying to order one burger and was told that I'm gonna have to wait that she's not ready. Then I wait for 15 minutes and no one answers I go to pull out to leave and nobody was in line in front of me. A time before this there always employees cussing and fighting each other. Even had the manager walk up to the person at the first window talking out loud saying she doesn't Give a eff if the customers order was wrong, as they are sitting there eating taking orders.  I thought I'd them a 2nd chance and never again."
    },
    {
        "id": 16,
        "text": "Came here for a quick lunch and I don't know if she was a manager or cashier . But she took my order through drive through & she was super nice and made my day a little bit better.  A coupon wasn't excepted and she apologized for it which was totally fine with me. She has great customer service skills and I hope she knows just by her being nice makes people's days, like mine better ."
    },
    {
        "id": 17,
        "text": "Absolutely worst! They don't even acknowledge customers standing waiting to order. Place is filthy and this was before COVID. New management and staff are needed here"
    },
    {
        "id": 18,
        "text": "Pure fucking idiots they have working here... trust me if you want McDonald's go that extra mile and get it from Bristol pike, I can just bet these guys fuck up something anytime we go here ... I've had it I'm gonna go out of my way next time not to come back. BTW were in the wake of a pandemic and all but one person was wearing the mask improperly. Sure hope me or my family don't get sick and I'll pray for anyone else that chooses they're service"
    },
    {
        "id": 19,
        "text": "If you have the  IQ of a stick , here's the place of employment for you... EVERY TIME, I go there, don't know why I do, they  screw up  my order... HOW HARD IS IT TO  PUT STUFF IN A BAG?? Rob me every single time.. Place should be closed down... GOOD  JOB MANAGER!! Morons!!!!!!"
    },
    {
        "id": 20,
        "text": "This place should be permanently closed down. That would actually be a service to everyone. This is absolutely the WORST McD's in NE Philly. I went to the drive thru and ordered a Nugget meal. The idiot who gave me my bag was more interested in talking to her coworkers. I asked for sweet and sour sauce to which she said it's in there (it's f'ing bbq sauce!) To make matters worse, there were no fries in my bag even though I already paid and they come with my meal. I wouldn't wish my worst enemy eat here except for puta who gave me my order in the drive thru."
    }
]