[
    {
        "id": 1,
        "text": "My review is very much like Scott F. \n\nI was only here for Erin Express. From what I remember it's a lovely place.. not bad but I'm hardly ever near this bar so I don't imagine this being my go-to bar in University City.\n\nHowever, probably best bar in the area."
    },
    {
        "id": 2,
        "text": "One of my favorite bars on campus, simply for how comfy and defining of my college experience it is. I only regularly come here for Tuesday night quizzo, which is probably why I'm rating it so high since I wouldn't know about the super crowded weekend nights-- not too crowded, but lively at the same time to have a great time with your friends while also being able to hold a conversation. Great late night deals on food (I recommend the onion rings, although you can't go wrong with any other of the fried, greasy, drunk food) and good selection of beers, although I'm not a huge beer person. \n\nThe quizzo questions are just challenging enough to keep you interested and motivated, with great prizes ($60 tab for 1st place, $30 tab for 2nd place, case of beer for 3rd place, and usually something really cool for the last place winner). The announcer is really nice and friendly, and the bartenders are usually college students so they tend to know what kind of service we like.\n\nThey have gotten stricter about carding-- implemented a scan machine and also asks for a backup ID."
    },
    {
        "id": 3,
        "text": "If you go to Blarney on a Saturday night, here's what you can expect:\n\n- to pay a cover.\n- to see trashed undergrad girls in cocktail dresses and heels falling all over themselves and anyone who gets in their way.\n- to pay in cash, as the credit card minimum is $20. \n- to hear terrible karaoke (this part is actually fun).\n\nYou shouldn't expect to:\n\n-have space to move around in. It's pack from the front door into the back room.\n-to have easy access to the bar. The first Saturday night I was here, I didn't even get a drink because I physically could not get to the bar. However, I am only 5 feet tall, so I couldn't muscle my way through a wall of frat bro.\n\nBottom line: this is a Penn undergrad bar, so if that's your scene, go for it. I personally don't like getting dolled up to go to a dive bar, so I take my t-shirt-and -jeans clad self to Drinkers' West, Blockley, or Cav's, all of which are way better, in my humble opinion."
    },
    {
        "id": 4,
        "text": "The veggie burgers here are AWESOME! They claim they are not homemade but they taste like better than homemade...YUM and come on - they come with a side of 'tots! It doesn't get more amazing than this."
    },
    {
        "id": 5,
        "text": "Awesome college bar, always a great time. 50 cent drinks on Thursdays and karaoke Saturday nights. Drinks are real cheap, highly recommended!"
    },
    {
        "id": 6,
        "text": "If you like tiny bars, this is the place for you. Blarneys is strictly a bar, no dancing at all, although there is a jukebox for entertainment purposes. This little hole in the wall is where I had my introduction to the goodness of Jaeger bombs. The drinks are reasonably priced, especially on Thursday nights. Thursday night is the night of the infamous .50 cent mixed drinks with a $5 cover. Amazing. Tuesday night also happens to be Quizzo night. How can you go wrong with .50 cent mixed drinks and Quizzo? You can't, so I'll see you at Blarneys next Thursday."
    },
    {
        "id": 7,
        "text": "Not Bad.  Came when a friend begged me to come out for the night.  The place is pretty neat, the specials are OK and the staff is nice enough.  It's kind of a pain to get up to the bathrooms, and when the place is packed (with prep Penn kids), its near impossible to get up to the upper levels, there always seems to be a steady stream of people coming down the stairs in the opposite direction.\n\nAll in all, and OK place that I may find myself at again on a weekend or two."
    },
    {
        "id": 8,
        "text": "Blarney is my favorite place to watch a game.  The Flyers, Phillies, Sixers, and Eagles are always on and lots of fans frequent the B-Stone for beers and Philly sports talk.  The walls are covered with Philly sports memorabilia, as well as a chalkboard listing the city's four major teams and their most recent championships.  The bartenders are all extremely personable and friendly, and you can get any kind of bottled beer you can imagine.  All of this at Blarney adds up to a top-notch sports bar.\n\nAside from being a great place to watch the game, Blarney has the best Quizzo in the city every Tuesday night.  The theme of the second round is chosen by the team that scored lowest the week before, so Blarney Quizzo regulars tend to know the theme in advance.  Thursday night is Sink or Swim (50 cent drinks with a $5 cover) and Saturday is karaoke.  Every night of the week is a rockin good time at the Blarney Stone."
    },
    {
        "id": 9,
        "text": "This place leaves much to be desired... But for an authentic \"traditional college bar\" experience & a cheap pitcher - you can't go wrong.\nThere's sometimes karaoke or a DJ, or people dancing on the pool tables. Other times I've been here and it's completely dead. You never know what you're going to get. One thing is certain - the service isn't very good, and you're better off drinking out of a disposable cup.\nWill I return? Probably... but only for $5 pitchers or $1 wells. ha ha."
    },
    {
        "id": 10,
        "text": "It's a dirty dive bar where I only go because all my friends are there. It's cheap and spacious, although it does get crowded on the weekends. Go after midnight and there's no cover -- and often no bouncer to check IDs. They're usually open late too, not kicking people out until like 3am."
    },
    {
        "id": 11,
        "text": "its a college dive. WITH darts n pool. alcohol n sharp objects n hard balls n wooden sticks. niiice"
    },
    {
        "id": 12,
        "text": "Definitely the typical penn \"college bar\". Staff was friendly when I went, but the place it's self can get extremely crowded for the space they have. Majority penn student crowd also. \n\nPrices were good being a college bar, and bathrooms were a mess because of all the people coming in and out. Understandable though."
    },
    {
        "id": 13,
        "text": "The Blarney Stone has an okay selection of beer on tap and standard fare. The drink specials are amazing, but they tend to overcrowd the bar. I like going to the Blarney stone when no one else is there and shoot shit with the bartender instead of wrestling for a comfortable place to stand or sit with the Mill Creek/Cav's spillover.\n\nThe last time I was there they had set up tables and chairs outside, but we weren't allowed to drink at them. What was the point?"
    },
    {
        "id": 14,
        "text": "The only reason I'm not giving it 5 stars is because the DJ (who had a soul patch) tried to do butt stuff to me. I'm a man."
    },
    {
        "id": 15,
        "text": "I've only been here for Erin Express.  And I will ALWAYS go here for Erin Express.\n\nOh wait, I was there one other time.  And I don't remember it.  So, good job Irish dive bar.\n\nCan't wait till next week."
    },
    {
        "id": 16,
        "text": "why are people yelp-bitching about blarney? its awesome cause it is what it is and the bartenders are the shit."
    },
    {
        "id": 17,
        "text": "Typical Penn bar filled with typical Penn kids. The beer prices are reasonable although the selection is not exactly vast. It can get quite crowded on the weekend and Thursdays. Basically, it's a decent if unspectacular college bar. If you want to hang out with Penn kids, this is the best place to do it--certainly a far better option than Smoke's.\n\nOf course, the above raises an important question: Why would you want to hang out with Penn kids?"
    },
    {
        "id": 18,
        "text": "Not bad, an Irish pub to the NW of campus and clean, fun, and cheap drinks. Decent tap beers, and they have pool tables.\n\nBathrooms are the downer.. you have to go upstairs (weird).  There are multiple levels. Not exactly handicap-friendly.\n\nStaff is friendly and the place can get crowded. Better on a quieter night, unless you like being packed in with a loud crowd of students during the school year."
    },
    {
        "id": 19,
        "text": "I love Blarney for quizzo on Tuesdays.  So that's what I'm going to review.  Because otherwise, it's way too crowded in here and I don't even bother.\n\nBut anyway, back to quizzo.  I like its laid back vibe (not too competitive/intense) and the food/drink specials are amazing.  $3/5 long islands that will get the job done and those chicken fingers/mozzarella sticks/fries...  All the drunk food I need.  The prizes for quizzo are also pretty good so I'd recommend going!"
    },
    {
        "id": 20,
        "text": "This bar fucking sucks. No bathroom and staff refused to close the door when it was less than 30 degrees outside."
    },
    {
        "id": 21,
        "text": "This place is the prototypical dive bar that caters to rowdy locals and rowdier students.  It's surprisingly a favorite for a lot of schools that aren't nearby, like Temple and Drexel, but if you go to Penn, don't be surprised to see that fat girl you hooked up with last weekend crying on the curb outside.  Cheap, dirty, and kind of fun.  Lots of people throw up here; it's that kind of place.  \n\nTheir men's bathroom is hilariously devised to prevent anyone from taking a shit (unless you're shitting in the urinal, which HAS HAPPENED).  Diabolical."
    },
    {
        "id": 22,
        "text": "Cool little spot right off of 40th and Walnut...I used to work across the street and for lunch their chicken parm hoagies would hit the spot. Karokee upstairs and they have Cruzan Buckets for $12-a must try. Mostly college kids but if you invite your own peeps this bar comes with a good time!!"
    },
    {
        "id": 23,
        "text": "Indecisiveness. I left my wallet in my back pocket, sitting on it, my right leg is tingling, going numb. Let it. I am trying to go numb. To numb the numbness. So here I sit. Indecisive. The crowd grows smaller and louder as the night passes. \n\nThe bathrooms are strange and remind me that I, a human, am just an animal, a series of biological processes frantically hurrying towards dissemination and dissolution. \n\nSeems to be trying for an Irish bar vibe? Not sure."
    },
    {
        "id": 24,
        "text": "Come here for the drinks not the food. Wowza, looooove Blarney. But damn those nacho sweet potato fries were horrendous. Ordered a bunch of appetizers for the table, wings, chicken fingers (both decent). But not one of us liked the nacho sweet potato fries (sweet potato fries with salsa and cheese). But the drinks are well priced, and the staff/management is great. AND charitable! Donated for a Penn function I helped put on for charity. Love ya Blarney."
    },
    {
        "id": 25,
        "text": "Friendly staff. Quiet on Thursday. I asked for a gin and tonic, got it in a pint glass."
    },
    {
        "id": 26,
        "text": "Pros: Cute, clean bar with friendly staff and decently priced drinks. Went there on a Friday night when there was a DJ, so that was a plus. \n\nCons: This place was like an obstacle course. You had to climb 3 flights of stairs and plow people over just to get to the bathrooms. Imagine doing this after a couple beers. Also, its pretty small, so the place gets jam packed. Good luck getting out of the bar if you decided to sit in the back by the pool tables. Oh and, its mostly college kids, so I experienced some snobby Penn/Drexel students when I was there. But there were also some equally friendly people."
    },
    {
        "id": 27,
        "text": "Came here for a feb club senior event. It's definitely a typical college dive bar, but it was still fun! Not great price deals for a feb club event though, kinda pricey for such a dive bar, and selection isn't large, but the buckets (especially the panty dropper) were delicious. Food was okay. Go to smokey joe's for cheaper (and better) drinks and bigger crowds. Overall, this place is just a classic college bar for fun and to hang out with friends. Small, dark interior but also pretty spacious dance floors"
    },
    {
        "id": 28,
        "text": "The Blarney Stone is a great compromise between \"college bar\" and \"bar.\" They offer a variety of drink specials, most notably Thursday's $5 cover and 50 cent drinks until midnight.\n\nThis is one of the best bars in the city, when it's not crowded. It's cozy inside, and the staff is friendly. Though they keep some of that Irish flavor it's named for alive, it's really more of just a low-key sports bar. This is a great place to watch a game (pending it's a Philly-related game).\n\nWhen \"The Blarney\" is crowded, it's a state of shock & awe. It becomes the fraternity you never knew you belonged to, and people push and shove and cut in line, and it'll make anybody prejudice against Ivy League school kids who love to put a Miller Lite on Debit --- not that I have a prejudice bone in my body."
    },
    {
        "id": 29,
        "text": "I really only come here on Thursday's when the well drinks are a dollar at the cover is $5. It's packed with college kids but we come at the beginning of the night to play a round of pool and listen to the live band before we have beer spilled on our shirts. \nAlso Latin music night is super fun. Usually can find a group dancing near the pool tables. \nIf you're in the area, it's better than Cavs (they aren't nice to their customers) but Blarneys feels safe and the bartenders are pretty on top of it when packed!"
    },
    {
        "id": 30,
        "text": "This place was great for st. Paddys, but is a college bar and serves it purpose of being there when you need a drink. I had forgotten we stopped by until I saw that I checked in here anf hadnt reciewed yet"
    },
    {
        "id": 31,
        "text": "blarney has been a favourite place of mine since i moved to west philly back in the day."
    },
    {
        "id": 32,
        "text": "My two stars could easily be four, depending on who you are.  I think this place is shitty, although the space (minus TVs) and sneaky location are totally my style.  Part of the issue:  I think anyplace with a $5 cover for $.50 drinks all night is a bad idea.  So take my review with one or many grains of salt.\n\nAnyway, the other bad thing about this bar was the food.  The french fries and garden burger we ordered were inedible.  Again, we're vegetarians and that informs my experience.  So, what I'm saying is that the burger was basically still half-frozen when it came to me and the fries tasted like fried chicken.  Now, why do you think the fries might've tasted like fried chicken?  Because everything goes in the same deep fryer, of course!  Wings, scrapple, garden burger, fries...it's all going to be cooked partly/wholly in wholesome, death-savory animal fat.  So this place gets a shitty review.  Because if I wanted fried chicken I would order fried chicken.  Plus, they should really be more careful about cleaning the fryer--this was some seriously unmistakable chicken flavor.  But maybe I should never have come here as a vegetarian who doesn't like $5 all-you-can-drink $.50 drinks...  Maybe this is really your dream-bar."
    },
    {
        "id": 33,
        "text": "I love coming here on a Friday after work! They have great specials and the super sampler is only $10 on Fridays and you get a lot of food! I've never had a bad experience here. Has a nice dive bar feel and isn't too rowdy. Great for a casual night out, or the first stop to the night."
    },
    {
        "id": 34,
        "text": "This bar is definitely not the kind of bar I would normally frequent but every time I go, I love it so much more.\n\nIt's a total undergrad bar.  Divey on purpose, cheap, awesome specials.  But, unlike any undergrad bar in West Philly, it's EMPTY every time I go.  Maybe undergrads don't do happy hour like us graduate students?  Maybe they can't find the place (it definitely doesn't stand out)? Well, that's awesome for me because I get to take advantage of the super cheap drinks (as in top-shelf liquors for $4 a drink) without being packed in like a sardine.  \n\nTheir food is pretty good.  It's just standard bar fare - nachos, wings, burgers, fries, etc.  There is plenty to choose from, so you're bound to find something you'll want.  And because it's so cheap, you can order a ton of appetizers for the table.  I definitely recommend the sweet potato nacho fries!"
    },
    {
        "id": 35,
        "text": "The Gator Guzzle rolled on and we arrived at the Blarney Stone third. What a college bar. This place is the kind of bar that reminds me of places in Gainesville or some other college town. What a great time. When I first walked in, I didn't realize how big this place was. But during our pub crawl, I explored the whole place and it was pretty huge. I bet this place gets crazy on a Thursday or Friday night. Fortunately, I wasn't there for that. \n\nInstead, we were singing the UF fight song (it was on the Jukebox) and \"We are the boys\" after the third quarter, er, um, I mean bar."
    },
    {
        "id": 36,
        "text": "Bar tenders are great. I come here for quizzo and they have awesome prizes. Drinks are also reasonably priced"
    },
    {
        "id": 37,
        "text": "Dive bar. College students. Karaoke Saturdays. Enough said."
    },
    {
        "id": 38,
        "text": "This is a frat house for frat boys. Case in point, my gin and tonic came in a plastic cup and cost me $2."
    },
    {
        "id": 39,
        "text": "Maybe before your bartenders falsely accuse clientele of breaking pool sticks, they should watch actual security footage to ensure they're talking to the right group of people. The staff here are low-class; no two ways around it. Go for ten minutes - anytime -and refute otherwise."
    },
    {
        "id": 40,
        "text": "In a lot of ways, I could write almost exactly the same thing for Blarney as I did for Smokey Joe's. It's a dark, sticky bar that attracts Penn students. And I love it. It definitely fits in the category of dive bar, and you'll meet a lot more non-Penn folk here than at some of the other Penn spots. It's pretty big and the stairs up to the bathroom are nothing short of treacherous. But it's cheap and a great time, and that's all that matters when you wake up the next morning wondering what you could have possibly been drinking last night. Plus the kitchen sends out some pretty on point drunk food."
    },
    {
        "id": 41,
        "text": "When I think about my grad school experience, I'll probably think of Blarney Stone before the building my actual classes were held in.\n\nHere's what I love about Blarney (and oh God, there's so much to love, if you're the type of person who knows to avoid it at night on Thursday through Saturday, when the undergrads invade and if you're the type of person to appreciate a good dive bar):\n\n- Grilled cheese and tater tots. And sometimes tomato soup if I want to mix it up. Sad that I think of this before beer.\n\n- Wifi. A bar with wifi is just genius. This is where we go to write our syllabi, to meet about the course we're taking or teaching, to study for our comprehensive exams. Come midday, and you'll have the place to yourself.\n\n- Super friendly, non-intrusive staff. They notice when our beers are getting low and come over with another round. They don't bitch when you move tables around. Every time a friend has had an issue with the food, they've been really quick to respond and have been super apologetic. I wish I could say that we never have issues with the food, but it is, after all, a dive bar. On that note, don't get the wings. \n\n- Blarney's rules, which include \"no douches\" and \"no icing bros.\" Also, curiously, \"no bare feet,\" which leads me to wonder who would go into a dive bar barefoot.\n\n- Completely reasonable prices.\n\nIt's one of those bars that you'll miss when you move away."
    },
    {
        "id": 42,
        "text": "It's whatever.  The burger was no better or worse then what I had years ago before the slight makeover and new management.  It appears the service improved.  They have matching shirts, except that one server who didn't do his laundry and likely was wearing yesterdays shirt with last weeks underwear.  Gross.  The other food being served looked way better then my burger, but I'm very fussy and have to be force fed if its a new food or something I don't like.  Not too many things will compare to the sight of a 44 year old, poorly in shape man being force fed french fries on some idle Tuesday.  Oh, they have beer."
    },
    {
        "id": 43,
        "text": "I don't know where to begin. Yes, the floors are sticky. Yes, they have tater tots. In between they serve drinks that will get you drunk enough to make some delightfully stupid decisions. \n\nWhen I die, I hope to be interred here. That my future descendants have the blessing of coming here to visit my final resting place. They can drink and karaoke here and think of me, and have one fleeting thought that maybe this time in history wasn't as bad as the history books made it out. That we had a toilet fire of a President and imprisoned children, but boy did we have Blarney. If that can't happen, I'll still be in love with it. And haunt it instead. Get ready, Kevin."
    },
    {
        "id": 44,
        "text": "A lot bigger than it looks, some pretty good local brews on tap. Oh, and very very college-y. But not in a horrible way, I guess.\n\nBut I've done this all before - in Ithaca. Kinda past that scene, personally. But, for reasons I won't go into right now, I found myself in this place with a group of my younger friends, getting shitfaced on a Thursday night.\n\nAnyway, being the only one with a job, I buy us a round of shots. They were stupid cheap at like, 4 or 5 bucks each. I don't remember. All I know is by the end of the night, I'd only spent about 50 bucks. That probably made me a high roller in the joint.\n\nDespite that, the bar staff is incredibly patient, surprisingly knowledgeable when it comes to \"old people\" drinks, and really quick. I suppose they'd have to be to survive the daily onslaught. The beer special that night was \"crappy light beers for a dollar,\" but the main bartender offered to just upgrade me to a bigger cup of Yuengling or Kenzinger at no extra cost. I think he recognized that I was a little older than the average college student. Thanks, guy!\n\nAlso, this place is cheap as hell. Which I suppose is why there are so many students every night.\n\nSo, congrats to you, Blarney. You were a lot better than I expected. I might even go back when there aren't so many students around. Summer's upon us!"
    },
    {
        "id": 45,
        "text": "On a Friday night when all of the other bars in University City were packed, my friend and I found a respite in this divey side-street locale. The atmosphere is similar to any dive bar in South Philly- dark and smokey, with a good dash of ye olde \"Irish\" flair. I wouldn't recommend this place if you want to have an active night out, and their selection of on-tap beverages is your standard dive-bar domestic few (though they had Shock Top and Yards IPA, which was good enough for us), but if you're looking for a relatively quiet place to poke your head into (and perhaps escape some of the campus kid shenanigans), Blarney Stone offers a good option.\n\nThe pub fare was pretty decent, if generic. Nothing to write home about, for better or worse. The prices are great if your pockets are light, and the staff is friendly."
    },
    {
        "id": 46,
        "text": "There's no denying that this place is fun if you're in the mood for rowdy drunk college kids. As a graduate student new to the area, I felt a little overwhelmed walking into an undergraduate past-time, especially when my friend came back from the bar with drinks served in plastic buckets, the kind that kids build sandcastles with. \n\nThis is in no way shape or form a classy establishment, it's just where people get hammered, dance, sing, and have a good time."
    }
]