[
    {
        "id": 1,
        "text": "This Wendy's is the worst Wendy's to go to . The food sucks , the service suck and the inside is always dirty ."
    },
    {
        "id": 2,
        "text": "This location has the slowest service ever every time I go. It's ridiculous. Today I went and got the 4 for $4 because I refuse to pay $3 for 4 nuggets. So I got a baconator, 4 pc nuggets, an ice tea and fries. Why did every item I got had no flavor what so ever. My fries didn't have salt. My baconator was cold and tasteless. My nuggets were soggy and my ice tea that was suppose to be a sweet tea wasn't sweet at all. I'm so tired of this place."
    },
    {
        "id": 3,
        "text": "I got a burnt baked potato  no friends ! Cook is BAD I think he is blind he don't know how to cook ‍ GO INTO TRASHHH I got burnt cheese on my baked potato how do u ever burn cheese unless u r BAD!!!!!"
    },
    {
        "id": 4,
        "text": "The restaurant was extremely dirty. All the tables and the floor were disgusting. Two workers walked through the restaurant and didn't even seem to mind the mess. There was one person in front of us and our order took over 10 minutes. The worst!"
    },
    {
        "id": 5,
        "text": "Eww I dont like Wendy's it looks nasty as hell food not good waiting long on order messed up my favorite food my Mcgriddls parfaits my all day breakfast"
    },
    {
        "id": 6,
        "text": "They left a bean in my baconator fries, some beef in my sons baconator fries, and french fries in my nuggets. The most unorganized shit ever. Very disatissfied."
    },
    {
        "id": 7,
        "text": "Oh my god this place sucks.  I ordered cheese fries and I got a salad with brown lettuce.  How does that even work.  Yeah told the person that I ask for cheese fries and she took the salad out of my hand and put cheese on it.  I am so mad right now and hungry.  I cant stand this place but the plaza is good.  The only good stores is Fancy Face.  Honestly who's with me to shut down Wendy's,  Finally their always slow and the lines are short but it always takes long."
    },
    {
        "id": 8,
        "text": "At times, this store is fast and slow with orders. But now, there are times the store won't even have window drive thru orders and have customers come in. Like what's the point of having a drive thru is they keep on doing that. Plus, there are young workers in there that talks too much at times and not taking peoples order. But again, the food is still good, but at times, there are horrible workers."
    },
    {
        "id": 9,
        "text": "My favorite (and only) thing to get here is the Grilled Chicken sandwich. No matter what, their fries are always soggy so you might as well subsitute for something else like a baked potatoe (with cheese and bacon...mmm) or just ask for cheese fries. \n\nThe salads are pretty fresh. Their good if you'd rather have something healthy."
    },
    {
        "id": 10,
        "text": "I see why they have 1.5 stars.  You pull up to the drive thru and get no greeting.  I place my order and I asked them to add cheese but no tomatoes and what did I get?  The exact opposite...no cheese with a tomato...and a charge for adding cheese! Too bad I didn't check my order before I left but maybe that'll be my practice from now on with all drive thru spots."
    },
    {
        "id": 11,
        "text": "Never again. My fries were cold and greasy. My chicken sandwich was burnt. The restaurant was not clean."
    },
    {
        "id": 12,
        "text": "Very nasty and unprofessional employees\nAnd on top of all that I had to wait over half an hour\nFor my good"
    },
    {
        "id": 13,
        "text": "Samson killed 10,000 men with the jawbone of an ass. I'm pretty sure this Wendy's is losing about that daily in revenue from the same instrument. I even called customer care about this one and I still have not heard from the general manager. But it tells me the moral at this store is from trickle down I don't care management. Welp won't be going back here."
    },
    {
        "id": 14,
        "text": "Not the cashiers fault or the one that made the sandwhich. I blame the cook.. and the manger had the nerve to ask if I want another sandwhich?Really totally discussed!"
    },
    {
        "id": 15,
        "text": "This is terrible! Poison. I ordered a Homestyle Chicken and a Baked Potato. I got my food and my Chicken wasn't fresh. But the potato is worst. The potato look like it was left inside of the 1900s and teleported to this day. It's dry ,stinky and not servable. If I could rate a 0 I would."
    }
]