[
    {
        "id": 1,
        "text": "Came here the other day for lunch and was very pleased with the bagel sandwich I ordered! I also ordered an iced coffee which is why I'm giving 4 stars and not 5. It was hot coffee poured over ice, watering down coffee and leaving it room temp without ice. \n\nI'll still be back, but will make my own iced coffee ahead of time. Also note their business hours are incorrect. The close at 4pm."
    },
    {
        "id": 2,
        "text": "My favorite new place for breakfast and lunch! Quick and friendly service. Their omelets and sandwiches are amazing, and prices are pretty cheap"
    },
    {
        "id": 3,
        "text": "I wanted to like this place more than I did. Clean, fast service, fair prices. But I wanted the bagel itself to be better. I admit that I am a bagel snob, so while this bagel was leagues better than what you would get in a super market, there are far better bagel options in the city. It was doughy enough, but it needed a bit more of a crust. I ate two before deciding. I will try again, but I left just a bit underwhelmed. For the 95% who aren't bagel snobs, this is place is great."
    },
    {
        "id": 4,
        "text": "This bagel shop just popped up about a mile from Temple University and being from NY, I havnt found any bagels in PA that deserve the name \"bagel,\" but this place is pretty darn good. Small shop vibe with very friendly cashier. I got the double egg and cheese and it was freshly cooked in front of me in a matter of minutes. \n\nThanks guys"
    },
    {
        "id": 5,
        "text": "I ordered this on uber eats on a rainy Sunday. My expectations were average since I've never heard of this spot before in Philly. My expectations were met. I enjoyed the food, but was a little pissed that my bagel had lox spread on it and not full lox like the photo showed. Additionally, I ordered coffee and they threw straws in the bag WITHOUT PAPER on them, kinda gross. Maybe an Uber Eats thing idk. Something to figure out next time. Again, the food was fine, but may have to try it in person. Thanks NY Bagel for making my rainy Sunday relaxing though!!"
    },
    {
        "id": 6,
        "text": "True to its name, this tiny new bagel shop actually makes New York-style bagels and breakfast sandwiches! On a real griddle! They give you a real NY-sized schmear of cream cheese on your bagel; everything about this place is delightful if you're a nostalgic ex-New Yorker like me, or if you're just looking for an excellent fast breakfast sammy. \n\nThe location is mid-block on Buttonwood, between 12th and Ridge."
    },
    {
        "id": 7,
        "text": "Delicious burrito! Was just passing by till I smell steaks and eggs. Definitely will come again as my go-to list!"
    },
    {
        "id": 8,
        "text": "I came here for breakfast on New Years Day and the food hit the spot! They have a lot of options on their menu, which all looked tasty. I ordered the pork roll, egg, and cheese sandwich on an egg bagel. The bagel was delicious and the cheese was nice and melted. I also ordered a side of home fries, which were amazing and the portion was very large. I definitely recommend this place."
    },
    {
        "id": 9,
        "text": "Always friendly service and the best bagel shop in Philly. Highly recommend there breakfast!"
    },
    {
        "id": 10,
        "text": "Pretty solid place in the neighborhood. Food is a positive 3 stars- they get the 4th for the great staff. They are very friendly and service is quick. Turkey club was HUGE and very good and the bagel chips aren't bad. Bagels are ok (however I'm not from NYC so my bagel palette might not be as sophisticated as other yelpers ) and coffee is decent. I am looking forward to trying more of the sandwiches for sure!!"
    },
    {
        "id": 11,
        "text": "Highly recommend this place if you're looking for quick, customizable, delicious bagels. As you can see from my photo, they do not skimp on filling aka a bagel lovers dream. The breakfast potatoes are your typical breakfast potatoes, nothing special, but they do shell out a hefty portion! Only issue was I ordered an everything bagel, and I believe they must've run out, but I wasn't notified, and I realized once I was home that my bagel was whole grain. Not a big deal, the bagel was delicious anyway!"
    },
    {
        "id": 12,
        "text": "Great little small local bagel shop in an area with not that many food options. The bagels are as good as any other I have had in the city and the service is super friendly. The coffee isn't the best but for the price you pay for everything it's pretty inexpensive. Def a great little spot for the area"
    },
    {
        "id": 13,
        "text": "What a nice find in an offbeat part of town. This did remind me of a new york bagel shop and within minutes of walking in we were walking out with a delicious breakfast sandwich on a New York style bagel. The staff was friendly and there was self serve coffee. We will be back."
    },
    {
        "id": 14,
        "text": "Yum! What a reliable little bagel shop! My roommate and i walk here when we want a yummy breakfast sandwich on the weekend! I'm pretty sure they have breakfast all day which is nice since we don't usually get up and out of our apartment until 12 pm or so! ¯\\_(ツ)_/¯  I even got a container of homemade cream cheese from here once, i think it was jalapeño and it was great! Highly recommend to all hungover weekenders or even if you're not hungover and just want a fat breakfast sandwich or some greasy breakfast potatoes"
    },
    {
        "id": 15,
        "text": "Fast and cheap but you pay for what you get. Everything bagel tasted weird/off and had a disgusting amount of cream cheese, enough for two other bagels. The home fries were also disappointing. Even the coffee doesn't taste good. Very disappointing. Won't be returning."
    },
    {
        "id": 16,
        "text": "I live fairly close to this bagel shop and have been here a few times now. I normally don't write reviews, but they have always been quick and friendly and they make really good breakfast bagel sandwiches (I haven't tried the lunch, but I'm sure that's good too), so I figured I should.\n\nI highly recommend them for good service, low prices, and tasty food."
    },
    {
        "id": 17,
        "text": "I wanted to like this place. Really, I did. I even came back a few more times before resolving to write this review. But some people shouldn't run bagel shops.\n\nIt would have been great! It's in a location without a lot of food options. Everybody loves breakfast food. What's not to love, right?\n\nWrong.\n\nBecause of my background I may have a high standard for bagels but this place falls way short of average in my opinion. I ordered the lox spread on my bagel. If I were to give an award for the smallest amount of lox in lox spread, it would go to this place. There was also just not enough cream cheese. Sometimes I have the problem where there's too much, but not enough? Come on. It's not that expensive. Also, I asked for lettuce and tomato on my bagel which they charged me extra for before giving me one piece of the world's smallest lettuce and most thinly sliced tomato.my mediocre bagel with pitiful amounts of lox spread, lettuce, and tomato was more than $5.\n\nI tried it again.\n\nI got the Cobb salad. It was like $9. I would honestly expect a portion size that was like 3x bigger than mine was. I was so disappointed. I give this place three stars for their location and convenience but as far as my satisfaction with it goes, I am disappointed."
    },
    {
        "id": 18,
        "text": "Great service and very friendly! Everything we have tried here has been good and the prices are very reasonable. They seem well staffed and the place was clean"
    },
    {
        "id": 19,
        "text": "Close to me, convenient. Very friendly and nice staff. They are quick with making an order and have a large menu of items to select from. \nThey also customized our order and got it exactly how we wanted it. \nGo check these guys out. You won't be disappointed."
    },
    {
        "id": 20,
        "text": "Delicious, fast and reasonably priced breakfast stop! They have all the breakfast essentials on the menu. A plus is that they really do wide range of bagels, sandwich options and even muffins/baked goods. \n\nThe breakfast sandwiches do not disappoint! Definitely a hearty load of meat, eggs and cheese. \n\nMy boyfriend got a simple breakfast platter (2 eggs any style with toast and a meat on the side). \n\nService was extremely fast (food was ready within minutes) and they accept card!\n\nI would definitely visit again! It's an easy stop-and-go styled establishment that is reminiscent of a convenient NY bagel shop!"
    },
    {
        "id": 21,
        "text": "I've been meaning to review this place for a while. I have a bit of a delivery addiction here when I am hungover or starving. I always get a breakfast sandwich, hash browns, and iced coffee. My food is always hot and delicious when it arrives and they pack it so carefully.\n\nThe breakfast sandwiches are GOOD. Bagels aren't spectacular but for the price and speed I think they kill it. A sign of a good breakfast sandwich to me is the meltiness of the cheese and every time it's perfect.\n\nSuch a lovely little spot with yummy food, you can't go wrong."
    },
    {
        "id": 22,
        "text": "Great quick stop show for bagels, coffee, salads, sandwiches, wraps, platters, etc. No indoor seating or bathrooms. Walk in, order, and go. Decent street parking options because it's a slightly random location."
    },
    {
        "id": 23,
        "text": "Was going to stop here and get a morning bagel but saw a roach crawling on the kiosk used to place your order."
    },
    {
        "id": 24,
        "text": "Nice little joint. Quality work. Great prices. Hard-working staff. Clearly a throwback type of bagel place. Pleased to see that you're still around... Although harder and harder to find."
    },
    {
        "id": 25,
        "text": "I stumbled upon NY Bagel & Deli Shop while snooping around on Yelp. I noticed that they had a feature that allowed me to order through the app and I was sold. \n\nAt this point I have ordered from here around 5 times. It is located a short drive from where I live, but it's on the way home from a friend's house so it's perfect for drives to and from in the morning after a night out. \n\nThe bagels are delicious. I've tried a variety of bagel offerings including their breakfast sandwiches, which have generous portions of egg and meat. I have also tried toasted bagels and I recommend their strawberry cream cheese if you're in the mood for something sweet."
    },
    {
        "id": 26,
        "text": "I ordered a bakers dozen of bagels through Yelp at 8:40 for my coworkers to enjoy. They arrived at 9am (much faster than the expected time of 9:30a). Seven of the bagels were rock hard and clearly not made today. When I called to let them know I was told that they opened at 7am and all bagels were freshly made. And no solution was offered aside from apologies. If you order butter it is small, individual packets of butter. The other 6 bagels were ok, not the best I've had but they were at least soft. I will not order from this place again."
    },
    {
        "id": 27,
        "text": "They make really good breakfast sandwiches which I eat weekly.   I also tried chicken pesto which was really good.  I highly recommend this place.  Very reasonably priced"
    },
    {
        "id": 28,
        "text": "Alright for bagel breakfast sandwiches at a decent price. Got pretty quickly delivered one morning after a few other shops closed and I was still in the mood for a breakfast bagel. Was a big greasy and not quite toasted but the bacon was good and the sausage did the trick."
    },
    {
        "id": 29,
        "text": "I have to admit, NY Bagel & Deli Shop was awesome. There's a great ambiance to it. Some people suggested Turkey Club Sandwich to me, I have to say it was really amazing. The people that work here are incredibly friendly. I really enjoyed it."
    },
    {
        "id": 30,
        "text": "I ordered an Asiago bagel sandwich and thought it was delicious until I saw all of the little hairs on the bottom. Yuck"
    },
    {
        "id": 31,
        "text": "Several years ago I posted some favorable & not so approving shots regarding this place. I've been back more than a handful of times since &  definitely feel its gotten a ton better. Due to this I thought I'd update my thoughts in a review. For one thing the sandwiches are a lot better (NOT ALL, UNFORTUNATELY).They're tastier & slightly bigger. The coffee which I had when the shop had recently opened wasn't good at all. I was surprised about that as though the sandwiches were slightly above average only I wasn't expecting the coffee to be bad. The next time I was willing to give their coffee a second shot was this spring (2021). It was really good that day as well as the following 3-4 times I had it. I should note I was also pretty happy  at the time the coffee was cheaper than Elixr's Coffee (another nearby shop to me, at the time).It was something like $2.35 (I can't recall the exact charge anymore). One day I came with my 18 oz mug I always bring so our landfills \nwon't have to be filled with more disposed of coffee rubbish paraphernalia. When the lady I hadn't seen before charged me $2.70 I reckoned she'd just made a mistake. When I said something about her figure she said my cup was a large so that's why I was being charged that amount. Following this I continued to get my coffee here but for some reason it had gotten worse, more bitter. \nI was going to give 4 stars prior to the coffee I got here 10/19/21 & the two egg sandwiches I ordered 11/6/21 (see pictures from that)but decided on three due to the shop's inconsistency.  The workers there, having said all that (I'm assuming they're the owners. I don't know ‍)are nice hard working souls."
    }
]