[
    {
        "id": 1,
        "text": "out of ten -- ten being best\n\nfood: 7.8\n\nlighting: 10\n\nnoise: 10\n\nenvironment: 8.5\n\nstaff: 9"
    },
    {
        "id": 2,
        "text": "Went in for the soft opening and we walked away very impressed.  Try the koreancini and the wings - both stand to be this place's signature dishes.  The sake punch was a fun take on sangria.  Fair beer menu and plenty of spirits to choose from.  Dessert was their play on strawberry shortcake that satisfied.  We'll be here often."
    },
    {
        "id": 3,
        "text": "Love the ambiance and the food was delicious! I have never had Korean food before and this was a terrific introduction! The Koreancini (fried rice and corn balls) were crisp and sweet and salted to perfection. The Kale Salad was big but not overwhelming and the dressing is perfection. We also got the stone pot bibimbap with tofu. The tofu was expertly cooked and the entire dolsat was flavorful but not too spicy. The relish on the BBQ tofu tacos was pickled heaven. \n\nThe white and red sangria were both excellent as well. My friend doesn't even like white sangria and she loved mine. There were also beers, wine, and cocktails that we still have yet to try!\n\nCannot wait to return!"
    },
    {
        "id": 4,
        "text": "Came here for brunch with family and friends and we really enjoyed our meals. I had the chicken and waffles and it was decent. Looks like I missed out and should have order the burger instead because that tasted awesome. Cool atmosphere and nice service. Definitely will return to try their dinner menu!"
    },
    {
        "id": 5,
        "text": "I had been wanting to try this place for a while, ever since I passed by it one day. Fast forward to Sunday, we were looking for a quick place to grab brunch and I suggested we try Southgate. We were able to find street parking nearby for free . When we got inside we were immediately seated and were able to identify several menu items that looked really yummy  the prices were all pretty decent (a meal and a mimosa will run you about $20). When the food came out everything tasted great (the fries are AMAZING). And last but certainly not least, our server Dan was super attentive and helpful. Overall it's a nice option for a casual weekend brunch if you're not trying to do a boozy brunch but still want a little booze."
    },
    {
        "id": 6,
        "text": "I came here with a friend after it was named the Best Burger from Best of Philly. We both had the Bulgogi burger with fries, and while it was pretty great, I wouldn't say it was the best I've had in Philly (that would be a tie between Kensington Quarters, P'unk Burger, and Good Dog Bar). The service and ambiance were lovely, and I would definitely return."
    },
    {
        "id": 7,
        "text": "I really enjoyed the bibimbap (got the one with tofu), it came in a hot bowl. There is outside seating which is nice but I would probably sit inside the next time."
    },
    {
        "id": 8,
        "text": "This place.  \nThe service was good - BUT the food-\nOrdered all kinds of menu items. \nKimchee , small plate, salmon crudo, buns , chicken karage , fried rice \n\nAs I was digging thru my plate for nourishment , looking for anything flavourful -i felt eyes burning on the back of my neck.  It was the cook looking like a dog groomer peaking thru the kitchen \"window\"-----noticing our lackluster expressions.  \nOver view \n- Kim cheeee was old AF\n- Buns oversteamed\n- Chicken karage over cooked \"chicken fried chicken jerky\"\n- No water options : just sink water \n- Basic.  \nWe paid before we got the rice- yelling as we ran out- \nKeep the rice."
    },
    {
        "id": 9,
        "text": "The drinks were good, not amazing but good. The Korean fried chicken was flavorful and extra crunchy which I enjoyed. BUT the pork belly udon noodles were seriously awful. I am not at all a picky eater and will pretty much eat anything, but I could barely get any of it down. I felt queasy the rest of the night just thinking about them. Probably won't be back."
    },
    {
        "id": 10,
        "text": "An awesome addition to the neighborhood. Love the seating outside .. but more importantly, love the bibimbap (especially in the stone bowl). I've been a few times now, and I just can't bring myself to order anything else!"
    },
    {
        "id": 11,
        "text": "Loved this place! I came here for a senior dinner. While the menu is pretty small, I love how it's so focused on Korean fusion food. I ordered the salmon bibimbap with my rice on the side. I thought the flavors balanced perfectly. Compared to other bibimbaps I've had in the past, the one I had at Southgate wasn't too heavy on the sauce. The ingredients were also seasoned just right, so that the main star of the dish was the actual salmon. While I don't drink, I was also extremely impressed by their drink specials. Would definitely reconsider this place if I'm in the mood for awesome food in a cozy environment."
    },
    {
        "id": 12,
        "text": "I enjoyed my bibimbop but the beef was a little on the tough side. I love the way the sizzling pot crisps the rice at the bottom :-P \nMy octopus appetizer was awesome - and a huge portion."
    },
    {
        "id": 13,
        "text": "I took a friend to this Korean spot because she was curious about Korean food.  Bimbimbop was inedible, fried chicken with panko was not a real chicken filet, but akin to chicken McNuggets, or mystery meat.  The wings were just OK.  This was an awful meal, and I think my friend will likely skip the Korean food for a long time to come."
    },
    {
        "id": 14,
        "text": "I love this place beyond belief! It has the most flavorful food is the whole city!!! Which means the best food in the world in that Philadephia in my mind is this culinary capitol of the world!!! I was absolutely impressed. They were so attentive too it was my birthday. I had the most wonderful time. I would give this place 100 stars!!! Thank you! Thank you! Thank you! I can't wait to go back;)"
    },
    {
        "id": 15,
        "text": "I used to be a denizen of the Old Tangier, so I wanted to see what became of the local neighborhood haunt.  The interior is wonderful.  So sleek and clean.  That being said, with all of the hard surfaces, it is hard to hear yourself think when the place is busy, let alone have a conversation at the table.  They are still developing the menu, so I wasn't able to see the full range of offerings they have.  I had the salad with the sushi tuna and rice.  It was a wonderful combination of tuna, daikon, fennel, pickled ginger and rice.  I found the chili sauce a bit too hot for my personal taste, but would not fault the restaurant for that.  Servers were anxious to please.  The biggest downer was the noise level.  When I mentioned it to our waiter he said that sometimes it's more relaxed and quiet (like when nobody is there?).  Some sound-absorbing materials would help to quiet the place down.  I don't want to have to yell across a tiny talbe for dinner or yell at the waitstaff to order.  I will see what the full menu and the atmosphere are like once they fully open."
    },
    {
        "id": 16,
        "text": "We went there yesterday.  The KFC was good but the spicy version was not spicy enough.  The chicken was crispy.  I think Soho has better KFC.\n\nWe tried the best of Philly's bulgogi burger,  it was nice and juicy but again needed more of that Korean flavor profile to come out with the kochuchang sauce or Kim chi on it to add some crunch to the burger.  The fries were weak and tasted like they were dehydrated and very dry on the outside.\n\nI would say the Butcher and Singer's burger  and Village Whiskey burgers are better.\n\nThe shrimp dumplings were excellent and had a nice miso glaze sauce to dip into on the plate.\n\nThe service was excellent since we went early but would go again.\n\nSouthgate,  please don't hold back on the Korean flavor profiles which make Korean food so delicious to eat to accommodate the Rittenhouse area."
    },
    {
        "id": 17,
        "text": "The KFC wings were very good- super crunchy and sticky sweet and hot. Great addition to the neighborhood."
    },
    {
        "id": 18,
        "text": "The new chef has made an awesome menu and flavor even better! I didn't think it was possible but I was proved wrong. I always love coming home to Southgate."
    },
    {
        "id": 19,
        "text": "Mom always says if you don't have anything nice to say don't say it. I loved the great waitstaff and the drinks were yummy - hence the five stars. But check the menu before you visit. It is not like other Korean or Korean inspired restaurants I've experienced in the Philadelphia, NYC  and  Baltimore area. In my experience, the side dishes (Banchan) accompany the bibimbap and other main courses and aren't usually a la carte.  There are usually several accompanying little delicious dishes plus kimchee with most entree choices. This is not like those restaurants and the prices and the a la carte sides were a surprise. I recommend going there to enjoy the drinks and wonderful  service the waitstaff provides. But in the Center City area, I recommend going to Washington Avenue, 10th Street, or Chinatown for a less expensive and more authentic Korean (U.S) dining experience. \n\nMy friend loved the burger option which was well seasoned, spicy and flavorful. He loves spicy food and was happy with his choice. Our waiter, the hostess, the bartender as well as the cooking staff were lovely, friendly and anticipated all of our needs."
    },
    {
        "id": 20,
        "text": "The menu is smaller than it appears. I felt like I almost had to order the wings and the bibimbap. \n\nAnd I did. And it was great. \n\nBut for some reason, not many venture far from those items. Or that's what it seems like, judging by the items coming out of the kitchen and the prior reviews. \n\nI would go if you are in the area, and if you have a need for twice fried wings and bibimbap in a stone pot."
    },
    {
        "id": 21,
        "text": "I came here with my friend after shopping in the Rittenhouse area. We got the Korean Fried Chicken, Tacos, and Burger. The tacos were the best, the burger next, and the Korean Fried Chicken was good but not amazing. I don't have much comments on the tacos and burger other than that they were good, tender meat, and very flavorful. I loved the gochujang-ketchup sauce given for the fries (included side to the burger). For the Korean Fried Chicken we tried both the spicy and soy; I love spicy food but think the soy had slightly more depth of flavor. We agreed that we actually slightly prefer the trashiness of BonChon Korean Fried Chicken (and their spicy wings are spicier!), so if you're a big fan of BonChon, I'm not certain you'd enjoy the KFC they have here--but try for yourself and see!\n\nIn the future, I think we would order just the Tacos and Burger between us, which would be a very reasonable price and leave us feeling comfortably full. Overall a really nice experience, appealing interior and attentive service, and I plan to return :)"
    },
    {
        "id": 22,
        "text": "Decor is classy and trendy. Staff is attentive and kind. Can't skip items on the small plate menu are the Korean fried chicken and the shrimp and pork dumplings. You will crave the fried chicken for weeks. The bibimbap rice bowls are flavorful and the portion size is generous. Haven't tried any of their large plates yet but I'm sure they are just as excellent!"
    },
    {
        "id": 23,
        "text": "I enjoyed my dinner at Southgate, but definitely felt like they skimped on the Korean flavor. Tried the KFC wings (both flavors), they had a delicious crunch but definitely not spicy. Same with the spicy fries. You can see they dusted it with something but the taste does not translate. The dolsot bibimbap was ok. Nothing particularly great to justify the $17 price tag. Service from the kitchen was very slow, long wait after our wings. The waiter and bartender were both great. And we enjoyed our cocktails, which were well crafted and delicious."
    },
    {
        "id": 24,
        "text": "Amazing food and good value for what you pay for. Very decent amount of food, I have leftovers for both of my two visits here. The dolsot bibimbap is really good. Perfect ambience for conversations, it's not too loud and the music is on point. Definitely will come back to try more dishes!"
    },
    {
        "id": 25,
        "text": "~Came here last Friday around 8ish with one other friend --we were both excited that finally a Korean place opened up in downtown Philly again. Food/drink selection wasn't as expected. Where's the pajeon and ddeokbokki?? No makgeolli either and the soju is muddled in a fancy cocktail priced at $12 (with that price I could buy 3 bottles of plain soju a few blocks down at Wine and Spirits!) I guess I was hoping too much that it would be a like Hongdae bar. The location of the bar should have been a dead give away that it would be catering to a different crowd and taste. Actually it's my fault for not reading articles regarding this place beforehand--they did say it was going to offer \"Korean inspired flavors\". Oh, so you are one of those places that add kimchi to food and call it Korean.\n\nI'd probably come back for the wings and sweet potato fritters on a late Sunday night when it's not so noisy. Defintely not going to have the bulgogi burger or spicy pulled pork sandwich again because they were just ehhh. Our bill was about $100 for two people.....geesus we could've gotten 4 large orders of chicken from BonChon or Soho *smacks forehead*........"
    },
    {
        "id": 26,
        "text": "I went to Southgate for dinner after hearing from friends to try them out.  It's kinda cramped space and the stairs to the bathroom is pretty steep.  Not a huge issue, really, unless you are handicapped.  \n\nI had the bulgogi burger for my dinner.  The burger was good, the fries on the other hand were soft and tasted like they were undercooked and from an oven.  I'll probably go back for the fried chicken, but the lame fries does make the experience a little bad."
    },
    {
        "id": 27,
        "text": "I have rated this 3 stars, but if Yelped allowed it, I would probably rate it 3.5 stars.\n\nCame here on a random Saturday at around 6pm, there was no wait and we were seated right away, however, about 30 minutes later there was a slight wait. Seating was a little tight, but that's probably due to the fact that it's a pretty small space. They also have seating outside but it was pretty warm that day.\n\nOnto the food, we ordered the coconut and cardamom infused soju, the  \"KFC\" wings, fried rice, the poke bowl (can't remember the name), the bibimbop, and the matcha fruit tart.\n\nI liked all the food, it was freshly made, however, it didn't wow me. The Soju tasted more like cardamom than coconut but it was pretty strong. The wings were good, but I think I'm one of those rare people who are not impressed with Korean fried chicken wings (don't hurt me, I like buffalo wings). My favorite part of the meal was the fried rice it had sausage, kimchi and all that good umami flavor. The poke bowl was just ok, the flavor was good, but it had very little fish. And my dinner partner had the bibimbop which I did not try but he enjoyed it. The matcha fruit tart was quite good and a nice detour from the usual fruit tarts.\n\nI would definitely return, but it's not a place that I crave."
    },
    {
        "id": 28,
        "text": "In terms of service the place was great, but the food was just meh. The wings weren't great, it  wasn't on the level of Soho's chicken or even bonchon a chain. The lamb buns were OK, I was really disappointed in the burger. I guess when it comes to a burger I'm more a purist. To me this burger was more like seared meatloaf with a Korean flare. I just wasn't a fan"
    },
    {
        "id": 29,
        "text": "Maybe it's because I am a frequent diner of Korean cuisine, but all this place seemed like to me was overpriced Korean fusion food in a \"hip\" setting. Honestly, if you don't eat Korean food EVER then this place will be AMAZING to you. The place is clean and sleek, the chicken wings are bomb, and bibimbap is not an item that is easily accessible in center city. But if you are like me and regularly eat Korean food, $2 per wing, $3 for fermented cabbage that usually comes free, and ~$15 for a bowl of rice and veggies in a stone bowl are just not worth it.\nOn the plus side, at least this place is helping Korean food become more mainstream."
    },
    {
        "id": 30,
        "text": "I only knew about Southgate from a video about their brunch menu and how they make delicious korean fusion dishes. Typically I'm hesitant when trying korean fusion dishes as I often feel like the flavors aren't handled properly when trying to americanize or change traditional korean foods (or maybe I'm just a korean food snob? or both??) but I must say... I loved my experience at Southgate this past weekend! \n\nI started brunch off with their kimchi blood mary, which was spicy! I was actually very happy with the spice level but also how they use kimchi to elevate the bloody mary. I didn't think it was too overwhelming which was what I was embracing for. I enjoyed the spicy house-made soju shot that it was paired with as well. It was like a nice little cool down break from the kimchi Bloody Mary :)\n\nMy friends and I decided to do tapas style for brunch so we could taste as many things as possible. Best idea ever! We started with the kimchi deviled eggs which were tasty. Again, I am pleased that they were able to subtly infused the kimchi within the dish, which wasn't overwhelming or overbearing by any means. But it also wasn't just adding kimchi on top of a traditional deviled egg. I believe they blended the kimchi and some sesame oil in the egg mixture which really just made the mixture smooth with a hint of sweet and spicy. They had four pieces so it's easy to share.\n\nFor our entrees, we ordered the kimchi poutine, short rib and korean fried chicken (KFC) and green tea waffles. It is hard for me to choose one clear favorite, mostly because I thoroughly enjoyed each dish. The kimchi poutine was delicious and I loved that the fries and cheese on the stone bowl continued to cook and get crispy even at our table. They don't have any gravy on this dish (like traditional poutine), but it works out very well. Very easy to share. The KFC and green tea waffles were a huge surprise to me. I wasn't expecting to enjoy the waffles that much, mostly because I wasn't too sure about green tea waffles... but it was very good! And paired with super crispy KFC was like icing on the cake. I wish the chicken was spicy though, that would have definitely put it over the top for me and been a favorite. Lastly, the short rib dish was good though it doesn't stick out as much as the other two. My friends really enjoyed the short rib itself, but I was under the impression it was suppose to be like galbi so that let me down a bit--still good but just not what I had been expecting. The short rib was placed in a huge bowl with rice, two eggs and jalapeños. The nice surprise was the sweet soy sauce at the bottom of the bowl, where the rice was soaking it up--it really brought the dish together.\n\nOverall, Southgate is a wonderful place to experiment with Korean fusion dishes. One of my friends had never had korean food before and really enjoyed our dining experience here. I like that they offer a variety of things outside what you'd expect. I will most definitely come back here for brunch the next time I'm in Center City! Especially for the spicy kimchi Bloody Mary :)"
    },
    {
        "id": 31,
        "text": "Great little spot, tasty happy hour menu, good tunes, nice beer list...enjoy! We stopped by for a Friday happy hour and it was pretty quiet. If you're looking for a place to catch ur breath after a long week this space t should do the trick."
    },
    {
        "id": 32,
        "text": "Fantastic! Sorry glad we were able to find a table right away! They made me a vegetarian bowl which was flavorful ! The drinks were delicious as well."
    },
    {
        "id": 33,
        "text": "Went for the soft opening at a time that eventually will be their happy hour. It wasn't up and running yet, but I assume that now that they have \"hard opened?\" that the happy hour is in full swing. We sat at the bar and I tasted most of the cocktails between what I ordered and what my ladies were having. Overall the cocktails were good, but I did feel like they were a little heavy on the ice since we went through them quicker than usual, but maybe we were just VERY thirsty. The bartender was lovely and attentive and happy to sell us more slightly overpriced drinks.\n\nWe tried the Korean fried chicken wings, which were delicious and way overshadowed the potato fritter/dumpling thing we also got. The vibe is clean and modern, but also dark and intimate. They fit seating in practically every square inch of the place, which is probably a good thing, since it was pretty crowded even at the soft opening. I LOVED the wallpaper in the bathrooms. The whole renovation is a far cry from old Tangier, but I have to say I do miss the headless camel in the window. I'll get over it I guess...and I'll be back for more Korean fried chicken wings."
    },
    {
        "id": 34,
        "text": "Great time! I loved eating the Asian fusion dinner. I had the hot pot, which is their most popular dish. I enjoyed it a lot and took home leftovers! You have to mix it (Which the staff will echo) since it comes as a layered sort of dish. We sat outside and were comfortable and our waiter came to check on us. There wasn't much outdoor lighting, which I was surprised about, so we're glad we didn't come later. The food came hot (obviously) and was a delicious traditional meal! Also, the bathrooms were pretty clean too. Unisex single-stall bathrooms. I will be coming back!"
    },
    {
        "id": 35,
        "text": "Regardless of what Craig LaBrian writes this is a excellent, fun restuarant with great imaginative food and a welcoming staff, and not noticeably noisy.  Definitely go and order the fried which is plenty spicy.  We might see you there as we will be back."
    },
    {
        "id": 36,
        "text": "Delicious food and drinks and cozy atmosphere. Our party of 2 came around 8:00 on a Friday night and were seated at the bar right away. Steamed buns were amazing, flavorful and the meat melted away as soon as I took a bite. The bibimbap was also delicious."
    },
    {
        "id": 37,
        "text": "The food here is pretty good. It is not quite 5 stars worthy, but everything is high quality and fresh and flavored well. The chicken wings and the dolsot bibimbap bowl were both delicious. It is a smaller place and has a very nice ambience. It seems like a great date spot. Prices are reasonable for what you get. I would definitely return here for some more Korean fusion"
    },
    {
        "id": 38,
        "text": "Not authentic Korean. I ordered the Hwe Dup Bap - Sashimi yesterday and it was a bit basic. The fish was not plentiful but tasted ok. Unfortunately my stomach started convulsing after 10-15 minutes of eating this. It got really messy and I passed out on the bathroom floor in cold sweat for an hour. This happened only one other time for Philly restaurants and that place (Pho-ladelphia) was closed for sanitary reasons. Not saying this place wasn't fresh but just sayin'... mighty Fishy! Two stars instead of one since I'm giving Southgate the benefit of the doubt but I have no doubt in my mind I suffered food poisoning."
    },
    {
        "id": 39,
        "text": "One of my favorite spots in the city! I think I've tried everything on the menu.\nDefinitely get the Korean Fried Chicken! Other favorites are the kale salad, BBQ beef tacos, fish and chips, bulgogi burger, and the chicken katsu. While you're there, make sure you grab a shot of soju and a pour of pumpking beer!"
    },
    {
        "id": 40,
        "text": "Came for brunch at this place! I was not disappointed. The food here is an amazing Korean fusion so be prepared for that. The restaurant itself is nestled on a street corner and has about 15 tables on the inside. They do take reservations so be sure to put one in if you want to get a table. The waiter was very nice and since it was a Jordan fusion restaurant he was able to explain and walk us through the menu. For my meal I went the Asian burger. The burger was great and it came with a spicey ketchup which was really good. My friends got the bibimbop which I was so jealous that I did not get. If you come here you must get the bibimbop! The food was cooked perfectly and the beef was juicy and spicey! Oh also be sure to get a few pitchers of sangria with your meal. The sangria was great and fruity!"
    },
    {
        "id": 41,
        "text": "Awesome fried chicken wings, great burger and really tasty bibimbap (with tofu). I give the food 4.5 stars but bumped the rating to 5 stars due to service."
    },
    {
        "id": 42,
        "text": "Quite good bibimbop dolsot. Maybe could be a little spicier. Liked the portion sizes. I've been twice - it gets really busy at peak times so visit during non peak times"
    },
    {
        "id": 43,
        "text": "Food was ok- fritters were VERY bland. Really no reason to be charging $12 for a cocktail in this setting. It's trying to be too many things. Service was cordial"
    },
    {
        "id": 44,
        "text": "Get the Korean fried chicken, spicy. Done.\n\nOkay, I'll also say that the bibimbap in the stone bowl is great. Good flavor and crisped rice: spot on! And the revamping of the shrimp-and-pork dumplings works well (my first experience with them underwhelmed, but the second had a better sauce pairing).\n\nSorry to say, I was disappointed by the bulgogi burger, which I tried for the first time the day SouthGate won Best Burger 2016, expecting to be blown away. It was practically raw in the middle, and though the flavor was good, it was subdued and didn't have the wow factor expected because of the title!\n\nLove the feel of the space. First visit was early evening on a Friday: had great service and nice timing with the kitchen. Second visit was late evening on a Wednesday, and the kitchen was dragging. Not sure why the difference.\n\nWill definitely return for the fried chicken and if someone else orders it, I'll give a second taste to the burger."
    },
    {
        "id": 45,
        "text": "we are very excited to have this restaurant on our block. 100% better than Tangier and a good option over La Baia on the other end of Lombard. i have enjoyed their food a lot and have seen some significant improvements from our first visit a moth or so ago. Our only issue is with their reservation / seating process. Twice we have made reservations and when we arrived we were only offered the table near the door even though many other tables were open. Last Saturday night same thing. We wanted a table away fro the door as it was chilly outside. We were told the other 4 top was reserved for a party of 6. No worries. So we eat dinner and the other table sat empty. Not until we were paying the bill did they seat a  table of 4 at that table. Not a 6 top...a 4 top.... So when the owners are peering out the window on a cold January night wondering where all there business is, I will be across Lombard Street peering out my window thinking how great it would be to have dinner at SouthGate...except I won't go because I know I will get the freezing table by the door. Please don't piss of the neighbors..."
    },
    {
        "id": 46,
        "text": "I would come back here, yeah. Our server was kind and personable, and I loved sitting outside on 18th street. The food was good, and there are happy hour specials to enjoy from 5-6:30. \n\nI would come back here, yeah, but I wouldn't order the hot stone bi bim bap (rice, veggies, a few strips of beef, $17) or a draft beer (10 oz of Grapefruit Sculpin IPA, $7) because I felt seriously ripped off. After tax and tip, that's $31 for BI BIM BAP AND A 10 OZ IPA.\n\nOof."
    },
    {
        "id": 47,
        "text": "I'm a huge fan of Southgate! This Korean fusion gastropub expertly mixes traditional Korean flavors in accessible American mediums. After going3 for happy hour, drinks, and dinner multiple times I decided to have my birthday here. The staff made it a wonderful night. Lisa and Juan at the bar are among the friendliest not to mention skilled bartenders out there whose signature drinks (especially the hot toddy) are delicious and beautifully presented. Our waitress, Lyndsie was very attentive and made us feel at home. \n\nWhile the drinks here are phenomenal, the real treat is the food. No trip to Southgate is complete without indulging in the Korean Fried Chicken, the double fried, crispy perfection topped off with either a soy garlic (my favorite) or spicy gochujang sauce. The chicken katsu is another favorite of mine. This tender, breaded chicken is topped with a Korean bbq type sauce served with a side of rice and a little cabbage salad. I love this dish for the variety of flavor and the portion is huge!\n\nI tried the bibimbap for the first time during my birthday dinner, choosing the hot stone pot option which I highly recommend!  While the presentation of this dish is marvelous, its encouraged that you mix it up before eating. The contents of your bowl continue to cook while you eat and the rice gets nice and crispy. The beef served with this dish was tender and flavorful and the spicy sauce was a perfect way to top it all off.\n\nOverall I recommend Southgate very highly. This is a great place to grab some drinks, snacks or a full meal. My mouth is watering just writing this."
    },
    {
        "id": 48,
        "text": "The wings are excellent!\n\nThe prices will kill you.\n\nThe wings are very Bonchon-esque and worth every penny, but other things on the menu are way overpriced for South St. They're charging Rittenhouse prices for upscale bar food. Like the tofu tacos - tofu and some mayonnaise for $12? The drinks are good, but they're nearly Franklin Mortgage prices for small, above average cocktails. \n\nDefinitely worth a try, but two apps and three drinks set us back almost $75 with tip, so it's just not a place we can really frequent. Definitely stop by for the wings though."
    },
    {
        "id": 49,
        "text": "We were so excited to try Southgate, and I'm glad we finally did! I'll admit I was a bit hesitant because I was very sad to see Tangier go. However, I had heard great things about Southgate so I decided to give it a whirl. We got the KFC wings as a starter, a mix of both flavors, and loved them! Highly recommended. As a main dish I had the burger - just voted Best of Philly - and while it wasn't the best I've ever had, it was pretty awesome. They have a good drink list, prices are relatively cheap and the service was good."
    },
    {
        "id": 50,
        "text": "I came here with misguided expectations, and that's not the restaurant's fault - everyone in here was happy and having a great time. The service was warm, kind, and attentive. I should have known when I walked in to The Black Keys and an extensive cocktail list I wasn't going to get the kind of food I wanted, and that's on me. Lol. But, sharing in case you're a Korean food fan!\n\nKorean is my favorite cuisine to go out and eat. I've yet to find any Korean food here in Philly that compares to the yummy little Korean spots in Cherry Hill. I was hoping Southgate would be my new sorta-pricey-but-worth-it Korean spot!\n\nI was disappointed to see no nengmyun, soon dubu, kimchi jigae, etc - just japchae and basic dolsots. \n\nI ordered japchae, my fella had a dolsot. For my pallette, it was by far the worst japchae I've ever had - the mushroom sauce was overpoweringly strong, the beef was little hunks of steak instead of shredded stew meat, there was so much oil in it I could hardly eat it. You can't go wrong with a dolsot of course and my partner enjoyed his meal. Their kimchi didn't rank for me, either."
    },
    {
        "id": 51,
        "text": "I came to SouthGate with my wife for restaurant week.  We were happy to see the restaurant was very busy and the menu looked very good with a wide variety of chicken, beef, and vegetarian dishes.  I also appreciated the large variety of local craft beers.  \n\nThe food was simply not very good.  We tried the fried pork dumplings and both had the chicken katsu.  The dumplings were a bit bland and the chicken was dry and stringy.  \n\nThe server was running but had a lot of tables.  There are a lot of options in the area and they were busy so maybe we caught them on a bad night."
    },
    {
        "id": 52,
        "text": "\"Southgate is a neighborhood gastropub elevating food and drink in our own unique way. Heavily influenced by both modern food culture and our Korean roots, we feature craft beer, wine, an impressive spirits list, and food that takes a creative direction through traditional Korean to classic American.\" Since reading that description over a year ago and bookmarking Southgate and also reading a ROTD by Nando F., I finally and much too long over due dined at Southgate.\n\nThe restaurant is located on the corer of 18th and Lombard and has both seating inside and outside. We chose to inside as it was only 6:00 PM and still warm outside. The inside is modern, cool and pleasant. It is a very comfortable space.\n\nMy dining companion on this night, who is also daughter, and myself ordered with three small plates. KFC - Korean Fried Chicken, Short Rib Steamed Buns and Pan Roasted Octopus. The steamed buns were the first to appear and these were soft and fresh and had some heat. They were much different then the Chinese style ones we were used to and came with a spicy dipping sauce. The octopus was very tender and had great flavors. It came with a Kimchi style sauce and baby corn. The KFC was excellent. The chicken was crispy, moist and flavorful and we preferred the spicy Gochujang sauce over the soy garlic.\n\nSouthgate also has a decent beer list on tap and in bottles. We were fairly full with the three small plates and we passed on dessert. I am looking forward to returning to Southgate to try Korean Steak Tacos and the Bulgogi burger. I really liked the concept and I hope that Southgate will continue to do well."
    },
    {
        "id": 53,
        "text": "Over the moon! This is not only one of the best meals I've had in Philadelphia in the last year, but it's become my favorite restaurant to bring guests to. The new menu is inspired and brings new meaning to Korean fusion. I live over 20 minutes away and I still make the trek as often as possible."
    },
    {
        "id": 54,
        "text": "Excellent korean fusion gastropub. KFC was on point. Bibimbap was really good as well as their kimchi burger. Inside is pretty chic but casual."
    },
    {
        "id": 55,
        "text": "I really wanted to like this place, but ended up walking a bit disappointed. Seating didn't take very long depending on when you arrive but the portions were slightly small for the hefty price. \n\nI grabbed the KFC which was $12 for 6. The chicken was very crunchy and more importantly, the chicken was juicy. Additionally, the sauce was sweet and not overpowering. Also grabbed a Dolsot Bibimbap (Hot Stone Pot) which was very well presented. There were a lot of vegetables and the dish stayed hot but my biggest complaint was that there was barely any flavor in the beef or from the gochujang, which was very disappointing. We also got a bulgogi burger to split. It was defiantly a interesting dish as a fusion dish. Maybe I'm more used to bulgogi with rice, but it was definitely a unique taste with how sweet the bulgogi burger was. \n\nThe place wasn't too loud and had a TV which had a game on. There is a nice outdoor seating area for the spring/summer. Overall, it was a pleasant experience. The service was good and the food was more often good. I'll be returning to try some of their other menu items."
    },
    {
        "id": 56,
        "text": "Review for drinks only. Decent beer list and attentive bartender. Need to come back and try the burger I am told it is amazing. Beware though, the stairs down to the restrooms are super steep."
    },
    {
        "id": 57,
        "text": "Not bad, but ultimately, this place veers toward watered down Korean than interesting Korean fusion.\n\nThe Koreancini and dumplings were off the mark in terms of marrying western and Korean flavors -- I don't get what's so \"Korean\" about a corn-filled arancini with tomato sauce and the eggplant puree does not add to the dumplings. You can certainly get better Korean fried chicken. The Korean pickle in the bulgogi burger was a nice touch, but overall not mind blowing. Finished the meal with the misugaru cake with lemon cream and persimmon...and apparently the people here do not know what a ripe persimmon tastes like.\n\nThe highlight here was definitely the cocktail -- the P&P is a great rye whiskey drink that balances the bite and the sweet well. \n\nIf you have risk-averse diners, then this place would probably be a nice introduction to Korean flavors in a posh setting. But if you're a Korean food veteran, then look elsewhere to satisfy your cravings."
    },
    {
        "id": 58,
        "text": "I am really happy about this addition to our neighborhood - Southgate has a cute, intimate feel with a unique menu. I came here on a Friday night with my boyfriends and was able to sit outside without a wait. To drink, I had the white sangria; a bit too sweet for my taste but good nonetheless. I probably wouldn't get it again because it wasn't cheap ($9). For an appetizer, we ordered the dumplings, which were delicious! The beef on the inside was so flavorful, I could have eaten 50 of them. There are five dumplings, so you can split them with another person as a small appetizer. For an entree, my boyfriend ordered the pulled pork sandwich. He wasn't crazy about the sandwich but we both loved his spicy fries. Very interesting addition. I got the bibimbap with beef. I loved it! My only qualm was that it came out cold. I asked for it to be heated up and they were happy to oblige, but it still came out lukewarm after that. I might try it in the stone pot next time. Otherwise, it was really flavorful with just a little kick which I loved. The service was also really good - our waitress was very attentive, friendly, and polite. I will say it is a little pricey, but not any more so than comparable restaurants in the area. Overall, I really enjoyed this place and will definitely be coming back!"
    },
    {
        "id": 59,
        "text": "Great brunch place. A lot of Rittenhouse places are overrated but I like this restaurant a lot. It's kid friendly, has an interesting menu that appeals to different palates, and they have a legit full bar. They have fun beer options and their cocktails are strong. \n\nEvery time I've been, the staff has been really nice. \n\nAs for the food: everything I've tried has been really good. The green tea waffle with the Korean fried chicken are delish. Bibimbap is my go-to. The Korean tacos and the bulgogi burger are also fantastic. If you're a little more adventurous: try the kimchi poutine. It actually works!\n\nCan't wait to go back."
    },
    {
        "id": 60,
        "text": "Visited philly from NYC to get away from the hot August city and eat some new things, wander in some new neighborhoods.  Southgate was on the list for a Saturday night dinner and drinks date for two of us and did not disappoint. The menu is curated and thoughtful - dishes range from accessible to more adventurous and all are delicious.  Wish we had a neighborhood place like this near us back home.\n\nAppetizers:\n\nKoreancini - fried rice balls with sweet corn and a fresh roasted tomato dipping sauce\n\nThe special pork buns with honey dipping sauce - soft pillowy buns and slow roasted pork with honey dipping sauce on the side (so filling!)\n\nChicken wings - sweet, salty, covered in sauce and messy gooey deliciousness (huge portion!)\n\nEntrees:\nTuna hwe dup bap - I had never had this before and it was refreshing, light and a delightful mix of crunchy light vegetable flavored, fresh tuna, sesame oil, rice and a bit of spicy sauce. Yum.\n\nBulgogi burger - whoa. Rich, buttery bun and perfectly toasted bread, umami salty sweet marinated patty, cucumber pickles and a huge heap of fries. Wow. \n\nDessert:\nThe little flour shortcakes with fresh cream and fresh strawberries and blueberries. We were so stuffed by this point but took this down as well.\n\nDrinks:\nWe had an amazing local vanilla ale (so refreshing), a beautiful porter, the old boy cocktail (yum!! spirit forward but still tempered by citrus), the p&p, and the Korumbian which had a lovely anise flavor and was not too sweet.\n\nWaters were always filled, service was attentive but not too much so and really really nice, atmosphere was hoppin on a Saturday night but not was not a pretentious crowd. Was a great neighborhood spot and perfectly chill vibe. Plus the chef was owning the kitchen with the open kitchen thing going on - always awesome to see.\n\nObviously by the end of the night, we had to slowly ROLL out of there we were so full. \n\nCan't wait to go back!"
    },
    {
        "id": 61,
        "text": "Really yummy food!  I thought the small plates were the highlight-- the fried chicken (super crispy and both the soy and the hot sauces were tasty), the pork belly wrap, fried octopus.  \n\nThe banchan were all delicious and had really authentic flavors, which I was impressed with, since it is Korean fusion and Korean fusion restaurants often water down the Korean-ness too much.  Everyone enjoyed, and 3/4 of us there were Korean, so that says a lot"
    },
    {
        "id": 62,
        "text": "Nice spot first time here since they became SOUTHGATE cute small place for girls night or even a date loved their rice bowl but sampan is much better lol"
    },
    {
        "id": 63,
        "text": "I haven't tried much Korean food, so I went a little conservative for my brunch choice and got the katsu burger....it was honestly the BEST burger I've ever had. I usually don't even like onions on my burger but all the flavors balanced each other so well I left them on. The Kimchi Bloody Mary was also different but delicious-with a sidecar of Korean rice liquor (Soju?) to enhance the spiciness to your liking. I'm so excited to come back here to try their dinner."
    },
    {
        "id": 64,
        "text": "I can't ding them for their clientele, even though there seem to be an awful lot of loud and insipid people packed inside...it's like a slightly improved version of the \"Founding Fathers\" crowd, which is a slightly improved version of the \"Howl at the Moon\" crowd, which is a slightly improved version of tree sloths, perhaps.\n\nBut back to the food, which is what matters. The place is reasonably priced and the food is great--Korean comfort food. It's not good for you, but if you want that, go to a real Korean place and get something full of veggies. \n\nAt Southgate, get the quintuply fried wings (KFC) that are truly terrific in Korean hot sauce (gochujang). Pass on the pork belly buns--they are ok but nothing to Yelp© about. The autumn salad was very nice, too.\n\nKorean tacos look like they're going to be a problem with the meat smothered in what appears to be a cream sauce of some sort, but actually the sauce is quite light and the tacos are terrific. For me the star was the Bulgogi burger, which I'm still thinking of weeks later... Not the right cuisine descriptor, but it's the most \"umami\" thing you'll ever eat. Spiced like bulgogi with the real deal trimmings and a great soft bun. Really fantastic and highly recommended. \n\nGo here and don't look back and enjoy. A fun and inventive restaurant with great food and service--enough that you can ignore everyone else and have a good and unhealthy meal with a friend."
    },
    {
        "id": 65,
        "text": "After two check ins, Yelp is asking me, what keeps you coming back? \n\nMy answer: THE WINGS! \n\nHonestly, I think they're the best wings I've had in Philly, so crunchy on the outside and so juicy on the inside. They're somewhat pricey ($12 for 7 wings) but the wings are huge and meaty, so I usually only need 4-5 wings paired with some beer for a full meal. I loved both their flavors, but I'm slightly partial towards the soy garlic. Other items on the menu include a variety of Asian fusion dishes, but they seemed mediocre at best in my opinion. However, the service is excellent and meticulous (they gave us little wet wipes because the wings can be messy on the fingers) and the ambiance is upbeat and modern. Also, I tried one of their specialty cocktails, which was delicious, and I'd love to try more of them! As such, I'd definitely come back regularly for the wings and the drinks. \n\nAnd so, yes Yelp - \"Yay! I'm a fan\""
    },
    {
        "id": 66,
        "text": "I and two other guests ate at Southgate on Sunday, 1/7/18.  When we arrived at the restaurant at 6 p.m. for our reservation, I asked for a table as far away from the table as possible, as it was bitterly cold outside.  There was only one other table of four in the restaurant at the time.  The hostess said that she had set up the table closest to the door for us (which only involved pushing two tables together), and even though the restaurant was otherwise empty excepting the one table, she insisted that we could take the table closest to the door or sit at the common table in the back.  So we sat at the common table.  We were there for a couple of hours and many of the other tables were empty much of the time we were there.  I give the hostess a HUGE thumbs down!  However, I must say that this was our second time eating at Southgate and we were otherwise very happy with both the food and the service.  The food was delicious and the waiter was pleasant and attentive.  I would just suggest some customer service training for the hostess to improve the overall experience."
    },
    {
        "id": 67,
        "text": "My girlfriend and I stopped by for dinner during a soft-open on a Saturday, and it was delicious.  The atmosphere is fun with great decor and quick service.  It did seem quite loud inside, but nothing too crazy.  \n\nThe food is delicious, and they have everything from bibimbop to a Korean burger.  We tried the bibimbop and their BBQ tacos, and both were very tasty.  The prices seemed a bit disproportionate between the two, and we were hoping the tacos might come with a side dish like fries or something - but both were delicious, so this wasn't too big of an issue.  They have a solid draught beer list at pretty standard Center City prices, and their cocktail list looks good.  \n\nOf course it's still too early to come to any firm reviews of Southgate, so I'll definitely modify my review once they've officially opened - as this will almost certainly become one of our go-to places for great food and interesting drinks."
    },
    {
        "id": 68,
        "text": "I am glad we finally got around to going here. We started with the octopus app, which was absolutely phenomenal. I got the monkfish entree- was sweet and spicy. i tend to be a picky eater in terms of being really concerned about eating clean and heathy.  i left there with a full stomach, but still felt light and good. the food was flavorful without being heavy and there were some great menu options for health nuts. service was friendly and efficient."
    },
    {
        "id": 69,
        "text": "We came to this place looking for some nice sizzling bibimbap. Ordered the korean fried chicken in both, spicy and garlic, tofu bibimbap and lamb buns. Everything was amazing. The bibimbap came in a sizzling plate and had an array of flavors. I was scrapping the stone bowl for stuck bits in the end. Korean fried chicken, per my mother in law, were the best chicken wings she had during her stay. Spicy ones were much better than garlic. Lamb buns were like bao buns but were equally delicious.\n\nDrinks were great. We ordered a pitcher of sangria which was perfect in the July heat. Our server was very attentive and got us soju tasters when we weren't sure what to order. I will definitely come back."
    },
    {
        "id": 70,
        "text": "I love this place. I usually get the beef dolsot bibimbap, and enough of the appetizers so that I have to roll out the door.  The octopus, in its current iteration is especially good. Check out the skirt steak- it's excellent and has real deal korean flavors.  Yes, it's fusion, and not 100% korean, but it's fusion done well, and it's getting better every time I go back, which according to yelp is 15 times as of today."
    },
    {
        "id": 71,
        "text": "Was on my way to Pub and Kitchen without much of a plan when I happened to stop in for the Sunday night happy hour. Overall - solid beer options and tasty food. To start I had the Korean Fried Chicken as and addition to my meal which was a nice option at just three pieces. The wings were big, meaty and juicy with a good crisp. I thought the spicy sauce was also well done. Followed up the wings with the bulgogi burger - very tasty and well seasoned, my medium rare came out somewhat undercooked but hey better under than over right? Definitely a solid choice if you're in the area."
    },
    {
        "id": 72,
        "text": "I've been to Southgate multiple times now, and this is the lowdown: \n\n* Cocktails are interesting, bartender (Lisa) is VERY knowledgeable\n* Happy hour prices are great ($6 house wines)\n* Atmosphere is both minimalistic and cozy\n* Menu just changed to include more foods that aren't deep fried (thank the lord!) - I haven't tried any of the new dishes, but both the snapper and pork dishes sound amazing!\n* Large plates/entrees hover under $18-20, very reasonable\n[* I wasn't a huge fan of the bibimbap, needed more flavor - when I took it home sriracha helped, but that doesn't say much for the dish.]\n\nBut really the ONLY THING you need to know is: \n\n* The KFC (Korean Fried Chicken) are the best wings in the city. They are crave-able. We have dreamt about them, they are that good - perfect combination of shatteringly crisp skin & sticky, sweet, spicy sauce (both options are good) & moist chicken. Yum. I want them NOW. \n\nPrices are VERY reasonable: two glasses of wine and a plate of wings (we took 3 home) during happy hour ran us $24 last week!"
    },
    {
        "id": 73,
        "text": "Wanted to love the place really. But the menu is very limited and the offerings, while totally edible,  just a little off the mark. A little heavy-handed on the sauces and salt.  I'm going to give it another try and hoping it will be better."
    },
    {
        "id": 74,
        "text": "Hip corner spot perfect for sitting outside and enjoying some grub on a cool, not too breezy night. The service was great and though the menu is a bit pricey, the food is very solid. Especially with the rice bowls, they have a great balance of super fresh ingredients, which make them colorful and vibrant. \n\nI chose the sizzling one, the dolsot bibimbap, and it was plenty filling. I haven't had Korean food at many places so I don't really have too many comparisons, but I very much enjoyed it. I do wish it came with some more sauce just to bring it all together a bit more, and also because I enjoyed the sauce so much, but other than that, I can't really complain."
    },
    {
        "id": 75,
        "text": "OH MY GOODNESS!  This place is FANTASTIC!  The restaurant is small and cozy but trendy all at the same time.  Even though the space is small, it isn't overly crowded, so you feel like you have space, even if at a small table.\n\nI came with a friend and we wanted to try a bunch of things, so we narrowed it down to 4 items and shared.  \n\nWe had the Korean Fried Chicken in Spicy Sauce.  These were awesome!  Perfectly juicy, crispy and the perfect amount of flavor and spice! he wings are pretty large too.  Make sure you order these when you come here!!\n\nWe also had the beet salad (a nice light item considering everything else was much heavier)\nI LOVE beets, and these were so yummy!  I loved that all of the various aspects of this dish added so much flavor and dimension to the beets!  My friend couldn't have the bacon that came with it (she doesn't eat pork) and they were really awesome about putting it on the side so we could both enjoy the dish!\n\nBimbimbap-  We went with the Dolsot Bimbimbap option and OH MY!  SO YUMMY!!!!!!  This was so perfect because it was cold and rainy the night we came here and this HIT THE SPOT!  Utter perfection.  We got it with tofu and our server recommended the sizzling option because the rice gets crispy and the texture melds really nicely with the other veggies, he was so right!!!  I am so happy we went with his recommendation! As Natalie K. said in her review, (she is the friend I was with) we were told that the crunch of the rice you get with this dish is incomparable, and it is so true.  It tied the whole thing together.  I could not get enough!!! I am honestly salivating just thinking about it.  I also look forward to trying the other styles, but I would absolutely get this again!\n\nBulgogi Burger -After being told that this was voted the best burger in Philly, we had o try it.  SO Good! it is definitely one of the best burgers I have had in the city.  each item on this burger (marinated beef, green leaf lettuce, scallion salad, ssamjang mayo, homemade pickles, sesame bun), truly complimented each other for the perfect Korean style burger experience.\n\nThere are more items on this menu that I am itching to try, I will update as soon as I can get back here and eat my way through the menu again!  We wanted dessert, but were so full, we couldn't do it, so...I guess we are heading back soon for more! \n\nService was fantastic!  Our server was super helpful, enthusiastic, and friendly.  \n\nMake sure you come here if you are in the are/have the chance to check it out. I cannot wait to come back! I can certainly say that I have found a new favorite place to go in Philly!"
    },
    {
        "id": 76,
        "text": "Best service in town. These folks go out of their way to be hospitable and it's genuine. Wish the menu had a few more options, but what they do, they do well (although I wouldn't recommend the octopus rice bowl - undercooked and no veggies). Can't wait to try brunch and the house made scotch bonnet soju Bloody Mary."
    },
    {
        "id": 77,
        "text": "Great place. Make sure if you get bibimbap, you get the dolcat (sizzling stone bowl)."
    },
    {
        "id": 78,
        "text": "We went here for dinner on Saturday night and I can't stop thinking about the bibimbap! It was amazing! I got the tofu bibimbap in the stone bowl - so delicious!"
    },
    {
        "id": 79,
        "text": "Sat outside with my date and we brought his dogs!  It was delicious.  I really liked the cocktails (we tried 4 and shared) and the pork buns.  The hot pot and hwe du bap were also delicious."
    },
    {
        "id": 80,
        "text": "Where the old Tangier was not successful, southgate delivers with its relaxed vibe in tight quarters. P&P cocktails were singular with its sour plumminess, i will crave this on a hot summer night. \nThe small plates of KFC soy, beet salad, & daily banchan were taste-bud challenging, lip-smacking, & finger licking good!  the lamb dumplings, although not my favorite, had a shy sweetness - cinnamon?clove? cardamom?  i found the dipping sauce too salty & lacking depth. \nwe made lots of good appreciative noises.  \na very fine ending to a day"
    },
    {
        "id": 81,
        "text": "Finally got to try my most anticipated summer opening of this year!!! Here's everything you need to know! \n\nService: For me, I tend to value service a lot when I eat out especially because I can for the most part cook the food I like to eat, service makes the experience from great to amazing if done right.  At Southgate, the service was great.  The hostesses were very accommodating and helpful, as this was my first time eating there, they were very helpful explaining that they do take reservations, what their hours were so far, and when they planned to launch the full menu.  With a group of about 10 people, I knew we were going to be a bit of a hassle to seat, but they did an amazing job of having us feel welcome and even sat us at one table and then moved us to the chef's table after it had opened up.  The waiter, which we had actually recognized from elsewhere was super attentive and helpful as well, he seemed to have that balance of not being pushy when it came to ordering and moving service along to being completely absent when we needed to request things.  The other owner guy (having recognized him from the philly.com article) also gave us an extra dessert which was a nice surprise after apologizing for long wait times (which for us we didn't even have to wait that long!) and that attention to small details let's me know they care about their business\n\nDrinks: I. Love. These. Drinks.  From the various cocktails I had gotten to sample from different friends there wasn't a single one I wouldn't order again for myself, and some of them had alcohols I didn't even like.\n\nFood: For dinner I got to try the wings, koreancini balls, pulled pork sandwich and the shortcake dessert.  First off, the wings are probably the best I've had in philly so far, the only thing that would prohibit me from ordering more is the price.  The koreancini balls to me were probably the most disappointing thing I ordered all night.  We had ordered on plate to split amongst our table, and the ball that I ended up with came to me unseasoned and bland, it tasted like fried fluff and by the time I got to my plate, there was no dipping sauce left on my plate because I ate with savages and the late bird gets nothing at that table.  My pulled pork sandwich came and I thought it was great, my only mistake was probably letting it sit while I waited for the rest of my table to get their orders.  In that time I guess the juices of the pork and slaw soaked into the bottom of the bun a bit, making me wish that that bun was toasted on a flat top for a bit +/- a tiny bit of butter.  I also REALLY LOVED THE FRIES. I could eat buckets of that stuff.  My only wish was that it had some sauce to dip it in, because naturally fries are the perfect vessels for sauce delivery and it felt weird not having any.  So, we asked the server and he offered us some of the sriracha ketchup that came on other things, and it was AMAZING!  Ideally if there was a combo meal where I could get wings and a plate of fries and a beer for ~$12-15, I'd be back at least once a week if not more.  Finally the dessert was a very fresh and clean finish.  I don't particularly care for the super sweet desserts of this world, and this was the perfect balance for me where it was just sweet enough for me to want more.\n\nOverall for a soft opening this was a strong showing.  Service is right where it should be and I'm sure most of the food kinks will be worked out over time.  And I can definitely see this place becoming a local watering hole soon!  I'll be back."
    },
    {
        "id": 82,
        "text": "We had dinner here recently and thoroughly enjoyed the meal and the service. We had the KFC appetizer with both sauces. Very tasty. The wings were super crispy and not at all greasy. The soy/garlic and spicy sauces were delicious. We both ordered clay pot rice dishes- one beef and one tofu, with a side of kimchi. The kitchen does not skimp on ingredients - these dishes were chock full of assorted vegetables, protein and fried egg on top. They came to the table sizzling. Washed them down with cold beers on tap- delicious meal on  a cold night.\nWe will be back."
    },
    {
        "id": 83,
        "text": "Have a real love hate relationship with this place. \n\nLove: the food is amazing - everything tastes fresh and delicious. The service - fast, helpful, and courteous. The happy hour - awesome, the city wide is one of the best in the city\n\nThe no like - maybe I'm bias because I've spent so much time in Koreatown in manhattan - but I miss the free Banchan with all the fixings.\n\nBibimbab - does anyone actually eat this stuff without the hot pot. Just serve the hot pot and save me the couple dollar surcharge. Also extra for the beef. A 12 dollar bowl turns into a 17 dollar bowl. Portions on the light side - hot pot is huge but barely even 3/4 full. Don't expect leftovers.\n\nOverall I love this place but I would extra love it if I left with some leftovers."
    },
    {
        "id": 84,
        "text": "I have been to Southgate a few times, and each time have enjoyed delicious food and good service. The Korean Fried Chicken is really awesome, as well as the bibimbap. Always a really good meal here!"
    },
    {
        "id": 85,
        "text": "We ate at Southgate last evening. It was a beautiful night and we were able to sit outside. I'm giving 4 stars because we only had 4 dishes and I'll wait on a 5-star review until we've tasted more.\n\nTo start, we ordered the mandoo (panfried beef dumplings) and the sweet potato fritters. Both were served piping hot and were delicious, crispy and accompanied by nice sauces that complemented the dishes. We split the beef bibimbap (a bowl of rice, vegetables and seared beef strips) which we paid extra to have delivered in a hot bowl. It arrived sizzlingly hot and stayed that way in the cool evening breeze for the entire time we took to eat it. The beef was flavorful and the dish was nicely balanced. The fried egg on top was a lovely touch.\n\nWe also split dessert, which was butterscotch pot de creme topped with chunks of English toffee. I make pot de creme at home often, and we have had many iterations at various restaurants, so we are familiar with what very good quality pot de creme is. This was one of the best we've ever had. The butterscotch custard was richly flavored, perfectly smooth, and pleasantly dense. The shards of English toffee on top were the absolute perfect complement to this delicious baked custard.\n\nWe left the restaurant completely satisfied, maybe a wee bit too full, but glad that we had eaten there. Oh, and grateful that we had to ride our bikes a mile or so home to work off at least a little of the meal.\n\n3 draft beers, 2 appetizers, 1 entree, 1 dessert: $50 + tip\n\nWe will return to this restaurant."
    },
    {
        "id": 86,
        "text": "Went around 7 on a Saturday night. It was an hour wait to sit inside, so we ate at the bar. The bartender that waited on us (wish I could remember his name), was terrific and super friendly. The decor is simple, but really appealing.\n\nWe ordered the Korean fried chicken wings and the Koreancini to start. Both were amazing. The wings were crispy and really tasty (we went with the spicy version). The Koreancini was the real star -- warm, crisp, and delicious.\n\nWe also got the Korean BBQ Beef Tacos. They were good, but not great. For a \"large plate,\" it was a pretty small dish. Only three small tacos. But the beef was cooked well and had a nice sauce on it. \n\nOverall, it was a great time.  Looking forward to returning!"
    },
    {
        "id": 87,
        "text": "Their wings have to be my favorite in the whole city. The beef tacos and the bibimbap were also fantastic. The only downfall was the punch which was made with WAY too much selzter. It was a bummer paying for a pricey drink that not only didn't taste good, but had almost no alcohol. I'd recommend trying their other drinks instead."
    },
    {
        "id": 88,
        "text": "My wife and I have never left here disappointed. It's our favorite \"go to\"... Not only in the neighborhood but in the whole city. Great atmosphere, incredible food! Kimchi is delicious and the fried chicken and hot pot are always a hit."
    },
    {
        "id": 89,
        "text": "I'd give this place a 2.5 really (Why hasn't Yelp made this possible yet?!!).  The service was friendly and the drink list was nice.  However, the food was a bit underwhelming.  \n\nWe got the wings, dumplings, and aricini to start.  Then I got the tuna rice bowl, or hwe dup bap.  Nothing was terrible, but overall it wasn't memorable. I also thought the portion on the rice bowl was a bit small.  To be fair though, I eat a lot.  It was like the kind of food you could get at any small hole in the wall take out spot but with a heftier price tag.  No real culinary feat here.  \n\nI did like the look of the place.  It's a cozy spot that looks good for the neighborhood.  Since I don't live in the neighborhood, I don't see myself back there anytime soon though."
    },
    {
        "id": 90,
        "text": "The food was delicious and people were nice. Although we had a reservation we could not get the table and had to wait for more than 45 minutes. But they offered some appetizers and drinks while we were waiting. Nice place, great ambience."
    },
    {
        "id": 91,
        "text": "Had a fantastic meal for two here.  We sat at the bar (best seats in the house!) and had awesome cocktails, split the short rib buns and the peppery, delicious japchae.  Everything was great, intimate ambiance, attentive and talented bartenders.  Still dreaming about that beef japchae!!"
    },
    {
        "id": 92,
        "text": "The service was excellent.  However, the food was very mediocre.  Perhaps it is because I am an avid fan of Korean food, but this place did not do it for me.  Not from an authenticity perspective, I understand it is modern Korean or Korean fusion, but from a flavor perspective.  We got the KFC, steamed buns and beef tacos.  KFC wasn't bad.  Decent flavoring.  Steamed buns were pretty bad.  No flavor at all.  The honey dipping sauce was an interesting complement, but it didn't really enhance the lack of flavor in the bun.  And the beef taco was just an average taco.  Nothing exciting.  Overall, an average dining experience due to the food."
    },
    {
        "id": 93,
        "text": "Great happy hour! I had the KFC wings (spicy & soy garlic), fries, spicy pickles, and white sangria. Everything was great, especially the pickles, and service was friendly and attentive. It helped that a super cute puppy was at the next (outside) table. Would definitely return!"
    },
    {
        "id": 94,
        "text": "A nice place to go with friends to drink and have food. The staff is very friendly and helpful. I love the soju mixed drinks- very tasty. I ordered the fried wings which were no where near bonchon level but still solid. The bibimbap was also solid not the absolutely best I've had. Definitely make reservations if you can as the restaurant isn't super large and gets crowded easily."
    },
    {
        "id": 95,
        "text": "Late night stop (10ish) - it was deserted on a sat night? I liked the food, and the specially cocktail (a version of a Caipirinha) was well made and strong.  Looks like a cool venue, but the lack of patrons made it less the desirous for a saturday night stop. I don't hang in the neighborhood much, so perhaps my timing was simply off. This could easily been a 4-star review if the social vibe was better."
    },
    {
        "id": 96,
        "text": "SouthGate is one of the few Korean Asian fusion spots in Philly but definitely a growing trend. Maybe it was because of the Restaurant week menu or their adjustment to American cuisines but there were parts that were definitely a hit or miss.\nThere was nothing to complain about with the decor and service, the place was happening on a Friday night. The food though is a hit or miss.\nThe Korean Fried Chicken we got both spicy and non-spicy. Those were probably the biggest KFC wings I've ever had and the taste wasn't bad but why is the crust on it so thick? It was like eating Kentucky fried chicken crust with Korean sauce. It was unfortunately because the chicken and sauce was pretty good.\nAlso the sides of kimchi and daikon, the daikon was too sweet and too largely cut, but everything was okay. \nI ordered the bulgogi burger, which the fries weren't any special and that gochujang sauce is bleh I had to order a side of ketchup. Gochujang unsweet as dipping is a terrible idea for fries! \n\nAnyway you may be think I hated the food at this point. On the contrary the bulgogi burger was actually really good! I can't help but wonder why nobody has ever thought of such a thing so props.\nLastly the matcha creme brûlée was the creme de la creme, it was absolutely amazing! I wish we could've just ate a larger bowl of that and a bibimbap and i would've been more than happy. Unfortunately It's a toss up of giving it another shot or not, maybe just one more bite of that matcha creme brulee!"
    },
    {
        "id": 97,
        "text": "Craving Asian fusion, and after being disappointed that I couldn't get reservations at either Doubleknot and Sampan, I decided to give Southgate a try.  Initially, our party of six was going to be seated outside, but luckily someone canceled and we were able to sit inside. \n\nI would highly recommend going family style, so that everyone can try everything.  We ordered a large round of apps, and then people were pretty much too full for mains. \n\nHighlights include: Korean fried chicken (perfect ratio of breading to chicken); short rib ho-ppang (braised beef was delicious); Kimchi pajeon (great flavor.  The pork comes up top, so for vegetarians you can take it out or have it on the side); fried octopus. \n\nProbably wouldn't order the pork belly ssam (was expecting it to be braised, but instead it was fried) again, and while the yakult soju satisfied the yakult craving, I would have liked either more yakult or more soju (and less Sprite)"
    },
    {
        "id": 98,
        "text": "All I want are Southgate KFC wings and beef tacos. If I am sad, they make me happy. If I'm happy, they make me overjoyed. I take houseguests here, which I think is high praise. I love the katsu sauce. I love the fries. I love the bar (the stools are short, so as a short girl, I don't feel like I'm on a highchair). I love that they have Nonino Amaro. But more than anything, I love the wings and tacos. I could never imagine saying those words because I find wings stupid and tacos are only eaten in the privacy of my own home. But here I am, craving wings and tacos. I don't usually recommend specific dishes because only you know what you like. But get a half and half order of the wings. Well, that settles it. Southgate for dinner tonight!!"
    },
    {
        "id": 99,
        "text": "I will be the first to admit I don't know much about Korean food, but I'd like to think I know something about GOOD food, and this is it!\n\nWe waited a month to check South Gate out because, invariably, a brand new place has kinks to work out, so I'd rather wait until they are. With that in mind, if they had any kinks to begin with, they've been dealt with. From decor to ambiance to service to menu selection to quality of food and beauty in its plating, I think South Gate pretty much nailed it.\n\nWe arrived before any other diners, (because that's what you do when you have a baby with you!) and were seated with high chair and sippy cup of water for baby. The place is beautiful. Sleek yet inviting decor. Fresh flowers. \n\nUnusually for me, I wasn't super hungry but we wanted to try a bunch of things.\n\nWe wet our whistles with a few beers. I got a delicious and heady vanilla porter. I think my husband got a sour ale...Not sure, but we were both happy. These were big pours for the price. If you're one who likes to dine at the bar, this one is aesthetically pleasing and well stocked.\n\nFor apps, Koreancini rice balls and sweet potato fritters. Both fried, neither greasy, but instead light, crispy and delicious. The Koreancini was accompanied by a mild but flavorful roasted cherry tomato dipping sauce. The fritters were complemented by a tangy chili sauce. \n\nFor entrees,my hubby got the wings (even though it's a starter, it is a LARGE portion), as they are always his favorite, and consequently, what he's most critical about. I asked how they were. \"Great\" he said, through a full mouth which loosely translates into, \"These are really effing good.\" I didn't try them, but I would take his word for it.\n\nWe tried both the beef and tuna rice bowls. The tuna hwe dup bap was fresh, crispy, not too salty with just enough asian flair to compete with the best tuna tartare I've had.\n\n The beef bibimbap? Well, if I'm being truthful without reservation, this was the best dish of anything I've had in a long time. I could eat this every day for the rest of my life and want for nothing more. Honestly. I plan to return here at least once a week (ok, maybe just once a month) just for this dish. I didn't get the hot bowl because my long-armed baby may have burned herself. But the beautiful fried egg atop a mountain of fresh, lightly cooked vegetables and perfectly seasoned and tender beef, sticky rice, sauce....oh my god... The best.\n\nAt the end of that I can't believe I challenged my stomach to take in more, but I managed to scarf down half the shortcake dessert. Now, fruit in my dessert is not typically my thing, but this offered a fresh approach to an old standby. From what I understand, there was a ground powder popular in Korea worked into the cake batter. It lent a spicy and unusually pleasant flavor I've never tasted before. So if fruity desserts aren't your thing either, give this one a chance!\n\nFor those reviewers who complaining about price, I'm honestly confused. I paid only slightly less for lunch at Stella Pizzeria last week and was left hungry and disappointed. The prices at South Gate are more than appropriate: you are getting quality, portion size and finesse. Just because it's labelled \"gastropub\" doesn't mean you should expect to pay for average bar food. This is GOOD food. I've certainly paid much more in fancier restaurants and got far less.\n\nWith one meal, this has become my new fav."
    },
    {
        "id": 100,
        "text": "Great place. 1st time here after reading about it in the Philly Mag.  Food was delicious must haves are that sweet potato fritters, wings, burger and tacos. Nothing was too hot most had a great sweet/spice balance. Will go back and try the Korean sweet rolls. Staff was very nice and attentive, place has a great feel and a decent happy hour (7 days a week) the citywide special of a Sapparo and a shot of Soju can not be beat. Only downfall not open for lunch.  If you get the burger ask for a side of the spread to dip your fries in.  If you are in Rittenhouse or Grad Hospital check them out."
    },
    {
        "id": 101,
        "text": "I've been here twice and determined that it's only worth it for the fried chicken. The drinks are watered down and taste like juice and the bibimbap and the chicken katsu are totally forgettable. Indoor seating is so loud that you leave hoarse- sitting outside is a much more pleasant experience (though my chair was right next to the bussing station). Beyond this, we had a party of 5 and were charged a 20% gratuity automatically included in the bill which was calculated on top of tax. I'm all for tipping waiters, but it should be calculated on your meal not on state tax. \nSo basically if you really can't find anywhere else to get fried chicken, go here and be prepared for mad food coma. Otherwise, I'd advise you checking out somewhere else."
    },
    {
        "id": 102,
        "text": "The KFC wings and Chicken Katsu are my faves! I have been there 5 times because I love it so much but never stop stuffing my face to write a review. Lol!\n\nThey are a block and a half away from my place and I love that fact. \n\nThe drink menu is amazing! I may or may not have tried them all. :-)\n\n\nP.S. TIP: It may say in the description that they don't do take away but I just made a take out order."
    },
    {
        "id": 103,
        "text": "After strategically planning my social calendar to check this place out, I was really glad to finally experience the greatness of southgate.\nFor an avid Korean cuisine fan, it's kind of pricey,  but given the quality and location, you are paying for a great experience.\nThe staff here is friendly and very professional - our waiter Dan, I believe, was on point.\nMy friends and I came 15 mins early to our 7:30 pm reservation - given the amount of people there, I highly recommend making a reservation. It is SUPER popular on a weekend.\nThey have a decent selection of drinks - my friends enjoyed their cocktails, particular the running nam (pun after the popular variety series the running man) which was delicious !\nWe had their pan seared octopus, which was creatively displayed as a single tentacle - I thought that was hysterical. It was soft and not overcooked which was good, but flavor wise I wasn't in love with it.\nMy favorite was the dolsot bibimbap with beef - definitely tasty and I asked for extra gochujang to spice it up more.\nEveryone really enjoyed their KFC -  soy garlic and spicy gochujang. Personally I enjoyed the soy garlic in terms of flavor but I liked the kick of spicy gochujang. The skin was perfectly crispy!\nThe pork bossam was a tad charred for me. I liked the arrangement though, made me feel like I was eating kbbq.\nOverall a good place to chill and definitely a mix of cultures. I think if you're open to trying new things but not too adventurous,  southgate is a good start."
    },
    {
        "id": 104,
        "text": "Staff was super helpful and patient with me and my date even though we had no idea what we wanted. They gave really good suggestions that ended up being totally delicious - the food and cocktails here are very, very good. We sat outside so I don't know what the inside of the restaurant is like, but I love that it's in a mostly residential area so you don't have to deal with center city sidewalk traffic. Beautiful area with trees and gorgeous old buildings. Nothing negative to say at all, we loved it."
    },
    {
        "id": 105,
        "text": "Great food, not so great service. My boyfriend and I got the hwe dup bap, octopus confit, and dukbokki, which were all surprisingly really good because as a Korean gal most asian fusion places underwhelm me. However the service was not anywhere on par with the food. After sitting down, our server took a really long time to even ask if we wanted any drinks. After finishing the hwe dup bap and octopus confit, I asked about the dukbokki since it seemed to be taking a while, to which our server said \"wow I can't believe you guys ate all that that quickly\" which was a bit of a weird response to a simple question. Overall I recommend this place if you're not in a rush, don't mind subpar service, and want quality Korean fusion food."
    },
    {
        "id": 106,
        "text": "I really wanted to like this place, but ended up walking away disappointed and hungry. The bf and I came here on a Thursday night for a double date at 7pm, and was seated immediately. Quick seating is always a plus! (Not even 5 minutes later the line was out the door, so arrive early). However, we were disappointed as soon as the drinks arrived. Tiny portions with not so tiny prices - be prepared to shell out some money to walk away full. \n\nFood/Drinks:\n- Spicy Pulled Pork Sandwich ($13)\n  The flavor of the pulled pork was just like any other, and the small portion size did not help. The only part of the meal that our entire group enjoyed were the gochugaru fries. Advertised as \"house fries\" that come with any sandwich, it came out as fries sprinkled with chili pepper and gochujang ketchup. \n- Korean BBQ Beef Tacos ($14)\n  So. Small. As soon as the plate was set in front of me, I already knew it was going to be a ramen night after I got home. The three tiny tacos had pretty good flavor, but were so small and lacking in the filling. (Heads up for cilantro-haters; ask for them to take it out if you're cilantro-averse!)\n- Korombian Sake Punch ($10)\n  Tasted a little watered down, and was very small for the price. All of the delicious aspects of the drink that were advertised (honey, lemon, citron tea, Korean melon, pomegranate juice) were nowhere to be found.\n\nAtmosphere:\n- Quick seating if you arrive early\n- Not too loud, which was surprising; you can definitely hear one another if you're with a small group\n- There's outdoor seating, which is sure to be enticing on a nice summer night\n- Our waitress was a little bit on the slower side and looked flustered most of the night, but it also was the first official opening night of the pub\n\nOverall:\nI think I'll give it one more try (maybe with the wings and koreancini), but my hopes for any good quality korean or korean-fusion food are certainly dashed for the Center City area."
    },
    {
        "id": 107,
        "text": "The food was pretty good, but the bibimbap is better at Giwa depending on your need for authenticity.  Our waiter informed us that Southgate has \"toned down\" their flavor for the general population.  Drinks are solid.  Don't ask for a side of kimchi! They charge you $3, give you 2 tablespoons and don't tell you in advance until you get the bill."
    },
    {
        "id": 108,
        "text": "*HAPPY HOUR REVIEW* \n\nI came here for Happy Hour and it was good. They have a wide variety of food available,  but their Happy Hour menu was fairly limited and standard. My friend and I got two beers, both sweet and savory chicken wings, and a plate of their bonchon (which we got kimchi). So here's the thing. The chicken wings were good, but were probably over breaded, but the sauces were perfect. The kimchi - was kimchi. Exactly as advertised, and exactly as expected. Personally, the happy hour is okay, but I suspect the dinner is much more inspired.  \n\nThe ambiance for this place is great though! A great place to catch up with your friend, bring a date, or have a nice classy dinner."
    },
    {
        "id": 109,
        "text": "This is my new favorite restaurant. The wings are uncommentable. Yea, I know that uncommentable is not a word. However, whatever I say will not give those wings the justice they deserve. Get in there and try them. Great bar and drinks. The service is excellent."
    },
    {
        "id": 110,
        "text": "My first time trying Southgate. It was really really good!!! Took me by surprise, I didn't even realize this was an Asian fusion restaurant. I thought it was another corner neighborhood pub. What a nice surprise! \n\nWe had the druken whale sake, which was so delicious! Started with the buns, which were so fluffy and delicious. I like the sauce with it too. For dinner we had the Korean tacos and the ahi tuna salad. The ahi tuna was amazing! I felt like I was in Hawaii eating a fresh tuna poke bowl with avocado. Loved it! \n\nService was also great. Our server helped us with a million questions we had about the menu. And he also offered some good suggestions. He even brought us a free sample of the unfiltered sake that we were pending to try! That unfiltered sake was also amazing! Reminded me of a boozy coconut juice, so good.  I wish the rest of the cocktails weren't so expensive, ($10 avg) because the choices looked really good and I would have tried more. \n\nGreat food, great service. I'll definitely be back!"
    },
    {
        "id": 111,
        "text": "The seating is a little close together and a drafty restaurant.  They close around 2/3pm in attempts to prep for dinner. DONT go close to closing time, my short rib pictured below was SOOOO dry! Also, really really salty."
    },
    {
        "id": 112,
        "text": "Nice twist on traditional Korean dishes  in a hipster gastropub milieu. Came here with a friend and a Sunday evening and the place was full by the time we left, which says a lot about how popular Southgate is. We got 3 Starters to to share - the octopus, Korean beef tacos, and the lettuce wrap with pork belly. Everything was perfectly portioned for small bites bursting with flavor.\n\nOnly 4 stars though as the grilled octopus only had 2 tentacles :-/ and the rest were potatoes..."
    },
    {
        "id": 113,
        "text": "I was pretty excited to see a Korean small plates place open up outside of Chinatown/North Philly, but not sure what to expect. Southgate serves overall great dishes, though the prices reflect its location near Rittenhouse Square.\n\nFirst off, the KFC wings had a super thick crust. It was actually difficult to bite through - maybe it was an off night? The flavor was pretty good, but not outstanding, and at $12/7pc, they were a bit pricey.The octopus was absolutely amazing. I'd go back just for that. For mains, I got the bulgogi burger - the beef was tender and perfectly marinated and the (housemade!) pickles were refreshingly tangy. The fries had a great spicy kick as well.\n\nTheir drink selection is solid - a decent beer list and interesting cocktails. We were a bit shocked that we spent $100 on what felt like a pretty simple meal, but then again, we managed to throw down $40 on drinks - they were that good.\n\nSouthgate is somewhat expensive for the subject matter, but the dishes were overall well-executed. It's a great, casual neighborhood restaurant with an interesting Korean-American fusion menu, and most importantly, we ended up having a really delicious meal and a fun time."
    },
    {
        "id": 114,
        "text": "Long overdue review. Sneaky good spot for brunch when the weather is nice. Breakfast kimchi poutine was intense but delicious. When we've gone in the past for dinner you can't really go wrong, but my favorites are the bonchon chicken wings (obviously) and dolsat bibimbap. \n\nThe drinks are amazing as well. I always get the \"old boy\". It's like and old fashioned and a negroni had a baby. Last pro tip is the chef's table is great for large groups of 6-10."
    },
    {
        "id": 115,
        "text": "Tried the Korean Fried Chicken and beef Dolsot Bibimbap. Both were good - not great. Ambiance not bad either."
    },
    {
        "id": 116,
        "text": "We've been wanting to try this place! Nice people, nice ambience! Good food! Hubs did try the bugolgi burger said it was good but didn't remind him anything of bugolgi was good but just like a good burger lol!! We will come back to try different items for dinner!"
    },
    {
        "id": 117,
        "text": "Came here for Sunday Brunch around 1pm after seeing a video online hyping up this place, weather was nice, so opted for their outdoor seating, it wasn't super busy, so everything came out really fast and the server was very attentive.\n\nThe first item I ordered was the Korean Fried Chicken (KFC) + Green Tea Waffles [$12] : \nThe outside when you bite into these give you a nice satisfying crunch, at the same time not being too hard/thick although were a bit too sweet for my tastes.  The Green Tea Waffles, however, were delicious, gave a hint of green tea flavoring while not being too overpoweringly sweet with a nice spongy consistency I'd expect from a nicely made belgian waffle.\n\nThe second item I ordered was the Kimchi Poutine [$12]:\nThey bring this out in a hot stone pot like you would see for Bimbimbap at many Korean restaurants and you can literally hear the sizzling tastiness approaching.  The kimchi, cheese, bacon, fries and runny egg on top was such a sinful combo.  You can pull the cheese up with your fork and it just oozes up.  Once you get to the bottom of the pot, the fries are extra crunchy from the stone pot.  \n\nAll in all, Southgate is a nice brunch spot with some pretty unique fusion dishes."
    },
    {
        "id": 118,
        "text": "The customer service here really sucks. Our table was wobbly and one of the air conditioning units was broken. The server did eventually stabilize the table but wouldn't really entertain us moving to another table because of the heat. \n\nFood was really good, but took forever to come out. We were here for two hours because it took a full hour to get our entrees."
    },
    {
        "id": 119,
        "text": "SouthGate is a delicious destination, with superb cocktails and terrific Korean-inspired food.  Sidewalk seating is delightful on lovely evenings, but inside is chic and comfortable.  As a twenty-year resident of the near neighborhood, my family is thrilled to have them here."
    },
    {
        "id": 120,
        "text": "After years of passing by this unassuming business in my neighborhood, I finally tried it and can't believe I've been missing out! \n\nI was easily able to make a reservation for my group of 6 on a Sunday evening. The restaurant was not crowded at all on this particular night and they made sure to set a table for six prior to our arrival. The place itself is rather small, with a long bar running down one side and a row of tables along the opposite wall. There was a pretty narrow path between the two. This did make it a bit squishy for those of us with our backs to the people at the bar and awkward for others to walk in between. \n\nOur server was very friendly and helpful with the eclectic menu. We opted to eat family style, with food delivered as it was prepared. We started with the korean fried chicken, one spicy and one soy garlic. These are essentially amazing chicken wings. I say go for the spicy - it was super flavorful and not all that spicy. My personal favorite were the short rib ho-ppang. The buns were fresh and delicious and the pork was seasoned absolutely perfectly. We then had the beef dolsot bibimbap - ours was not served sizzling as described, but was very tasty all the same. Finally, we had the japchae which was probably my second favorite. \n\nOverall, this was a great group experience. We loved the food and option to eat family style. I'll definitely return for more of those pork buns and other deliciousness in the future!"
    },
    {
        "id": 121,
        "text": "Wings wings wings. So good. Get the spicy ones. They're not the tiny little wings. They're like from chickens on steroids. \nStick with the beer because the drinks are a bit overpriced and not very strong. Kind of pricey but the portions are huge. The fish and chips are great. The tacos fell flat for me. \nStick with the wings. Go for it."
    },
    {
        "id": 122,
        "text": "Great neighborhood spot. The space is open and cool and the service friendly and prompt. I thought the food was great and appropriately priced. We had the chicken wings and they were fantastic. Got half soy garlic half spicy, I liked the later better my husband the former so I think getting some of both is a good call. The fried green tomatoes were so yummy and I loved the little sauce that was on them. The burger was delicious. Will definitely go back again."
    },
    {
        "id": 123,
        "text": "First night in Philly after flying all day and suffering rotten, lousy and expensive food, my wife and I were too tired to go far from our B&B (La Reserve, on Pine - go there!). Found this place a few steps away. Went there! \n\nFriendly and local vibe, vibrantly noisy, but not anywhere near so much that conversation is difficult. A small coterie of tables inside - be sure to reserve before you go. We didn't, but found a spot at the bar. Bartenders were helpful and nice. \n\nThe menu is short, but you'll still have a hard time choosing. Fortunately, the young woman next to us got the hot pot. It sizzled hotly, scents and spices urging us to order the same. \n\nSo we did. My wife got beef, I got tofu dolsot bibimbap. We tied for best dinner. No, seriously. The tofu was perfectly prepared, with a crisp just slightly chewy crust, yummily seasoned by its veggie environment topped off with a tingly red sauce. Get that. \n\nA small but tasty selection of beers and such went nicely with dinner. We could have stayed for another, sitting and yakking in the midst of other couples and friends enjoying the company and atmosphere, but we had pie to eat. Head to Magpie a couple of blocks away for dessert. \n\nSouthgate is great. Go there."
    },
    {
        "id": 124,
        "text": "Food was amazing! In the old Tangier place. Everything has been totally redone. The food does not disapoint. Even the hand made cocktails where well done!"
    },
    {
        "id": 125,
        "text": "Heard a lot about Southgate, so decided to come here last night with a few friends. Perhaps it was because of the high expectations (particularly about their wings), but the food did not really wow me.  As a starter, we shared their highly praised KFC (Korean fried chicken) wings - half soy garlic and half spicy gochujang. It came out hot and crispy (and was really big!).  As a spicy-food-fanatic, I was surprised that I preferred the soy garlic. It had a more memorable flavor profile, while the gochujang was just plain spiciness (could use some citrus seasoning, for example). While I loved how crispy and juicy the wings were, the flavors didn't really seep into the actually chicken, so unless you're eating the flour crust/skin, there wasn't much flavor.\n\nI ordered the marinated beef bibimbop (without the stone pot - I think it's rather ridiculous to pay $2 just based on the bowl that your food is served in!), and was rather disappointed.  While the flavors were good, it came out cold, the egg on top was overcooked, and the beef was rather tough. I really wanted to like Southgate, especially since there aren't many Korean restaurants in the area; however, I don't think I'll go back for a while. And if I were to go back, it would be for the ambience and I would not be getting the same dishes again."
    },
    {
        "id": 126,
        "text": "Went here with a friend on a Saturday around noon and we were able to sit down immediately at a table outside.  The waiters were very friendly, attentive, and the food came out quickly.\n\nThe fried beef patty burger - pretty good.  I ordered it \"medium\" as opposed to \"medium rare\" and it was too rare in the middle for me.\nThe kimchi poutine - outrageous.  It's comes out in a hot stone bowl and sizzles for a good 5-10 minutes after being served.  My friend really like it.  Good fries in both meals.\n\nThey have a decent tap list, too.  I will keep an eye on the menu and see if anything changes that brings me back for more.  For now though, I think we got the gist of what they're serving."
    },
    {
        "id": 127,
        "text": "Haven't been to a Korean Fusion restaurant where there are sochu fusion options so I decided to try this place out and I was definitely in for an unforgettable treat! Definitely recommend the sochu fusion drinks and ever famous Korean Fried Chicken! Great customer service as well!"
    },
    {
        "id": 128,
        "text": "Decided to try this place with the boyfriend after seeing all the good reviews on Yelp. Definitely a good call. The Korean Fried Chicken (KFC) was delicious! I also had the bibimbap and that was pretty good as well. Definitely want to try the bulgogi burger and the sizzled bibimbap when the weather is a little colder out. Love that this place has outdoors seating and we could bring our pups out with us. They even brought our corgi a water bowl."
    },
    {
        "id": 129,
        "text": "Great and unique addition to the Philly food scene with an awesome ambiance. Happy to see a different a take on the gastropub, bringing a FULL menu influenced by traditional Korean flavors.\n\nLoved the wings and mandoo, both are my go to appetizers. Thoroughly enjoyed the burger and katsu as well. \n\nThe big winner for me were the cocktails! Great and friendly bar staff with amazing drinks. Old Boy or P&P FTW."
    },
    {
        "id": 130,
        "text": "Had the wings, tuna bowl and bibimbap. Everything was good but very pricey for the food you are getting. This place has alot of potential but needs some work."
    },
    {
        "id": 131,
        "text": "I've had a burger or two in my lifetime, and there is no way the bulgolgi burger is the best burger in Philadelphia. The happy hour deals are pretty good though."
    },
    {
        "id": 132,
        "text": "More like 3.5.\nThe fried chicken wings were awesome - I thought the spicy gochujang were better than the soy garlic, but both were delicious.\nThe bibimbap was very good. Lots of veggies. The korean steak tacos were avery flavorful.\nGreat cocktails. Friendly service.\nWill definitely return for more wings and other food."
    },
    {
        "id": 133,
        "text": "So happy I FINALLY tried Southgate! I came here for brunch on a Sunday around 12pm. There was no wait and tables were available both in and outside. Service here is good - wait staff is attentive and brought us a whole container of water for the table. The menu for brunch isn't huge, but gives a decent amount of options that are twists on some Korean classics. The menu is easily accessible on their website. I ordered the dolsot bibimbap while my friend got short rib loco moco. I loved my dish! I ate almost all of it - the one downfall, which was not Southgate's fault, was that the gochujang in the dish was a little too spicy for me. I would order this dish again in a heartbeat and just ask them to leave the gochujang off. My friend also said his meal was delicious and ate the whole bowl. The portions were nicely sized - see pictures - and I felt full and happy after my meal. This was definitely a 4.5 star experience. Will definitely be back soon to try the dinner menu!"
    },
    {
        "id": 134,
        "text": "Love this place.  Although I mourned the loss of Tangier as much as anyone else in the neighborhood, this is a much-needed addition to the area.  Have had almost every item on the menu - each one is carefully prepared and well-executed.  Don't expect traditional Korean cuisine or some Korean fusion nonsense, because it's neither.  Favorites include the KFC wings, kale salad, bibimbap, tacos, and katsu.  Perfect place to stop in for a drink off of their diverse drink list.  Bartenders and servers are friendly and the decor is classy and warm.  Awesome family style table in the back is right next to the kitchen and great for groups."
    },
    {
        "id": 135,
        "text": "Stopped by for brunch on a windy Sunday. I had the kimchi deviled eggs, and the braised short rib. The kimchi deviled eggs were good, but I'd like the kimchi to be stronger. The short rib was out of this world, thus the 5 stars. It was perfectly cooked, super tender and flavorful. The rice was delicious and the two fried eggs accompanying it were perfect. A very rich, insanely delicious dish. I'll be coming back for more. \n\nService was really good, quick and attentive. \n\nBrunch cost me $25."
    },
    {
        "id": 136,
        "text": "Amazing! Reservations are pretty necessary on weekend nights as the place is small, but the quality of food they get out of that kitchen is unbelievable. We had the soy chicken wings, tofu tacos, Southgate fries, Brussels sprouts, fried chicken sandwich, burger, and steamed buns. I couldn't get enough of any of it. There was a margarita-esque drink with soju on special that was to die for, and the 'old boy' cocktail was negroni-esque and also great."
    },
    {
        "id": 137,
        "text": "Good food and service. We had the bulgogi burger and KFC wings (the soy ones were superior) both of which were scrumptious. One less star for little elbow room and the shaky bench on the right side of the establishment."
    },
    {
        "id": 138,
        "text": "Really good food and service. The bibimbap bowl was served piping hot and it was delicious. The portion was quite large too! The deviled eggs were good and my fellow diners enjoyed the kimchi. Would definitely come back."
    },
    {
        "id": 139,
        "text": "I came here with friends during restaurant week. The price is good and most of the food were good. My bibimbap has too much sesame oil but too little spicy paste. My friend's fries was half cold."
    },
    {
        "id": 140,
        "text": "This restaurant never disappoints.  We have been here on several occasions and the food has always been delicious.  The KFC (Korean Fried Chicken) comes in soy garlic or spicy gochujang.  Both are delicious.  We also enjoyed the short rib buns and kimchi.  Great late night option on Saturdays."
    },
    {
        "id": 141,
        "text": "I was so, so excited to try Southgate, because Philly doesn't have very many Korean places/options, and Southgate looked great and has an awesome looking menu. We went for dinner, but I definitely want to go back to try brunch, too! (Especially for those chicken and waffles!). \n\nFor dinner, we ordered the chilled cucumbers, the Korean fried chicken (half soy/half spicy), the steamed buns, the dukbokki, the dolsat bimbimbop, and the pork belly ssam. \n\nI'm not going to lie, I've had better Korean fried chicken (and even Bonchon has pretty good KFC), so their KFC was just alright. The star dishes of the night were really the dukbokki and pork belly ssam. WOW, this was probably the best dukbokki dish I've had in a while, and I'd definitely order it again. The pork belly ssam was also really delicious and different (since I usually order the seafood one and hadn't seen pork belly as an option anywhere else before). \n\nWe also ordered the grapefruit soju, which was good, but not my favorite soju flavor. I kinda wish they had lychee soju, but they had a lot of other different soju flavors compared to your traditional Korea-town restaurants. \n\nOverall, I'm glad Philly finally has a little more upscale Korean option, and I really like the atmosphere and vibe of Southgate."
    },
    {
        "id": 142,
        "text": "Back in Philly! Here for the weekend to cheer on my gf during the Love Run. Since we got in on a Friday, we made plans to grab dinner somewhere nice with our friends and family. My Yelp research brought this place up as an option and we all agreed to check it out.\n\nOur Megabus was stuck in a bit of traffic, so we got there a bit later than we expected (about 9:20 pm). When we arrived, I couldn't help but notice how relatively small it is, and how packed it was. \n\nWe spoke with the hostess to let her know that our party of six already had our names down thanks to two friends who got there before us.\n\nAfter maybe waiting 10-15 minutes they were able to seat all six of us (which they acknowledge they don't usually do). Our server came quickly with waters and menus. The menu is extensive! Lots of tasty options for Asian cuisine. We started the night with an assortment of cocktails and beer. I got a hot toddy, which just wasn't my favorite.\n\nIn a funny moment, the server told us they had unfortunately run out of buns and we were all bummed thinking we couldn't order burgers. However he quickly qualified his statement to mean short rib buns.\n\nOur group only ordered bulgogi burgers and dolsot bibimbap plates. Both very good! The bulgogi burger was voted amongst the best of 2016 according to a Yelp review, and I can see why.\n\nGreat service and lots of tasty options. Highly recommend this place."
    },
    {
        "id": 143,
        "text": "Southgate was GREAT. I will say this though, definitely make reservations. We walked by here on a Friday night and it was packed with about a 45-minute wait. I mean, that's pretty much to be expected for a good dining spot on a Friday night, but definitely make sure you make a reservation if you want to guarantee a table.\n\nI was really craving Korean food one night and so we made a reservation for around 7:30. This place is small, with two tables to the left when you walk in the door, seats at the bar for around 10-12ish people, and tables with booth seats all along the right hand side wall. It's dimly lit, candles on each table, cozy, intimate and warm. You wouldn't expect this to be a Korean place just walking by, it looks like a typical gastropub. \n\nMenu is solid, great choices and just the right amount of options. I went for the dolsot bibimbap - hot stone pot with beef and a side of kimchi. It's hard to pass on your favorites, but next time I come I'll try some of their other dishes - they've got a great selection! \n\nService was just the right amount of attentive, friendly and well spaced out. I don't remember my dish being too spicy, but then again, I'm a spice-a-holic and have heard/read reviews about it being on the spicier side here, so just be aware if you are sensitive to spiciness."
    },
    {
        "id": 144,
        "text": "Been meaning to try this place for a LONG time. I was not disappointed. 5 stars for service and food. We had the soy garlic KFC, pork mandoo, shortrib steam buns, and the octopus. The octopus was the most tender I have ever had. Everything was perfect. The wings were super crispy and not overly sweet. Could have eaten several orders of them. The chef sent out a trip of kimchi, brussels sprouts and the potato salad. Also very good"
    },
    {
        "id": 145,
        "text": "I come last night specifically for their Happy Hour I tried their Happy Hour Red Sangria. It was very flavorful and had a nice kick. I also tried their KFC wings everyone raves about, in the soy and spicy flavors. All in all, the chicken was thoroughly cooked, with good flavors, tender on the inside and crunchy on the outside. Overall, good chicken, but nothing to rave about. I'd say stop by if you're in the area."
    },
    {
        "id": 146,
        "text": "Definitely one of my new favorites. The service and food are both amazing. Hard to say which is better. Anything I've tried here I loved. And the hostesses/servers are so friendly. For food I definitely recommend the buns and dumplings (I think ho bangg was the bun). One thing I will say is they're getting pretty popular so it can definitely get busy. You might need to wait for a seat for a few minutes if you walk in, especially if you have a bigger party."
    },
    {
        "id": 147,
        "text": "This place is a diamond in the rough! I love Southgate for it's authentic menu, intimate atmosphere, and reasonable prices. This place is great for grabbing a bite with a friend or a casual date night. \n\nYesterday I took my mom here and she too adored it. We each ordered kimchi and a small plate of steamed  pork dumplings to share. Both flavorful and generously portioned. We then ordered the traditional bibimbap with beef. The bowl was filled with rice, veggies, egg, seaweed, bean sprouts, beef, and an unforgettable red sauce. We left quite full because it tasted so good. I will be back soon!"
    },
    {
        "id": 148,
        "text": "So happy to have this in the Rittenhouse neighborhood!  First, the kimchi was homemade and deliciously authentic (though they ran out).  The menu highlight was the fried chicken wings--we had combo soy and gochujang  (next time, I think we'll order just the gochujang--but not very spicy at all).  We also had the tuna sushi bowl (maybe a bit light on ingredients and seasoning, but good nonetheless)--next time, I'll try the dolsot (stone bowl) bibimbop.  We really liked the large Kale salad (delicious sesame seed dressing).  We also had the beef tacos (not much like Kogi truck tacos--a bit light on fillings and could have used kimchi topping).  I'm looking forward to going back (good drinks menu and good beers on tap)"
    },
    {
        "id": 149,
        "text": "Had dinner here on a Friday night around 6:30, the place wasn't packed but was starting to get a little cramped. This small eatery is just south of Rittenhouse Square next to graduate hospital. The atmosphere is very moderate and reserved. The food is best identified as Korean fusion, dishes friendly to the American palate and inspired with Korean ingredients and flavors. If you want an authentic Korean experience this is not the place to go, if you want to be more adventurous with your dinner but still want dishes to remain familiar then this is your spot. \n\nThe waitstaff are all very nice and professional, they do genuinely appear proud of their establishment. The food is unique and the flavors are not too strong. Myself I am used to Korean dishes and was a bit disappointed by the level of food they offered. I ordered the kbbq tacos and thought they were okay at best. Their cocktails were average as well. This is a midscale restaurant with mid-upper scale pricing. This is a nice spontaneous place to go on a date, especially if you're not too adventurous, but more accurately, curious."
    },
    {
        "id": 150,
        "text": "Very excited about Southgate, which has the potential to be a go-to after work spot for my wife and I. \n\nThe interior is completely redone and you would hardly believe it used to house the busy, kitschy trappings of Tangier. Very sleek and clean with plenty of seating and a large bar. \n\nWe started with the Koreancini, which was good not great. The arancini were nicely crisp and the corn inside tasted fresh. However, they needed a tad more salt. Still, the big miss was the sauce, which was basically stewed tomatoes that lacked seasoning. The dish didn't really read as Korean. I would have loved some heat or punch of flavor.\n\nI got the tofu bibimbap which was AWESOME. Really fresh and a sizable portion. To drink I had the sake punch, which was light and refreshing. We also had the dessert -- their only dessert option at the moment -- shortcake layered with whipped cream and berries. The dessert was good, not particularly sweet, which I enjoyed, but, again, nothing read Korean. To top it all off, service was truly excellent. \n\nI can't really understand the reviews complaining about price. They might seem high if this was still Tangier, but for a Gastropub they were pretty average. \n\nAll in all, Southgate has some room to grow -- first and foremost they need to put their menu up on the website. But so far Southgate seems like an great addition to CC, and is an especially welcome veg-friendly Gastropub."
    },
    {
        "id": 151,
        "text": "Small quaint place with a nice atmosphere. Dined late on a Saturday night, and the place wasn't too crowded. I had the koreancini which was a decent starter. Had the the bibimbap which is bowl of rice and veggies with a fried egg and tofu.  I chose the tofu as a vegetarian but my friend got the beef. Very good and both chose to get it hot in the stone bowl, but needed to wait a bit to let it cool enough to eat."
    },
    {
        "id": 152,
        "text": "Southgate is the Best! A neighborhood staple! Amazing Korea food! Seriously awesome brunch"
    },
    {
        "id": 153,
        "text": "My girlfriend and I ate here during an evening rush. We ordered a few appetizers/small dishes and drinks at the bar: pork dumplings, crispy Brussel sprouts and the galbi. Everything came out pretty fast, the bartender was pretty fast and didn't rush us. We also got the persimmon panna cotta dessert; it was delicious.\n\nIt was a little cramped and pricey but that's to be expected in this area. \n\nWe didn't get a chance to try any of the entrees but we'll get to that the next time."
    },
    {
        "id": 154,
        "text": "This restaurant is adorable and delicious. My boyfriend and I popped in and sat at the bar where we got great service. The house infused soju is delicious, I had the earl grey and he had the cardamom; next time I would get a whole glass of it. For dinner, we had the softest, chewiest buns filled with steak and cheese (philly style of course), the japchae noodle bowl, and a fried chicken sandwhich. Everything came with this delicious garlic pepper aioli and our food could not have been more tasty. We can't wait to go back!"
    },
    {
        "id": 155,
        "text": "Asian fusion, shareable plates. They tried to make a modern, American twist on traditional Korean dishes, however wasn't innovative enough to create a blast on the pallet, yet also failed to present the premium quality Korean traditions. Good selections of drinks and quality of food, nice atmosphere to gather with close friends or date night, but the flavor of food is just so-so"
    },
    {
        "id": 156,
        "text": "I like the food but they never honor your reservation time. This is the third time we've had to wait over 20-30 minutes. We walked out and went elsewhere. I get that they can't control how long people stay but should account for that in their bookings."
    },
    {
        "id": 157,
        "text": "Super confused about the hype of this place! We came for happy hour, and yet everything still seemed super overpriced.\n\nWe got the sweet potato fritters which were good but something that I definitely could've made at home. Also shared some soy garlic wings, which were good but at $2 a piece felt really overpriced - they were very similar to Soho chicken in size and taste. I got the beef tacos as my entree, which were probably the best part of the meal. I had a bite of the beef bibimbap and was not impressed - the beef pieces were super tough and not flavorful, and definitely not worth it for the price (I can't quite remember but it was like $14 or $15).\n\nI was so excited for a Korean fusion place, but I don't think I will return :("
    },
    {
        "id": 158,
        "text": "Had dinner here on Wednesday night and was glad we made reservations because the place was packed. We started with the KFC (spicy) and octopus. For dinner, we shared the dolsot bibimbap with beef and bulgogi burger with a side of kimchee. The octopus was our favorite of the night, followed by the bibimbap. I had pretty high expectations for the KFC and burger. Both were good and definitely tasty, but not in the running for the best I've had. Based on first impressions, I'd give this place 3.5 stars for now."
    },
    {
        "id": 159,
        "text": "Good food and really like the space. Korean chicken wings had the best first bite crunch I have ever heard. Like the drinks and the kimchi too."
    },
    {
        "id": 160,
        "text": "Really enjoyed my dinner here. The KFC (chicken wings) are really tasty and all of the appetizers are quite good. Philly suffers from a shortage of decent Korean food - this place has pretty good bibimbap and the fusion dishes are perfect for those who aren't familiar with the cuisine. Enjoyed the beer selection as well.\n\nBig shout out to the team here for being willing to track down a lost receipt for me. Huge, huge, kudos for something that they didn't have to do for me, and really appreciated. Thanks!"
    },
    {
        "id": 161,
        "text": "Fusion and small/large plate trends combine to produce a mediocre result.  There were a few highlights including a delicious calamari salad, but there were more misses than hits including a Korean fried chicken sandwich in which the overly breaded and generous chicken pieces were completely dried out.  The shrimp dumplings were also a disaster, offering four small dumplings with so little filling they tasted like plain dough swimming in a sauce.  The short-rib filled steamed buns were a reasonable take on the original though they were, like the originals, too doughy.  (That was OUR mistake).  In sum, there were some interesting flavors ruined by some poor preparations.\n\nLet's hope the entire small plate shtick runs its course soon.  It won't, of course, because it is so profitable, but it isn't generally a satisfying way to order...or eat!!!"
    },
    {
        "id": 162,
        "text": "I really enjoyed my visit to Southgate last night. They were accommodating to our group of 7 (we got a big table towards the kitchen) and the food was great! We tried both styles of their Korean Fried Chicken (KFC) - the soy garlic and spicy gochujang. I really enjoyed both flavors. The spicy wasn't TOO spicy and the soy garlic was sweet and tangy. Both were a great compliment to the extra crispy crust on the chicken. For my entrée I went with the beef bibimbap and of course upgraded to the dolsot option ($2) extra which was worth getting the hot crispy rice. I ate the whole bowl and I'm not even mad. I tried 2 of their signature cocktails the \"Korumbian\" because the name just made me laugh and the Korea 75. The Korumbian was a little too sweet for my taste, but it was nice with the spicy wings and salty soy flavors of the dishes we got. I preferred the Korea 75 which is sparking wine with sake and a little citrus (grapefruit maybe?) I'm a sucker for anything with a little sparkle to it. I definitely would recommend this place for something that isn't your typical Italian or Chinese casual dining if you like interesting flavors. I will be back!"
    },
    {
        "id": 163,
        "text": "I love this place and especially love that it's close to my home!  The renovation is beautiful.  It is classy and casual.  It has great outdoor seating.  It was easy to get reservations and when I had to change the time, they were very accommodating.  A great sign is that it is run my Asians and many Asians eat there.  I can say that because I'm Asian and that's always a great sign!  Haha  Food is delicious and beautiful.  I went with some friends that are not adventurous eaters and they LOVED it.  They have a full bar so that's also great.  Great service all around.  I will definitely be back often!!"
    },
    {
        "id": 164,
        "text": "We were in the area yesterday and were in the mood for Korean food, so we decided to try out Southgate! The restaurant was modern and comfortable, perfect for a holiday season dinner with friends. \n\nWe started with sake and Sapporo beer, and I ordered the fried chicken and the dolsot (hot stone bowl) bibimbap. The fried chicken tasted good, but was a tiny bit heavy on batter, and was expensive at $12 for 6 wings. Similarly, the bibimbap rice and veggies were done perfectly and tasted wonderful, but the beef was slightly overcooked and chewy.\n\nOverall, we had a good experience and would be happy to return for round two.\n\nFour Yelp stars"
    },
    {
        "id": 165,
        "text": "This is going into my regular rotation for happy hour starting now! They have awesome kfc (either spicy or sweet) and $6 sangria, half off drafts and a nice city wide. Their French fries are very yummy and a large portion. You can get a lot of very inexpensive food/drinks during happy hour in their cozy dining room. I'll be back very soon!"
    },
    {
        "id": 166,
        "text": "I hope this place does well.  Ambience is chill and I think they have a good sense of who they are in terms of preserving the essence of Korean food while stretching the boundaries, but not by too much.  Service is always friendly. As for the food -- KFC is the best item on the menu -- very thick and very crunchy batter -- and both spicy and soy are great.  Katsu burger with kkochukaru fries -- the kids really liked the flavor profile.  The short rib loco moco -- a nice nod to Hawaiian good -- adventurous, although I would still opt for the KFC.  As for the kimchee -- it was good -- just nothing that extraordinary for kimchee.  Philly could use more Korean style joints like this, so I hope it does well.  It would be a fun place to host a private party."
    },
    {
        "id": 167,
        "text": "I was so excited for this restaurant to open that I went ahead and made this yelp page for it weeks in advance! I went opening weekend with a group of 14 people and had a really awesome experience! We didn't think to make a reservation, but the hostess was kind enough to seat us right away at the chef's table right by the kitchen. The server was also very attentive and patient, considering people in our party were walking in sporadically every 10 minutes or so. For food we ordered the soy ginger korean fried chicken (7 pcs/order) and koreancini balls (5 pcs/order) to share, and I got the bulgogi burger as my main. The meat was a little dry and the side of gochugaru fries could definitely use a lot more seasoning to really POP, but still a solid meal. They also gave us an extra dessert (misugaru cake with berries and creme) on the house for the delayed service, which most of us didn't even notice! \n\nI came back the Friday after with a friend, again without a reservation, and got a nice outdoor table right away. We ordered the sake punch and the koreana 76 off the cocktail menu and they were both delicious and super refreshing! We tried the KFC again, this time half sweet and half spicy, and I actually preferred the gochujang flavor - it's not too spicy and just sweet enough. For our mains we ordered the bibimbap and the pulled pork burger, which were both stellar. I actually enjoyed the pork burger much more than the bulgogi burger from my previous visit. The fries were crispy and cooked to perfection, and the ketchup/gochujang mixed condiment for dipping was a really great touch to the dish.\n\nDefinitely a fan of this place and will be coming back often! It is a little pricy for everyday eating  and it's not necessarily authentic korean food, but nevertheless a great addition to the food scene in philly!"
    },
    {
        "id": 168,
        "text": "A great neighborhood gastropub with a spin. I live very close to Southgate and had been wanting to try it out for some time now. On a rainy Sunday I figured brunch was the perfect excuse to stop in. The space it fairly small with a long bar and about 6 or 7 tables. Great for groups of 2-6 although I did see a larger group in the back. The decor is dark and reminiscent of a pub/Korean soju bar. The brunch menu is concise with a good selection of dishes to choose from. We got the chicken and waffles, short rib loco moco, and deviled eggs. \n\nChicken and waffles was a hit. The chicken was flavorful with a crispy cracklin skin. A spicy maple syrup or honey drizzle would have been a great addition but then you run the risk of soggy chicken. And no one likes soggy fried chicken. The matcha waffles were dense and crisp and a good compliment to the chicken.\n\nMy short rib loco moco was hearty and rich. You get a generous portion of soft short rib. The rice and pickled jalapenos were a nice offset to the rich egg and meat. \n\nWe were intrigued by the deviled eggs and they were a fun spin on the party classic. The kimchi's funkiness cut through the creamy yolks and the whites were soft boiled.\n\nOverall, I'm a fan of Southgate. It's a great place to take friends for dinner, drinks, brunch, pretty much any occasion."
    },
    {
        "id": 169,
        "text": "We ended up here as we are sleeping in the neighborhood . It is Wednesday night the place is 1/2 empty and we arrive for dinner at 6:30 pm . The waiter tells us there is happy hours at the bar but advice us on prices for wine at our table . Saying it is a house wine and we charged $6.00 / glass . We had 5 glasses and got charged 10 each glass . After discussing with waiter and manager they keep on arguing and do not want to change the price as originally told ! Wrong wrong wrong . Bad customer service . Beside the crudo salmon after asking if it was good as a main dish for 1 person .... it was actually 3 small slices of unfresh smoked  salmon and 3 slices of cucumber .... very cheap ! \nTherefore for the bad customer service , for the poor quality of food I would not recommend this place at all . Let's Move on"
    },
    {
        "id": 170,
        "text": "Fantastic new chef and the food is jammin'. \n\nBest beef tartare ever and an incredible sizzzling rice bowl with beef. Budget friendly, super cocktails, child friendly - this is a great small neighborhood spot. Make a reservation soon you won't be disappointed. The flavors are big, the ingredients fresh and friendly service all at a reasonable price.\n\nLoved it and can't wait to return."
    },
    {
        "id": 171,
        "text": "Two of us shared kimchee, brussel sprouts, pork mandoo, veggie mandoo, kfc and seafood panjeon. They have us complimentary cucumbers which were better than the kimchee. Everything was outstanding and I would dare say better than the Korean food in Los Angeles. Attentive service and an excellent beer selection topped it off. There was no wait for a table at 8:30 on a Thursday. People are surely missing out."
    },
    {
        "id": 172,
        "text": "Best service I have ever received from a restaurant. Server David Lee is a fantastic employee and deserves all the love and recognition. His perfect timing and smile brings an experience of a lifetime. Their food and drinks are great as well, but David Lee is the icing on the cake."
    },
    {
        "id": 173,
        "text": "I came here with a small group of friends for an early birthday celebration and I was really pleased with the food. The bao buns were definitely the best part of the meal, and I would come here again just for those. The one critique I would give it is the chairs that they use for the outdoor seating. They were really uncomfortable and took away from the outdoor dining experience. I would still recommend this place to others who want an affordable but delicious meal."
    },
    {
        "id": 174,
        "text": "Can't believe I have not yet reviewed Southgate - it's a staple! We live very nearby and frequent Southgate heavily (like, at least 1-2x a week) because the service, ambiance, food, and drink selection are so good - and the prices are so fair. We love Southgate!\n\nThe happy hour, in particular, is probably the best I have encountered in Philly, with $4 Two Hearted on draught and $2 banchans (small but delicious side dishes, like warm crispy tofu with chili sauce or soy braised potatoes - 2-3 are sufficient for a meal for me). They have excellent outdoor seating as well as a warm, chic interior, and all the dishes (especially the pork ssam and pajeon, as well as the rotating burgers and chicken sandwich - oh, and the brunch!) are reliably delicious. The service is friendly, prompt, and never overbearing. \n\nMy only critique is that they do struggle sometimes to meet demand during restaurant weeks and after street fairs on South St, so I suspect they need more service on hand for surge capacity - but they've always tried to make it right when wait times have been long. We feel very lucky to have this gem nearby!i"
    },
    {
        "id": 175,
        "text": "Excellent waffles, but the chicken was all skin and bone and hardly any meat. Try using chicken breast or tenders. The fried skin tastes good but chicken waffles are all about using a fork and knife to cut meat and eat it together with the waffle..."
    },
    {
        "id": 176,
        "text": "I really like this place - it is a shame I moved away from it. I had the hot stone bowl with crispy rice and beef - amazing. I've also had their gigantic wings, and they are really flavorful."
    },
    {
        "id": 177,
        "text": "We went here for brunch for a friend's birthday! I'll start off by saying the drinks were really good! HIGHLY recommend the blood Mary - probably one of the best I've ever tried! I got the Korean 76, which was also pretty good! The food was decent, nothing great. We tried the green tea waffles, and I thought they were okay, my friends really liked them. The bibimbop bowls were really good and tasty though! Would def recommend to go for drinks!"
    },
    {
        "id": 178,
        "text": "I came here with friends during restaurant week. This is a small and cozy place. The decor and aesthetic gives you a feeling of comfort. The customer service is great and very attentive to your needs.\n\nAt first I didn't have a really high expectation for the food for this place, but they brought their food to another level. The appetizer was great. Even though the filling isn't anything like a normal dumpling, the taste brings you right back to one.\n\nThe loco moco was delicious. The patty is cooked to perfection with a little pink in the middle. The gravy reminds me of a katsu sauce. The eggs were perfect sunny side up.\n\nThe desert for me was great. The pear was a little too sweet, but combined with everything it becomes balanced out. My only qualm would be the pear wasn't soft making breaking it apart to accompany the dish difficult. \n\nAll in all, the atmosphere, customer service, and food are great.  Even though I came here for restaurant week, everything in their menu is well priced. Defiantly a great place to come for some korean fusion."
    },
    {
        "id": 179,
        "text": "We were a party of 2.  Ordered the kimchee (awful), the KFC Fried Chicken - a bit too much breading and very thick on the sauce, and finally, the short ribs - the short ribs were overdone and dry, veggies ok.  We asked for extra sauce to finish the short ribs - didn't ever, that's how awful they were."
    },
    {
        "id": 180,
        "text": "Mmmmmmmmmm! So so good! Had it not been for the Philly Magazine event I wouldn't have known about this gem of a place. \nIt's a Korean American restaurant with a bar. It may not seem much from the outside, but on the inside it's super cozy with bar seating, community table and a regular tables. \nWe ordered the Hot toddy, P&p and soju as drinks and the KFC Korean Fried Chicken wings with the fries! \nThe wings were so so delicious, super crispy and flavorful, we also got the Korean beef tacos and Kimchi. I was really looking forward to tasting the bulgogi burger, but we were stuffed! \nCan't wait to go back! I hear their brunch is the bomb dot com!"
    },
    {
        "id": 181,
        "text": "This restaurant was so much fun--cozy, dimly lit, friendly, attentive servers, pleasant cocktails, varied beer list....The menu is small, but has options for everyone and the food is delightful!"
    },
    {
        "id": 182,
        "text": "I had been walking passed this place while staying at an airbnb. Then a friend suggested we meet there since she had heard good things and wanted to try it. \nPerfect. I had the Autumn salad, who would have thought a kale salad could be so delicious and filling.\nF had the tofu rice bowl and loved it. My friend had the tofu taco and said they were really good. \nI even tried their persimmon shortcake which I took home and it was still good the next day."
    },
    {
        "id": 183,
        "text": "I haven't tried Korean food before this place so they really set the bar high. We had a nice selection of appetizers and shared a bowl. Everything we had was awesome. Great flavor with mild spices made these dishes delicious. The Korean Fried Chicken (KFC) is a must have; they have both soy and spicy I would recommend both. Offers a fully stocked bar and they had mentioned that they were experimenting with seasonal desserts but they didn't have any available which was a shame. Nevertheless that just gives us an excuse to go back another time."
    },
    {
        "id": 184,
        "text": "This place was so good I can't wait to go back. I got the hot stone bibimbop with \"seafood.\" Super good but I'll probably just get it in a regular bowl next time because it was SO hot I kept burning my mouth. Also, I ordered the \"seafood\" addition and was told it came with shrimp and squid. My bowl came with only shrimp, which I kinda wished they would have at least acknowledged. It was good so whatever. \n\nMy boyfriend got the bulgogi burger and let me try a bite since it was too big for him to finish (that never happens). The burger was incredible. I want to go back here just for that. Plus it came with a sauce for the fries that was so good. They had happy hour begin at 4pm when we were still sitting there but we were told that happy hour was only at the bar. Bummer. Overall this place was great. Would have given 5 stars but the service was lacking a little. Our orders took a noticeably long time to come out, but maybe that's just because of what I ordered."
    },
    {
        "id": 185,
        "text": "What a cool idea it is to open a Korean gastro-pub!  Southgate adds a whole new menu of foods to the typical Center City pub.  I really enjoyed drinks and dinner here.  I loved the Korean version of the Citywide - here it was Sapporo and a shot of Soju.  The sweet potato fritters were more than tasty as was the Korean fried chicken.  My one complaint about the chicken was that it was supposed to be spicy.  It wasn't at all to me.  My friend's Dolsot Bibimbop looked very good and she was pleased with it.  The place looks good, service was fine ... but there was one other thing that I think is kind of annoying.  We arrived at 5:15 on a weekday.  Of course I know it's happy hour and I had checked that out beforehand online.  The hostess gave us only a regular drink menu and the waiter brought over only a regular food menu.  I had to ask for the Happy Hour menu....and when I did I got a response, \"Oh do you want a Happy Hour menu?\"  C'mon - if you have Happy Hour specials just give out the menu and don't make people have to specifically ask for it or otherwise miss out on the special offers.  Despite this, I still think Southgate is a good four-star addition to Center City Philly!"
    },
    {
        "id": 186,
        "text": "Great vegetarian bibimbop. Good flavors and good portion size! Totally worth the extra dollars for the dolsot."
    },
    {
        "id": 187,
        "text": "Beautiful, dimly lit spot. Outdoor seating during the summer. Extensive beer and wine list. Korean-inspired food. Tried the KFC with soy garlic, and short-rib steamed buns. The KFC is deep fried multiple times, and deliciously crunchy. Not a fan of the sauce, it's slightly spicy and mostly tangy. Tastes like a huge piece of General Tso's Chicken. The steamed buns were chewy on the outside and tasted like salty and meaty on the inside."
    },
    {
        "id": 188,
        "text": "I am so close to giving this place five stars! Honestly, everything we've had has been VERY good and the Happy Hour specials are great! That being said, we have only really ever eaten the happy hour food and have yet to try the entrees.  Maybe once we do, this'll be a five star review!\n\nThe house made sujo is amazing--get a flight so you can try all of the flavors! You MUST get the Southgate fries (and ask for them crispy) you won't forget it. My ONLY disappointment is that the sujo is not part of the happy hour menu. Definitely worth stopping in to try the unique Asian flavors. The cones out quickly once you order! The staff is also really great and always on point."
    },
    {
        "id": 189,
        "text": "Man, oh man, the chicken is mad good. Also beers up the wazoo, which means a lot for some of you younger folks uneducated in older person jargon.\n\nWould go again. Mind you seating is limited so call ahead."
    },
    {
        "id": 190,
        "text": "This review is limited to the happy hour. \n\nWe ordered the fried wings, radish kimchi, Brussels sprouts and cauliflower. The wings were delicious and little messy. The radish kimchi was amazing, but I love radishes a little too much. \n\n3 dollar Sapporo or add a shot for a dollar."
    },
    {
        "id": 191,
        "text": "Really good. The Korean Fried Chicken is some of the best I've had across the city. My only critique is the portions as I wished reach dish was a bit bigger."
    },
    {
        "id": 192,
        "text": "Southgate is one of our favorite neighborhood spots. Outdoor tables are 6+ feet apart, covered, and heated for up to 4 guests. Try the bibimbap bowl with tofu for a hearty vegetarian meal!\n\nIn an effort to call attention to COVID-safe outdoor dining done well and support local businesses, I have started an Instagram account @PhillyCovidDiningGuide showing the outdoor setups at restaurants! Check out my post on Southgate and others here https://www.instagram.com/phillycoviddiningguide/"
    },
    {
        "id": 193,
        "text": "I was a bit reluctant to try their korean fried chicken because philly already has bonchon and soho and other lesser known korean restaurants that offer fried chicken. The KFC concept is no longer new nor exciting in my book. But Southgate chicken was delicious. The meat was well marinated. The chicken was crispy and juicy. I also liked their beef mandoos. But the tuna rice bowl was a disappointment. Too much ginger made the whole bowl way more sour than it was supposed to. The galbi tacos were good but nothing too memorable. BUT i love their bulgogi burger. The meat patty was HUGE and cooked medium rare perfectly. Love love love! I mean the portion was good. Thanks god we all shared the food."
    },
    {
        "id": 194,
        "text": "What a great place!!!! Amazing food and service. It's definitely a great take on traditional Korean cuisine with an added twist. You have to try the K.F.C (Korean fried chicken) and the bulgogi burger ...... pretty amazing! It is definitely my first and not my last. I am going there very soon!"
    },
    {
        "id": 195,
        "text": "A group of girlfriends and I decided on Southgate for a low-key dinner on a Sunday night. We made a reservation for 7, and we were surprised that the place was packed when we arrived. We were seated immediately, and our waiter was very attentive. My friend and I split the KFC (half spicy half soy garlic), which I would definitely recommend! It's a little pricey at $12/6 wings, but the chicken was perfectly crunchy and flavorful. I went for their famous bulgolgi burger, and I was not disappointed. The seasoning on the burger was sweet, but not overwhelmingly so, and I thought the flavors all came together very nicely. I would definitely recommend Southgate if you're looking for a more intimate dinner experience!"
    },
    {
        "id": 196,
        "text": "A truly delicious and interesting brunch option for grad hospital! A neo American Korean type cuisine is what you'll find here, but the star of the show is the French fries. They are just truly perfect: crispy and soft pillowy on the inside. And they come with this delicious spicy aioli type concoction!\n\nAs for actual brunch recommendations, I loved the steak tacos. They were not too spicy but so incredibly flavorful with flavors I'm not at all accustomed to--really unique! It's a much needed break from your classic eggs Benedict and pancakes. \n\nThe ambiance itself is adorable too--classic twinkle lights and an outdoor patio feel when you're sitting inside in the dead of winter. \n\nCan't say enough good things!"
    },
    {
        "id": 197,
        "text": "Southgate is a really cute date spot, but I have very mixed feelings about their dinner menu. Their dinner menu is very limited, which made sharing plates kind of difficult. Our table of 3 ended up ordering KFC, side of fries, and 2 beef dolsot bibimbaps.\n\nKorean Fried Chicken (6 pieces for $12) in Soy Garlic:\nThe size of these chicken wings/drumsticks are impressive, but I've had better KFC. I wouldn't recommend ordering this, especially since it's $2/piece.\n\nFries (not on the menu - $4)\nThe fries were unexpectedly seasoned (a little too much IMO, it got way too salty for me) -- I'm not sure what's in their seasoning because you can see red flakes on the fries, but I didn't find them spicy. \n\nBeef Dolsot Bibimbap ($17)\nThis was my favorite dish of the night. I loved the beef -- it wasn't chewy at all and I think they marinated it. Plus, you can't really go wrong with a dolsot bibimbap. I only wished they added more rice because the rice to meat/veggie ratio is a bit off.\n\nWe were all stuffed by the time we left, but overall, I didn't think it was a memorable meal.\n\nProtip: I actually messaged them through Yelp to make a reservation (bc I couldn't get through on the phones at first, no biggie) and they responded in a couple of minutes, which was great."
    },
    {
        "id": 198,
        "text": "Food is 3 stars, service and the idea of the menu is 5 stars, hence the 4 star rating.\n\nFirst of all, I really wanted to like this place. Looking at the menu and reading the review, I was ready to give it a try. It's just... the execution of their ideas fell short. \n\nWe tried the Korean tacos and the kimchi poutine. I think the ideas were great for both dishes. But the bulgogi in taco was dry and overcooked, perhaps because the cut was too thick and had too high of a meat-to-veggie ratio. Based on what I grew up eating, bulgogi is supposed to be thinly sliced, tender, juicy, and have all flavor marinated from onion and pear. Their green sauce thing was also a bit off. \n\nKimchi in the kimchi poutine was surprisingly good. The combination of kimchi, egg, and cheese is hard to fail when your kimchi itself made well and cooked perfectly. Kudos to Southgate for that part. I think the idea of kimchi poutine is interesting and has a potential work, but their fries were way too oily.\n\nI think both dishes might work if you walk into this place expecting a greasy bar food with Korean influence. I don't know what the culinary training background of the chef here is, but his/her ideas are great, just needs a better execution. I really want this place to do well and get better.\n\nTheir service was amazing by the way - our server was David according to the receipt, who was extremely attentive (he must have poured water for us 17 times) and made thoughtful recommendations.\n\nDrink selection isn't long but decent. I loved how they have Kloud, my favorite Korean beer."
    },
    {
        "id": 199,
        "text": "delicious! first place on the mainland i've seen loco moco, and the short rib really classes-up a classic dish. The bibimbap is also fantastic. Lovely drinks and a fantastic atmosphere, great for either brunch or dinner!"
    },
    {
        "id": 200,
        "text": "We stopped in the night after Thanksgiving with a couple of friends, and we are so happy we did!  The food and cocktails were spot on! We had the wings, a mix of the spicy and the soy, which were fantastic! Definitely get them when you go. Super crispy and flavorful, a highlight. We also got 2 orders of the tacos, one beef and one tofu, both were great as well as the bulgogi burger. Everything was well prepared, fresh and delicious. The cocktails were also fantastic. The saki sangria was a particular favorite. Great little place, we'll definitely be back."
    },
    {
        "id": 201,
        "text": "This place is fantastic. The food is delicious, staff is friendly, and the mix drinks are on point. I highly recommend it for anyone looking for a Korean Fusion restaurant. The food is very flavorful. I would recommend the Korean Tacos and Southgate fries."
    },
    {
        "id": 202,
        "text": "I had a really good experience at Southgate during brunch. I initially had a table indoors but after realizing that the air conditioning was too cold for me, requested to move to an outside table. The waiter was very nice about it and quickly brought our stuff to a new table. The service was good and fast. All the employees were very polite and did a great job. \n\nFood-wise, the brunch menu has many options that are nice combinations of classic Korean and American food, and all of them are good. I'd highly recommend you to come here."
    },
    {
        "id": 203,
        "text": "Southgate has a mix of true Korean dishes as well as fusion dishes. The venue is small but cozy and the service is consistently great. After coming once, we are now regulars!\n\nLoves\n-surprise- the kimchi fries are amazing!(I'm not a fan of fusion food typically)\n-dolsot bibimbop\n-dduk mandoo guk (rotating special)\n-KFC \n\nDislikes\n-none\n\nWill be back soon!"
    },
    {
        "id": 204,
        "text": "I wish, I wish, I wish I could have loved it. Our server was fantastic! We tried a range of fusion burger to the traditional mandoo, but nothing scintillating. Was surprised to see overworked dough for the dumplings and how the crispy wings were sauced."
    },
    {
        "id": 205,
        "text": "Cute lighting and atmosphere, but food is mediocre - I've had better Korean food in the city. \n\nAtmosphere: Relatively dim, but nicely lit inside. Feels cozy and intimate, with seating for around 20-25, but definitely was on the louder side. In a group of 3 of my friends, I felt like I had to talk loudly to hear everyone else.\n\nFood: Bibimbap hot pot and vegetable pancakes were tasty - bibimbap was very flavorful, but around ~$17 with the beef - definitely on the pricier side. I've had bibimbap of similar flavor and quality in Philly, but cheaper price. \n\nOverall:  - I likely won't be back, just because I really like the other Korean food options in the city. If you're looking for a relatively nice atmosphere though, and not too crowded, this is a decent choice."
    },
    {
        "id": 206,
        "text": "Just wanted to give a quick update to my last review. I went back to Southgate and was pleasantly surprised to see an updated happy hour menu with lots of yummy food and drink options!! Not pictured is their happy hour cocktail which I had 2 of because it was so good. This time I tried the crispy brussels, bao buns, and korean spicy wings. I am being completely honest and not overblown when I say that I've never had better brussels sprouts in my life -- crispy but soft, hearty but balanced, creative in its flavors, and so warm. Seriously one of the best things I've had in Philadelphia so far. Bao buns and Korean spicy wings are also decent, but these brussels sprouts were truly one of the best dishes I've had. Also, much appreciated to the staff for being so receptive with feedback and also for their service, which is a standout as always!\n\nI'll be back :) You have a loyal customer in me!"
    },
    {
        "id": 207,
        "text": "Wow, what a unique concept for a gastropub--this is definitely not a theme that I have stumbled across before. A sleek and minimal feel for the space makes the tiny tables in the bar area feel less cramped than they actually are. There is a communal table in the back (near the open kitchen) that would benefit larger groups and the bathroom is downstairs.\n\nAs everyone else has mentioned, you ought to get the wings. Don't afraid of the hot wings--they are not so hot as to make you tear up and pack a more flavorful punch than the sweet wings. No matter the flavor, you are in for an ample, crunchy portion. The kale salad was the perfect size for two to share as a starter, and the mashed avocado made the dish. The buns were light and sweet and were a good addition as a starter to our meal. But what really stole the show was the dessert (check the specials board). We had a caramel pot de creme with peanut brittle and dark chocolate on top... I can still taste it melting in my mouth. \n\nService was fantastic and felt more upscale than the title \"gastropub\" would suggest. All of the servers I've had are knowledgeable about the drinks menu. I don't remember which of the signature cocktails I had, but it was whiskey-based, strong, and reminiscent of an old-fashioned--in a word, delicious.\n\nAn excellent place to come with friends for drinks and small plates--I'm sure I will be back again soon."
    },
    {
        "id": 208,
        "text": "When I first moved to Philadelphia, one of my objectives was to find a nice unassuming neighborhood restaurant to make my go to place. Southgate is this place. I've passed by it so many times and was always struck by the simplicity of their menu + how warm and inviting the outdoor space was, and this week I bit the bullet and went for happy hour.\n\n1) SERVICE: Great. Our waiter was impressively attentive to our table even though it was a busy night with full tables and a line for takeout. I remember barely finishing my water when he magically appeared to refill my cup. They also took precautions by wearing masks, using paper menus, and wiping down tables. \n\n2) FOOD: I had the happy hour burger of the day (kimchi burger) and southgate fries (garlic, gochugaru, gochujang aioli) to share. At first I thought I was saving a lot more, but it seems like their $16 regular menu burger includes fries whereas the $10 happy hour burger doesn't. From a happy hour perspective, you save $2 on banchan and $2 if you order the burger and fries separately. I didn't really get why the $4 mystery beer was in the happy hour menu since it's also $4 in their regular drink menu. Anyway, the food was solid. I'd describe it as Korean-American grub with a contemporary twist. The southgate fries were my favorite -- they had that honey garlicky smell that I love and there was more than enough for 2 to share. The burger was also well portioned, and I think people will appreciate the fusion element with the kimchi. However I wish there was more flavor from the patty or the cheese, since it seemed like the kimchi was the unilateral star of the show. \n\nOverall this was a great experience and I will be back to try other things on the menu. The pricing of the happy hour menu could be a little more transparent, and some of the menu does seem a little pricy, but it's a cozy place with attentive service and a no frills menu of creative but instantly recognizable food that packs a punch."
    },
    {
        "id": 209,
        "text": "Came for dinner and enjoyed the food. The restaurant is very laid back.The food was great and the wait staff was excellent. The ambiance was nice. I had several small plates and found them to all be delectable! The place was completely transformed from the prior restaurant that was there, Tangier.\n\nThe food was good. The lamb buns were great as well as a shrimp dish we tried. I also tried the kimchi but was not a fan, the waiter was great and took it off of the bill. The shrimp and pork dumplings were to die for! \n\nService was great and the food was served swiftly. This place is one I have to visit again."
    },
    {
        "id": 210,
        "text": "I would describe Southgate as a modern-style and chic Korean fusion restaurant. As a Korean-American who has grown up with home-cooked Korean meals, I have high standards.\n\nThe first thing that really disappointed me is that the kimchi was not free. All the banchan style dishes that would normally be free at a Korean restaurant were labeled as appetizers that you would had to pay for. The analogy I would make to this offense would be an Italian restaurant making you pay for bread. \n\nI ordered the jajangmyeon, which I was surprised and impressed that they offered for a fusion restaurant. The components of the sauce looked pretty traditional and authentic, but I would not say it was exceptionally delicious. It was okay. It was fine. It was also nearly $20 so that was slightly upsetting to know I was paying $20 for a specialty jajangmyeon, which is considered a take-out/fast food in Korea. \n\nMy friends got the bimbimbap, which looked pretty good, but the bimbimbap was also at mid-price range, and I feel you could get a bimbimbap dish of similar standard at a lower-priced location. \n\nIn terms of ambiance and restaurant atmosphere, it was small but cozy. I would call ahead to see if they have availability or make a reservation."
    },
    {
        "id": 211,
        "text": "I LOVE Korean food.  So when this neighborhood  restaurant opened up I was really excited (YAY!!!!!) Ate here a few times.  I was  hoping for a Korean BBQ, but no (Whomp whomp). Which is fine since it didn't advertise as so. \n\nFood was good the first time (YAY!!!!) but not  great. Went back the second time, got one of the specials, it was a disappointment. (Whomp Whomp)\n\nAlso, I was looking forward for kimchi. It's usually free at Korean restaurants, but nooooooo.. you need to buy it here. (Whomp Whomp)\n\nAnd I'm not sure why people love their wings so much. Mine was kinda dry to my liking (another Whomp Whomp)\n\nGreat cocktails though! (YAY!!!)"
    },
    {
        "id": 212,
        "text": "I really wanted to like Southgate. It's in my neighborhood and Korean food is normally my jam. But it just really didn't live up to my expectations based on the taste and price of it's food.\n\nFor happy hour, we got \n- Soy Garlic Chicken Wings (3 out of 5) \n- Gochujang Chicken Wings (3 out of 5)\n- Chicken Sandwich (3 out of 5)\n- Koreanchini (3 out of 5)\n\nWe also had some drinks for happy hour. A beer & a shot of soju for $5? Reasonable! \n\nConclusion - Southgate just didn't live up to expectations. The food is just barely above average, but too pricey. The drinks during happy hour are the only draw for me. Wouldn't go out of my way to eat here."
    },
    {
        "id": 213,
        "text": "For our first Korean experience, this restaurant knocked it out of the park. The service was amazing (thank you Evan!!!) and the kitchen was incredibly accommodating to all of our requests, especially for that of an \"inhumanely spicy\" sauce to accompany our meals. We started with the brussel sprouts, which were fantastic, and each got a bibimbap (one with beef, one with tofu); each was wonderful. We will be regulars at this location for sure!"
    },
    {
        "id": 214,
        "text": "Solid Korean food!!! \n\nSo, as sad as I was when Tangier and its cheap brown bag \"mystery beers\" left, I am happier that Southgate took its place. I walked by this place so many times without realizing it was Korean. It is. It's awesome and you should go! \n\nI got the bibimbap with tofu. The gochujang has some heat, so I recommend asking for it on the side if you are sensitive to spicy food. (They're super nice about doing that. No problem at all.) My partner got the beef sparerib noodle soup. It was very good, but mild if you're looking for something spicy. The sparerib is excellent, and totally worth trying in any dish. \n\nFull bar, and very nice tap list. Lots of cocktails to try. \n\nThe service is friendly and the perfect amount of attentive. There to refill water, take your order, and give you a check, but no interrupting conversation every two minutes."
    },
    {
        "id": 215,
        "text": "So glad we decided to try here! You definitely need a reservation if you want to come for dinner since they only offer outside seating currently. I actually really appreciate when a menu isn't super overwhelming with too many options because it usually means that the restaurant has focused on producing a few high quality items, and this menu was no exception. We ordered the bao buns and the bulgogi burger, both of which were amazing. The drinks were also on point (bold fashioned and soju punch).\n\nTLDR: you like Asian fusion you need to try Southgate!"
    },
    {
        "id": 216,
        "text": "After returning from a trip from South Korea, I just couldn't seem to get enough Korean food. I'd had Southgate in my bookmarks for months, so I decided to snag up a last minute reservation and see what all the buzz was about. I was not disappointed. \n\nWe arrived ten minutes early and our table wasn't ready yet. There was room to sit by the railing near the back which I was grateful for because it was really cold outside. I ordered the persimmon soju ($16) It came in a ceramic container with two little cups. The persimmon flavor was readily apparent, the drink was only slightly sweet which I liked. \n\nWe were seated about five minutes after our reservation time. We ordered the banchan which was brussel sprouts and pickled radishes that night. The radishes were good, but they were American style radishes. \n\nWe ordered a few more small plates to share. The star of the show was the octopus. The pieces were a little crispy on the outside and melt in your mouth tender on the inside with a creamy savory sesame sauce and spicy pineapple kimchi to give the perfect balance of heat and sweetness. I think this might be the best octopus dish I have ever eaten anywhere! \n\nThe Korean fried chicken was crispy outside and juicy inside. We got one order of spicy and one order of sweet. The chicken was good, but I prefer crispier skin in favor of crispy batter. This style was the later. The spicy was pretty weak in terms of heat, which was kind of surprising after the octopus. Don't get me wrong, it was really good, but my personal preference for KFC leans more towards what you get at Cafe Soho with the light batter and crispy skin. However, I loved the spicy Korean fries at Southgate! They were fresh and crispy with some heat from the dried peppers. \n\nI ordered another cocktail that was the special with apple brandy and an egg white and pepper. It was really well balanced. \n\nThe only disappointment that night was dessert. We got a meringue one. It was just the hardened meringue cookies you can buy in a plastic tub at the grocery store with some jam on it. Too sweet and not very satisfying. \n\nOverall, it was a very pleasant experience. Service was friendly and prompt. It was a little pricey, but since it was tasty, I didn't mind so much. I plan to return soon!"
    },
    {
        "id": 217,
        "text": "To sum up my experience in one word: AMAZING! This place was so great! I've been wanting to go for the longest time, so I'm glad I finally got a chance to check this place out. When you walk in, the spot is quaint and trendy - it  makes for a really nice date spot! The space is small, but it's not overly quiet with everyone that's in there. There's a bar with ample seating in this space, that actually happens to take up a lot of space - however, it makes the table seating much cozier. \n\nFOOD: \nKorean Fried Chicken in spicy sauce - this was amazing! I definitely recommend this. Somehow they make the skin extra crispy, like it's almost floating on top of the chicken underneath. I know that makes no sense, but when you get it you will love it. \nBeet salad - this was good. I think I would have enjoyed it more if I could have eaten the bacon that came with it. I tried a little of the vinegarette to see what I was missing and I was definitely missing a lot. \nDolsot Bimbimbap - THIS WAS GREAT! It was a rainy and cold day when we ate; the mood was somber, but this dish just warmed us both up right away! It was delicious, when we asked our waiter if it's worth it to get the sizzling dish, he said the crunch of the rice that you get with this dish is uncomparable and he wasn't lying. It was truly delicious and the crunch of the rice tied all of it together. \nBurger - our waiter told us this was voted best burger in Philly and after eating it, I one-hundo p agree. This is an amazing burger and the fries that came with it were perfect. \n\nI really wish we had had room for dessert, but it was just not happening. Oh well, guess I'll have to come back and try more! The menu is awesome, so I'd definitely come back to try something new!"
    },
    {
        "id": 218,
        "text": "Ventured to Southgate with a couple of friends for a delicious, Korean-fusion Girls' Night dinner and had a great experience. We had made a reservation and were seated right away in a crowded, cozy restaurant. There's bar seating as well as a collection of two-tops that can be pushed together as appropriate, but we wound up in the back at a large table that can seat about 10 people, so we shared our space with another group (shout out to the man next to me that night who now probably knows way more than he cared to know about my friends and me). \n\nThe drink list includes a variety of unique cocktails with an Asian spin. I decided to be adventurous and tried the featured Soju flight, which was pretty good --- I particularly enjoyed the soju with cardamom. My friends tried the Seoul Sour (which was \"more sour\" than my friend expected) and the White Sangria, which was good.\n\nFor our meal, we opted to split several of the small plates. The crispy tofu banchan had a great texture and a delicious sauce, while the eggplant was just okay. We got the Korean Fried Chicken with a mix of soy and spicy sauces, and it was incredible (thanks for the tip, Yelp!). The short-rib steam buns were delicious, and the waiter was nice enough to offer to bring a 3rd bun since the order typically comes with 2. The bassam (pork belly lettuce wraps) were flavorful with fresh lettuce and delicious pickled veggies, and the seafood pajeon pancake was enjoyable as well. My friend who has spent time in Korea overall pointed out that the food was based on traditional foods, but definitely had a unique spin --- but we definitely enjoyed our meal. \n\nI'd definitely love to go back; some of the entrees (including bibimbap and the bulgogi burger) were calling my name."
    },
    {
        "id": 219,
        "text": "Went there for Friday happy hour (4-7pm), the hh burger of the month was a great deal and was amazing! Huge burger and very flavorful. Loved the HH drink  Sapporo + shot of soju for $5! The pork belly ramen was well portioned , and the half boiled egg in the ramen was just right. Will come back again to try out their dolsot bibimbap next time!"
    },
    {
        "id": 220,
        "text": "If I could give South Gate 10000 stars I would. It is an absolute neighborhood staple that is consistently delicious. The hot stone pot is perfection, portions are great, and the service is always wonderful. They are very accommodating to vegans and vegetarians as well. 12/10 recommend."
    },
    {
        "id": 221,
        "text": "Yum! Perfect for a cold winter night! Cozy little restaurant with delicious food. We split the kfc Korean chicken wings which are really some of the best wings in town. Then we each got a bibimbap in a hot stone bowl and added tofu. The serving size was huge and had enough for lunch the next day. The price is very reasonable, and they also have a great happy hour menu (with drink AND food specials)."
    },
    {
        "id": 222,
        "text": "Awesome food. Modern take on traditional dishes. Bartenders create fabulous drinks. One of Philly's best."
    },
    {
        "id": 223,
        "text": "Went here for brunch today and it was empty which was a real shame, 'cause it's really good. The brunch offerings are fusion twists on the classic american brunch and everything was tasty. Ordered the bulgogi buns to start which were rich and flavorful. Got a side of the cucumber pickles which were more along the lines of traditional kimchi but the zucchini offering were almost tempura batter fried zucchini in a sesame kimchi sauce - delicious. \n\nFor mains, we had the korean fried chicken sandwich which came with a taro-fry esque french fry as well as the korean fried chicken with green tea waffles - excellent. The Dolsat bimbimbap was traditional but a nice version of this classic dish. \n\nWe didn't even have booze and they are known for their cocktails. Highly recommended tor brunch."
    },
    {
        "id": 224,
        "text": "I tried this place when I was spending the weekend at my boyfriend's house and he suggested we order it. We ended up ordering the bulgogi burger and Korean fried chicken. \n\nThe burger looked really good, but I only tried the fried chicken. The chicken was incredible, so flavorful. The chicken was so crispy and prob was the best chicken ive had. \n\nI would order from this place again."
    },
    {
        "id": 225,
        "text": "I went to Southgate with a friend one evening on a whim and boy, was I blown away. Southgate is a small, unassuming Korean-fusion gastropub on the corner of the street. The inside was dark, cozy, and intimate, with many small tables lined up side by side parallel to the bar and an elevated communal table at the back of the restaurant for large groups of friends. The overall atmosphere was relaxed and casual. The food was amazing. \n\nMy friend and I started our meal with the octopus dduk kochi. It was $14 for 3 skewers so a little on the pricey side, but the skewers were worth it. The combination of fatty pork belly, chewy dduk, and perfectly grilled octopus drizzled with a sweet, but savory sauce was delicious. We then tried the dolsot bibimbap, almost like a Korean fried rice/salad, which was also very good. Though the size of the bibimbap was more than adequate, we were still hungry and so ordered the kimchi fries. Oh my god- they were everything you'd want with loaded fries. The fries were crisped to perfection and topped with a combination of kimchi, bacon, onions, cheese, and scallions. What impressed me the most about the dish was that the \"toppings\" were spread throughout the dish! Every fry was coated with flavor and we never ran out of the topping. It was the best spin on poutine I've ever had. All in all, a phenomenal dining experience and one I'll be hitting up again soon hopefully."
    },
    {
        "id": 226,
        "text": "Southgate's Korean fusion is interesting and has some bright spots, as well as some duds. The banchan and the crispy brussels were amazing, and the \"kfc\" fried chicken was delicious, too. Unfortunately, the ssam was just so-so and felt a bit overpriced. We came here for restaurant week and got a lot of variety, but still at just a mediocre value. I'd recommend over-indexing on the appetizers and small dishes and maybe just getting one main dish to share."
    },
    {
        "id": 227,
        "text": "Another pandemic review, my wife and I were looking for a bit of Korean flare and heard great things about this bar. They have a few picnic tables outside, but we grabbed food to go. They have a fairly small menu, but execute their specialties well. \n\nWe got the Soy Korean Fried Chicken, Pork fried Mandu's, Bulgogi Burger, and Seoul Hot Chicken Sandwich.\n\nThe Korean fried chicken was crispy, moist, and had just the right amount of sauce to coat it. Great start. We ordered the Vegetable Mandu's but received the pork, nothing special, but they executed them well. \n\nNow, the Bulgogi Burger is why I came. I had never had Bulgogi in burger form so I was excited. Now this was the winner, that meat was so flavorful, cooked a perfect medium, and sooo juicy and the pickles and mayo were delicious to round it out, that bun was buttery and soft. \n\nThe Hot Chicken Sandwich was also great. Not as good as the burger, but that's hard to top. The thick cut fries that came with both entrees were a nice addition. Overall:\n\nKorean Fried Chicken 5/5\nPork Mandu's 4/5\nBulgogi Burger 5/5\nSeoul Hot Chicken Sandwich 3/5\nFries 5/5"
    },
    {
        "id": 228,
        "text": "One of our favorite meals in Philadelphia. My wife is Korean and has specific taste for Korean food, and she was blown away by how good everything was. She got the Bulgogi burger and I got the Seoul hot chicken sandwich and both were awesome. The fries were really good too. I would highly recommend the mystery beer, as it was only 4 bucks and turned out to be a really good beer, although I'm sure it's probably different every time. Mine was definitely more like an 8 dollar beer though. The server was awesome as well, and we can't wait to go back!"
    },
    {
        "id": 229,
        "text": "First time at Southgate for brunch!\n\nFor appetizers for the table, we ordered the Kimchi Poutine (spicy fries, cheese curds, kimchi, pickled chili, smoked bacon vinaigrette) and the Kimchi Deviled Eggs (kimchi, yuzu salt). The latter were terrific: a little zesty, a little spicy, and smooth. I'd heard a lot about the Kimchi Poutine, so my expectations were high. I was underwhelmed--if the fries were crispier, they might've held their own against the Kimchi Poutine, but it all blended together into a tasty, but not textural mass.\n\nThe Short Rib Loco Moco (braised short rib, poached cage free eggs, fried shallots, white rice) was fine, but not memorable. I'd definitely recommend the Dolsot Bibimbap over the Short Rib Loco Moco for a more flavorful, textural experience.\n\nA fellow diner had the Korean Fried Chicken (double fried chicken wings, sesame seeds, scallions) and noted that the dish holds up as consistently good fried chicken."
    },
    {
        "id": 230,
        "text": "Amazing atmosphere, great alcohol and servers, and especially bibimbap. Hope you guys will be alright through this pandemic!"
    },
    {
        "id": 231,
        "text": "Southgate has a super cute vibe and a menu that's easy to follow! We got the Southgate fries that were delicious and felt like an Asian-style poutine. They have gochugaru seasoning that I wish was honestly a bit stronger, but the fries were a big portion/filling, and made with thick cut fries that were delicious to eat hot. \n\nThe fried vegetable dumplings were also delicious and since the food was brought out hot, it made the meal even more satisfying. \n\nThe tofu bao buns were light, but compared to the other two small plates I would prefer getting the fries or dumplings instead. \n\nThe shrimp dolsot bibimbap came in sizzling. Which it was piled with vegetables, a fried egg, and gochujiang, it was not my favorite part of the meal. It is a hearty dish, but I was more impressed by the appetizers than the bibimbap."
    },
    {
        "id": 232,
        "text": "My first experience at Southgate was probably atypical.  I got to sit and a slightly higher table, right next to the kitchen and eat all of the things.  The food and beverages were top notch and I just felt very lucky to be there.\n\nI'll just get right to the hits.  Between the KFC and the beef tartare my palate was thrown toward different ends of the spectrum in both flavor and texture.  Presentation wise the tartare won but that was in look alone.  Both dishes were equally delicious.  The tartare felt very precise to me and that made it slightly more impressive.\n\nThe pork bossam and the skirt steak were just heavenly.  Thankfully I was able to get the group to agree on the octopus and the beet salad for some lighter options.  I could have easily sat there and continued to chat and stuff my face with this insanely delicious food.\n\nEver since that meal I haven't been out a great deal due to a new little one at home.  Suffice to say when I get a chance to go out again, I'm making a bee-line for Southgate.  The food here was that good."
    },
    {
        "id": 233,
        "text": "I've walked by about a hundred times without stopping and finally made reservations for happy hour. Ordered the beer and burger deal off the happy hour menu and thoroughly enjoyed it. I would have liked having a few more food items on the happy hour menu but will likely be back to order the regular items at another time. Curious to try more."
    },
    {
        "id": 234,
        "text": "Solid 4-star, only because I merely did not quite try enough to bump them up to 5-star (yet)...\n\nCame here with CP a few days prior to Turkey Day (i.e. Thanksgiving) to give them a test run.  We each had some food and drinks.  The bartender was happy to describe the drinks on the menu and help guide selection.  The P&P I had truly hit the spot and the tacos were filling without being heavy (if that makes any sense).  We did not try to wings, as described in so many other reviews.  They looked awesome, friends say they are awesome, I will confirm during a future visit.\n\nThe wait wasn't outrageous, but we found seats at the bar.  The hostess was willing to move us to seats once they opened up, but we decided to stay put.  I wouldn't call the atmosphere unique, but it still very nice yet a bit tight.  Therefore, I would probably recommend reservations in advance for a larger group.  Otherwise, more details will come as I try more...  And I will be trying more!"
    },
    {
        "id": 235,
        "text": "Yummm! I made reservations for me and my friends for dinner Friday night. Right now they are doing outdoor dining only which is fine! They had a cute little outdoor set up. We were promptly seated and ordered our food since we were starving.\nIt was the tail end of happy hour so I also ordered the soju punch before it ended. I didn't care for the drink I got but drank it since it was only 8$. For food I started with the soy fried chicken appetizer. Then for my entree I got the bulgogi burger with fries.\nThe appetizer came out and omg there was so much chicken. It was all crispy and juicy! The sauce was really good too :) My bulgogi burger came out and it was pretty messy to eat but had a good bulgogi burger. It was slightly overcooked but other than that it was still really good. They give you a mountain of fries with the burger which is great! My friends got the tofu bibimbaps (vegan and vegetarian friendly!) And my other friend got the spice pork baos and the seoul hot chicken sandwich. Everyone enjoyed their meals and we were happily full. I had tons of leftovers after  :) great place! Can't wait to come back and try more items."
    },
    {
        "id": 236,
        "text": "My friend and I came here for brunch last week and had a great experience. Our server was the right amount of attentive and the aesthetic of the restaurant was Instagram worthy.\n\nWe ordered the korean fried chicken and waffle and the short rib loco moco. Both of them were really good and a nice break from your typical brunch options. The korean fried chicken was served with green tea waffles which were the perfect balance of macha and waffle without being overwhelming. The short rib was super tender and melts in your mouth. \n\nI recommend this place for people who love brunch but want something a little different. Southgate does a great job of combining brunch with Korean flavors!"
    },
    {
        "id": 237,
        "text": "This is a super cute restaurant in Rittenhouse square! The food is Korean with a tapas twist to it. The menu looked amazing so we got a few items to share among 3 people: \"KFC\" (Korean fried chicken ), lamb steamed buns, bibimbap - hot stone and a side of the Brussel sprouts. The fried chicken was to die for - absolutely cooked and seasoned to perfection. That was definitely the table favorite. The second favorite was the dolsot bibimbap - which came in a sizzling hot stone and sauce on the side to stir in as your food cooks in front of you. Note the sauce is a little spicy so if you have zero tolerance for spicy food like I do consider opting out. It was still perfect without the sauce.  The lamb buns I was not a huge fan of only because they were really spicy and I did not have any warning before I ate them. Again if that's your thing go ahead and order it! Overall the food, service and ambiance was great - definitely go check it out."
    },
    {
        "id": 238,
        "text": "Amazing find! Picked Southgate from looking at Yelp reviews and it did not disapoint! We started with the KFC wings after reading such great reviews and they definitely lived up to the hype. We had the spicy and they were not overwhelmingly spicy at all just full of flavor and a crunch like I've never seen on a wing. Next, we had the beef tartar and it was incredible! The sauce was perfect and the quality of the beef tasted like a top steakhouse. Finished up with the korean steak tacos and they were even better than everything else! The marinade on the steak made it melt in your mouth and the garnishes were refreshing and not overwhelming. \n\nService was great with very friendly hosts and waitstaff. We missed happy hour but will definitely be back next time!"
    },
    {
        "id": 239,
        "text": "I went here recently with my wife and son and we were all extremely pleased with the food, ambience, and service. My son loved the bulgogi burger. He couldn't put his finger on what made it taste so good, but he loved it. Much of our meal was like this. Dish after dish, we were pleasantly caught off guard by the unusual flavor profiles. I would recommend the fried chicken appetizer, the bulgogi burger, the tuna hwe, the pork buns, and the misugaru shortcake for dessert. The sake punch was great too. We left stuffed and happy. It was truly a great meal. I can't wait to go back to try the rest of the menu."
    },
    {
        "id": 240,
        "text": "(To the tune of \"Starving\" by Hailee Steinfeld)\n\nYou know, I'm so hungry\nMy stomach's rumbling, \nI need something tasty\nOr else I'll be tumbling\nThe more that I have read, the more I want to\nCheck out Southgate tonight\nAnd finally try that bulgogi... burger......\n\nI didn't think that I was starving, 'til I tasted you.\nEating like an animal, just bring me back to Philly's Zoo\nBy the way, by the way, these wings taste oh-so-naughty\nI didn't think that I was starving, til I tasted you.\n\nYou know just the right flavor, bring me higher\nElevating dishes. Made me a sigh-er.\nFeel like I'm melting into my seat right now.\nSpicy Brussels sprouts, Zing....\nChecked out Southgate last night\nAnd finally tried that bulgogi... burger......\n\nI didn't think that I was starving, 'til I tasted you.\nEating like an animal, just bring me back to Philly's Zoo\nBy the way, by the way, these wings taste oh-so-naughty\nI didn't think that I was starving, til I tasted you.\n\nGREAT burger. Truly terrific. The wings nail it on texture and flavor, and six were plenty as they're big and meaty. Fries were unremarkable. For our \"side\" we got banchan, which is a rotating seasonal side duo. Brussels and radishes, both spicy, both fantastic. Left feeling satisfied but not STUFFED as the pair of split the burger, wings, and sides. \n\nChairs weren't terribly comfortable and, maybe a pet-peeve, but I HATE when tables are like iron grates (which their outdoor tables are). Makes any potential spill a hazard to your pants/shoes!\n\nTop notch meal, though not SO amazing that I'm rushing back. Would recommend, though, especially if you haven't tried."
    },
    {
        "id": 241,
        "text": "This is a place that I'm sad that I didn't come to sooner. I came for brunch and it was awesome. \n\nThe food was super tasty, the vibe was fairly trendy, and the service was just the right amount of attentive. \n\nWe got the short rib and tacos and both dishes were very tasty. The mimosas were also reasonably priced. \n\nA cute neighborhood place that I'd like to come back to have dinner or brunch at! Definitely check it out."
    },
    {
        "id": 242,
        "text": "I was excited to try Southgate since there aren't many Korean places in Philly, but I would say it was just okay overall. We shared the steamed buns and each got our own Bibimbop, the one that comes in a hot stone bowl. It was the perfect amount of food, the combination of veggies in the Bibimbop was great, and it was nice a warm for a rainy night. However, the steamed buns were not what we expected, as they barely had any filling and the sauce was too salty. The Bibimbop could have also had much more flavor, and even though it was served in a hot stone bowl the rice never got a little crispy, which is one of my favorite parts of this dish. \nThe service was also just okay. Our server poured water so that it splashed constantly, and when clearing out other drink glasses spilled water on the table and didn't seem to notice. The hostess also made everyone leave their umbrellas at the front of the restaurant, which is reasonable, but when I went to leave my umbrella was gone, and the hostess was ambivalent at best. \nOverall, the food was okay, and the service was just okay, so for the price I most likely will not be returning."
    },
    {
        "id": 243,
        "text": "I'm surprised I haven't reviewed Southgate, as it has been a favorite of mine since it opened. I recently ordered my 2 favorite dishes for delivery. I ordered the bulgogi burger and Korean fried chicken (KFC). Both arrived in the same delicious condition as they are in the restaurant. \n\nThere is no burger in the city quite like the bulgogi burger. It's a juicy burger that seems to be infused with the bulgogi seasoning, whatever that is. It has pickles on top and some kind of mayo on a sesame seed bun. The flavor profile of this burger is unlike anything else in the city. I love it!\n\nThe KFC wings are so crispy and so delicious. You can get them with mild or hot. I go with mild. You can't eat just one. Once you get started you will have to clean the plate. I actually got two orders of wings to share with my girlfriend. I knew one would not be enough.\n\nOn my previous visits I've tried the korean tacos, dumplings, and fries. I remember enjoying every dish, but the burger and KFC stand out. The waitstaff has always been friendly as well.\n\nThis review is long overdue. Southgate has been a 5 star restaurant since it opened and I'm glad I can order their food during this pandemic."
    },
    {
        "id": 244,
        "text": "What a find! Prior to trying there Korean Fried Chicken the best KFC chicken I have had was at Andy's Chicken on South Street. This KFC tastes healthier and is rockin!\n\nI had the Soy KFC however after rereading their menu I see you can order both Soy and Spicy combined, I thought you had to choose one option, good to know for next time.\n\nThe $8 dollar French Fries were a giant failure and I had to throw out over half the order, way too much seasoning on fries for me but if you like alot going on with sauces on your fries maybe you will like. I wish they had an option for a more basic fry hint hint SOUTHGATE please add this option to your menu ; )\n\nLastly, I ordered the crisy tofu side item for $4. The order came with only three pieces however this was soooo good. It really blew me away and I almost wish I didn't find it as I see my self ordering take out from this place just to place an order for several side orders of there crispy tofu!\n\nApparently, this place has a brunch menu which includes Green Tea Waffles, sausage, egg, and cheese dumplings whatttt!! I will be back here in less then a week for sure!\n\nThis review has the most exclamation points I have ever used describing a restaurant btw - try them NOW!\n\nAs always people SYOY!!!"
    },
    {
        "id": 245,
        "text": "Ate at Southgate on a Wednesday night, and they were crowded. Even though my friend and I had made a reservation, we still ended up waiting approximately 15-20 minutes for a table. The place is dimly lit, crowded and offers a variety of Korean and Asian fusion dishes. \n\nWe started with their Korean Fried Chicken \"KFC\" and had half soy garlic and half spicy gochujang sauce. They were delicious! Crispy on the outside and the meat piping hot and tender. My friend ordered their dolsot (hotplate) bibimbap with tofu and I ordered their bibimbap with beef. The portion size was large, presentation colorful, and absolutely delicious. \n\nService was a bit lacking, but could be due to how busy they were. We found ourselves waiting for a table even though we had a reservation, waiting for our check, and waiting for boxes. Our waiter did box up our leftovers for us, but swapped our boxes. We didn't check so the next day, we ended up with each others leftovers."
    },
    {
        "id": 246,
        "text": "We went here for happy hour during covid and only outdoor seating was open, but it was tented to block the wind and there was a heater which kept us warm. The best thing we had by far were the southgate fries. They were coated in a spicy sauce and came with a spicy aioli on the side. We also got the wings which I felt left a bit to be desired. They were definitely crispy but the flavor was mostly soy and not very spicy even though we ordered the spicy ones (so I actually think they got our order wrong looking through other people's pictures if the wings on yelp). We also ordered the bao buns (pork and beef) on happy hour which were fine but not amazing. I think they needed more sauce or something to give it more flavor.\nReally the fries were the main selling point here.. torn between giving a 3 or a 4 for overall rating as we think it really was about a 3.5. Service was pretty good and definitely liked the Saturday happy hour."
    },
    {
        "id": 247,
        "text": "The waitstaff here is on top of things. Apologizing for long wait times and constantly topping off our drinks. \n\nThis is the second time I have been here. Once for brunch and once for dinner. \n\nWe started with the potato ban chan, Korean fried chicken, kimchi pancake, beef jap chae, black sesame cheesecake, and peach panna cotta.\n\nThe portions here are all very tiny. I would recommend one appetizer, one entree, and one dessert per person. \n\nThe potatoes were nice and soft. Slightly sweet and salty. The perfect way to start off the meal. \n\nThe Korean fried chick was good as well. We got half soy and half spicy. Nice a crispy and the meat was cooked all the way through. I wish there were more wings but oh well there are other places for that\n\nKimchi pancake was one of the best I have had. Small and savory. Perfect. \n\nThe beef in the jap chae was dry like beef jerky and also had no flavor at all. The other ingredients in the jap chae were tasty. Lots of veggies. It felt healthy to eat!\n\nThe peach panna cotta was light and squishy. Almost jello like consistency and the peaches ere sweet and the oatmeal/granola was nice a crunchy. \n\nThe black sesame cheesecake was single handily the worst dessert I have ever ordered. They must have forgotten to add sugar. It tasted like something I would spread on a bagel. Detestable. If I planned on ever coming back here I would have complained about this dish to my server. But I ain't coming back. Please take this dessert off the menu and fire your pastry chef immediately."
    },
    {
        "id": 248,
        "text": "I highly recommend their korean fried chicken and bulgogi burger! Safe and clean.  Support local business!"
    },
    {
        "id": 249,
        "text": "Came here for happy hour on an early weekday. Cool and classy vibe with very friendly staff. The decor is a combination of pre-modern rustic with a dimly lit setting. Happy hour menu was solid but we just ordered beers from a good list. The beer that my wife wanted was kicked and they gave her the next keg up on the house which was super nice. It ended up being an 11.9% barrel aged stout...lolz. will definitely be back for food!"
    },
    {
        "id": 250,
        "text": "The food and staff we're all amazing. We visited this restaurant when we were last in Philly and were back in  Philly again and can't wait to eat at Southgate for dinner this evening! One of our new favorites!"
    },
    {
        "id": 251,
        "text": "This is a pretty good spot for a blend of Korean-American food at a mid-price level. Service was solid and attentive. Everything came out in a timely manner. It can get busy and loud so keep that in mind when deciding when to go. It is a bit tight in there as well. \nFor the food, I really enjoyed it. I got the Korean Tacos and Fish & Chips. For the price, it was definitely on par and maybe even better than I expected. I would definitely go back and try other dishes they have to offer."
    },
    {
        "id": 252,
        "text": "I could eat Southgate's spicy Pickles and eggplant sides all day , everyday.\nMemorable meal at reasonable price makes Southgate a favorite in my book. Perfect for a non-pretentious night out with top notch food ; the place has a lovely neighborhood vibe."
    },
    {
        "id": 253,
        "text": "Southgate rocks!!!! Consistently offering the best Korean BBQ around. Standard go to is the Bibimbap or Hot Stone Pot paired with an appetizer such as the wings, Brussels sprouts or spicy pickles. They also offer a diverse craft beer and cocktail list to sip alongside dinner. This place is delicious!!!!  The daily happy hour menu is a great add on to check out."
    },
    {
        "id": 254,
        "text": "I've visited Southgate on two separate occasions. Once, after work for a beer and wings. A second time for restaurant week with a group of six. I'll definitely come back during HH for the wings (I believe $5 or $6 at that time) and a beer.  I've only had the spicy korean wings but they were great. \n\nThe second visit with the group was underwhelming. I had the potatoes, spicy cucumbers, wings, the galbi jjim and the black sesame cheesecake for dessert. Many in the group shared that the food was inauthentic and the galbi jjim was pretty dry. I wouldn't go again for the price of restaurant week with what they were offering. (For example, the bibimbap was being served without protein and not in the stone bowl). The saving grace was the wings.\n\nA better bet during HH or for a quick bite."
    },
    {
        "id": 255,
        "text": "Super solid delivery experience from Southgate last weekend! Though my husband and I have been to the restaurant plenty of times, it was our first time trying delivery. The restaurant did an incredible job wrapping everything securely, and the time between placing our order and receiving it was really quick! \n\nWe started with the KFC (spicy) and the pork dumplings. My husband loves dumplings and I was lucky to snag one. Southgate's were very tasty and I really liked the dipping sauce. The KFC was delicious, as always. \n\nI stayed consistent with my main and got the Seoul hot chicken sandwich, with fries. It was delicious and definitely spicy. My husband had the pork ssam - I didn't try it but it looked great. Can't wait until we can enjoy a meal at the restaurant again but, in the meantime, I'm happy to know we can enjoy the same delicious food at home."
    },
    {
        "id": 256,
        "text": "I love this small shop! The cocktails are great and I highly recommend the wings!! They also had a cheesesteak bun on special that was incredible. I am a repeat customer and still impressed"
    },
    {
        "id": 257,
        "text": "Kudos to Michelle C for tipping me onto this Asian fusion joint with her review during the early stages of COVID. It took us a minute to get to 18th and Lombard, but our first meal didn't disappoint.\n\nSouthgate doesn't try too hard with an overwhelming menu, but the balance of it will appeal to carnivores, vegetarians, and those who seek some mild spice in their palette. My GF and I ordered two waves of three small plates, devouring just about everything. Favorites included the KFC wings, Brussels, veggie dumplings, and most prominent, the spicy pork Bao Buns. Pillow soft bun, shredded pork, acidic pickles and spicy sauce - spectacular.\n\nOur server, Evan, was solid and our tab was more than reasonable for all we ordered. Great Friday night date."
    },
    {
        "id": 258,
        "text": "Beware the chicken sandwich! This place has very interesting dishes, but beware of that chiken sandwich. As someone who has tried the hottest of the hot and the spiciest of the spicy, I was blown away by this sandwich. Those of us who got it were crying and sweating, our skin was burning and we couldn't really taste anything because of how overwhelming the spice was. We asked the waiter if that was normal and he said we were not the first people to ask that that evening and maybe it was just extra spicy that night. Whatever it was ,it wasn't really enjoyable. \n\nThe only thing I really liked from the dinner was the kimchi fries. We sat outside and the ambiance is nice. The staff are nice too, but I'm not racing back."
    },
    {
        "id": 259,
        "text": "I got the bulgolgi burger, and it was quite delicious. I also got a yakult cocktail. That was a bit strong (don't drink and ride your bike!), but tasty! Unfortunately, because I was one person, I couldn't get a seat outside, but the seat at the bar was not bad. I would come again, given the chance."
    },
    {
        "id": 260,
        "text": "After hearing about the bulgogi burger, the husband and I decided to come here and check it out.\n\nThe place is a little cramped, but still had a nice feel and look to the place. Even the bathroom is pretty snazzy. That's probably why it seems to be a popular date spot - there were quite a number of couples there clearly in the early stages of dating (success to my left, awkwardness to my right).\n\nThe service is top-notch. Our waiter was amazing - extremely friendly and attentive.\n\nFor dinner, we decided to split an order of the Korean Fried Chicken wings and then both ordered the bulgogi burger. The chicken wings were crispy and seasoned really well. A great start to the meal. The bulgogi burger, on the other hand, probably could have done with a bit more marinade. It wasn't bad by any means, but it just tasted like a regular burger. I didn't get even a hint of the kind of Korean marinade you would associate with bulgogi. So, that was kind of disappointing. At least it was pretty big. Maybe it was because the chicken filled us up, but we were absolutely stuffed by the end of the meal - we probably should have just split a single order of the bulgogi burger with the sheer size of the burger and amount of fries.\n\nStill, it was a nice dining experience. It just wasn't particularly memorable. Well, except for the poor couple to the right of me. Better luck next time, fella."
    },
    {
        "id": 261,
        "text": "Ladies and Gentlemen, children of all ages of the Yelp world lets get this review rolling !\n\nFirst let me just say this place is down right awesome in the gastropub scene. Great food , great service, down to the choice of beverage. Ok so you might want to get ready to love thy neighbor while you're in Southgate. What I mean by that is, it is tight quarters, so get ready to see and smell what they ordered. Along with that you'll hear everyone's business , with it being small. \n\nI met up with some Yelpers that evening which is always a fun time, so we'll call it a mini UYE. The first thing that was mentioned was \"Get the Wings\"! Who am I to turn down wings, it'd be Un-American if I did. I am a wing fan, and I am telling you , these are some of the best wings to be had. Big meaty wings, that would make Popeye's, KFC,and Crown go back to their drawing board.  \n\n-Korean Fried Chicken~ A.K.A. \"KFC\" is what you'd say to your server, plus it even says is on their menu. Don't worry though, this isn't a Colonel Sanders recipe kiddies , so get ready to wipe your mouth. This is what you'd expect to bite into, now get ready for a crispy double fried wings with your choice of sauce. You can either go with their soy garlic or spicy gochujang, we  rocked out the gochujang as our option. UHHH-maze-ING\n\n-Mandoo~ I know everyone knows what a dumpling is, and I am sure we all are saying \"its a dumpling\" what is so special about it. My friends, I said the same thing until I tried it, and yes it is a dumpling. The Mandoo is a fried beef dumpling, over a creamy  eggplant type of puree. To simply put with one word, three syllables which is De-Lic-Ious... Delicious.\n\nThere is so much more that I wanted to peruse, like their Bulgogi burger and their Bibimbap where this also had my mouth watering.  So besides the food being awesome, their cocktails and craft selections are just as good. I really, and I mean I REALLY enjoyed their Southgate Citywide Special. A great concocted blend of Sapporo with a shot of Soju that will make you order one after another. Careful though, it maybe subtle, but this will come up on you like a freight train if you have to many.\n\nIn all the server was on the ball, the food is great, and the beverages are on point. What else could anyone ask for? Minus the size and the closeness of everyone, Southgate is a great spot to visit. I know I'll be back, get that KFC ready!"
    },
    {
        "id": 262,
        "text": "I'm a big fan of this place--- more specifically their Korean Fried Chicken (KFC) Wings! They have this amazing crunchy exterior along with its flavorful glaze. It's tangy and spicy and overall delicious. It really is something you need to experience firsthand! Come for the wings, stay for the atmosphere! \n\nPlus: they have happy hour!"
    },
    {
        "id": 263,
        "text": "I was visiting from out of town. My host asked what I wanted for dinner. I said maybe Asian? Or a gastropub? She delivered with Southgate, a Korean gastropub!\n\nAs common in Philly, the space is narrow and cozy. We were seated near the door. It was super warm, snug, and loud, which isn't necessarily a bad thing. It took us time to decide what we wanted. I think the server maybe got distracted with other tables when we weren't ready right away. It all worked out in the end. \n\nDrinks: man from nowhere (server said this was the Staff favorite) - nice balance with a Smokey spice behind. Handmaiden - tartness up front. Both enjoyable. \n\nFood: Kimchi (exactly what you'd expect), KFC half and half (crispy coating. spicy is spicy! We both favored the soy and ginger), short rib steam buns (yum but a little dry), and tofu hot stone bimimbap (total comfort food. The same food as the other bimimbap but the hot stone adds a crispness to the rice).\n\nGive it a shot. Snuggle in. Enjoy the experience."
    },
    {
        "id": 264,
        "text": "FYI: Their large plate portions are definitely LARGE so if you have a smaller stomach, I'd probably consider splitting one.\n\nRestaurant Week introduces us to beautiful things once again.\n\nPROS: Flavors are definitely there. Everything tasted amazing and was all very nicely seasoned. Their take on Korean-American fusion food works beautifully, and we enjoyed every plate of our five course meal. I got really excited since they had grapefruit soju imported from Korea, which I freakin love. Though I would have to say, the star of the night was 100% the bulgogi burger. Oh my goodness, that burger packed a punch. The cut of meat of thick and juicy and tasted incredible with the sauce inside. It was also cooked exactly to the medium rare I requested. The fries were delicious and had some extra seasoning that we both really enjoyed. Their matcha creme brulee was also amazing. The matcha flavor was pretty intense but I usually like my green tea/matcha flavored desserts on the strong side. Their Restaurant Week menu is probably one of the most expansive ones we've ever seen, but we're so glad that it was so we could try a bit of all their popular items. Their usual prices are also not outrageously high either so we'll definitely be back.\n\nCONS: I sort of wished they gave some rice with their banchan or marked somewhere that you can take your time and eat it throughout your meal since people who don't usually eat Korean food would've probably tried to eat an entire thing of kimchi or daikon before they served the next course. Also, the burger is pretty messy to eat since it leaked meat juices the second I picked it up."
    },
    {
        "id": 265,
        "text": "So good! Ate outside and good experience with heaters and seating. The wings are SO GOOD. I will deff order them to go again. We got dumplings and the tofu bao buns really good. Wine was great as well"
    },
    {
        "id": 266,
        "text": "Really good food and a nice beer selection. Service was attentive. The Octopus Salad and bibimbap dishes were fantastic. One of the best octopus dishes in Philly."
    },
    {
        "id": 267,
        "text": "My ongoing saga for good, mildly authentic Korean food in Philly continues as I attempted Southgate a few months back (listen, 2017 was a hard year!). Now, I have -never- had success with any place that sells both fried chicken and bibimbap, but you have to give everyone a fighting chance.\n\nThat being said, my boyfriend and I dined al fresco on the tiny streets of Grad Hospital with a soy garlic happy hour appetizer, which were appropriately crunchy and sweet. The only fault was the whopping 3 wings on the plate for the price, but I'm not bitter considering the atmosphere. I also urged him to try out soju, so we split a bottle of Cham, or I guess it's Charm...romanization is weird. I've never had this brand out of the US but it's like a cross between Choeum Cheoreom and Chamiseul: not bad, not great.\n\nOnto the entrees. I gave into the temptation of a steak dolsot bibimbap while my boyfriend bravely (read: naively) ordered jajjangmyun. The bibimbap was about what I expected, but I respect no establishment that doesn't give me the bottle of bibimbap sauce because it needed way more than what they gave me. The jajjangmyun was as disappointing as expected, with hardly any noodles, the sauce on the bottom, and the bonchan used as a garnish (and not even all that nicely). The flavor was kind of there but meh, needed salt.\n\nHopefully Southgate has improved over the months, since this was in August. I'll be back soon!"
    },
    {
        "id": 268,
        "text": "Heard great things about this place so I decided to finally try it out. Ordered the small plate of soy garlic Korean fried chicken as well as the bulgogi beef bao buns. The soy garlic was delicious and the chicken was very crispy. However, the chicken itself was overcooked and a bit chewy. As for the bao buns, they were perfectly fluffy. The only downside was the beef was a lot tougher than what you'd typically expect of bulgogi. Overall, I'd want to come back as the flavors were certainly there and I hope the next experience is even better"
    },
    {
        "id": 269,
        "text": "Cool atmosphere inside, friendly service, quick food delivery and the food is good. I got the veggie dumplings, spicy cucumber and southgate fries, and a decent drink selection. \n\nSurprised they're not busier! If you're in the area it seems like a great place for happy hour and a place where you can actually hear your friends talk at dinner."
    },
    {
        "id": 270,
        "text": "Updated menu to reflect COVID restrictions, but same great food! I've only done pick up, but saw that they have outdoor seating as well."
    },
    {
        "id": 271,
        "text": "Let me start by saying that despite the delicious food, the wait was deplorable. We arrived at 8, ordered by 8:15, and received our order of Korean fried chicken at 8:30, which was fine. And all was going well. Then we waited about an hour for our main entrees which were the bulgogi burger and the tuna rice bowl. Even when the waiter said the food wouldn't only be a few more minutes, it turned into another half hour. I'm not sure what goes on in the kitchen but this is completely unacceptable. We could have eaten 5 dinners in the amount of time it took to get our food. What a shame, because we did enjoy the food. Next time, we'll come at 5pm so we can eat by 8pm.\n\nAt least the 3 refills of water we got during the entire 2 hours was nice and luke warm...."
    },
    {
        "id": 272,
        "text": "Service is good . The place is super small but the service is exceptional ! The food was delicious. I recommend the fries . The bartender was so sweet and knowledgeable. Definitely going back , this was my 3rd time there . They also have the best wings"
    },
    {
        "id": 273,
        "text": "Okay so we have been coming here for a long time and always liked the food, service, and vibe.  Easier parking options around and my kids liked it as well.\n\nThe last two visits, the food has gotten noticeably salty -- every single dish has too much salt, and I think the chef is a heavy smoker and can't taste the food."
    },
    {
        "id": 274,
        "text": "This was my second visit to Southgate, first since the pandemic.  My kimchi fries and pork bao buns were delicious!  \n\nI was hoping for a good experience after a recent  bad experience at a different local establishment.  Southgate did not disappoint.  The servers were welcoming and relaxed.  \n\nI will be back!"
    },
    {
        "id": 275,
        "text": "Here's the thing about Southgate:  I didn't think it was Korean enough!  Let me explain.  \n\nThe wings are excellent.  Can't complain about perfectly fried (multiple times) jumbo wings with good sauces.  I preferred the spicy version better, but it's up to your tastebuds on this one.  For some reason I thought that there would be some mind boggling Korean flavor burst that I've never had before, but to my slight disappointment, they were just really good wings.\n\nAs for the burger, which was just named a Philly's Best, I had a similar problem.  It was cooked perfectly and had nice flavor, but I was expecting some Korean fireworks.  I liked it better with some extra pickles.  Same thing goes for the fries: good, but not what I was expecting.\n\nService was perfect.  They were attentive, well spaced and very friendly.  I like the space, and there was a nice local vibe going on.  It's a place I would drop in on again if I were in the area, but not one that I would walk all the way across the city for, like I did tonight."
    },
    {
        "id": 276,
        "text": "Came here for brunch 3 days ago and had a fantastic time!\n\nWe ordered all the items that I posted in my photos, as well as the Kimchi Blood Mary and the Korean 76 (prosecco/soju based cocktail). The Korean fried chicken (KFC) was legit both in terms of texture (nice exterior crunch w tender meat on the inside) and flavor. But having had KFC at multiple joints previously my opinion is that they're all comparable and though the ones here are outstanding, it's not more amazing than other KFC spots.\n\nI like green tea flavored anything, so I opted to have the fried chicken w green tea Belgian waffle. It had a nice hint of green tea flavor but I wished it was crispier. I tasted my friend's short rib and I thought that was the most scrumptious dish of the day...I might also be swayed by the fact it was accompanied by 2 perfectly poached eggs over rice.\n\nThe Kimchi Bloody Mary was excellent, but it could be spicier. The soju on the side was a nice touch.\n\nService was impeccable, my friends and i felt very well attended to...one of our phones ran out battery and our server returned within a minute w/ a phone charger, and was just so friendly and unintrusive throughout our 3-hour long stay. \n\nSide note: we tried showing up on a Friday night w/out a reservation and there was a 1-2 hr wait so we came back 2 days later for Sunday brunch and was promptly seated w/ ample space left in the restaurant. I don't think most ppl know how awesome their brunch menu is...I would take this place over a lot of other well-known brunch spots in the city any day..."
    },
    {
        "id": 277,
        "text": "4 for service and ambience. 3.5 for food. 3.0 for pricing. I came here for brunch with three others. We were the first ones there. We ordered the Korean fried chicken for an appetizer.  The fried chicken was $12 for 6 wings. The crunch was good but the sauce lacked flavor, and the spicy sauce isn't that spicy. Nowhere near the best Korean fried chicken in the City. And they were overpriced at $2 per wing. \n\nFor my meal I ordered the burger. The meat was flavorful but the cook was off. It also tasted like it was over marinated, and didn't have the right texture for a hamburger. The fries were OK, but not great. The burger was good, but I do not get the hype. \n\nI tasted the chicken and waffles.  The green tea waffles were delicious. The fried chicken was too, but it was drenched with syrup. It would have been better if it was served on the side. \n\nMy fiancé ordered the tofu tacos and did not like the way they cooked the tofu. My friend ordered the short rib and really enjoyed it.  \n\nThe server was really good and made very good drinks and recommendations. I order the Soju Hot Toddy and it was really good. Definitely the best thing I had here. I would return for happy hour. The normal menu is a bit overpriced."
    },
    {
        "id": 278,
        "text": "If I have to use one word to describe this restaurant, it is heartwarming. The flavors are always lively and the services never disappoint. And in this pandemic, the owner did not pause a second when asked if they'd consider offering free meals to frontline medical workers. On top of that, free delicious pork buns that unexpectedly appeared in my food delivery during this trying time? Yup, heartwarming, with tons of grace and generosity!"
    },
    {
        "id": 279,
        "text": "I know that the concept of Southgate is Korean with an American style, but to be honest I'd say it's the other way around. I felt like I was eating mostly American food influenced by Korean cuisine.  For an appetizer, I ordered the octopus and dduk skewers (unfortunately gobbled it down before getting a picture) but you should know that there were only two pieces and there was only one piece of the octopus confit on each skewer (which was the best part).  The dduk was a little tough - there's a way to cook dduk crispy on the outside and soft on the inside which is what they were going for and did an ok job of.\n\nThe galbi we ordered was really good, but again I really wouldn't have called it galbi.  If you served this to me and I didn't know what the dish was called or where it came from, I would've never suspected it to be Korean.  That being said though, it was really good though just judging it based on its stand alone quality. The meat was really tender and the marinade was delicious, but again I just had to laugh a little at how it was supposed to be remotely Korean.\n\nI also got a beef dolsot bibimbap, and it was really good but also bibimbap is low key one of those things you can't really mess up.  I wish they put a little more of a finishing sesame oil drizzle and more spicy gochujang but overall it was satisfying.\n\nI also ordered a soju flight (they house infuse their sojus) and they were all pretty pleasant and worth a try if you've never had soju before. It's a very impressionable spirit and takes on the flavor of whatever is in it easily, so it may feel a little like drinking juice but the flavor combos were interesting and my partner and I did enjoy them.\n\nService was great, and because of the lovely weather we asked to be seated outside and were able to, so I didn't see much of the interior space. \n\nI think just all in all, it truly was a three and a half to a four star restaurant experience because it's not that the food wasn't good - I just think if you are craving Korean, skip this place. \n\nAnother little tip: don't get the kimchi it was foul.  Also a little miffed they charged for banchan - I know the concept again is \"Korean American\" but I think you'd enjoy just sitting at a fully Korean restaurant and getting your free (and way better quality) banchan experience there with your meal."
    },
    {
        "id": 280,
        "text": "I had the Korean fried chicken and green tea waffles. The fried chicken was spectacular and had that wonderful crunchy, light coating in the Korean style of fried chicken. The waffle was a bit lackluster and dry though - the green tea barely came through, and instead I would have preferred a regular buttery, crispy waffle with green tea whipped cream or something as a topping. Really great place to brunch if you're looking to change up your usual breakfast fare."
    },
    {
        "id": 281,
        "text": "This is a great spot to grab dinner and drinks on a Friday night! With a group of 4 and no reservation, we ate at the bar. Happy hour with half priced drafts and wines is from 5-7 pm. They've got a nice variety of drafts here and also offer discounted snacks like a 3 pc kfc and banchan. \n\nWe tried the soy garlic kfc; it was so yummy! Super crispy skin but still juicy chicken. I'm glad we got the happy hour portion though bc this is heavy, and I don't think I could handle an entree portion of this. \n\nMy bf had a bibimbap that I know he enjoyed! Although he was bummed that getting a hot stone bowl would make it a $16 dish so he opted out. I had the japchae which to be honest I'm still thinking about. It's stir fried veggies with glass noodles. I added the beef to it, and it was so savory, flavorful, and spicy. I will hands down be getting this again when we go back."
    },
    {
        "id": 282,
        "text": "Came for outdoor seated dinner! The prices were a bit steeper than expected, but the service was great and I could see the \"modern korean\" spin they took on the food.\n\nOrdered:\nBulgogi Ssam (4/5): Tasted great, but something was a little disappointing about it; maybe after eating korean food a lot I was expecting more things to come with the wraps? It came with lettuce, meat, rice, a sauce, and some pickled radish. I think I was wishing for some kimchi or garlic/scallion and a ssamjang instead of the gochujang sauce, but it was good nonetheless! \nTofu Bibimbap (4/5): This was definitely one of the most flavorful bibimbap i've eaten! It was kinda pricy considering the tofu is +$3, I wish it was crispy tofu!"
    },
    {
        "id": 283,
        "text": "Reasonable place just nothing special. \n\nWe did pickup because of the covid situation so obviously took into consideration that hot food is rarely as good when it's been out for 20 minutes. Seems almost unfair to review things like wings or fries, silly us for getting them as takeout. I think the restaurant could have done things to help like using a breathable container instead of plastic so things don't get such soggy, or placing two flavors of wings in separate containers so the sauces don't all mix together, but oh well. And our order was messed up... got two of the same side dish instead of the two different things we ordered but wasn't worth the trip back :(\n\nThat being said, the three stars is legit just because we weren't big fans of the flavor. Did like the hearty bun on the chicken sandwich and it was a filling meal. And order was ready within 15 minutes."
    },
    {
        "id": 284,
        "text": "I've been meaning to try Southgate ever since my brother told me about their bibimbap, and I'm so happy I finally did. Full disclosure, I had never tried bibimbap before so I have nothing to compare it to, but it was delicious, full of flavor, and definitely hit the spot!  The portions are also huge, so I had tons of leftovers for the next day. My friend and I also split the soy garlic Korean fried chicken (can't say no to korean fried chicken)! The breading was crispy, the chicken was tender, and I loved the soy garlic sauce. We came at an odd time (~4:30) so they weren't too crowded but it started getting busier around 6ish. It's definitely a cool neighborhood spot to hit up!"
    },
    {
        "id": 285,
        "text": "I walk past Southgate most days on my commute and they have a decent crowd every single time! I finally decided to check out this place on Friday night. \n\nAt 7 PM, it wasn't too crowded. Although the outside seating was full, there were plenty of spots inside. The place is definitely better for smaller groups, however. \n\nI was feeling something basic, so I got the fried rice with pork belly. With a side of kimchi, it was perfect. The portions are fairly generous and it also reheats well. I especially love the little pieces of potato mixed in. My friend got the bibimbap, and said good things about it too. \n\nFor a westernized Korean place, I really enjoyed it. It is a little on the pricier side - $14 for the fried rice, $3 for a small size of kimchi - and these were two of the more reasonable dishes. \n\nThey have happy hour and brunch too, so I might save this for a treat yo self place when I'm too lazy to venture far."
    },
    {
        "id": 286,
        "text": "Super psyched about this place. It is has super delicious food, and also good cocktails and wine. I can't say more... Actually, just one more thing, so happy about this place being here."
    },
    {
        "id": 287,
        "text": "I liked this place a lot. \n\nI had the KFC (korean fried chicken) wings. I got half soy and half spicy. They were super crunchy and meaty and delicious. You only got 6 which was an odd amount in my opinion. My boyfriend got a beef hot pot dish that I tasted and it was really good. My only complainant was that the sesame oil stood out a little too much. But all in all it was good. \n\nThey have local beers here from across PA which is neat to see. We sat outside despite the hot temperature. From what I could see inside, it looked very nice. A little small, but nice. \n\nThis place is in a residential area so it was quiet, I liked that. \n\nAlthough while we were sitting there I could help but notice a man walking down the street looking at bikes with his flashlight no doubtably checking if they were locked. I of course yelled at him from where we were sitting and told him to go buy his own bike and that all the ones on the street are locked ;)\n\nAfter that, I began eating again. Just a few minutes go by and my police officer senses are tingling. I see another male standing on the sidewalk watching very closely as people walk past him. I know he was waiting to either grab someones phone or wallet out of their hands. Luckily he gave up and walked away. \n\nI say this because it is in a nicer area but still be careful!"
    },
    {
        "id": 288,
        "text": "Closed on Monday's. \n\nOne of my favorite paces to dine in the area. I rave about their Spicy pork miso ramen.  Normally it's amazing but tonight it was lacking. The flavor profile was completely different than the last 3 times I have ordered it. The photos even look different. \n\nThe SouthGate fries were a little too sweet for me but I found myself having just one more again and again lol. \n\nI feel so bad, I forgot that my friend doesn't eat pork. After raving about this place and their ramen, I was left feeling stupid because the only ramen they offer is pork based. \n\nGreat place for happy hour."
    },
    {
        "id": 289,
        "text": "Had a juicy burger with kimchi. The fries were thick cut and delicious, and they offered good portions for happy hour! Pork buns were good too. Excited about this local spot!"
    },
    {
        "id": 290,
        "text": "The happy hour here is amazing!  The flavors are so unique and the food is delish.  I've ordered here occasionally over the years but slept on their happy hour...until now.  The happy fries have this incredible sauce on them with kind of a spicy Mayo dipping sauce.  Just thinking of the combo is making me crave those fries.  Their bao buns are also so tasty.  They're a little expensive on the regular menu so happy hour the price is perfect.  The beef ones are my favorite.  I've also tries their burgers and rice bowls which are good, but the chicken bites appetizer is also amazing.  Packed with flavor and crispy on the outside despite having a lot of sauce.  The service at happy hour was great too.  We had a kid in tow and they brought a kid cup which was super nice and had a lot of patience for an antsy toddler.  Definitely check this place out and don't miss their happy hour!!"
    },
    {
        "id": 291,
        "text": "I actually love this spot. It has a very nice ambiance inside and comfortable seating outside. I wasn't particularly a fan of Monk fish. It's a very very meaty fish, like a freakin prime rib. It was incredibly strange, but some people enjoy it. However, we REALLY loved their Korean fried chicken. It was double fried, crunchy, and simply phenomenal. You can tell the chef here knows what he's doing. Beautiful presentation of food. Great date night."
    },
    {
        "id": 292,
        "text": "Awesome neighborhood spot for unique menu. Accommodated our table of 14 and pretty much ate the menu. All raved about their dish. The monkfish special was the winner and the skirt and hangers were perfect and tender. Knowledgable bartender with nice selection of top shelf standbys and several unique liquors that were recommended and descriptions spot on. Can't go wrong with great around the corner atmosphere!"
    },
    {
        "id": 293,
        "text": "Booked another res and enjoyed it.\n\nAdditional notes:\n\nThey appear to have a problem with their OpenTable-to-reservation system.  They \"lost\" our reservation and the next table wasn't open for 45 minutes.  Mistakes happen, but there was no apology which was disappointing.  We came back after 45 minutes and had dinner.\n\nThe Restaurant week menu is pretty spot on.  Got the Bibimbap which was delicious.  Spicy \"KFC\" (Korean Fried Wings) are also excellent but when compared to the soy versions my wife got, weren't all that spicy (kick it up guys!).\n\nService was exceptional in the restaurant.  Fast.  Attentive.  Friendly.  \n\nI'm still a little put off by the reservation thing, but I'll probably eventually come back again."
    },
    {
        "id": 294,
        "text": "My night began with delicious fried chicken and ended with a stomach ulcer (ok not really but I lied in fetal position for the next 12 hours praying for the sweet relief of sleep that never came). \n\nMy friend and I went on a Wednesday evening for happy hour and split some korean fried chicken and fried calamari + shisito peppers. When the chicken first came out, it was hot, crunchy, and flavorful. Amazing! But after not even 15 mins., the outer layer turned soggy and a bit chewy. I think this was because the coating was thicker compared to other KFC I've had. If you're a slow eater, beware! \n\nNow ... For the experience that had me downing tums all night. To be fair, when we ordered the calamari and shisitos, our waiter mentioned that they were out of the regular peppers and only had the spicy ones left. We were both the type to order extra hot sauce on the side and have had shisito peppers before, so bring it on! Oh what fools we were. When the waiter returned with our order, he reminded us that the peppers were very spicy and actually apologized before, wait for it ... slowly backing away with his palms up! I'm not even exaggerating. But we paid no mind (because hanger) and dug in. One bite of those peppers and we were in a world of regret! After dabbing our foreheads profusely and downing 3 glasses of water each, we wondered if removing the seeds on the inside would make the peppers more palatable. It didn't. \n\nMoral of the story is, if your waiter apologizes for the spice level, take their word for it!"
    },
    {
        "id": 295,
        "text": "Great new (ish) spot! We had a 9pm reservation and got seated immediately which was a plus since it's not a big place and it was pretty crowded.\n\nGreat wine beer and cocktail selection as well as four sake options. Not super long but good selections. Off of a recommendation on a sake and bottle of wine we started the meal off right and went with the fried wings which were awesome. Crispy and filled with flavor, we tried both options.\n\nMy one disappointment were the pork buns, I've had way better. They just lacked the right taste, were a bit bland and had a star anise taste to them that I just didn't think worked, also almost a smoky pork taste that again just didn't go.\n\nBesides that, all the entrees that came out were awesome for the table, not one complaint! I had the bulgogi burger, medium rare and while I was nervous at first to have bulgogi as a burger, since I love it classic, everything paired together so well and it was juicy and perfect size. This place is worth a stop."
    },
    {
        "id": 296,
        "text": "This place had been on my list for YEARS, probably since it opened.  Finally got around to ordering from there a while back and it was worth the hype.\n\nOrdered some bao buns, spicy pork miso ramen, beef bibimbap and Korean fried chicken.  All of it was fantastic, layered with flavor and you get a lot of bang for your buck, but THAT FRIED CHICKEN THO.  Let's just say I'll never eat regular basic bitch fried chicken again in my life.  Southgate has officially converted me.  How does it get so crispy? So juicy? So succulent? So sweet and tangy? It's dark magic, indeed.\n\nI did enjoy the other dishes, but honestly everything paled in comparison to the chicken.  I would just stick to that, honestly (although their burger sounded enticing)."
    },
    {
        "id": 297,
        "text": "I dined in for a late dinner and got started with some appetizers. Starting with the Southgate fries, I saw numerous reviews saying it's a go-to / must try, but I honestly didn't understand the hype. The fries were soggy from the ingredients that were put on them. It had a garlicky taste but not something I could keep picking at. The spicy pork bao buns were really good definitely will recommend it. Now the Korean wings were an extreme flop. The soy wings tasted like the wings were drenched in soy sauce and were extremely salty. The hot wings were not spicy at all. My sister doesn't have a tolerance for spice, and she tried it and said it tasted identical to the soy wings. The bibimbap was piping hot, and I enjoyed every bite. We also ordered the spicy soju, soju punch, my sassy girl & the bold fashioned; all the drinks were strong and great! \n\nNow the service here is tremendous. Our waiter was awesome; he was patient with us and kept checking in. Even other staff would double-check to see if we needed anything and so for that an extra star for excellent customer service. I would definitely try this place again and try other items."
    },
    {
        "id": 298,
        "text": "Everything about this place is awesome. The service, the decor, the whiskey selection, the food, the soju, the location! \n\nCouldn't narrow down what to get so we got a bunch of things...\n\nCheesesteak buns - unexpectedly delicious. The buns were soft and warm, the cheesesteak was bursting with flavor. \n\nKimchi pancake - I've had other kimchi pancakes where the flavor of the kimchi was masked. This is not them. The kimchi is so good and you get some in every bite. \n\nSoy garlic wings - not the best Korean fried chicken I've ever had but solid. I would get these again. \n\nBulgoggi burger - AH-MAZE-ING\n\nKorean hot chicken sandwich - I was hesitant to get this because I've been to Nashville and have gone right to the source (props to Prince's). I really like this take on it. It feels authentic. Tasted like a beautiful, flavorful marriage of a hot chicken sandwich, a bahn mi and Korean fried chicken (so maybe more like polygamy). \n\nSoju flight - I've never had soju before so thought I'd try the flight. It was surprisingly light and tasty. Each cup tastes exactly as described. My favorite was the persimmon and earl grey, it tasted just like a cup of tea. The coffee & Orange brulee one was my least favorite but mostly because I haven't had any coffee in a few months. \n\nParking wasn't an issue (feed the meter or download the park mobile app). You can walk off you dinner around Rittenhouse Square. Prices are reasonable and service was great.  Bathrooms were clean."
    },
    {
        "id": 299,
        "text": "I got takeout from Southgate and had a delicious meal!\n\nI ordered the Mushroom Steamed Buns (with sesame aioli and pickles). They were absolutely delicious - the mushrooms were soooooo smokey and flavorful. I also got an order of the Fried Vegetable Dumplings which were amazing. I ate both super quickly - maybe because I was super hungry, but also maybe because they were both just straight up delicious. \n\nMy mouth is already watering thinking about my next takeout order from Southgate."
    },
    {
        "id": 300,
        "text": "I am picking up what you are putting down, Southgate! My friend and I had a catch up dinner on Tuesday and it was perfect! \n\nFirst off, I can't even believe the space was formerly Tangier. It has been completely transformed and looks very modern and sleek. While we passed on drinks, there is a full bar and it looks like a great spot to perch for drinks or a solo dinner. \n\nAfter reading the rave reviews of the KFC we had to share some to start, and I have to say it was incredible. We both liked the spicy version more but the garlic soy were also delicious. \n\nFor my entree I went with the bibimbap with beef in a hot stone bowl. It was great, if perhaps a questionable choice on a hot summer night. I will save the sizzling bibimbap for cooler weather in the future. There are lots of other options I'd like to try in the meantime. \n\nOur server was pleasant and on top of keeping our water glasses full. My only gripe was that it was at times hard to hear him and even my friend over the din of the restaurant. Nothing that will keep me from going back, next time with some drinks thrown in!"
    },
    {
        "id": 301,
        "text": "SouthGate is a go-to spot for happy hour, dinner, and just because for my group of friends. The food is delicious, the service is great, and the drinks are reasonably priced. It's nearly impossible to go wrong here.\n\nSome menu highlights include:\n- The Korean Fried Chicken, as far as sauce goes, I'm a soy girl but friends rave about the spicy too\n- The Southgate fries, THE GOCHUJANG AIOLI IS DELICIOUS! I always ask for more.\n- Dolsot Bibimbap, totally worth the additional cost for the hot stone pot because the rice gets perfectly crispy.\n- The Bulgogi Burger, and if you're there for happy hour then you have to get the burger and beer special.\n\nFor happy hour, my personal favorite is the Southgate citywide. They also have a craft beer of the day and mystery beer (comes out in a paper bag) for $4. The options are great, especially for the price point!\n\nI'd also recommend trying the yakult soju! Our server brought us a round of these once because he heard we were celebrating a birthday. This was delicious and almost tasted like an alcoholic go-gurt in the best possible, most delicious way."
    },
    {
        "id": 302,
        "text": "We visited Southgate as a large(ish) group this weekend.  It's an entertaining and enjoyable Korean (American) experience which I can and will return to.  The food was delicious and the service was great.  There were some communication issues with the kitchen that kept this from being 5 stars, but nothing overly concerning.\n\nThe Good:\n\nI previously had the Bulgogi burger and recently had the Dolsot Bibambap at Southgate.  The burger was cooked appropriately, with a nice spice, but wasn't overly impressive.  The bun was a bit messy.  I was craving a burger, which is why I got something I wouldn't normally consider.  It was fine but nothing overly exciting.  \n\nThe Bibambap is definitely a star here.  Very saucy, a little less spicy than I'd hope, but flavorful and delicious.  The gooey egg was an enjoyable addition and the beef (optional), had the right spice to really enhance the meal.  I definitely would order again.  It was also incredibly filling.\n\nWe also tried the Cheesesteak buns, which were a little more crispy than I was used to, but delicious.  Perhaps a bit too bready, but we enjoyed quite a bit.  \n\nThe service was fast and attentive.  Our drinks, both water and cocktails, were frequently filled and re-ordered.  The place was busy and ideally staffed.\n\nThe bad:\n\nThe dumplings were frankly pretty lame.  Unspecial and comparable to standard fare.  \n\nThere was some miscommunication between the kitchen and the server.  One person in our group ordered the dolsot bibambap w/o an egg.  All came served with an egg.  No matter, it was quickly fixed, but the next dolsot bowl left a sizzling meal for what was 20 minutes.  It's great that food comes out hot - that should be the goal!  However, it rendered the meal inedible for a long period of time.  There are worse problems to have, but this stuck out.\n\nOther notes:  Gratuity was included for 6+ guests, which is fine but probably not great for the servers.  The cocktails were slightly overpriced for their quality, but nothing outrageous.  \n\nConclusion:  Southgate is a nice Korean fusion experience for those who want a little adventure, but nothing over the top.  The food is wholesome and enjoyable without being inaccessible.  The service is fast and attentive.  I can and will return!"
    },
    {
        "id": 303,
        "text": "Ok so if you are ordering the Korean fries, you probably cannot eat anything else - the portion size is humongous! I had the bibimbap and the boyfriend had a burger - both were delicious! Staff was super friendly and attentive. They also have a great cocktail menu so definitely keeping this on my \"go back\" list."
    },
    {
        "id": 304,
        "text": "VISIT HISTORY: \n- last visit: this past weekend for their happy hour\n- frequency: been there ~10 times as I live very close \n- next visit: not particularly drawn to the place. will go if friends haven't been there \n\nFOOD:\n* firstly, i must state my conflict of interest as I am Korean thus I have an innate tendency to criticize westernized Korean food*\n- good introduction to Korean food, made very approachable and educational\n- appreciate that the food items are in Korean so there's that cultural learning\n- fried chicken is similar to what I used to have in Korean so not totally far off\n- dduk bok ki is served with rice which does not happen with conventionally dduk bok ki but it seems like they wanted some carbs on that plate \n- overall, over-priced for the quantity/quality of food you get (my opinion) but if you're new to Korean food, not a bad place to start\n\nVIBE: \n- friendly \n- home-ly\n- i always see the same bartender with the cool hat. very friendly guy."
    },
    {
        "id": 305,
        "text": "tl;dr a Korean spin on American bar fare, falling more heavily on the latter cuisine\n\nPromising Korean fusion eats just out of Rittenhouse, Southgate is a popular neighborhood gastropub. I've walked by it countless times, but only just made the time to give it a whirl. The gray-toned palette skips between matte and glossy finishes to compliment dim mood lighting. The walls are decked with a chic take on subway tile. Exposed HVAC, incandescent bumps, and twinkle lights dangle tastefully from the ceiling. Hours and specials are chalked onto a board at the head of the sleek bar that extends the length of the restaurant.\n\nMy partner and I swung by for early weekend dinner and arrived in time for happy hour. We opted for the Banchan Set, the Bulgogi and Pork Steamed Buns, the Korean Fried Chicken, and the Bulgogi Burger (which came with a draft, as part of HH). Of the banchan, my favorites were the zucchini and tofu, both cooked in a rich soy-based sauce and served hot. On the other hand, the kimchi and cucumbers were lukewarm and standard, if not boring. Each dish was large, and I recognize that Southgate is not an authentic Korean restaurant; yet, it still felt off-script for Southgate to charge for banchan. The two-biter buns both had a pillowy bun and nice spicy mayo. While spicy pork was flavorful (and particularly heavy on the sesame), the bulgogi felt dry. Both KFC glazes were yummy with a remarkable depth of flavor (even though the \"spicy\" was not particularly hot). However, they ran a tad soggy with a laughable tiny portion (7 small wings) for the price. The burger was rich, juicy, thick, and heavy, complemented nicely by the tang of pickles and subtly spicy aioli. but was paired with a flimsy bun and flimsier steakhouse fries (I really wish they were shoestring, instead).\n\nAt $56 (after tax and tip) despite the happy hour deals, Southgate definitely errs on the expensive end. Although nothing was actively negative about my experience here, nothing floored me either. As a whole, Southgate definitely rings more American food than Korean -- so if you have a hankering for Korean comfort food, this probably won't do the trick. I may or may not even return to Southgate, depending on whether I ever have the craving for their specific take on fusion cuisine."
    },
    {
        "id": 306,
        "text": "I came here for dinner and ordered the korean fried chicken (KFC) wings (half spicy and half soy).  The wings were crispy and tender.  The flavors were okay - I still prefer Cafe Soho over these.  Comes with about 6-7 wings.  \n\nI had to get the burger, which was recently rated as the best burger in Philly.  The bulgogi burger is a nice combination of american and korean fusion.  Very juicy and perfectly cooked to medium. I'm a traditionalist so I wouldn't say that this is the best burger in Philly.  This is the best bulgogi burger though! \n\nWifey had the bibimbop and she said it was ok for her standards - I think I would rather get the hot stone pot over at Giwa at 16th and Sansom. \n\nOverall - good new restaurant in the area that I'll come back to!"
    },
    {
        "id": 307,
        "text": "Finally made it to South Gate, and was not disappointed! This place is great.\n\nWe started with the Korean fried chicken wings, which were good but definitely not the best order we had that night. \n\nThe award winning bulgogi burger deserves all its accolades. So simple, yet a very very quality burger!\n\nMy gf got the bibimbap in stone pot. The stone pot keeps it cooking the whole team and left very crunchy yummy rice at the end. \n\nWe finished with the persimmon crisp. It was very interesting and delicious. \n\nWill be back soon!"
    },
    {
        "id": 308,
        "text": "Recently walked past Southgate and noticed their advertised happy hour, so had to go! From 5-7PM on weekdays AND 2-7 on weekends, Southgate offers both food and drink deals with their indoor and outdoor seating. We strolled by on probably the hottest day of the year and decided to eat outside - probably not the smartest idea, but it actually wasn't as bad as expected with a slight breeze coming in from the street. The outdoor seating was nice and isolated from the street with the covered seating, and the tables were nicely spaced from other diners. And luckily, not many others were as crazy as us to sit outside, so very few people were outside. Our waiter was very attentive to us, making sure our water was always filled especially in the heat. \n\nOf course, we were there for happy hour, and they definitely had a good number of deals available. I opted for the $16 burger and beer. I could chose any beer so opted for a tangerine pale ale, which was very refreshing. The burger was slated for the bulgogi burger, which was excellent - there was a good bit of sauce that made the bun a little soggy, but the flavors were on point. The brioche bun was hefty enough to hold up the contents, and the burger patty itself was very substantial. The burger also came with their homemade fries - thick cut, well seasoned, and plentiful, they were great! For $16, it was an awesome deal! My fiancee got the $4 draft beer of the day, which was a watermelon ale. Very refreshing as well! He got the $10 burger of the day, the kimchi burger - he loved it!! There was a ton of kimchi on the burger, and the kimchi was very good - nice level of spice, crunchy veggies, and bacon, a unique taste. He was a big fan! While his didn't come with fries, luckily I had plenty to share so we splitsies. \n\nOverall, we really enjoyed our happy hour meal at Southgate - the deals were on point, and the food was good! While it wasn't the best burger I've ever had, it was quite a unique take and the deals couldn't be beat. We hope to make it back for another HH to try more of their offerings, and to try their Korean fried chicken, which seems to be highly regarded. Thanks for a great meal despite the sweltering heat, Southgate!"
    },
    {
        "id": 309,
        "text": "Here you can- Enjoy what appears to be some korean fusion in a bar restaurant setting, at the bar, table, alone or with a small group, coworkers or a date. \nMy ratings are based on a scale of 1 to 5 stars where\n1 star is tragic and \n5 is Ouuwww terrific \n\nOverall ratings- 4.5 stars\nCustomer service- 5 stars. Bartender was patient and explained not only the menu but some Korean background on some of the menu items. \nFood taste- I LOVED the spice of the Korean Chic Sandwich and the other items I had were great 5 stars!\nAmbiance- 3 stars laid back corner bar vibes. Everyone stuck to who they came with.  Wouldn't come here to meet new people tho.\nDecor- 4 stars. Basic clean lines bar restaurant.  \nCleanlinessCleanliness- 4 stars but the bathroom is very well stocked and handy."
    },
    {
        "id": 310,
        "text": "Quick review for a quick dinner -\n\nCame on in a Friday, no reservations; got seated at the faux bar towards the back which faces the extremely tiny kitchen. It's kind of impressive how many people they serve here with what looks to be a a kitchen the size of a large bathroom. It probably isn't their only kitchen but if it is, good on them for being efficient. \n\n\"koreancini\" = 1/5 - I would not get this. Dry, terrible texture, no flavor. Didn't go well with the dipping sauce. \n\n\"KFC\" = 3/5 - a solid rendition of KFC. I'd put slightly below Federal but way below Andy's Fried Chicken. Size of the wings were decent and the batter was solid. Could have used a little more sauce.\n\nbibimbap = 3/5 - also a decent rendition of bibimbap. I ordered mine with beef and it came in a stone pot. For $18, it was kind of small. Needed more gochujang which the waiter was happy to oblige. \n\nIt's nice to get some korean food in Philly. I will be back when I need my next fix as the local spot, Giwa, doesn't cut it."
    },
    {
        "id": 311,
        "text": "Good tasting Korean food with a variety of menu options. Staff is friendly and prices are reasonable."
    },
    {
        "id": 312,
        "text": "Best chicken wings in the city. We have been ordering like non stop from this place since the city shut down. Always brightens our day. Everything on the menu is delicious. Can't wait to go back when the city reopens."
    },
    {
        "id": 313,
        "text": "Let me tell you, I loveSouthgate. 5/5 For atmosphere. I am really happy that I wound up ordering Kimchi, it was outstanding, just a phenomenal taste. The staff is amazing and very welcoming. So happy I gave Southgate a try."
    },
    {
        "id": 314,
        "text": "On the spur of the moment, we popped into Southgate for a quick bite as we were passing by on a Friday evening. \n\nWe sat at the bar and since we were just minutes under the cutoff for Happy Hour (6:00pm), we quickly ordered a few things off the menu. \n\nWe ordered some fried dumplings and a few Banchan (sides) items (Tofu and Eggplant). The tofu was my favorite. It had a nice sauce and the outer edges were lightly crispy. The dumplings were also tasty. The eggplant was good, but I was expecting a warm dish, so just keep in mind that the eggplant is served cold. \n\nThe restaurant was lively and full of people. It's decorated with lights and has a nice atmosphere. They also have outdoor seating, which was completely full that night. The bartenders and staff were super friendly and efficient. \n\nI definitely plan to return for dinner one evening."
    },
    {
        "id": 315,
        "text": "Probably the worst Korean food I've ever had. We ordered combo wings. The soy wings were drenched in soy sauce, suuuuuper salty. Like someone took a whole container of soy sauce and dumped the entire thing over it. \n\nThe spicy one wasn't spicy and had almost no flavor.\n\nWe followed up with Southgate fries. These fries were so garlicky, I don't think I've ever had this much garlic in my life. It killed the vampire next to us. I love garlic normally, but this was overkill (no pun intended).\n\nThe cocktails were a bright spot and so was the beer. The restaurant has a neighborhood vibe and our server was nice, only reason this place isn't a 1-star."
    },
    {
        "id": 316,
        "text": "My friend and I went to Southgate for happy hour on a Friday after work. My friend had heard they had great deals on both food and drinks. I ended up forgoing food and just ordered the Southgate citywide instead. I will admit...I had no idea what a citywide was so I was quite surprised when I was served both a beer and a shot. Overall, I felt the happy hour prices were good, but I would have appreciated a wider selection of craft beers and specialty cocktails. Certainly check the menu to ensure they have something you like before going!"
    },
    {
        "id": 317,
        "text": "I was a little bit sketched out when I was able to get a reservation last minute on a Friday night. But I have been eyeing this place up for a while so I figured I would just give it a shot! \nWe started with a variety of drinks from a sake punch, sangria and their version of an old fashioned - all of the drinks were perfectly made. \nWe then ordered the Korean fried chicken for an app. They came out with 6 huge wings, half soy and half spicy. They were so crispy and so delicious! I could have just had this for dinner! \nWe had chicken katsu, japchae, and burgers for dinner. I wouldn't be able to tell you a favorite because they were all amazing and they all came out hot! They all had totally different flavors and I was truly impressed that they were able to make such awesome dishes."
    },
    {
        "id": 318,
        "text": "This place was an interesting concept on brunch. A nice Korean twist to change things up. Either things were delicious, or not so great. Not too much in the middle. The green tea waffles weren't the best...I would prefer just regular waffles. The Poutine was just fries...definitely needs more ingredients. But the Bloody Mary was one of the best I've had! And for that reason, I do recommend it! Also the bibimbap was really good, personally didn't order it but tried some and delicious!"
    },
    {
        "id": 319,
        "text": "Went for dinner with a few friends and ordered their southgate fries which were delicious. They have a separate sauce for dipping, and I'm not sure what's in it but I need to buy it by the gallon. I also ordered the kimchi cheeseburger which was delicious as well. My friend ordered the bibimbap- and that was the overall fan favorite of the group. Eating it the next day for leftovers was even satisfying!!"
    },
    {
        "id": 320,
        "text": "I have loved Southgate from the beginning (and not just because it's super close to my apartment). They have always provided delicious and quality food and unlike a lot of \"fusion\" restaurants, they really stay true to the Korean roots of the dishes. Their portions are big and their cocktails are very creative and tasty! They have really nice outdoor seating in addition to seating inside at tables, the bar, or the community table! Even as they have moved on to new chefs running the kitchen, there were never any dips in the quality of the food they serve. Perfect for a night with friends, a date, or a nice place to take your parents (mine love it too!)"
    },
    {
        "id": 321,
        "text": "3.5 starts.  Sorry, it just doesn't quite stand up to the other excellent 4 star restaurants I have been to in Philly.  My biggest complaint - their prices.  The good is an amazing space in a cute neighborhood and a unique cuisine.  I will definitely be back to check out some other dishes but for a casual meal on a weeknight with 2 drinks we ran up a bill around $70, just didn't think it was quite worth that."
    },
    {
        "id": 322,
        "text": "This place checks off all the boxes for me. Great happy hour deals (1/2 off drafts!), including food. I tried the 3pc Korean fried chicken ($6) and the HH Brussels sprouts ($3). Food came out very fast and though small portions, I felt it was just right for being able to try several things. The diner next to me at the bar got the katsu chicken and it looked so good, I was compelled to order more food. I got the fried rice ($11) with kimchi and pork belly. The kimchi was amazing. \n\nThey have outdoor seating and a modern aesthetic which makes the Korean menu somewhat unexpected. I definitely see myself coming back for happy hour and dinner. There are so many more things on the menu I must try!!"
    },
    {
        "id": 323,
        "text": "I have been here several times.  Great addition to the neighborhood!  I had never had bibimbap before, and Southagate made me quite the fan!"
    },
    {
        "id": 324,
        "text": "I got an itch to \"try something new\" and my boyfriend suggested Southgate. It's just a couple blocks from us and we kept walking by saying we had to try it some day but we never got around to it. Last night was THE night! I made a reservation for 2 at 7:30 on a Thursday. We probably didn't need it, but shortly after we got there the place did fill up.\n\nThe place... Is small. Borderline claustrophobic. The bar takes up half of the restaurant. If you want to try this place and also enjoy breathing then I recommend waiting until the weather is nice and you can sit outside. It was a tight squeeze and we are two tiny people. Did not like that the entire restaurant is basically one long bench with tables and chairs pulled up to it. I know a lot of restaurants are like that now but I really do enjoy having a more private table. I did use the bathroom before leaving and while it was freezing down there I do love me a restaurant with gender neutral bathrooms. There's never a line.\n\nThe server was great. I think his name was Evan. He was attentive and genuinely seemed to enjoy working there. Good for him!\n\nWe ordered some new and exciting beers. My boyfriend tried something from Korea and I tried something from Japan that was labeled a witbier on the menu. It wasn't what I am used to from American witbiers ... It had a funky aftertaste that I usually would expect from an IPA and I really hate IPAs. But it was a $12 bottled beer so I couldn't exactly have tried it before I bought it. Should have gone with the cider or the hot toddy! Boyfriend thought his beer was okay but ended up getting a Sapporo. \n\nWe started off with the soy kfc, which was perfectly crunchy yet moist and flavorful, and the short rib steamed buns. I expected more of a bao bun for some reason on the steamed buns and these were more like a dry biscuit so that was a little sad to me. Boyfriend ate the rest of my bun so I could save room for dinner. For our entrees I ordered from that night's special menu, the glass noodles, and boyfriend ordered a bowl of bibimbap. He liked his dish (can't go wrong with a hot bowl on a cold night!) but mine was unexpectedly spicy. It's entirely possible the menu warned me about the spice but we had a couple drinks before dinner and I may have just seen the word \"noodle\" and got excited and ordered without a proper read. I ordered it \"with seafood\" and it came with shrimp, calamari, and little baby squiddy jawns. It was flavorful and had some nice textures to it, but the spice got me. I ate about half of it and had to take the rest home.\n\nOverall, I was happy I tried something new and that itch was completely scratched for the evening, but I think if we came back we would pop over for happy hour (every day!) and stick to the appetizers menu. I would also switch up the drink and try a cocktail. I told a coworker about our dinner there and she said the appetizers are really where its at and we made a bad call getting entrees. I'm willing to give it another go some day, but based on this experience it's a solid meh so I am in no rush."
    },
    {
        "id": 325,
        "text": "This place blows it out the top!!!\nUnique foods to us white folks and so delicious!!\nGreat service is also a great attribute!!\n\nGet your ass down here to Southgate!!\nGet a reservation bc it can get busy on many service hours."
    },
    {
        "id": 326,
        "text": "This is one of the best places to eat in the city. They serve you generous quantity of delicious food with a smile and do not take a loooong time to bring your food.!! The decor is simple yet chic. Go there for a hearty meal. I had the tofu tacos - delicious and the tofu was not deep fried so a BIG plus!! My friends ordered chicken entrees and they were all happily over fed :)"
    },
    {
        "id": 327,
        "text": "I've been to Southgate twice now and I'm not going to stop. \n\n1. GET THE WINGS. Large portion, perfectly crispy, spicy is pretty spicy and they're a bit messy,  but they give you wet wipes.\n2. Skip the buns. They were ok, nothing to write home about,  and you can do better (Bing Bing).\n3. Try the Korean 76, the Korombian Punch, or the p&p.\n4. Skip the white sangria and the ritten in the stars.\n5. The bibimbap and hwe dup bap (basically a tuna rice bowl/salad situation) are good,  solid sized portions. Tuna is super refreshing.\n6. End with the misugaru cake- like strawberry shortcake but the cake is a bit denser and not too sweet.\n\nService was great and you can make a reservation through Yelp Seatme. Great ambiance for a date, to catch up with a friend, or just grab a drink and a bite at the bar.  I hope they stick around and I hope they slowly integrate more traditional Korean foods onto their menu (pajeun, maybe some Korean soups/stews for winter?)"
    },
    {
        "id": 328,
        "text": "During this quarantine, Southgate kimchi has become my Quarantine anthem and the Southgate spicy cucumbers are my source of comfort.  I believe it's because Southgate slathers their cucumbers in joy.  \n\nSo while the chicken wings are lovely - the Southgate banchan is what I crave!"
    },
    {
        "id": 329,
        "text": "Solid 4-star spot right around the corner from a friend's place. For the immediate area I was extremely happy with the food and the service. \n\nDraft beers appear seasonal and though there aren't a ton to pick from there are enough to satisfy a variety of beer drinkers. Overall a nicely curated list. The cocktails look lovely, even though I didn't partake. Next time for sure. \n\nThe food menu is limited but what they do, they do well. Mandoo was a good substitute for the  steamed buns - which were sold out (so disappointed they didn't have these - it was merely 7pm). Bibimbap with tofu was on point and a large serving which probably would have worked to share if accompanied by a couple apps. \n\nAte at the bar - service was friendly and attentive without being overbearing... And he wasn't hard on the eyes either. \n\nRecommend this place for sure."
    },
    {
        "id": 330,
        "text": "I really wanted to like this place but I did not feel welcomed. My friend and I came in the middle of a Sunday for drinks. My drink tasted like lemonade so I liked it and we had some homemade pickles that were good, but we overheard the staff complaining that we sat at the bar instead of a table. First of all, don't talk about us a foot away from us, second of all I don't see why it was a big deal we sat at the bar, and third if this was an issue they should've just told us when we came in and we would've sat at a table. We both felt really uncomfortable after this and peaced out."
    }
]