[
    {
        "id": 1,
        "text": "This is definitely some solid Korean food. I was pretty happy with my order and overall didnt' have many complaints. I paid 10.99 for some really solid dolsot bibimbap. It wasn't the best I've ever had  but it was pretty darn tasty. My sister and I shared some dumpling which were 6.99. They were quite tasty and we had trouble finishing them off with our meals and the banchan. \n\nSpeaking of banchan, I fully enjoyed almost every dish they had. The kimchi was very fresh and quite tasty. I don't often eat kimchi by itself, but Dae Jang Geum really delivered and I found myself almost asking for a second portion. I also liked the tofu, the sprout salad, and the pickled cucumbers. \n\nMy sister has never had Korean food, so this was a good place to bring her and she enjoyed most of what she had. However, she did get the Wonton soup (3.99) and I admit that even I didn't like it. It was bland and the wontons (which were dumplings) weren't tasty. We could have done without that. \n\nOverall it was a nice solid dinner and my sister is slowly but surely coming to embrace my love for Korean food."
    },
    {
        "id": 2,
        "text": "I went into this Korean restaurant coz I once worked around that area, I actually asked the boy in the dollar store next door for recommendations, he said this is a good place, so I chose them. Nice food, not that expensive, appetizers are free with various type. One of the waitress was very nice to me coz she was from China too. I ate lunch there four days in a row, beef broth left me great memory. I was always full after I ate there, the boss gave two to three bowls of rice every time."
    },
    {
        "id": 3,
        "text": "When i miss my moms cooking, I come here. This is authentic Korean food done right. \n\nMenu is expansive, kalbi and marinated pork is on point, and their kalbi bop is heavenly. To the uninitiated in Korean cuisine, each meal comes with a bunch of \"side\" dishes called banchan. Banchan was A+."
    },
    {
        "id": 4,
        "text": "This was the first Korean restaurant I'd ever been to. I went with my boyfriend, when the restaurant was pretty quiet. I didn't even know what to order because the menu was so expansive. Their Kim Chi was excellent, and I really enjoyed the Dae Jang Geum also. I hope to go here again."
    },
    {
        "id": 5,
        "text": "Went with a group of four.  Fun way to eat BBQ .  We ordered duck, pork and prime rib. The bill came to just over $100 without tip.  We had beer.  \n\nThe waitress will bring the hot coals, then the banchan and then the meat.  She helped us cook it, but I suspect that we could take over more of that now that we know how to manage the brazier. It's a little hectic with all the food coming to the table -- it ends up covered with plates. This makes for messy eating, so perhaps not a place for a date or a business meeting. \n\nIt's true that all the banchan or little sides that come with the meal are wonderful. Moreover, once you finish the side dish, they will refill it.  The service is friendly and competent. I guess they have to be managing those hot coals. \n\nHighly recommend. Will go again."
    },
    {
        "id": 6,
        "text": "Dae Jang Gi is two restaurants in one, first it's a typical American seafood spot and secondly a Korean BBQ house. My 10 year old cousin Manny and me went there to chow down after his karate class last Wednesday evening. Manny was hungry after throwing punches and delivering kicks and i was hungry from watching him and all the single mom's at Kim's Karate. Talk about a buffet! Anyway, we entered the restaurant and a guy sat us at a table with a grill built in to the table. I was anticipating munching on some Beef Ribs and Kim Chee and Rice when the same guy dropped off a paper menu with fried shrimp and chicken fingers and fries on it. I was confused especially after seeing the BBQ grill in our table. I summoned a female server who was an elegant, pretty Korean lady who spoke perfect English. I asked her where the Korean food menu was and she apologized and returned with a proper menu with all great Korean dishes. Manny ordered the Pan Fried dumplings stuffed with meat and vegetables, pan seared to a crisp. I ordered a big, hot steaming bowl of Yook Gae Jang which is a stew made of shredded beef, clear noodles, and lots of garlic and hot peppers. We shared and order of Galbi, which was grill in the kitchen because you have to order 2 entrees in order to grill it yourself. That was ok by me and we ate like pigs with all the accompanying side dishes laid out for us to try. I gotta give Manny some props, for a 10 year old, he tried all those mystery dishes when most kids would have been grossed out. Manny said the only thing missing was Karaoke."
    },
    {
        "id": 7,
        "text": "I usually get the galbi there, which is delicious. The best part is that it comes with complimentary dwen jang jji gae (fermented bean paste soup), egg soufflee, and sample mool naengmyun (cold noodles). Three free mini-meals! Other places just give you the first. The banchans(side dishes) are plenty and good as well.\n\nThe haemul pajeon (seafood scallion pancake) and jaeyook boggeum (spicy pork stir-fry) is great, too!\n\nNothing spectacular, but consistently solid food and service. Generous portions and refills on the banchan as well.\n\nAlso, their parking lot has security cameras (not that it's needed)."
    },
    {
        "id": 8,
        "text": "Came in here on a late Sunday night - 11 PM-ish? - and still got awesome service and great food :) If you are ordering meat, go for the So Gal-Bi and not the Sam Gyup Sal. It is so much better! Other than that, they gave us complimentary soups and delicious banchan to go along with the meal!"
    }
]