[
    {
        "id": 1,
        "text": "Wowwwww! Top quality meat and awesome service!! Their pork rib and premium beef rib is the BEST. Also the  is definitely the best in Philadelphia !! The interior is super cute too and good for big groups! can't wait to come back with more friends and family!"
    },
    {
        "id": 2,
        "text": "The photo explains everything. We went out for Korean bbq as a family and boy oh boy did we eat. They were very accommodating as we don't eat pork so they substituted it for chicken. Everything was sooooo good and it was fun grilling the meats to our desired liking. We also had two bottles of Korean rice wine Shoju I believe it was called and it was like a light vodka, very smooth. The service was so exceptional as well. We enjoyed it very much!"
    },
    {
        "id": 3,
        "text": "The food was good and the service was great. They really do try their best to do the best they can. We had a lot of on the house service, like keran jimm the korean style steam egg, which was good. The panchon were all great as well. The waiters and waitresses really care for checking up and seeing how we were doing. The atmosphere was awesome too! I'd say it's a great place to bring a date"
    },
    {
        "id": 4,
        "text": "My bf and I was craving for Korean bbq and wanted to try a new place. We searched on Yelp and thought we would this give this place a try. The server recommended the Korean bbq for 2 for $70 because that would be the best value. The course includes korean side dishes, miso soup, steamed eggs, Tempura, salad with ginger dressing, bibimbap and 6 different variety of meats. The serving sizes were more than enough. The servers were also very friendly and stopped by every few minutes to check up on us. They even offered us complimentary alcoholic drinks on the house."
    },
    {
        "id": 5,
        "text": "I've tried many Korean BBQ places in Philadelphia and this spot is by far the BEST KBBQ in Philly. The staff was super friendly, attentive, and were kind enough to give us some free service items. The meat here is high quality priced at a reasonable cost. They also have a variety selection of appetizers, side items, and other entrees if you do not want KBBQ. I recommend the steamed eggs and pork belly! This will be my new goto for KBBQ."
    },
    {
        "id": 6,
        "text": "We stopped by for a family dinner on a Monday evening. We usually prefer kbbq buffets, but my parents said they'd had a good experience here. The atmosphere is so nice! It's located in a pretty miserable strip mall, but the parking is plentiful and the interior makes up for the outside. The whole place feels newly renovated, and the tables are clean.\n\nWe ordered the course for 6 people, and we were stuffed by the end of it. The course comes with broiled egg, jeon (assorted fried fish and veggies), two stone bibimbaps, etc. Everyone also gets their own soup, salad, and dipping sauces. \n\nAs for the meats, they give you a lot and they are good quality. Surprisingly, the spicy chicken was my favorite! My sisters loved the beef galbi they give you in the beginning. There was enough meat for everyone, and we even had some leftovers. However, a group of six HUNGRY men or athletes might need to order more.\n\nThe staff was really attentive, and the waiters cook and cut the meat for you. They also told us what the meats were as they cooked them. The staff was nice and held the door open as we left! Overall, I would make the hour drive to eat here again!"
    },
    {
        "id": 7,
        "text": "This place slaps. \n\nI came here to celebrate the first day of indoor dining last week, and that meal may have been my all time favorite meal of all time of all times.\n\nI tried doing Korean bbq at home a couple times, but this place is just perfection. The four of us ordered:\n\nBibim Naengmyeon (cold buckwheat noodles)\nGalbi Jjim \nLA Galbi\nSeafood pancake\nJae-yuk pork stir fry\nBeers and soju\n\nI don't regret a single thing we ordered. Can't wait to go back!\n\nThank you again for that amazing meal!!!"
    },
    {
        "id": 8,
        "text": "Went for lunch and it was a steal! It was two of us, we ended up getting bibimbop and cold noodles from the lunch specials and ordered several meats from the a la cart menu. The cold noodles and pork belly were my favorite! Servers were attentive and the space was nice and clean. It's in a sketchy strip mall, but don't let that deter you from going in. Can't wait to go back for dinner"
    },
    {
        "id": 9,
        "text": "I didn't like anything here except their spicy chicken. It's not my cup of tea per say. I didn't like any of their side dishes, dessert was terrible. Service was not bad. Service was relatively quick but not friendly or engaging. They also didn't make any suggestions or engaged with me, my mom or my cousin. They passed us a bunch of side dishes without letting us know what they are or whether we wanted them or whether we could have a choice of something else."
    },
    {
        "id": 10,
        "text": "Great quality meats! You're definitely getting your money's worth here. It's not the cheapest kbbq place, but they have great service and attention to customers that makes the price worth it. \nThe premium kalbi is the best flavor, but price + flavor considered, I would say the pork rib is the best value. Def worth checking out!!"
    },
    {
        "id": 11,
        "text": "I am a fairly new PA resident, having moved here from northern Nj little over a year ago. As a kimchi loving Korean who can live on kimchi jjigae all day, everyday; I was a little concerned about the authentic Korean food options available in the philly area. Well, I am concerned no longer thanks to the opening of So (translation: cow) Korean Grill. What a great BBQ spot! I love that due to their special smell-restricting grills, I don't reek of BBQ all day afterwards (because let's be honest, as much as korean bbq is a delight for the tastebuds, its aroma is not so delightful on our clothes). Great prices, welcoming and upbeat vibes, AND BEST OF ALL, they serve alcohol! Woot woot! Yep, I'm such a fan of this place that you may find me here once a week, along with my meat loving husband and daughter. All, wait no longer for a pleasant surprise and come by right now!"
    },
    {
        "id": 12,
        "text": "Hungry Box from UberEats was amazing! Bulgogi Beef, dumplings, omelet, radish, string beans with garlic, japchae & rice underneath! Best $13.99 spent in a long time! I can't wait to order from here again! Just wished I coulda ordered a beverage. Amazing food!"
    },
    {
        "id": 13,
        "text": "this place has excellent service and food!! would definitely recommend coming here for kbbq"
    },
    {
        "id": 14,
        "text": "This is one of the better kbbq places in the area. The service was great and we got japchae for free. Some of the side dishes were old (dried up sauce and vegetables were not as fresh) but overall, all the food tasted pretty great. \n\nSet A was more than enough for 2 people and we took home some leftovers. There was one meat that tasted almost identical to the Premium Galbi Beef Ribs, so there is no need to order the galbi as an addition to the course ($32.99). \n\nThe atmosphere and the decorations are really nice! I would definitely go again."
    },
    {
        "id": 15,
        "text": "Got the Hungry Box special and it was such a great value for the price!!! Highly recommend everyone trying this if it's still available post-pandemic! I'd love to try this place out in sit down form one day!"
    },
    {
        "id": 16,
        "text": "Just went today with my uncle. This is the place with the worst service if you want to eat \"dirty\" stuff than feel free to go there. Literally when we want to order stuff no one came to ask we literally have to call them. After food was on the table the waiter became completely \"blind\". They are just walking around back and forth doing nothing. When there's some dirty plates on our table the waiter literally just took a peek and than walk away. Also when they finally realized that there's a table of customers next to them, they finally did something but after they put the barbecue into the grill the waiter put the tongs and scissors on the f**king dirty table:). (Plus no one will change the barbecue net for you, they will just put all beef, chicken, and seafood on one net). What a nice service. This is a great place to go if you want to cook the barbecue and wipe the table by yourself. Totally welcome to come if you guys wanted to have a \"new experience\" of self servicing. ;)"
    },
    {
        "id": 17,
        "text": "This place is definitely a hidden gem. Such an amazing staff and a fantastic menu. The food is marinated perfectly and the cut of meat itself is superb. The atmosphere is quiet and relaxing. If you have a chance check the place out if you haven't already !"
    },
    {
        "id": 18,
        "text": "Highly recommend this place! The food is really, really good. We did the \"For 2\" meal, and you get a lot of food for what you pay. The service was incredible, and everyone is super friendly. The owner came over to talk to us after dinner and was genuinely nice / tried to get to know us and get feedback on how the food was. The interior is also super cute and new. It's cosy for dates, but they can also accommodate big parties. We'll definitely be back!"
    },
    {
        "id": 19,
        "text": "I ubereats kimchi jiggae at least a couple of times a week from here and it's always delicious. Today, my sister and boyfriend decided to dine in for the bbq and it was amazing. Everything was fresh, savory, clean and tasty. Because of covid there were hardly any people but their service was impeccable. Highly recommend!"
    },
    {
        "id": 20,
        "text": "Ordered a la carte but still worth the price... hands down best galbi in the area, but the other dishes were great too!\n\nTheir \"service\" dishes were perfectly timed and generous too. Definitely would recommend!"
    },
    {
        "id": 21,
        "text": "The food was amazing and the customer service was even better. We ended up here for a last minute dinner on a Thursday and it was just GREAT! Our server kept bringing out things for us to try from the chef while we wanted on our meal as well."
    },
    {
        "id": 22,
        "text": "We were in search of a new Korean BBQ place because our go-to restaurants were all packed. I was immediately drawn by the photos I saw online and thought this place MUST BE good...it ended up being one of my favorite K-BBQ places in Philly just from one visit!\n\nThe food was SO good. We ordered Set A (feeds 2) and the seafood pancake. It was way too much food for us that we had to pack leftovers  I think it was enough for 3 people if you wanted to drink soju too!\n\nThe interior aesthetic was beautifully set up! The dividers helped give each table their own space. The owner told us they have these new grills with fans underneath so you don't leave smelling like bbq. So, if you wanted to dress up for a date, you can. They had K-Pop playing on all the TVs  \n\nLastly, the customer service was top notch! They checked up on us often and helped us cook. \n\nI'll upload a short video to show what we ate!"
    },
    {
        "id": 23,
        "text": "came here for valentines day and had a wonderful meal!\n\nwe didn't get the combo but ordered a la carte since i only wanted the beef orders. we got the kimchi pancake, egg souffle, doenjang jigae, bibimnaengmyun, pork belly, boneless beef ribs, beef sirloin, and prime rib\n\nthe kimchi pancake was good, nothing special and same with the egg souffle. the banchans i was a little bit disappointed in, they were mostly vegetables or pickled vegetables; very simple. i really appreciate the variety of banchans at seorabol since they contain meats or protein \n\nthe meats came out and we began to grill! all of the beef and pork was so delicious! no complaints at all. service was a bit spotty but it was v day! luckily i'm not rookie in the korean bbq game so i don't mind cooking and cutting my own meats.\n\nthe bibim naengmyun was good but something was missing to me, maybe something in the sauce or maybe i wanted the noodles to be chewier? but compared to seorabol i would say they're on the same level\n\nthe doenjang jigae was a surprise hero; it was spicy, good pork flavors and i really enjoyed it! \n\nall in all, it's good to have another korean bbq option in the area and i'm a fan! welcome to the neighborhood!"
    },
    {
        "id": 24,
        "text": "In an otherwise dead strip mall, So (the Korean word for cow) Korean Grill will hopefully lead a revitalization of this area of the city. The interior is well designed and attractive. There are 8 symmetrically installed flat screen TV's around the dining area. The menu includes typical Korean classics and BBQ combos. The tables are all spacious booths with grill tops. \n\nWe came here for lunch and were very pleased. There is a $7.99 lunch menu with about 12 different options. We ordered a dolsot bi bim bap (stone pot rice bowl), mul naeng myun (buckwheat noodle I'm cold broth), bi bim naeng myun (buckwheat noodle in spicy sauce), and dukk mandoo guk (dumplings and rice cake soup). All very good. The dduk mandoo guk used a ox bone soup broth; unique, but it worked. Four dishes for $32 (plus tax, of course)? Good luck finding that deal anywhere else!\n\nWe will be back."
    },
    {
        "id": 25,
        "text": "Food was great! Waiter wasn't really able to answer our questions properly but manager came over and helped. Staff was very kind and helpful."
    },
    {
        "id": 26,
        "text": "I'm super excited about this place and with the new H Mart, I'm really hoping the shopping center gets a breath of new life.\n\nThe restaurant is the old karaoke spot from year ago and if you remember the layout, it's hard to imagine the changes they had to make.\n\nThe ambience is great and the decor makes for a satisfying Korean BBQ experience. It's not a hole in the wall mom and pop spot, and you should expect prices to reflect that. I feel as though Korean spots in recent years in the area are going for a modern aesthetic and that can definitely be a good thing.\n\nThe food itself is fantastic. Everything seemed to have an extra bit of effort put into the presentation and flavors.\n\nThe price might seem a little expensive but it's par for the course with Korean BBQ these days."
    },
    {
        "id": 27,
        "text": "The short review - IT\"S GREAT\nFor lunch, we ordered three servings of premium galbi for four people.  The galbi was marinated wonderfully - slightly sweet and filled with flavor.  The grill vented the smoke away from us and it was a clean cooking experience.  The serving size is something Fred Flintstone would love (for you young folk - he's a cave man cartoon character that loved to eat).\nThe banchan was tasty and our meal came with a small soybean paste soup (doenjang jigae).  We also ordered a haemul pajeon (seafood pancake).  The pajeon was crispy and filled with seafood.\nService was attentive and prompt.\nOverall, this place is great.  The owner spoke with us for a bit and she's a real professional that takes pride in her restaurant.  It's only two years old, the decor is spacious and clean and the food is excellent. \nCheck it out, you'll love the Korean BBQ."
    },
    {
        "id": 28,
        "text": "The food was amazing and the customer service was even better. We ended up here for a last minute dinner on a Thursday and it was just GREAT! Our server kept bringing out things for us to try from the chef while we waited on our meal"
    },
    {
        "id": 29,
        "text": "We have an unplanned visit to this place but man, the food is good, the price is not that expensive with the amount of food they gave us.\n\nwe went there around the beginning of the week and returned on the same weekend.\n\nServices are awesome."
    },
    {
        "id": 30,
        "text": "Service was great.  Came in, was greeted right away. I the atmosphere was good, tables were spacious, didn't make you feel cramped. Food was good also. Will definitely be back."
    },
    {
        "id": 31,
        "text": "Best kbbq place in Philly I've had in a while..! So glad they opened up and hoping they'll stay  If you get the course meal it comes with 6 different types of meat, and it's the perfect way to get a little taste of everything. The \"course for 2\" is actually enough to feed like 3 or even 4 people... highly recommend this place!!!"
    },
    {
        "id": 32,
        "text": "This place is way too good for the strip mall its in. Meat was so good, staff was very friendly, and the prices were reasonable as well. I left stuffed!"
    },
    {
        "id": 33,
        "text": "Excellent food and even better service!! Just had dinner with six of my friends and we all are very full and satisfied. I would highly recommend this restaurant to anyone looking for good kbbq."
    },
    {
        "id": 34,
        "text": "Food was good. The lady who owns/manages this place was great. I took off 3 stars because one of the male employees (not sure if he's a waiter or if he cleans tables) with dyed blonde hair and glasses is a straight jackass. My friends and I were finishing up with our food and this employee came to our table and said \"we need to start cleaning up\". We apologized and asked for the check (even though there was still some time until closing). The guy literally (I kid you not) started screeching, rolled his eyes back, and started marching angrily to get the check. We were a bit confused but when he came back a few seconds later with the check he said in the most disgustingly rude tone I've ever heard from any restaurant employee, \"you guys decide when we get to go home tonight.\" Like seriously? There's still some time left until closing and it takes what, 1-2 minutes to clean our table? It's also your job to work UNTIL CLOSING. If you're that upset with your job then you should quit, not ruin customer's evenings with your ridiculously childish and unprofessional behavior. \n\nI still tipped well because I wasn't sure if they split the tips at this place and our actual waiter was super nice, but this was absolutely ridiculous. He needs to get fired."
    },
    {
        "id": 35,
        "text": "Just stopped in for lunch today with my girlfriend and was pleasantly surprised. The staff were so kind and tentative; it really felt like they cared about our experiences, offering us suggestions on different ways of trying things. I've had all of the kbbq in the area and in my opinion, comparatively better than Kim's and Seorabol with a more beautiful interior as well. Would highly recommend coming for lunch, during covid, as the seating is more available!"
    },
    {
        "id": 36,
        "text": "Definitely worth my hike from South Philadelphia. This place has amazing deals. I was able to feed my 4 person group with the 2 person combo and we all left super full (and our wallets were happy)! The interior is very very comfortable and beautifully set up. The waiters and waitresses were all very attentive and amicable. They refilled side dishes the second they were empty. I wish there were more soju flavor options, but nonetheless I would definitely come back!"
    },
    {
        "id": 37,
        "text": "Randomly stopped in once Yelp told me this place was new in my area.   I was solo so I decided on the pork rib and beef sirloin.  Being keto I skipped all of the beginning accoutrements aside from the salad and soup.\n\nThe beef was solid but my god the pork ribs were AMAZING.  Those two items alone were enough to fill my belly despite my avoiding rice and every other carb on their menu. Servers were super nice and since it's 5 minutes from my house I'll definitely be back. \n\nMy meal came up to $24 before tip (I had two diet Pepsi's."
    },
    {
        "id": 38,
        "text": "I cannot talk about the customer service or food here enough! The food was great, the staff was wonderful, and they were great with following COVID courtesies! Such a great deal for the quality!"
    },
    {
        "id": 39,
        "text": "The kqq meats are all decent, nothing mind-blowing. But today, I'll write about their cold buckwheat noodle dish (neng-myun) and the fried dumplings. They have the best cold noodle dish, which is perfect by itself or to eat with meat (huge tip!!) in lieu of rice. It's served in a refreshing cold broth with veggies and is perfect for a hot, summer day. You can add the spicy gochujang sauce, spicy mustard, or vinegar in it to enhance but I usually just add a little bit of the gochujang sauce and it's good as is. The dumplings are PACKED with meat and so flavorful. I even had them for takeout and they were just as good (but definitely prefer them fresh out of the fryer at the restaurant). So good!"
    },
    {
        "id": 40,
        "text": "As shown in the photo, these 3 cuts of short ribs cost ~$27 including tax/tip. The cuts lean toward the fattier side. Also must grill yourself. All in all, probably not worth it."
    },
    {
        "id": 41,
        "text": "OMG !! I would definitely come here again ... and next time with bunch of other friend to introduce korean BBQ in fancy way but at lot cheaper price. Price is very friendly and we ate so much. \nThis place needs to be recognized... my wife loved it."
    },
    {
        "id": 42,
        "text": "Came early evening on a Sunday for the two-person bbq special.  Normally, I'm torn on 'feeds two/four' type meals because there usually is a catch. However, after reading the listing, I was impressed with the selection offered and figured the worse than might be done with this special would be a trade off of volume for variety.\n\nFor $75, you get the standard banchan, two miso soups, two salads, a tempura basket, hot egg dish, veggies to grill, and a whole lot of meat! The meat covers their beef and pork offerings, but does not include any fish.  I'm guessing the portion of each meat is smaller than an à la carte order. \n\nTo the potential portion concern, it was not a concern.  We left full with a small take home bag.  The banchan is amazing and unlimited if you aren't quite full.  Likewise, you can also add on some meat if you want more.\n\nAs for quality, well damn I was impressed. I wasn't a huge fan of the sausage, but beyond that we were fighting for each piece.  The pork belly or bulgogi were the overall winners in my mind.\n\nTo wrap things up, my own regret was not bringing more people in the party to try more dishes.  We plan to correct that mistake near term.  Hope to see you there!"
    },
    {
        "id": 43,
        "text": "Was so amazing!! The pork belly was so fresh and the staff was great! Very covid safe restaurant! Everything was so amazing and flavorful! We loved everything we had! We will definitely return !"
    },
    {
        "id": 44,
        "text": "This place might be the best KBBQ in philly right now. \n\nOrdered Set A and was blown away. It's the perfect amount of food for two people and the best bang for your buck to try a little bit of everything! The atmosphere of this restaurant is very cute and trendy. The meat quality was amazing, the best I've seen at any KBBQ place in Philly. The banchan was unique all with incredible flavors. I'll be dreaming about the asparagus marinated in the garlic sauce. The presentation of the food was also immaculate.\n\nDefinitely my new go to spot for an impressive date night!"
    },
    {
        "id": 45,
        "text": "This was our first Korean bbq experience. This place is amazing!!!! A hidden gem!! The service was incredible and the servers were super attentive. The setup and decor is comfortable and laid back. The food was so delicious. We enjoyed that they had smaller 4oz portions in ala carte so we could try a variety of choices. The price was not crazy either...we definitely be back!"
    },
    {
        "id": 46,
        "text": "Hands down this is the best korean bbq in Philly proper. Although it is NOT an AYCE, it might be better because it's not. Super high quality meat (although a bit pricey), and the service is on point. Hopefully they will continue providing the high quality of service even after some time and not flame out like most restaurants do in terms of service quality. HIGHLY RECOMMEND!!"
    },
    {
        "id": 47,
        "text": "Everything was amazing. You get so much food and the staff is so helpful and nice. We got the 2 person meal and  our whole table was full plus more."
    },
    {
        "id": 48,
        "text": "My boyfriend and I are from Boston and we came to Philly to visit family. We were craving Korean and decided to try this place out since it was new and had great reviews. \n\nThe cold noodles here are phenomenal; very authentic and the best we've had in the east coast of U.S. The bbq meats are really good cuts and portions are actually a lot, which is never a bad thing! The ban chan (side dishes) are freshly made and should be eaten. Their dipping sauce goes so well with the meats.\n\nThe ambiance is good for a couple or a group of friends or family. It's very clean and nicely decorated inside. They play kpop music but its not too loud and actually is great background music.\n\nLastly, the service is really stellar. Their staff is attentive and came to help grill the meat, as well as checked in to make sure we were happy with everything. They also gave complimentary warm dipping sauce, baked egg, and  watermelon as dessert. \n\nOverall, we had such a great food experience here that we are eager to come back again when we are in Philly. We highly recommend foodies and Korean food lovers to check this place out!"
    },
    {
        "id": 49,
        "text": "Great service, clean place and delicious bbq. We had the set for 2 and the portion seems too little for $70. Well the meat portion that is. However, this set did not come with white rice like normal bbq places include but they did have the bibimbap in the clay pot that was included in the set which came out last for us after eating most of the foods already. There wasn't much banchan offerings just the normal kimchi, pickle radish and some fish cakes. Other than that the food was great. Will be back again though since there's not much places with great bbq."
    },
    {
        "id": 50,
        "text": "We came to celebrate a friend's birthday. We ordered one of the prix-fixe menu items and were shocked by how much food came out. There were the typical kbbq items (beef, pork, chicken) and surprising items like grilled squid and shrimp! Both were super delicious. Great place for groups. Oh, best part was the ventilation system was so good that we didn't smell at all when we left."
    },
    {
        "id": 51,
        "text": "I enjoyed my meal there so much, it made me realize how MUCH I missed out on eating at a restaurant! The feeling of having that high quality beef grill before you sending tingles as you smell the aroma. Your eyes feast on the wonderful side dishes that decorate the table. I enjoyed it very much."
    },
    {
        "id": 52,
        "text": "Loved the food! Favorite was the LA galbi. Service was absent. I wish they had the bell there bc the staff would always walk pass us when we need help. Not sure if we were supposed to holler to get their attention. Overall I would return again bc the meal was sooo delicious! Certainly looking forward to next time!"
    },
    {
        "id": 53,
        "text": "The fact that they have a \"set\" menu option is very nice for non-Korean customers who are not very familiar with Korean food and how to order.  The set menus offer a variety of authentic Korean meat and vegetable side dishes. Their Galbi and soondubu (spicy soft tofu) soup are especially excellent, and I always order the kimchi pancake as an appetizer.  I do travel an hour to get to this place, but it's always worth it.  Went to this place 4 times these past 2-3 months for their amazing Korean bbq!"
    },
    {
        "id": 54,
        "text": "Amazing place with amazing people serving you. The portion for 2 is greatly for 2 hungry ones. The servers stays next all the time and give you information about what she's cooking. Great service and location with easy plenty parking"
    },
    {
        "id": 55,
        "text": "came as a group of 6. walk in only, but they have a good amount of room and i don't think anyone had to wait (even though it was a friday night - get in before 7 ish to be safe). super cute kbbq place right next to a massive hmart so u know you have dessert covered if you can still eat. high quality meats, good sauces/banchan. lovely waiters and owner was super nice.\n\ntechnically a 4.5 star because it is on the pricier side of things. if i went back, i wouldn't get the set meal (although it does have a lot for 6 people and we left pretty full) because it focuses too much on chicken. swap out to buy fewer, but higher quality cuts of beef/pork. lowkey the sausages are fire (but salty, so be careful and eat lettuce or rice LOL)\n\nended up costing me about $45 including tax, tip, and some soju."
    },
    {
        "id": 56,
        "text": "No service at all. Don't change the plate when it is burnt.Put the scissors on the dirty table.never coming again"
    },
    {
        "id": 57,
        "text": "Came to So Korean Grill for an early Father's day dinner with my family and had an amazing Korean BBQ feast that you typically can't get in or around the Philadelphia area of this quality. \n\nWe pretty much ordered the entire menu which consisted of a wide variety of meats and seafood for the grill and several rice and noodle dishes. The complimentary side dishes that are traditional to Korean restaurants were particularly impressive here as well. \n\nEverything was delicious but if I had to narrow down the best, I would go with the short rib, pork belly and grilled calamari. \n\nThe restaurant is brand new so the ventilation system of the grill almost completely removes any smoke and limits odor from the food catching onto your clothes. \n\nLast but not least, the menu is very well priced and the portions are huge so I definitely plan on coming back with a larger group."
    },
    {
        "id": 58,
        "text": "I have never been a big fan of Korean cuisine. It's place on the Asian food chain always lagged sufficiently behind Chinese, Japanese, and Thai. However, restaurants like DuBu in Elkins Park and So Korean Grill in Olney (of all places) have ignited my taste buds for Korean like one of Rocket Man's missiles to the North. The dishes are uniquely flavorful and prolific, and the service is amazingly efficient. It all adds up to a wonderful culinary experience and a great value, on top of it all. Just make sure to bring an equally prolific appetite, because the panoply of dishes are endless!"
    },
    {
        "id": 59,
        "text": "I went on a Saturday with my aunt and grandma for lunch. Wasn't super busy but there were already a few tables when we arrived. We got the SET A BBQ combo for 2 and the mulnengmyun (soup cold noodles) to share. It wasn't very good. More than half of the meat that was got was too tough and very hard to chew. Only the pork belly was somewhat okay. The cold noodles tasted bland and nothing like authentic Korean cold noodles should be. Most likely not going back again..."
    },
    {
        "id": 60,
        "text": "This place is absolutely delicious!! The restaurant is very cute and the ambiance is so chill! We really enjoyed the spicy chicken and the beef short ribs! The dumplings are to die for!! PLEASE COME TRY THIS PLACE!! \n\nIgnore the absolute sketchy mall, this place is a DIAMOND in the ROUGH!!"
    },
    {
        "id": 61,
        "text": "I went there yesterday with my friend and we got 2 appetizers. The place was pretty empty so we were not taking up any space. The stuff came up to us at lease 10 time and asked what do we want to eat. And we said that we are okay with just appetizers. Then the owner came up after giving us a side look and asked if that is all we will eat. I said yes, we are not hungry rn to which she said that she's making an exception but we must order the entree in order to be there. I asked her if that is a rule and she said no, but that's what she wants. After giving us multiple side looks and talking about us we finally left. Very disappointed. Not coming back. I used to come here with many friends but now we are not coming back a"
    },
    {
        "id": 62,
        "text": "Great delicious food and great service! For my first time eating Korean BBQ it was a great experience. The staff were friendly; they informed me what each meat and side dish was. I'll definitely be coming back again!"
    },
    {
        "id": 63,
        "text": "I considered this the best KBBQ in Philly right now. The food, the service, and the atmosphere are great! \n\nSet A is more than enough for 2 people. The quality of meat is good, and I love the side dishes they offered. \n\nThe waiter was super nice and accommodating. They regularly checked on you and helped you grill the meat. \n\nThe atmosphere is very modern but still cozy. The restaurant is very new so I love how I did not smell like bbq food on me. \n\nI will definitely come back here again."
    },
    {
        "id": 64,
        "text": "Absolutely great! Was looking for a place in Philly south Jersey area that served Korean bbq comparable to that on nyc or north jersey and so far this is the only place that kills that craving!"
    },
    {
        "id": 65,
        "text": "This place is amazing and I am very picky about my Korea food! The service and food are on point.  Great for a delicious, fun group night out. \nIn addition to the good food,  you don't have to actually worry about smelling after which is my biggest gripe about eating Korean BBQ.   \n\nHIGHLY RECOMMENDED! Best Korean spot in Philly by far!"
    },
    {
        "id": 66,
        "text": "The food tastes so good there.  I really like their Galbi Jjim， but I forgot to take picture."
    },
    {
        "id": 67,
        "text": "I normally prefer going to AYCE Korean bbq but this place is amazing and worth the money! \n\nI usually get the set A option, which serves enough food for two people. The set comes with miso soup, salad, tempura basket, bibimbap as some of the starter's items. As for the bbq meats, the set includes pork ribs, pork belly, sirloin, bulgogi, and sausages as well as others meats. I have to say, the set did make me full and I also didn't feel overwhelmed with the food, just enough to have a good balance of the various food items. The services are always very good. Everyone is so nice! I always enjoy coming back."
    },
    {
        "id": 68,
        "text": "Hella authentic trust me. Great value too. When they say it's so korean they're not kidding. Go shop next door at hmart and then come eat here aftetwards."
    },
    {
        "id": 69,
        "text": "Nice and clean. Seems to have vacuum built into the grill itself so you don't have loud ventilation systems going into the ceiling.\n\nWe had premium galbi, la galbi, and pork belly. Everything was very good, but next time will probably skip the premium galbi as the difference was not worth the extra cost vs. la galbi. \n\nAlso had dduk guk, kimchi jjigae, mul naeng myun -- all very good. Especially the mul naeng myun. Dduk guk had really nice tender meat and tasty broth. \n\nIf you eat a lot, it can get a bit expensive. But you can definitely tell that you get what you pay for as the quality of meat here is much better than other places that offer \"AYCE\" style KBBQ."
    },
    {
        "id": 70,
        "text": "Probably the best Korean Barbecue I have ever eaten!  They cool the food on the grill in front of you which was a first for me..the staff was so polite and they give you a TON of food! The restaurant is very Covid conscious and practices social distancing.  Definitely bringing my boyfriend back!"
    },
    {
        "id": 71,
        "text": "Party of two went there to grab quick (?) lunch. \nWe just ordered bibimbab and cold noodle\nBibimbab was average honestly , but cold noodle was pretty good. Atmosphere was good , nicely decorated interior \nServers were polite but not exceptional \nThey didnt come once to ask if we need anything until we asked for something \nI guess because we didnt grill? Can't judge yet\nOverall nice dining experience"
    },
    {
        "id": 72,
        "text": "Just came back from an early dinner here and everything was excellent!! The space is really nice and clean and the service was attentive. Best of all, I didn't walk out smelling like I was marinated in smoke. My husband and I shared the the premium galbi, pork belly and cold buckwheat noodles. The beef and pork were cooked perfectly at the table. The quality of the meat is definitely higher than other places that I've been to in the area. The pork belly came in a thicker cut which helps retain a lot of the juices once it's cooked. This will be my new go-to spot for Korean bbq in Philly!"
    },
    {
        "id": 73,
        "text": "Sooo much fooood! \n\nCool and clean interior; spacious and spaced out booths; service was fine.\n\nThe food:\nThey offer different rice and noodle dishes, soup, à la carte bbq items as well as different \"sets\" with a variety of bbq items and veg, that serve different numbers of people. If you go there really hungry, perhaps your party can finish the set designated for the number of persons in your party.\n\nOur set included different cuts of pork, including pork belly, sausage, different cuts of beef, chicken, shrimp, squid; a variety of kimchi; vegetables; salad and miso soup. It was a LOT of food.\n\nFor the most part, all of the proteins were tender and quite tasty. The kimchis were all excellent. The miso soup was unexpectedly good. The side salad was just filler. \n\nStaff set the grill temperature and assisted with cooking, as needed. When we turned up the grill to hasten cooking, a staff member came by and flipped it back to her setting. Lol. \n\nThe beauty of this place is that there is plenty of time for good conversation and noshing on the side dishes, while the food is grilling.\n\nThere is a return in my future, hopefully with a lot of greens in the interim to prepare for all of that protein.\n\n4.5 stars"
    },
    {
        "id": 74,
        "text": "Eat in and takeout are awesome! We ordered takeout tonight. Our foot was in the vestibule when I arrived, with my name! Contactless pickup and the food was delicious. Staff is always very friendly."
    },
    {
        "id": 75,
        "text": "I love this place. Their kbqq is so good and I love how they have set menus so you get that variety of different meats! When I recently went, we had an appetizer called Chadol Salad which is a salad with thin slices of beef in a delicious dressing and I can't stop thinking about it! We also got the nengmyun but I forgot to take a picture of it but it was so refreshing and tasty. The staff is always so nice and friendly. Make sure to check this place out, it's right next to the new hmart!"
    },
    {
        "id": 76,
        "text": "\"Don't judge the book by its cover\" the restaurant doesn't looks good from the outside but it is more than perfect from the inside. Service is good. Food quality is perfect and delicious. Go go go go."
    },
    {
        "id": 77,
        "text": "Not only was the food delicious, but the service was outstanding. I truly felt like I was in someone's home and they were cooking for me. They constantly came by to check on our food, asked if we needed anything, and made us feel very \"at home.\" You could tell they truly care. We got the Set 1, plus a seafood pancake, and left with a good amount of food for lunch tomorrow. Highly recommend this place!"
    },
    {
        "id": 78,
        "text": "I stopped by here for lunch before checking out the new H-Mart. It's a super convenient location right next door in the same plaza if you want to get your shopping done in one trip. The interior looks really nice and new, it has plenty of seating and is well spaced out. \n\nWe started out with the classic seafood pancake which was a good sized portion to share among my party of 3 and very tasty. The menu is quite extensive and offers set menus for 2, 4, etc but we ultimately opted to order meats a la carte. The marinated ribs were the crowd favorite and what I would definitely order again. Service was also attentive and they did a good job keeping an eye on our meats but giving us space at the same time. \n\nNext time the Korean BBQ craving hits, this will be my place!"
    }
]