[
    {
        "id": 1,
        "text": "On the plus side, the meat here is marinated well and tastes amazing. The women working here are friendly and very attentive. They will cook the meat for you at the grill so be prepared for that. There's also a pretty decent beer selection provided by the bar located in front and there's karaoke in the basement area if you feel like belting out a song after a few drinks. As a result, this place is open pretty late, too.\n\nOn the downside, the banchan isn't as plentiful as other places and the price is a little high for what you get. The building also looks like it's closed down. The first time we went, we had a hard time finding a way in and almost left. It really has that feeling of being a secret spot.\n\nStill, it's a great place to go if you don't feel like making the trek to Olney or have that late night itch for some BBQ."
    },
    {
        "id": 2,
        "text": "Bobos is split into 3 different services, a Korean bbq restaurant in the back, a sports bar in the front, and a karaoke lounge downstairs. The service is great in the restaurant, it's usually 2 older Asian women, they can't speak much English, but they are the sweetest servers I've met. The food is fantastic. The side dishes are plentiful and also delicious, scallion salad is the best. The meats are seasoned well and they help you bbq. The bar area is separated through double doors and it is a smoking bar, so be prepared to smell like smoke after hanging out for more than 20 minutes in that area. However, there's plenty of space, the bartenders are usually nice and accommodating and prices are not bad. Happy hour specials are 3 shots for $10 and $3 drafts. They also have a good selection of bottled microbrews available and creative mixed drinks. The karaoke downstairs is not anything special but it's good to know it's there. There's about 4 or 5 rooms available. Also, if you spend $100 at the bar you get an hour free at the karaoke room. All in all I do like this place a lot, it's a good go-to hang out neighborhood bar for me and my friends. The best part is definitely the food though. I had my birthday dinner here with about 12 people bc it's good for grouups and the service is great as I said earlier. Try the kimchi fried rice. Their bulgogi is seasoned and the kalbi is tasty! The purple rice is my absolute favorite."
    },
    {
        "id": 3,
        "text": "Love this place since my first time here 2 months ago. Menu is easy to navigate, service is wonderful and prompt( however I've only been here during the middle of the night when barely to no one else is here), food is delicious, overall just wonderful. If there is anything I am not too happy about, it's that I always go home smelling like burnt charcoal, but I guess that's not something that can be changed. Thankfully I always go home right afterwards so I can shower immediately.\n\nLooking forward to being of age soon so I can pay visits to their bar, usually sounds lively in there when I'm having a post midnight meal."
    },
    {
        "id": 4,
        "text": "RIP Bobo's, found out last week that this place closed down, you will be missed!"
    },
    {
        "id": 5,
        "text": "This place is just great. greaaat food."
    },
    {
        "id": 6,
        "text": "Nice, relaxing place with a home-y feel. Having the table-top BBQ was awesome, food was great"
    },
    {
        "id": 7,
        "text": "Good place to go eat and relax...\n\nFood on the restaurant side is good and it can be served on the bar side.\nNo BBQ on bar side though but everything else is A-OK!.\ngood place to have a few drinks and hang out with friends. food is a little pricey but its a bar...\n\nonly down parts would be the crowd is a little intimidating. and the bar smells like cigarettes, when you leave you will smell like it too.\n\notherwise this place is an awesome place overall. i would go back enjoy yourselves here if you don't mind the little stuff i listed. i really don't either."
    },
    {
        "id": 8,
        "text": "This used to be a go to spot if you wanted to meet \"the asian\" friends.  \nThe korean bbq here is really one if the best in Philly.  It is really well marinated. However they don't give you alot of side dishes like Seoranbol, so it's give and take."
    },
    {
        "id": 9,
        "text": "Server kept coming up to put our meat on but we didn't need that much assistance.  So felt a little rushed. Also tried to upcharge us when we only ordered the pork set and udon noodles. Seriously? Been here too many times with other people (never paid) but because I'm a female, you think I won't notice the price difference. And it doesn't seem to be busy cause its mediocre at best."
    },
    {
        "id": 10,
        "text": "I love this place for the BBQ. The bar is in the front and in the back is a quiet nook that allows you to enjoy their delicious food. \nThe women that run the place are kind and very friendly, setting up and preparing the food you ordered quickly with a smile.\nThe pricing is reasonable for the area it's located in. I have always had more than enough food for the price we pay. In a large or small group everyone leaves full and satisfied, with left overs to boot.\nI was told by a guy that runs a lunch truck in CC to try their fried chicken, it's some of the best. I have to agree, they make some damn fine korean fried chicken.\nFrom beers to bbq this place is great."
    },
    {
        "id": 11,
        "text": "Awesome food! great portion and friendly service! a Hidden Gem for sure in Philly!"
    },
    {
        "id": 12,
        "text": "So far I only been here twice and enjoyed it a lot. Of course the bill was pretty pricey by the time we finish ordering so I only come when I have enough money saved. \n\nThe restaurant is pretty nice. Kind of gives off a traditional korean feel to it. Around the restaurant you'll find posters of kpop idols and dramas hanging around. Since I keep up with those kind of things I find it really cool and interesting. \n\nI usually order the bbq meat and tried most items from the menu. My sister and I both enjoy the prime ribs ones. It's really flavorful and goes well with rice and the lettuce. I really like the spicy pork and its usually put in last because the sauce it marinate in burns on the grill. Like the prime ribs this is amazing and ordered it both time I went. For the other meat you can also ask for some red pepper paste for that special kick to add some spice to it. The pork belly taste really yummy dip in that and wrap up in the lettuce with the daikon radish. With the meal it comes with steamed egg for service and that's pretty yummy too. Eat it a bit early on in the meal because it'll deflate if it sits out for too long.  \n\nThey also have korean pancake, fried rice, stir fry, soup, hot pot and other different korean dishes if you aren't up for korean bbq. \n\nYou might think its a lot of work cutting up the meat and checking if its ready to eat or not but there's this really nice lady that comes around and periodically check on the meat and if you're new to korean BBQ, she'll show you how to wrap the lettuce and what possibility you can put into it. As far as I notice she's the only waitress but the times I went there's only us or another party."
    },
    {
        "id": 13,
        "text": "Having come from LA, I have really high standards for KBBQ, but I have to say that Bobo's really hits the spot. It's certainly on the more expensive side for their set combos for meat, but I will say their assortment is quite good for sharing. We had 9 in our party, and we all left quite full with $40 per person to cover the tab. The spicy pork and the kalbi were on point, and I'm a huge sucker for the gaeran jim. By far, the weakest item was the soondubu that came with the meal. Also, I would have liked more panchan variety. However, the service was quite wonderful. Lots of grill-side service and pretty timely with bringing out the dishes. It's a great place to go for groups, especially with bar and karaoke in-house."
    },
    {
        "id": 14,
        "text": "I love this place!!! It's so friendly here, the bartender makes you feel like you're at home. A beer or two after work here is the best way to end the night. Enjoy playing pool? This is the spot."
    },
    {
        "id": 15,
        "text": "Delicious Korean BBQ place in NE Philly. Although you can't order BBQ at the bar (rest only) you could order everything else. The bar is fun, stick w/beer bc bartenders there can't mix drinks."
    },
    {
        "id": 16,
        "text": "Korean BBQ newbie but was very impressed by Bobos. Went for dinner and had the marinated prime rim and green tea seasoned pork belly. Both were really tasty and fresh and the sides were all great, especially the bean stew and the steamed eggs. Bobos has a great beer selection... tried a dogfish head Midas Touch that went great with the BBQ.\n\nAfter dinner we had a couple of drinks at the bar and watched the phillies game on what is definitely the biggest tv i've ever seen. Played some pool and then headed home. Really liked this place and will definitely be back."
    },
    {
        "id": 17,
        "text": "Delicious BBQ, your typical Korean joint that has a lot of the classics on the menu.  I was told the Korean fried chicken was amazing but it was not as great as I had hoped.  The kalbi was awesome though and so was the nengmyun (cold buckwheat noodles, both the spicy one and the non-spicy in broth)."
    },
    {
        "id": 18,
        "text": "Friendly place with good food.  Went down to their basement for some karaoke and was very surprised by the bill.  I guess not much competition in Philly for korean karaoke if they can get away with charging that much for drinks and the room."
    },
    {
        "id": 19,
        "text": "Went to bobo with my wife and friends order more then we can handle portions was a lot .... Feels it's more family operated would come back again to try other dishes"
    },
    {
        "id": 20,
        "text": "Bartender Cindy and owner was very nice!! Made me feel welcome here. Drinks were made perfect just the way I like it and affordable. Karaoke room has more of a basement homey feel and has a top and new hits playlist. You're allowed to smoke in here so be prepared to smell of cigarettes when u leave, however this is a good thing for the smoking crowd. As far as the food, the fried chicken was just okay to me.The hospitality and drinks won me over. Ill be coming back again to try out the BBQ!"
    },
    {
        "id": 21,
        "text": "I can't believe i never reviewed this place. Korean bbq on one side and a bar on the other, with nrb in the basement - pretty much everything you need in one location. The bbq is not too expensive and good - not great. Definitely good enough to eat over and over tho. The service is great too. The bar side is really inexpensive and i always see familiar faces so i love it. If i was an outsider tho, i don't know how comfortable i'd be going here. In any case, the nrb is your typical nrb and you can easily order things upstairs and bring it down. This place makes for a great place to spend an entire night with friends and have a great time."
    },
    {
        "id": 22,
        "text": "Very good BBQ with complimentary bean stew and egg custard!!! Not very well-ventilated, but the food makes up for it!!"
    },
    {
        "id": 23,
        "text": "I'm a regular here so of course you'd here nothing but good news from me. I'm a huge fan of KBBQ and this is definitely on top of my list. Their menu isn't as pricy as other KBBQ places - although they do have an assortment of meats readily available as combos which are a little more. I'm not a picky eater, I prefer variety so it's great that they have portions of different meats available so you can pick-n-choose and basically customize your own KBBQ. Their \"egg soup\" appetizer for the BBQ is like a heaven fluff! I enjoy their salad & especially their fermented soy bean sauce (I usually run through 2 of them).\nTheir veggies are always fresh. Meats never taste frozen & their marinade (for any meat) is great! I had some left overs that I took home & heated up with some white rice, mmmmh, deliciouso! (: The ambience is very homey. The service is always great, they always cook your food, clear your plates when necessary, dining area always stays clean. The language barrier (Korean-English) isn't bad, they generally understand what you need/ask for so there's no problem there! There's always parking in the lot & it's not hard to locate. I come here for just good eats & hanging with friends so I'd def recommend Bobo's as an option."
    },
    {
        "id": 24,
        "text": "Great BBQ and there's karaoke bar in the basement.  So, after you done stuffing your face with Galbi you can go downstairs and sing your heart out to GD's Heartbreaker."
    },
    {
        "id": 25,
        "text": "really good prices for Korean BBQ..never ever busy for some reason..always liked the fact that the (fermented soybean soup),which was delicious, is complimentary with the BBQ since it is usually extra at other places.."
    },
    {
        "id": 26,
        "text": "I've been here once or twice so far, but mainly for friends' birthdays, not just for a normal night of drinking. I think I should come more often for everything that they offer. There are cheap drinks - last time I went, there was a special for 2$ SKYY? vodka shots. My friend also ordered samgyupsal kimbap for us (at 1:30 AM! crazy late), which was absolutely amazing. In fact, all our friends had stolen half our plate before we were able to take a bite! There are some games to play, a bunch of tables, and karaoke down below. I would be aware though - if you're not there to spend too much money, there is a $15 bar minimum on cards. \n\nTLDR: Good, affordable drinks and Korean food? What's not to like?"
    },
    {
        "id": 27,
        "text": "My friend and I went here looking to catch the end of a basketball game and maybe get some soju. The bar was empty when we got there and the game was over. It was a good night of drinking and talking due to an awesome bartender who pour strong drinks. More people came into the bar and everyone was friendly. The place did have some awesome drink names(surprisely I can't remember any of them). The bar portion is a nice place to go and chill. My friend was happy because they had brooklyn lager and they also had allagash white in bottle."
    },
    {
        "id": 28,
        "text": "when i go to a restaurant, i have certain expectations based on their reputation, reviews, the staff, the cleanliness, etc. etc. \n\ni have been coming here since i think back in 2005? it could be even way before that. the ownership has changed maybe 3-4 times, but EVERY TIME the staff has pretty much stayed consistent, the food has stayed consistent (minus the prices, they went up a little bit, but that is due to inflation). \n\nLeft side (Restaurant): you grill your own meat. but technically, you really don't because the e-mo's (aunts) do it for you. (this is not a biased opinion). no matter what the race, i have always seen them so friendly towards other customers, and always rushing over to see if you need re-fills on the sides, or you need more meat. they usually give you a plate with half fresh carrots that are cut up and half fresh korean cucumbers which are also cut up into pieces. as a courtesy, they give you eggs that are steamed/cooked in a korean brown pot, and a small side of soup that can be split between a party of four (they will give you more if you have more people). Anyhow, i recommend the \"pork belly\" aka samgyupsal which is complimented very well with the korean wine drink \"soju\" which tastes like rubbing alcohol but gets the job done. \n\nRight Side (Bar): i love the staff here. my bartenders are always quite friendly, and treat their customers with respect, and know how to have fun on the job. They dont water down the drinks, or try to rip you off, and trust me i know, i used to bartend. They might not over-pour but for the price your paying, you are getting a good deal. SO TIP YOUR BARTENDERS GOOD! :)"
    },
    {
        "id": 29,
        "text": "Korean BBQ seems to be the meal to try but not knowing that, I went for a few different things on the menu. BE WARNED, I got enormous amounts of food and a staggering bill. Had I known the portion sizes would be fit for two or three people, I would have altered my choices or waited until I had a posse to go with. \n\nThe fried chicken, about 15 pieces, was a little bland. Either as for hot sauce or bring the chicken home so you can doctor it up a bit. The portion of fries I received were steak fries and the portion was massive. I tried fried dumplings as well which were the highlight of the meal for me. \n\nThe other two dishes I had were cold(on purpose) purely experimental. I believe the one was cold buckwheat noodles. It was very flavorful. I'd recommend it for a more Korean food experience you'd try no more than twice a year.\n\nThe atmosphere in the front was a typical bar feel; dark, dingy, depressing, smelling like cigarettes and a little noisy with the music. All of the crowd seemed to be regulars as they seemed very relaxed in the environment. The bartender was pleasant as was the lady who took my order and served my meal. The restaurant area was much brighter and more inviting than the  hole in the wall feeling I got from the bar. Still the restaurant attire felt a little dated with all wooden furnishings, but I'm assuming that's typical of a Korean dining experience.\n\nThe only thing I purchased from the bar were two Blue Moons which I discovered I do not like at all.\n\nMy biggest offsets were the prices and that I was not given a heads up about the portion size. Insist on paying up front as I did so you can know exactly what you're getting yourself into.\n\nOn my next visit, I will be sure to try the Korean BBQ and make sure that I bring at least one other person along. \n\nThe restaurant side is good for kids."
    },
    {
        "id": 30,
        "text": "Good korean food in philly.  Ask the lady for \"service\" and she will get you stuff free of charge."
    },
    {
        "id": 31,
        "text": "After hearing abut this place for a while, I finally decided to give Bobo's a try, and I'm so glad I did because IT'S SO YUMMY!!! The BBQ selections are pretty good and the menu is simple and easy to read/navigate... Important for non-Koreans like me :)\n\nI was really impressed with the quality of food, especially for the price. My friends and I order three dished of meat (beef, short ribs and shrimp) and a seafood pancake and our tab was @$75. I could have easily spent double that at Ms. Kim's.  The location was convenient and the service was great. My only gripe is that they don't give you a vast array of side dishes like other places, but I guess they make up for that with their steamed egg and tofu soup. Will definitely go back!"
    },
    {
        "id": 32,
        "text": "I love Korean BBQ! Bobo's, according to my Korean source in Philly (aka my bf) is pretty popular. The food was awesome, and we had enough to feed a small army. We ordered the special, which comes with a huge plate of beef (which they cook right at your table), kimchi side dishes, rice, salad, udon noodle soup, and a couple other small dishes. There is also a bar adjoined to the restaurant, with a pool table and several tv's, where you can also eat."
    },
    {
        "id": 33,
        "text": "Bobo's is both a Sports Bar on one side and a sit down Korean BBQ on the other.  My rating to both is top notch.\n\nI'll begin with the food because that is what usually brings me there.  They offer a selection of fresh and frozen meats which will be grilled to perfection right at your table.  Even though the BBQ comes with nice portions of sides (a stew, an egg-based dish, kimchi, vegetables), you'll still want to eat quickly because you won't want whoever you are with to have more than just their share =P  \n\nOn the bar side, you'll find great specials, friendly bartenders (yes, I'm talking about you Grace), and a great selection of bottle beers.  They'll also have the game on and a pool table available.\n\nTwo final notes, Bobo's has Karaoke rooms downstairs if that is your pleasure.  Additionally, the entire staff is extremely friendly - comforting to a non-Korean like myself."
    },
    {
        "id": 34,
        "text": "Probably one of the best korean bbq places in Philadelphia. I used to come here every single Thursday for dinner and drinks in the bar in the back. I only stopped because I was getting too lazy to drive all the way from downtown up to NE Philly and I was getting really fat.\n\nBut the food here is great. Lots of side dishes with the BBQ and you can even order food in the bar (no BBQ). The servers in the restaurant are nice and the bartenders are cool. Definitely one of those places where everyone knows each other."
    },
    {
        "id": 35,
        "text": "Best kept secret, don't tell too many people for fear of it becoming douchy... Food great, authentic and fresh."
    },
    {
        "id": 36,
        "text": "I don't know if the guy Jen D mentioned from a review years ago is the guy that my friend and I met, but he is hella cute.  Just thought I'd say that.\n\nIn fact, this review has nothing at all to do with the food.  We go singing here at the karaoke downstairs, and the mics here are awesome.  I HAVE eaten here before and I don't remember it one way or another so the food must have been fine.  So four stars feels about right."
    }
]