[
    {
        "id": 1,
        "text": "We had  bulgogi at Buk Chon's Old City Fest booth. I had it as a rice bowl and my wife had it on a roll. In deference to local culture (I guess), both were topped with cheese and I added Kimchi. The meat tasted good enough to suggest a trip to the restaurant."
    },
    {
        "id": 2,
        "text": "We've never been disappointed here. Everything we've had was delicious! Our go to is the bulgogi and bimbap bowl."
    },
    {
        "id": 3,
        "text": "Summary: worth a try if you're in the area\n\nOverall, the food was good. We had the fried chicken appetizer, ribeye bulgogi and the Kimchi fried rice. I didn't care too much for the fried rice but the rest was tasty. Service was not great but we had brought wine to enjoy and this the slowness wasn't too bothersome. The menu is accessible and reasonably priced. Love that it's BYO. I probably wouldn't make a special trip to come here but if I found myself in the area would return for dinner and to try some new things."
    },
    {
        "id": 4,
        "text": "Last night my wife and I came in for Dinner. We weren't quite sure what to expect but decided to give it a try since it was in the city and we weren't quite sure what to eat. The food people posted looked good and we gave it a shot. We were not disappointed at all. We had the Korean Chili wings, Kim-Chi Fried rice and the Spicy Pork Bowl.\n\nWe wish the Korean Chili wings were a little bit spicier. However, we did like the fact they were super crispy and boneless. We weren't really looking to get our hands super messy last night so it was perfect!\n\nThe Kim-Fried rice was pretty good. It wasn't too spicy and it didn't have a sour after taste like some places we have tried. The portion was also perfect. not too overwhelming at all. \n\nI felt like the Spicy Pork Bowl was the best. Normally, when you order a hot stone bowl the rice at the bottom tends to burn very quickly. When I started tossing the rice to mix it with the veggies and the pork. It wasn't burnt at the bottom either! The green onions were a little big they weren't cut into bite size so I picked them out of the bowl. Besides that everything was great. \n\nThere's not a lot of Korean places that I would recommend but I would definitely go here."
    },
    {
        "id": 5,
        "text": "Everything we ordered was good. As someone who grew up in Toronto with a thriving K-town where side dishes are expected, I was nonplussed. Up your side dish game."
    },
    {
        "id": 6,
        "text": "The food is so addicting! The Korean fried chicken is a must have!! It's perfect. It's crispy, sweet and spicy, practically candied. So delicious! Then I always get the Galbi. If you like short ribs, you'll love the Galbi skillet or rice bowl. The short rib is so tender and the flavor is to die for. Real Unami. Today I tried two new things that I will definitely be ordering again; the scallion pancake and shrimp fries! Both were amazing!! \nI love the inside of this restaurant. It is cozy yet feels spacious because of the high ceilings. The brick walls, candles, murals, and lighting add the it's welcoming and warm vibe. I love coming to Buk Chon with friends for a fun night or with my boyfriend for a quiet date. Service cannot be beat! Takeout is also always another great option for us Old City locals as well. \nThird time back this week. Will be back very soon!"
    },
    {
        "id": 7,
        "text": "My boyfriend and I are just visiting Philadelphia for the weekend and we stumbled across Buk Chon. We didn't really have any expectations or know what to expect. It was AMAZING! We had the beef bulgogi, spicy pork bun, double fried sweet potatos and the fried boneless chicken wings with honey soy sauce. Everything was so delicious!  The portions are a great size, the price was reasonable and the staff were so polite. Would HIGHLY recommend trying it out."
    },
    {
        "id": 8,
        "text": "Great food and it comes in very generous portions. The service is great as well. I would highly recommend this restaurant."
    },
    {
        "id": 9,
        "text": "This place is legit. Best Korean food in philly. The owners passion for quality service and food is second to none. Try everything and explore the menu. Make sure to grab a reservation."
    },
    {
        "id": 10,
        "text": "Everything was delicious. I'm doing my best not to compare this to my mom's cooking because that would be ridiculous. This has an interesting blend of korean fusion dishes to appeal to everyone and that's pretty much what I had. Everything was delicious, and my american friends who never had korean were very pleased. When you're craving your mom's cooking like I do all the time, this might not be your #1 choice but it's a tasty dinner spot nonetheless."
    },
    {
        "id": 11,
        "text": "Stopped in last Saturday night on a visit to the area. We grabbed some drinks at Glory down the block and had a hankering for Korean. We arrived around 9.45p and was pretty surprised to hear that the kitchen would close at 10p (on a Saturday night)! \n\nHad the spicy pork Bibimbap (pictured) which was excellent. Not too spicy and a generous enough portion. \n\nEveryone with whom I interacted was super friendly - definitely a strength. Would strongly recommend this place for those looking for quality Korean fare but be careful to arrive on the early side!"
    },
    {
        "id": 12,
        "text": "Excellent friendly service and hot delicious food. Enjoyed the spicy/flavorful ramyun soup and a generous helping of kimchi fried rice. Would certainly return!"
    },
    {
        "id": 13,
        "text": "The beef bowl and soondoobu was good. No banchan here like traditional korean restaurants but the food spoke for itself."
    },
    {
        "id": 14,
        "text": "3rd review. Great place! Owner was super super friendly and accommodating. Food was excellent. Some of the best Korean I've had in recent memory. Ambiance was pretty rad as well, nice n cozy, cool walls. Most certainly be back!"
    },
    {
        "id": 15,
        "text": "Spicy delicious Korean food. I tried the spicy pork buns which were flavorful and had a tinge of sweetness to it. I also had the kimchi fried rice which I asked to make it spicy and they sure didn't disappoint. On my revisit list."
    },
    {
        "id": 16,
        "text": "Love the restaurant atmosphere, it had a nice cozy feeling\nThe food tasted  really good . Had the Galbi( short ribs ) it was very tender and had a good taste \nAlso orders the army stew , wish it had more ramen but still had a good taste it"
    },
    {
        "id": 17,
        "text": "I've eaten at the restaurant this place replaced, but I have to say I'm not upset. The beef bimimbap was extraordinary and my friend had the tofu stew. They also have half off apps with the purchase of a main course, which were both also great. The only reason for docking a star is that while we were only one of two tables there (we did a pretty early dinner at 4:45), the waitress took quite a while to come over when we were ready for the check."
    },
    {
        "id": 18,
        "text": "Had lunch here today \nHave been wanting bimbimbap for several weeks. Ordered the spicy pork version based on servers recommendation. It did not disappoint. Everything I wanted plus some. The spicy pork was flavorful and tender. The veggies were perfect texture and the hot stone bowl kept the meal warm throughout \nI loved it. :)"
    },
    {
        "id": 19,
        "text": "We ate here with a Korean friend who dis ALL the ordering. It was so good. \nCan't wait to go back!"
    },
    {
        "id": 20,
        "text": "Great food, music and environment. Cool place to drink, have fun and go on dates. Definitely one of my favorite places to go in philly for good korean food. Also great location near Penn's landing and only a short walk away from franklins fountains great place!"
    },
    {
        "id": 21,
        "text": "Exceptional food! Stumbled across this Old city gem while looking for \"Hot and New\" restaurants in Philly and so glad I did! \n\nFirst off, the interior is rustic and tasteful. I mean who doesn't love red (brown maybe?!) and white brick walls! There is woman's face painted on the red wall and candles adorn the white one. \n\nMenu looked so good that we wanted to order everything on it but went with The Spicy Pork Stone Bowl, Kimchi Fried Rice, Tofu bibimbap stone bowl, Spicy Chilli Gnocchi - if you are already drooling over the names then you have to try this place! Everything was so flavorful and I am so so glad that spicy means spicy here! \n\nWith the stunning brick walls, a large industrial style chandelier, beautiful charcoal gray stone bowls, clean presentation and amazing food, this place clearly is one of the top Korean restaurants in Philly. I can totally see it getting more and more busy as it gets famous so come here eat while it is still a secret haha."
    },
    {
        "id": 22,
        "text": "Friendly, fast service + The fried chicken is to die for! (I got mine with the honey soy sauce) So crispy and juicy! Definitely coming back."
    },
    {
        "id": 23,
        "text": "Absolutely delicious Korean food! I especially recommend the fried kimchi and tofu! Good price and perfect location. Although the menu is some what limited, however everything is well prepared and taste like home."
    },
    {
        "id": 24,
        "text": "I lovedddd this place! It was BYOB so we brought a couple bottles of wine. I got the rice gnocchi and the soft tofu stew. Everything was so yummy and the rice gnocchi had great texture. You can't really go wrong with tofu stew so that was a safe one to order. The place was cute, kinda small so our group of 9 had to split up at first if we didn't want to wait a while. They were so nice and let us combine once the table next to us freed up though!"
    },
    {
        "id": 25,
        "text": "Service: Excellent!\nAtmosphere: Beautifully casual! Can't beat BYOB!\nFood is where the stars fall. The Banchan pickled platter was incredibly tasty. Japchae was equally delicious. Fried chicken seemed to be a ton of breading, not much sauce or chicken. Scallion pancake with pork was very bready and almost soggy. Pork buns were decent. \n\nWhat is really a huge bummer was to find that the Bulgogi skillet was really just glorified philly steak in a hot skillet with rice. It was tasty but for $18, no thanks. I thought maybe I was being a bit critical about the steak being just thin chopped steak until I saw their lunch billboard advertising the bulgogi as a steak sandwich special.\n\nThe server accidentally put the wrong item in so we ended up getting the pork buns for free. Again, excellent customer service!"
    },
    {
        "id": 26,
        "text": "Great addition to the neighborhood. Who doesn't love a Korean BYO with delicious food, top notch service, and great atmosphere? The restaurant itself it really clean, sophisticated yet comfortable, and surprisingly quiet despite a good crowd. Everything we ordered was delicious. Don't miss out on the sweet potato fries, green onion pancake, braised short rib, and rib eye skillet."
    },
    {
        "id": 27,
        "text": "Two lunches were delicious. And tonight went for dinner with a friend, shared 4 appetizers and 1 main dish and loved every bite."
    },
    {
        "id": 28,
        "text": "This place was pretty dope. And the food was really good. I was excited to see a Korean spot right around the corner from my hotel and found myself eager to check it out. (I'm glad I did.) When I arrived, there was only a group of four sitting in the back. I could see their table was full of different items and they were all eating family style... Trying everything... Laughing... Having a good time... I was low-key jealous.\n\nI ordered the Bulgolgi with a Seaweed Salad. The meat didn't taste like most Bulgolgi that I was used to, but it was still uniquely very good on it's own. The Seaweed Salad tasted a bit more traditional and great.\n\nI would definitely recommend this place and would love to come back... Especially when I make more friends in the area. One day..."
    },
    {
        "id": 29,
        "text": "I have never eaten at the actual restaurant but have ordered take out several times. The food is wonderful. Very flavorful, nice presentation. It was hot when delivered despite living on the opposite side of town then the restaurant."
    },
    {
        "id": 30,
        "text": "Really good Korean food.\n\nVery simple menu, but it has everything I would typically order.  Prices are very reasonable.\n\nThe Korean fried chicken was incredible.  The seafood pancake was very good as well. \n\nThe staff is very friendly.  The Chef (Maybe the owner?) was really friendly and was very attentive.  I'll be going back."
    },
    {
        "id": 31,
        "text": "Five stars. At first I was a little suspicious, but I had vegetables and chicken and it was amazing. It was a little bit of a longer wait, but I can't blame them for having business. Overall, Food was great, Price was cheap, and the female waiters were hot"
    },
    {
        "id": 32,
        "text": "We had the spicy pork buns, kimchi, and ribeye the bowl with rice. Everything was great! It was super fast and great service! We will be back because we saw the double fried chicken on the way out and are definitely coming back to try it!"
    },
    {
        "id": 33,
        "text": "I love the crispy spicy pork bao buns, a total game changer, and the Korean fried chicken. I go for these two items regularly. The bulgogi was a little underwhelming, but it's a size-able portion and there are lots of little accoutrements, which I adore. The restaurant itself is very cute and trendy and the service has always been great. Check it out, especially the bao buns!"
    },
    {
        "id": 34,
        "text": "The food was great, not too expensive and very delicious. The decor is awesome, really nice vibe. Finally, the staff were very friendly and take care of their guests."
    },
    {
        "id": 35,
        "text": "I haven't been in Olde City in quite a long time, so while walking with coworkers during lunch was pleasantly surprised to see a Korean restaurant.. It's not your mom's traditional Korean restaurant, it had some modern/hip feel to it, and appears to have been a renovated bar.  The narrow entry way leads to more spaced out, dimly lit seating in the back.  \n\nThe menu was pretty standard of a Korean restaurant, appetizers such as korean wings, entrees such as bibimbap, spicy noodles, etc. I got the short rib Bibimbap for $15 while my colleagues both got the spicey soup.  Because it was a new year special, they provided a nice little rice cake soup, nice touch.  \n\nOverall, the food and service was good, no complaints.  The portions, could've been a little bigger, but nothing.  I'd come again if in the mood for Korean food."
    },
    {
        "id": 36,
        "text": "I absolutely LOVED everything I tasted here and have been dreaming about it! In fact, I'm just recently back from traveling and it's the first meal thought about and craved!! \n\nWe came for a large family lunch and had no problem reserving a table last minute in their somewhat odd fitting medieval feeling small dining room on a Sunday afternoon. (Watch out, they do close between lunch and dinner from 3-5pm!) I LOVED their exposed brick walls, nooks for their dripping white pillar candles, street art mural and chandelier! Good vibes!! \n\nI shared the tofu clay pot bibimbap with my daughter. It was tasty, piping hot and filled with veggies and crisped rice!! Delish! They give you your choice of sauce to mix in if you so choose, but I ate it plain and really enjoyed it! (It's vegan minus the egg to top.) My sister in law had the same thing only with beef and thoroughly enjoyed hers. (She's Korean, I think that holds some weight!) \n\nMy youngest ordered her Korean favorite and a great vegetarian option, the japache, but here it's served with sweet potato noodles. It was so delish!! Perfectly cooked noodles and big vegetables in a warm, comforting toasted sesame oil! Yum! \n\nThe table also ordered the Tteokbokki to share. It's a Chili rice cake gnocchi! I was so intrigued! There's both rice and fish cakes, so veg heads, examine closely if splitting this one. The sauce has a great kick! It's a traditional dish made modern with the addition of the mozzarella cheese. (The fusion of new and classic seems to be a theme with the entire menu, so keep your minds open if you're looking for a more traditional Korean meal here) \n\nMy brother, who lived in Korea for years was happy to see \"Army Stew\", which is apparently somewhat rare in the states. \n\nEveryone was pleased and we immediately spoke about a return visit! \n\nPrices were reasonable and it's BYO!\n\nHappy Hour is Tues, Wed, Thurs, Sun from 5-7. Half off apps with full entree purchase."
    },
    {
        "id": 37,
        "text": "We got the Galbi and kimchi fried rice. Absolutely loved them. Galbi is cooked in a French style, a fusion of Korean and French, and looks more like a lamb shank."
    },
    {
        "id": 38,
        "text": "Absolutely worth to try this place. Glad to have this Korean restaurant in the Old City. It is a quiet and clean place. The owner and chef were really friendly. Had a nice service too. Chilli gnocchi is spicy at the first taste but it becomes sweet after that with cheese. Soon dubu is a little bit sweeter than what I expected but the overall taste is good. Galbi bourguignon bowl is the one you should not miss. It is so soft and just melts in your mouth. Overall banchan taste is good and nice plating. Of course, I want to visit here again!"
    },
    {
        "id": 39,
        "text": "My boyfriend and I absolutely loved our meal at Buk Chon! We got the fried sweet potato appetizer and seaweed salad and the kimchi fried rice, bibimbap on a stone bowl (with tofu and the chili sauce), and the galbi bourguignon for our entrees. The galbi fell off the bone and the kimchi fried rice was perfectly flavorful, while the bibimbap was incredibly filling and flavorful. All in all, I would absolutely recommend it for lunch or dinner. Our waiter was also very courteous and responsive."
    },
    {
        "id": 40,
        "text": "Went there for lunch on Saturday, very cool and clean atmosphere. Waitress was friendly and attentive.  We had some of their $9.99 lunch specials; rice cake gnocchi, spicy pork, beef and fried kimchee rice.  All were delicious but the best was the korean fried chicken for starters, we ordered both the chili and honey-soy...they were super crispy and a ton of flavor.  We will definitely eat here again"
    },
    {
        "id": 41,
        "text": "So. Good. Ordered the japchae, chicken (Chile sauce for the win), soondubu, kimchi and pickled radish. Was the perfect amount for two people -- we walked away stuffed! So glad to have a great Korean restaurant in Old City."
    },
    {
        "id": 42,
        "text": "I really enjoyed dinner here. This ambience is nice and cozy, the food is delicious and the service was topnotch. I came here on a Saturday night with my wife and sister. We had just left Glory Beer a few doors down, and decided to come eat here. We did not realize until we were seated that the place was byob. Luckily, there was a beer store on 2nd Street about two minutes away, and I grabbed a few beers. \n\nWe order the Korean Fried Chicken appetizer, which came out quickly and was essentially boneless bites. The batter was delicious and the flavor of the sauce was on point. \n\nFor dinner, I ordered the sizzling beef bibimbap. My wife ordered the bulgogi and my sister ordered the spicy pork rice bowl. My sister asked for a mild version and the server said they will try. We all really enjoyed our meals. The rice was cooked perfectly.  The flavors were delicious.  The meat tasted fresh. The portions were as expected. The pork rice bowl was still too spicy for my sister, so my wife switched with her and they both enjoyed the rest of the meals. I was super impressed with this place and was happy to have stumbled upon it. I will definitely be back. It has a very classy yet comfortable atmosphere. It is great for a date night!"
    },
    {
        "id": 43,
        "text": "This restaurant is simple amazing. It is in a very nice, pleasant area in the city and could easily be missed due to it being such a small restaurant but do not be fooled.\n\nI went here for the first time and my experience was nothing short of great. Everything from the decor, intimate settings service, food and pricing was worth my time being there. \n\nI ordered the Korean chicken wings and are really good. If you are looking for a good place, with a intimate setting, I would suggest considering this place.  Also, make reservations as this place can fill up fast"
    },
    {
        "id": 44,
        "text": "Found it on Yelp! Great food and people!\n\nWe ordered a stone bowl spicy pork & beef and a korean fried chicken."
    },
    {
        "id": 45,
        "text": "We went for lunch with two small children and while the decor is very stylish the set-up was perfect for small kids. The server was very friendly and the food was delicious - and the lunch specials are great deals. All around great dining experience."
    },
    {
        "id": 46,
        "text": "Service is fine. My soondubu is like the worst I've ever had- no flavor at all. Fried chicken was ok, three stars. My hubs also thought his food (spicy pork) was just ok. Can't really recommend."
    },
    {
        "id": 47,
        "text": "Excellent Authentic Korean Cuisine. Staff knowledgeable and owner operators are wonderful"
    },
    {
        "id": 48,
        "text": "Hip, trendy, and satisfying. We went here for my brother's birthday lunch and it was such a perfect atmosphere for a casual family meal. Their fusion food was amazing. My parents have never tried Korean food before and they left happy."
    },
    {
        "id": 49,
        "text": "They have the best soondubo soup here hands down! I haven't tried any other dishes yet but I can't wait to come back and try the Kimchee fried rice. This husband and wife shop is so cute! Only negative is the yogurt soda drink was a no good."
    },
    {
        "id": 50,
        "text": "We had a delicious meal at this new Korean restaurant in old city. Every dish was perfect. The portion sizes were plentiful and the wait staff was attentive. I really want this place to succeed because the food is delicious. Spread the word!"
    },
    {
        "id": 51,
        "text": "What a gem!!!! We stumbled on this place when we couldn't get a table somewhere else and it was a great find. They had \"happy hour\" on a Sunday night and offered 1/2 off appetizers if you order an entree. We ordered 3 entrees and 3 appetizers for three people and were pleasantly full when we left. The fried chicken appetizer with the chili sauce was our favorite by far!  The sweet potato noodle appetizer was another unexpected favorite. The service was fantastic and the restaurant was clean and modern. This place really earns the 5 star reviews everyone gives them!!"
    },
    {
        "id": 52,
        "text": "Walked by this place last week and saw that they were opening up so was looking forward to trying it out. This place definitely does not disappoint we ordered about a total of seven or eight dishes and every single one of them was absolutely delicious. By far one of the best authentic Korean restaurants around. I will definitely be back here again."
    },
    {
        "id": 53,
        "text": "Me and my friend heard about a new Korean restaurant in old city and we came right away to try it since we loved korean food. The food was very delicious and they had authentic korean drinks that I couldn't find anywhere else. The staff were also extremely nice and helpful. Definitely coming back and I recommend to anyone."
    },
    {
        "id": 54,
        "text": "I come here for lunch every week specifically for the Ramyum-spicy noodle soup. I LOVE IT, I CRAVE IT, I NEED IT NOW! The pork buns are also very delicious. \n\nPLEASE have the spicy noodle soup for dinner so I can come here even more. I beg you!"
    },
    {
        "id": 55,
        "text": "Absolutely loved it. It's the authentic Korean restaurant Philly has been yearning for. Their staple dish, the Galbi Skillet was phenomenal--tender, juicy and flavorful. Korean fried wings and seafood pancake were also perfectly made. On top of that, Chris, the owner shared his utmost hospitality in welcoming my friends visiting from NYC and Boston. They are an ethnically diverse group so he took the time to share Korean drinking culture tips, phrases and an overall fun & fantastic experience. Cheers!"
    },
    {
        "id": 56,
        "text": "Walked past here and a hunger pang struck, my stomach had made up its mind. The staff were very friendly, and we tried out two Korean drinks new to us, the Hong Cho, which tastes a bit like kombucha except you actually enjoy it, and the Yuza, a citrus drink.\n\nWe ate a bibimbop and a marinated salmon. A word of warning, the salmon is raw. Both came with side dishes, and white rice. The salmon is marinated in soy sauce and goes perfectly with a bit of white rice, the quality shows. The bibimbop was delicious and piping hot."
    },
    {
        "id": 57,
        "text": "I, unfortunately, have to update my review. The owners are so disrespectful and cannot handle take out or delivery orders. Their attitudes make ordering the chef's delicious food absolutely not worth it. Chris and Alicia, you need to get better servers and learn how to use delivery services and write down take out orders. I cannot believe I brought in so many family and friends to be treated the way I was today. I will NEVER order from or come here again. Neither will anyone I introduced to Buk Chon."
    },
    {
        "id": 58,
        "text": "We come here regularly (the Old City location is convenient and where the former Zento used to be) and are working our way through the menu--which is not that big--but what they do, they do well. All things considered, Buk Chon is arguably the best Korean restaurant in Philly, even if it's not exactly traditional (banchan side dishes cost extra; and pork buns, while tasty, aren't Korean either). The staff is friendly, but my only suggestion is that one waiter in particular invest in some body spray, as it rather noticeably detracts from the dining experience."
    },
    {
        "id": 59,
        "text": "I say everything is amazing here. fried chicken is amazing well seasoned so is the rib eye and the fried oysters are amazing as well. very delicious restaurant. very convenient being close in the city. a must try."
    },
    {
        "id": 60,
        "text": "Had to try the salad as traditionally there is no salad dish in Korean cuisine. It was surprisingly good! If there ever was a Korean salad, this is how it would taste! My daughter loved the fried chicken. She said it was very crunchy, flavorful, but a little dry. She really enjoyed it! Overall a very quaint, relaxed, diverse, and intimate environment. Loved it. Would come again."
    },
    {
        "id": 61,
        "text": "This is a great place to go on date nights! The atmosphere is nice and this restaurant has great food options. It is not the most authentic korean restaurant and is more catered toward the locals in the old city area. \n\nI went here twice and I must recommend the ddukbokki which they call \"chilli rice gnocci\" and the seafood panacake.  For a main dish, the stone bowls/beef bowls are decent. However the soft tofu stew is better in more authenic restaurants.  I would mostly come here for the tasty appetizers, atmosphere, and BYOB experience."
    },
    {
        "id": 62,
        "text": "New place to check out. Not too different than what Zento to used to look like but a great menu. Had the Korean fried chicken as an appetizer and the \"army stew\". Both really good. Good service and the owners said \"hi\". Worth it."
    },
    {
        "id": 63,
        "text": "Buk Chon does a nice job of filling in a gap in the Old City restaurant scene. It's good to have a Korean option.  To be honest, it's not my favorite Korean restaurant in the Philly area - indeed I prefer many of the ones in the Koreatown around Cheltenham Avenue - but there is still much to like here.\n\nThe physical look of the place is def appealing to the eyes - especially the rear space with the great chandelier and exposed brick wall embedded with candles.  An order of tasty pickled eggplants began the evening. Do note - there are no complimentary Banchan here.  The Korean fried chicken with chili sauce was as good as I expected.  And last but not least, the Galbi rice bowl had tender roast beef served over a sizable portion of rice. Service was decent and both my friend and I said we would return."
    },
    {
        "id": 64,
        "text": "Great food and happy hour had awesome deals on appetizers.  Steam buns were incredible and so was the bibimbap"
    },
    {
        "id": 65,
        "text": "We loved everything about this spot. It might sound weird, but this space has such a calming, relaxing atmosphere, I can't quite explain why. The dishes are beautiful and arranged with care, let alone flavorful and delicious. My friend ordered the fried rice and I ordered the bibimbap, and we highly recommend both. I've had bibimbap at several different spots around the city, and this is definitely one of the best ones I've had. Service is phenomenal, the server and manager were both attentive but not suffocating and gave us our space. Five stars all around!"
    },
    {
        "id": 66,
        "text": "My favorite Korean place in Philly. \n\nI've become a regular customer there and absolutely love the owners, chef, and staff! \nIf you are craving authentic Korean food with a bit of innovative touch, this is the place for you.\n\nMy go to dish are:\n- Fried chicken or spicy pork bun appetizer\n- Beef or spicy pork bibimbap in stone pot\n- Short rib (kalbijjim) Skillet"
    },
    {
        "id": 67,
        "text": "This place was absolutely phenomenal! The server was extremely friendly and really took his time to explain to us what everything was and even gave us personal recommendations. His recommendations did not disappoint... he knew his stuff! On top of that, he kept his mask on and gave us hand sanitizers after we were finished. It's too bad we live in NY bc we would love to come here more often, but I definitely recommend!"
    },
    {
        "id": 68,
        "text": "Stone bowls are delicious. They also have great lunch specials for $9.99. I could eat a pound of the spicy pork and vegetables."
    },
    {
        "id": 69,
        "text": "I went here looking for a sushi place that used to inhabit the same space. The food was very good and the servers were nice. Because it was brand new when I went there were still a few kinks to be worked out but I don't hold it against them! Cute spot and nice folks!"
    },
    {
        "id": 70,
        "text": "Husband and I ate at Buk Chon this past Saturday night. It was our first time there, but will certainly not be our last.  The ambiance and service were warm, the place was clean,  and the food was uniformly delicious, and made of high quality ingredients, for very fair prices. I had the scallion pancake appetizer and the ribeye bibimbap. Husband had the fried chicken appetizer and the pork bibimbap. I don't think the chefs were going for strict Korean authenticity, maybe more of a fusion cuisine, but it was all nonetheless very tasty.\nWe saw that a previous reviewer gave one star based on a complaint about problems using a Travelzoo voucher. We, too, used a Travelzoo voucher, and experienced no issues. The voucher's terms are generous; we saw only one entree on the menu that exceeded the voucher's dollar limit. \nAnother reviewer also gave one star, in part based on a very inappropriate restroom sign. \nI did not see such a sign in the restroom area, and asked our server about it. She said management had been horrified to realize it was there, left over from the previous business in the space, and had taken it down before they even saw that review."
    },
    {
        "id": 71,
        "text": "I came here for dinner with my son. We ordered beef bulgogi, spicy chicken, and chapchae. All three meals were delicious!!!!! The bulgogi's sauce were perfectly balance of the sweet and spiciness. It did not overpower the meat, compared to other bugogi that I've had. The spicy chicken had enough heat on it and very crunchy. Finally the chapchae. It had the right amount of sesame oil on it. My son added some bulgogi meat in it and it tasted even better!!!! I highly recommend this place if you are craving for some good Korean cuisine."
    },
    {
        "id": 72,
        "text": "Recently stopped by this little place for a birthday lunch and I was slightly impressed. The atmosphere is calming and picture worthy but a bit too small for parties larger than 6. I ordered the fried chicken as an appetizer and it was amazing, simply put. For an entree I went with the Fire Chicken. Fire was an understatement, and by fire I mean that shit was flaming hot. While I should have expected this given the name, I was blown away and really had to push through to finish my meal. I'd probably choose differently second time around but if that's your thing, go for it."
    },
    {
        "id": 73,
        "text": "In response to some of the complaints that this place's prices are higher than the average Korean spot: I don't see why Europeans/European food should have a monopoly on fancier restaurant vibes with higher priced menus- and they don't own \"fusion\" or putting imaginative spins on traditional dishes either! Don't non-white restauranteurs also deserve to make some money? \n\nOtherwise: I FREAKING LOVE THIS PLACE. I moved into an apartment building down the street from them 3 weeks ago, and since then have been there about 10 times. \n\nI'm a chef and am pretty hard to please. I always feel ripped off if I'm served something I feel like I could have made just as well as home. Like yeah, I am just a white gal and a relative newcomer to Korean cuisine, but I learned how to make certain dishes like Bulgogi from Maangchi's blog a few years ago, and have made it so many times since for professional gigs. Buk Chon's bulgogi is MILES BETTER. The overall flavor is of course the same, but it is a more interesting presentation: you can taste several more of the ingredients- so well-layered but subtle!!\n\nI also have a big appetite, so was surprised to see some reviews complaining about portion size! The first time I went to Buk Chon for dinner, my partner and I shared the pork buns appetizer, and then both got an entree. This was WAY too much food. Several times since then, I have split two appetizers and the Bibimbap (my favorite!) with a friend. This has been the perfect amount of food. And it's SO NICE that the restaurant is cool with this- often \"nicer\" places insist on everyone order their own entree, or they'll add a fee to \"make up\" for the person or people who did not order their own. I'd actually be willing to pay more money for this now-routine of ordering a single entree, because all of them have always been so delicious!\n\nOh- if you go for lunch and order the discounted lunch special, the portions are smaller than when you pay full price at dinner. This is not unusual among restaurants I've been to in general.\n\nLast thing: I also love the Chinese green tea and think it complements much of the food well. \n\nEvery time I walk past and see someone(s) peering at the menu outside, I stop and encourage them to go in. And the same to everyone reading this!"
    },
    {
        "id": 74,
        "text": "Super good food. Just the right spice. Good mix of vegetables and spicy pork. Had the Bibimbap dish. Comes out super hot, so give it some time. Portion size was good. Not too much, but satisfying for me. I would come back with friends."
    },
    {
        "id": 75,
        "text": "Went to pick up my order and the manager yelled at me thinking I was someone else. I told him to calm down and he didn't listen. I never been to this place but I guarantee I will never go back."
    },
    {
        "id": 76,
        "text": "Yelp always works. We did a search by distance, Buk Chon was close, saw the reviews and were great. \nSat down, ordered and we have been surprised by the quality of food served here. All\nMade to order, warm and in hot plates imported from Korea. So this great tasting food stayed hot and warm until the last bite. \nAwesome place."
    },
    {
        "id": 77,
        "text": "My spicy pork stone bowl was very good, little different to what I used to but still very good."
    },
    {
        "id": 78,
        "text": "This is my first time having Korean food in Philadelphia, and I will say that it was very good. I got the stone pit bibimbap with a Diet Coke. For this bibimbap, it had edamame and snap peas inside which I found to be very interesting. Although the pot itself wasn't hot enough to burn the rice, the flavors made up for this. The restaurant itself was nice and clean, and the staff was very kind and attentive. Overall, I highly recommend this restaurant if you want classic Korean food."
    },
    {
        "id": 79,
        "text": "This is my first time writing a yelp review but this place was bad enough that I felt the need to make an account to share my experience. This was probably one of the worst experiences I've ever had at a restaurant. I was visiting Philadelphia with some friends for the weekend and this was the only dinner place we went to and all of us were pretty disappointed.\n\nServers don't walk around ever asking if we need anything and they barely came to our side of the restaurant so it was hard to flag them down for things. It wasn't even busy at all. We realized halfway through eating that some of us did not receive our side dishes with our meals. After waiting to flag them down, we asked if we could get our side dishes and the server just looked at us super confused and said, \"Well did you order any?\" This restaurant has a pretty small menu, so it blew my mind that the server couldn't just look at our food, and realize that certain ones came with side dishes. She just looked at us as if we were stupid for asking like we didn't read the menu ourselves. And someone in our group did order the side dish platter, which he did not receive either. She said she'll look at our receipt to see if we needed any, and then she came back eventually saying that yes we were supposed to get some side dishes and in-genuinely apologized. \n\nServers would come around once in a while to refill our water but never ask us, \"How is the food?\" \"Do you guys need anything else?\" \"Would you like a togo box?\" \"Do you want the check?\" The staff was so awkward and quiet and didn't seem like they were trained at all on customer service. \n\nMy friend ordered the bibimbap with chicken but when we received his food he said, \"I ordered chicken but this is beef,\" and the server said, \"Oh we ran out of chicken.\" First of all, why couldn't you have told my friend that earlier instead of just serving him a different meat option? Why did you just assume he would be ok with beef, what if he couldn't eat beef? She didn't even say sorry for the mistake, she just gave it to him and he just awkwardly accepted it so he could start eating because we had waited over 30 minutes for our food.\n\nThe food wasn't that great either. They tried glamorizing the names of simple Korean dishes to make it seem fancier than it actually is. Kimchi paella is just kimchi fried rice, calling basic Korean dishes a different name does not make it fusion or make it taste any better.\n\nOverall, this restaurant needs to work on their staff and customer service. I've never left a restaurant so upset for being treated so poorly by staff who clearly don't know how to say sorry. It's your job to ask us if we need anything. I don't know the names of the two girls that served us but I really hope they learn how to treat customers better. As a Korean-American, it's pretty disappointing that this place has mediocre service and lackluster food."
    },
    {
        "id": 80,
        "text": "I am from LA so you can't beat LA in Korean food.\nBut considering being out of California, this place is fairly good.\nLiked Tofu-Kimchee.\nTofu soap is good but should have little more water in it.\nKimchee fried rice is good but I don't like ham in it but if you like that, it is good."
    },
    {
        "id": 81,
        "text": "Delicious food delivered during pandemic time. Japchae was amazing, and so the bimbimpab and the soft tofu stew! \nNicely prepared and package, great and professional job!"
    },
    {
        "id": 82,
        "text": "Nice small, quaint spot for Korean food. Dined in around 9:45 on a Saturday eve. Their kitchen closes relatively early for the weekend at 10. There were still a few tables full of people but the restaurant was fairly quiet by then. \n\nTheir menu is tailored but very solid varied options . Plenty of vegetarian options too. The food was very good, fresh, flavorful. The tofu salad was so delicious. The Bibimbap was fresh and tasty. Everything we tried was great. \n\nI would definitely come back and dine again. Service was friendly and attentive. This place is BYOB."
    },
    {
        "id": 83,
        "text": "Buk Chon was one of my first few times trying   Korean food and I can say I was seriously impressed. Not only is the food incredible, but our server Matt was attentive and answered all of our questions. He was very knowledgeable about all the food and helped me pick out the best vegetarian options. My group tried the banchan which had a variety of different pickled sides, the fried chicken, sweet potato, the bibimbap, and the kimchi fried rice. I would highly recommend this byob place for a night out in olde city."
    },
    {
        "id": 84,
        "text": "Been recommended the place by a couple people, especially for the lunch specials. \n\nCame to try for dinner and made a reservation through yelp. When we got there around six there weren't a lot of people but by the time we left it was definitely filling up! \n\nThe place is nicely decorated with a couple of tall tables in front, two seaters by the bar and larger tables in the back.  \n\nService was quick and we got our food fairly quickly.\n\nI had been hearing about the short rib bourginon skillet which definitely isn't traditional Korean, but had good recommendations. The meat was melt in your mouth tender and extremely delicious. We also got the soondubu, which wasn't as spicy as I liked but my mom loved the level of spiciness. There was also quite a bit of seafood in it. \n\nI liked the banchan variety, but wish there was kimchi in there. The ones included were daikon, eggplant, spicy pickles, and a mix of soybeans, corn, and carrots. \n\nThere are also nice lunch specials for 9.99 on weekdays. It includes a banchan side dish along with a main dish with rice."
    },
    {
        "id": 85,
        "text": "Beautiful interior and beautiful food. One of the best stone bowl rice I had in a while. Also really recommend the \"Korean punch\" drinks they had grape, pear and cinnamon flaovors."
    },
    {
        "id": 86,
        "text": "Pros: Clean and welcoming environment, modern decor, comfortable interior, nice service, BYOB. Tofu stew with seafood is good. \n\nCons: food option not enough. Skillet beef is not well sliced and way too sweet. Bibimbap is not done the traditional way. The Skillet beef is def very bad dish. \n\nConclusion: nice place to hang out, but as a Korean restaurant, you have to cook the meat right, most important thing."
    },
    {
        "id": 87,
        "text": "Oh wow we loved everything we ate here. Popped in on a Thursday night and were quickly seated in a romantic two top. We both had the bulgogi and seaweed salad. It came out sizzling and piled high with a delicious bowl of rice and fresh accoutrements.  We finished with the panna cotta with fresh blueberry preserves-- delicious. We have been back three times and also LOVE the short ribs. We recommend buk chon to everyone."
    },
    {
        "id": 88,
        "text": "Loved this place! Great for going with a big group as a reservation was easy to get and there are lots of things you'll want to try. Went with a party of 6 and tried almost all of the menu. The appetizers are the real stars but the mains were also really good. Our group especially liked the korean fried chicken, cold appetizer sampler, rib eye bulgogi, bimbimbap, and soft tofu stew. Felt so affordable, too, since it's byo!"
    },
    {
        "id": 89,
        "text": "One of my favorite restaurants to dine in or take out / delivery. Love the Korean fried chicken, spicy pork buns, japchae with beef and spicy pork on stone bowl. Definitely consider them for delivery right now!"
    },
    {
        "id": 90,
        "text": "The food is good and you are given a decent portion however no sides is a deal breaker for me! One of my favorite things ever is KIMCHI. When eating Korean food (also one of my favs), I expect side dishes. I understand the 'style' of meal that comes with side is Banchan but business may depend on this. Many of us do not expect to pay $3 for Kimchi, well I don't and I didn't.\n\nI started with the Korean Fried Chicken which I could not clearly determine was chicken. When I offered the left overs to a friend they quickly mentioned the same. It appears to be pieces of chopped chicken not specifically from the breast or thigh that's coated and fried, then dipped in a sauce. The chili sauce was tasty, not necessarily different or special just okay. I really did enjoy the Spicy Pork in a hot stone bowl, very tasty and filled with pork. Because I went during 'Happy Hour' the appetizer was half off because I purchased an entree.\n\nThe decor is modern, crisp with clean lines and low or pub seats. I was approached and seated immediately however service was slow and the server was inattentive. This was not acceptable considering I was the only one in the restaurant.  The slow service and lack of sides causes me to 'tap out' and not return."
    },
    {
        "id": 91,
        "text": "A great new BYOB addition to the Old City dining scene, with tasty Korean food, nice setting, good prices and friendly, efficient service. Our group shared the mixed appetizers, and I had the Tofu Bi Bim Bop, which was delicious. Comfortable, relaxed and warm atmosphere, and a great place for pre-theater, post-movie or just gathering for a good meal."
    },
    {
        "id": 92,
        "text": "The ambience here is so romantic, I love it! I would be happy bringing anyone here to introduce them to Korean food as there is a lack of it downtown. I'm accustomed to the Korean and Korean-Chinese foods in North Philly, and a problem I often have is the language barrier and not knowing what dish I'm getting in general (other than the general protein/fried/rice/noodles). No problems here as the menu is explained! I do wish I could adjust the spiciness level though as I found the stews not as spicy as I'm used to. Also BYOB, and during happy hour, appetizers are half off with an entree! \n\nI like how this restaurant has both comfort food options (rice cakes and kfc) and more famous dishes like their Galbi as well. It is a wonderful place for a special occasion meal right in old city."
    },
    {
        "id": 93,
        "text": "Messed up management. No water was served after we sat down. and forgot to place our order. The table after us got served food before us.\n\nI would never come again."
    },
    {
        "id": 94,
        "text": "Food was good! But it really bothered me the portion of one entree was hardly enough for one person? I think they really failed to advertise that they hope u order like you do with a 3 course meal? Or tapas style~ but no doubt food was on point! \n\nThe budae jigae stew was sooo tasty! Again I wish that alone was enough for the meal~ but nope! \n\nOur pajeon could almost be labeled as burnt so I'm not sure what happened .. since it was so small, it didn't hold that much seafood either, idk if the premium was worth it. \n\nIf it's convenient for you to stop by, do try it! But dun worry about fomo~"
    },
    {
        "id": 95,
        "text": "Walked over and enjoyed a wonderful bulgogi lunch.  Great service.  Will definitely post on my fellow airline crew boards to make this part of their PHL layover!"
    },
    {
        "id": 96,
        "text": "This is the best Korean restaurant in Philly, no doubt about it. Awesome food, great service, great location. 10/10"
    },
    {
        "id": 97,
        "text": "We loved this little place...quiet, clean and friendly. The food was excellent we got the spicy pork and the tofu lunch specials. A good find!"
    },
    {
        "id": 98,
        "text": "Their tofu soup is so good. It's not too salty. The service was nice. The decorations are simple but classy. I love it. I definitely will come back"
    },
    {
        "id": 99,
        "text": "I went for a birthday dinner with a friend! I love the food! It is so good!! Had the seafood pancake, the banchan sampler, army soup and the pork on stone bowl! I ate so much!! Service is excellent!!"
    },
    {
        "id": 100,
        "text": "Stopped by for lunch, order kimchee fried rice and spicy pork. Both dishes were really tasty. Very impressed with the kimchee fried rice, usually my tongue hurts when eating this dish elsewhere but this was made perfectly here. Would be back to try sundubu."
    },
    {
        "id": 101,
        "text": "The food is AMAZING !! Everything we ordered was delicious! I am a trained chef so I'm very picky ! The Galbi Bourguignon skillet was out of this world ! It was melt in your mouth amazing and the Korean chicken was crazy good ! We never eat rich food like that but it was worth every calorie. Can't wait to go back and have the Japcha , the bibimbap and the kimchi fried rice. It's BYOB so we walked around the corner and bought some great sake to go with our meal. I highly recommend this place just make sure that you have a reservation or you will never get in !"
    },
    {
        "id": 102,
        "text": "11/17/2019;\nThis place might be a lil bit overrated. \nThe environment is pretty good, the food is good but not THAT outstanding. Also I feel like it's kinda American Korean food, which mix a lot of other elements into Korean cuisine. The taste is still pretty good, it's just that it's not authentic/ traditional. \n(Or maybe it's just I'm having a high expectation since it's the first thing popped up after we searched for Korean good)"
    },
    {
        "id": 103,
        "text": "We were so thrilled when Buk Chon opened because we live around the corner! We have already eaten here almost a dozen times since it's opened it's just THAT GOOD. Everything is just so delicious the staff is so friendly and the chef is just wonderful. The Japchae is a must try. The green onion pancake and rib eye bulgogi are super delicious."
    },
    {
        "id": 104,
        "text": "After reading the glowing reviews, we tried Buk Chon on 3/7. It was not crowded and we had our choice of tables. We shared the korean fried chicken in soy and scallion seafood pancake which contained shrimp as our appetizers. The chicken came in cube like pieces and had thin sliced almonds on it and made it easy to share. It was truly delicious. The pancake came out later in the meal and was big so it was also good to share. The main courses we had were better than the appetizers. We shared the shredded rib eye on the skillet and the short rib on the skillet. The flavoring and tenderness of the meat was superb. The rice that accompanied it was also excellent. I am coming back for that meat again soon."
    },
    {
        "id": 105,
        "text": "We were a party of 5 and had a phenomenal dinner. The restaurant itself is a quaint BYOB with a rustic feel. The food was unreal. We tried about 9 different dishes and everything exceeded expectations. It is clear that everything is handmade and takes time to be perfectly prepared. Be patient. It's worth the wait!!! \n\nThe \"Army Stew,\" the short rib and the Pork Bao Buns were all incredible. \n\nGO AS SOON AS YOU CAN!"
    },
    {
        "id": 106,
        "text": "The best KOREAN food in Philadelphia! It's a small and dainty restaurant with modern decor. So many great dishes to choose from."
    },
    {
        "id": 107,
        "text": "Buk Chon opened about a year ago in Old City and damn, it is fire. The service was great and the food was outstanding. Although there are a million other great eats in Philadelphia, I definitely can't wait to return.\nDid I mention there was happy hour on a weekend? For the life of me, I can't remember what it is. I'm pretty sure its 1/2 off an appetizer with any purchase of an entree. Can anyone confirm this?\n\nWhat we ordered: \nJapchae: stir-fried sweet potato noodles with assorted veggies\n\nWe had to order a noodle dish. It would be un-Korean to do so. The veggies and sweet potato noodles were a great mix of flavor. I love sweet potatoes, so any time I can incorporate them into my meal, I'm in. I'll order 6 more, please.\n\nKorean Fried Chicken: double-fried boneless chicken thighs in Korean Chili sauce\n\nThis was hands-down the best thing I ate during dinner. The chili sauce had a great balance of sweetness and heat. The chicken was still moist inside. Still thinking about that delicious appetizer. YES PLEASE.\n\nChili Rice Gnocchi: rice gnocchi, fish tofu with chili paste topped with mozzarella.\n\nHave you ever ordered gnocchi at an Asian restaurant? I know I haven't before. It was okay, definitely not my favorite part but definitely an interesting twist on the cuisine. I didn't care for the tomato base and mozzarella, but then again, I can't really handle cheese anymore. The fish tofu had a unique texture which I enjoyed and it wasn't overly fishy.\n\nGalbi Bourguignon: slow-braised short ribs with mushrooms and asparagus skillet\n\nThe amount of food in each entrée was absurd. Three hungry girls barely made a dent in this. The flavors were really well balanced and really flavorful in the Galbi; however, the texture wasn't for me. It was similar to a pot roast. It was delicious but needed a different texture to separate it from the vegetables. When I added the rice, it was a much more complete dish.\n\nSpicy Pork: grilled spicy pork over rice and assorted vegetable skillet\n\nDefinitely my favorite dinner entrée. The pork had a great amount of heat that carried through each bite, but not spicy enough to take over the whole meal. The pork had a slight sear on it which made it have a slightly different texture. I thought it was great.\n\nRibeye Bulgogi: thinly sliced grilled beef with assorted vegetable.\n\nA really good representation of bulgogi. The Korean beef on top of some vinegar-seasoned rice definitely hit the spot after walking around the city for a lot of the day. The grilled beef had a great flavor.\n\nSide of Kimchi\n\nI love kimchi. If I could put it on everything, I probably would. It doesn't last long when I have it in my house.\n\nI thought all the dishes were large in size. The entrees came with sides of rice. I had leftovers for a few days and I was terribly sad when they were all eaten. If you are in the Old City area and need a bite to eat, definitely head to Buk Chon. You won't be disappointed."
    },
    {
        "id": 108,
        "text": "This was my first time eating here with my boyfriend and everything we ordered was delicious. From sweet, salty, sour and spicy my palate was hit with a mhmmm at each bite. Once I picked up my chopsticks it never rested on the table until every dish was finished."
    },
    {
        "id": 109,
        "text": "Eva was amazing. She did a good job on my toes. I would have paid closer attention to the heels but overall a good experience"
    },
    {
        "id": 110,
        "text": "I've ordered delivery from here a couple times through Caviar and the food is AMAZING. So far I've tried the green onion pancake with seafood, Japchae and Galbi Bourguignon and each was excellent. I'm grateful to have another great option for Korean food in Philly now. Don't miss out on this place."
    },
    {
        "id": 111,
        "text": "This spot was a great find! I am vegetarian and loved that they had options for me! I had the tofu bibimbop bowl, and it was absolutely delicious. The rice could've been a bit more crunchy. Certain parts felt mushy. That's me being picky and particular. I was full the rest of the night! I also had the pear Korean punch. Overall, great experience!"
    },
    {
        "id": 112,
        "text": "This is by far one of my favorite restaurants on the planet. I regularly drive over an hour just to get one of their bibimbap bowls, as they're honestly one of the best things I've ever eaten. Very nice look to the restaurant as well and the ambience is great, perfect for a date night. The staff is consistently helpful and pleasant to speak with. \n\nI can't emphasize this enough, this place is the best and I will be coming here regularly for the foreseeable future."
    },
    {
        "id": 113,
        "text": "Delicious food! Was blown away by the flavor combinations! I would recommend the spicy pork in any dish! Great service as well, greeted, super friendly, and well taken care of. Good atmosphere. Definitely recommend to eat here to warm your belly up."
    },
    {
        "id": 114,
        "text": "A great addition to the neighborhood.  A friendly greeting on entering the attractive restaurant for lunch.   Bimbimbop was perfectly served and was everything expected. Service was pleasant and attentive."
    },
    {
        "id": 115,
        "text": "This review is for their lunch. We came super hungry after being across the street struggling with the passport organization. We were excited to get some Korean food and for a great price of $10. \n\nWe ordered the kimchi rice with pork and the teriyaki chicken with vegetables. The Kimchi rice was not very spicy, but definitely had a nice little kick to remind you about that kimchi. It also brought a very over easy egg on top to help with the protein portion. \n\nThe teriyaki chicken was really sweet, a super thick sauce on it. It was good, just not great. The chicken portion was also really small, way more veggies. The seaweed and cucumber sides were quite small but good compliments to the dishes.  \n\nThe service was a bit slow, and we were literally the only people here. The ladies working were not friendly at all. \n\nOverall, I think the place is ok, not somewhere I'm running back to."
    },
    {
        "id": 116,
        "text": "This is our new favorite Korean restaurant. My girlfriend and I love Korean food. We came across this new place and we read the story of the owners who are also the chefs and we wanted to give it a try. We went twice within a week. That's how delicious the food is. Best rib eye ever!! The place is byob and very reasonably priced. We made a reservation every time we went because the place is small and busy so I recommend doing that. I can't wait to go back again."
    },
    {
        "id": 117,
        "text": "Delicious meal with interesting flavors and hearty portions!  The takeout service was quick and we'll certainly be back."
    },
    {
        "id": 118,
        "text": "So I'm really torn in between this, food is good, more like 3 stars, but for me, service was great and really courteous staff. Side of banchan was not good, I think the elements of lima beans, mushroom need improvements on the flavoring, a little too sweet for my liking. Also it's not complimentary, which most korean places are. I thoroughly enjoyed the budae stew, good portions and had everything I liked, like sausage, spam, ramen noodles and a slice of cheese, with broth not overly spicy and it didn't make me sweat. It's right in old city and is on a busy road next to a couple good bars if you're in the mood for an eat then bar hop with some buddies."
    },
    {
        "id": 119,
        "text": "This menu is different than the one on Grubhub- but it was still very good! The kimchi fried rice was excellent with the right amount of heat (5/10 on spiciness scale for me). The Fire Chicken was very good as well (6.5/10 spicy for mild) and had a deep, complex gochujang flavor, but the menu does not mention the onions and scallions that come with it as well, so for people who do not like onions beware! Can't wait to eat the rest for leftovers"
    },
    {
        "id": 120,
        "text": "This place is truly amazing . The staff is great and the food is truly authentic and extremely delicious !!"
    },
    {
        "id": 121,
        "text": "great little gem in old city. visited on a tuesday and there still some choice seats. the ambiance is great.  service is excellent. food is great.  it's not traditional korean with bon chan and ok su cha tea so go with this information in mind.  i ordered the dol sot and tong dark in traditional korean hot sauce and both hot the spot.  as my colleague and i realized its BYOB!!!  i asked the owner? what the bottles on the wall were for.  he told me they were interesting empty bottles from customers. very cool. i'll visit again."
    },
    {
        "id": 122,
        "text": "The \"about\" section of Buk Chon Korean Cuisine's website hooked me and the great photos on the digital menu made me drive across town. The thing that will make me return? Spicy pork buns. Meet me there."
    },
    {
        "id": 123,
        "text": "Found this newly opened gem the other night and an enjoyed dinner with a friend, and had the entire restaurant to ourselves! The owners are extremely friendly and very attentive. The space is very well designed and has a cool mural of an Asian woman. The food was good, we got the spicy pork bowl, the appetizer sampler and bimbimbap. The pork was super flavorful and spicy, I wanted the sauce for every dish! The bimbimbap was authentic and tasty! I will be back to try more dishes."
    },
    {
        "id": 124,
        "text": "This is my first time having Korean food in Philadelphia, and I will say that it was very good. I got the stone pit bibimbap with a Diet Coke. For this bibimbap, it had edamame and snap peas inside which I found to be very interesting. Although the pot itself wasn't hot enough to burn the rice, the flavors made up for this. The restaurant itself was nice and clean, and the staff was very kind and attentive. Overall, I highly recommend this restaurant if you want classic Korean foo"
    },
    {
        "id": 125,
        "text": "4.1/5\n\nThere really isn't very much good Korean food in Philly (and believe me, I've tried looking), so this might be the best Korean food I've had in Philly. That being said, this place is MUCH pricier than your standard Korean restaurant, and I've definitely had better Korean food for much cheaper in other cities...but beggars can't be choosers right? :P \n\nI did really enjoy their cheese ddeokbokki (which I find hilarious that they call \"gnocchi\" -- I suppose this is the closest western approximation?), and their fire chicken dish, which can be quite spicy if you ask for it.\n\nIt's also pretty untraditional that the place only serves banchan with some dishes or as a side, instead of being complimentary. The menu with its westernized names, the modern inner ambiance, and the high prices make the restaurant seem at first glance like a fusion restaurant, but the food actually tasted more authentic than I expected (except the banchan) -- don't let the words \"gnocchi\" and \"kale\" on the menu throw you off too much :)"
    },
    {
        "id": 126,
        "text": "perfect Korean food restaurant, the pork bun is really delicious and I recommend their tofu soup topped with yummy cheese. the rice coming together can be purple or white. it's a nice place to enjoy food and listen to soft Korean music. also their service is great, definitely would visit more times."
    },
    {
        "id": 127,
        "text": "I really liked my Rib Eye Bulgogi Skillet! I originally intended to take leftovers for lunch the next day, but it was so good that I ate it all in one sitting. I tried my friends' dishes but wasn't too impressed with them, so I'm glad with what I ordered, I just wish it wasn't $18 or that they provided side dishes along with the meal. The restaurant is cute, but the servers were not the most attentive because they were talking to each other (not even busy with other customers)."
    },
    {
        "id": 128,
        "text": "Not a huge fan of Korean food but my daughter is and she loved it.  I got the rib eye bulgogi (is that right?) and it was good.  The waitress was very patient with us.  My daughter got the stone pot thing with all the sections of whatever foods they were.  She was in heaven.  oh!  We got the chicken appetizer and the spicy pork buns things too!  Very delish I will def be bringing my girl back here if she decides to go to school in Philly!  Great service great food= winning combo!!"
    },
    {
        "id": 129,
        "text": "I had an OK experience at this Korean resto in Olde city. Not your traditional Korean spot. They don't offer sides as part of your meal and their galbi isn't prepared the Korean BBQ style. I was actually disappointed in their food as their ambiance and service was very nice. Their prices are a bit on the higher end as it is in Olde city but it definitely does not reflect the quality."
    },
    {
        "id": 130,
        "text": "Awesome food, service, and ambiance!  The tofu stews were delicious and the right amount of spice.  The owner and servers were very friendly and made sure we had an amazing experience."
    },
    {
        "id": 131,
        "text": "Came here craving some Korean food. Definitely delicious. I came here wanting to try the slow raised short ribs and they were out. That's the only reason I left 4 stars. Other than that service was great, the place has a really cool and chill environment that is eclectic and perfect for a date. The beef bulgogi was delicious and the portion was enough for my partner and I to share. I love how they don't skimp on the meet either. Also loved the Japchae made with sweet potato noodles. Next time I think I'll add a meat but it was still very good on its own. Recommend this place!"
    },
    {
        "id": 132,
        "text": "Went there for lunch on Saturday, very cool and clean atmosphere. Waitress was friendly and attentive.  We had some of their $9.99 lunch specials; rice cake gnocchi, spicy pork, beef and fried kimchee rice.  All were delicious but the best was the korean fried chicken for starters, we ordered both the chili and honey-soy...they were super crispy and a ton of flavor.  We will definitely eat here again. Thanks"
    },
    {
        "id": 133,
        "text": "I walked by this place a few times and was intrigued but never went in. One night after happy hour, my boyfriend and I were looking for a place to grab a quick dinner. We were debating between this and a place next door. Luckily, a lovely couple was leaving and urged us to give this place a shot and wee were so happy we did. We tried the Korean fried chicken, bulgogi and spicy pork. The portions were generous and everything was delicious and flavorful. I've been back a few times for take out bulgogi. It's delicious. This place is also a BYOB to top it off. Definitely recommend."
    },
    {
        "id": 134,
        "text": "Fantastic. This is now my new go-to restaurant. Everything from the atmosphere, location, service, to food was amazing. \n\nI had noticed they opened a few weeks earlier and I was really excited to try. I went with my significant other and a coworker. We brought a bottle of wine. \n\nWe ate so much food and it was all great prices. I honestly can't say enough good. \n\nThe food I recommend is the any of the hot stone pots, Korean \"gnocchi\", bulgogi linguini, the sampler, the bao, and really anything. It was all amazing. Photos to follow"
    },
    {
        "id": 135,
        "text": "We visited Buk Chon for lunch on our way home via Philadelphia. It turned out to be a great treat after hours spent on a cold field followed by a long drive. The five if us sampled the fried chicken - both spicy and sweet, as well as the bulgogi, ramen, and kimchi paella. Every dish (including the kimchi side) was delicious, perfectly seasoned, and had a very fresh taste. As a product of a Korean American household that values well prepared Korean food, I can't recommend Buk Chon enough. The atmosphere was also pretty cool, so we will definitely be coning back without the kids."
    },
    {
        "id": 136,
        "text": "Their bulgogi and soondubu (tofu stew) was amazing! The staff is very friendly and they accommodate families with small children."
    },
    {
        "id": 137,
        "text": "My husband and I made a reservation for Friday night at 6:30pm and we were surprised that this place was not packed, especially after how fantastic the food was. We ordered the Korean fried chicken and scallion pancake as appetizers and then each ordered the Bibimbap, I got the veggie and my husband got the beef. Everything was so fresh and delicious. The service was wonderful and everyone was very friendly. The fact that it is a BYOB makes it such a steal. We are looking forward to going back again!"
    },
    {
        "id": 138,
        "text": "The service was good. Come here for the first time with my friend for her birthday. The buns was really good. I got the short ribs while my friend got the spicy pork. I would say she rather steal my short ribs than have her spicy pork belly. Food is amazing and would be coming back when in the area"
    },
    {
        "id": 139,
        "text": "It's a charming restaurant kind of tucked away, but I feel like they try too hard to be more \"high class\" than they really are. They have a pretty small menu so it's not too overwhelming. The service was decent but the food did take forever to arrive. \n\nI feel like their flavor profile has been greatly Americanized. Everything is on the milder side. Sauces tasted water down. I had the seafood pancake, beef bulgogi skillet and the spicy pork bibimbap. The seafood pancake came with a decent amount of seafood and crispy around the edges, but the dipping sauce was way too vinegary. The beef bulgogi tasted more like stir fried beef than bulgogi. The bibimbap came in a stone pot so that was nice. I wasn't a fan of their gochujang sauce though. It was way too sweet, watery and lacked heat. The worst part of all was we had to pay for the banchans! What kind of Korean restaurant doesn't come with complimentary banchans?!?! It's like going to a Mexican restaurant and not receiving complimentary chips. Told you this place isn't legit. \n\nNot the most authentic Korean restaurant in the area. Honestly, I feel like there are better and cheaper options in Chinatown. This place is good for those new to Korean cuisines and would like to just dip a toe in. For Korean food fanatics, this place might be a bit disappointing."
    },
    {
        "id": 140,
        "text": "Great neighborhood spot. Quick service. Delicious food. Nice menu. Good prices. Glad to have it nearby!"
    },
    {
        "id": 141,
        "text": "I've always had to travel to the North Philly/Cheltenham area to find good Korean food but with Buk Chon in old city I get to have my Korean food fix without having to drive so far. Buk Chon's menu is pretty limited and it's not exactly traditional Korean food (I think) but the flavors are absolutely fantastic. They don't serve free banchan (side dishes) and the appetizers are on the smaller side but these things are not a deal breaker for me because the quality makes up for it all. These are the things that I've tried so far:\n\n1. Seafood pancake - nice and crispy on the outside while soft and chewy on the inside and packed with seafood. The portion is very small so don't be surprised when you order.\n\n2. Kimchi & tofu appetizer - delicious stir fry kimchi and pork with lightly pan fried firm tofu. Also, a very small portion.\n\n3. Spicy pork over rice - a real winner. Tons of pork over rice seasoned perfectly. Be careful because it's served in piping hot stone bowl and you can easily burn your mouth eating this. Just scoop the food onto your plate for it to cool and enjoy!\n\n4. Galbi bourgiunon - tender, fall off the bone short ribs in a delicious, savory, thick sauce. The galbi is not cut like the traditional galbi (flanken style) but more like the regular English style cut. A very comforting dish!\n\n5. Soondubu (tofu soup) - the flavor of their tofu soup is not as good as the Korean restaurants in North Philly but pretty good compared to other restaurants around the center city area.\n\n6. Chili gnocchi - Korean rice cakes in a spicy tomato sauce with fish cake and cheese. It was too spicy and the rice cakes were a tad undercooked when I ordered it. The only item I would not order again from here."
    },
    {
        "id": 142,
        "text": "Been recommended the place by a couple people, especially for the lunch specials. \n\nCame to try for dinner and made a reservation through yelp. When we got there around six there weren't a lot of people but by the time we left it was definitely filling up! \n\nThe place is nicely decorated with a couple of tall tables in front, two seaters by the bar and larger tables in the back.  \n\nService was quick and we got our food fairly quickly.\n\nI had been hearing about the short rib bourginon skillet which definitely isn't tradition Korean, but had good recommendations. The meat was melt in your mouth tender and extremely delicious. We also got the soondubu, which wasn't as spicy as I liked but my mom loved the level of spiciness. There was also quite a bit of seafood in it. \n\nI liked the banchan but wish there was kimchi in there. The ones included were daikon, eggplant, spicy pickles, and a mix of soybeans, corn, and carrots."
    },
    {
        "id": 143,
        "text": "If i could do a 6 stars out of 5 i would. The food was tasty and their side dishes are very fresh. We had KFC honey soy, chili tofu & rib eye bulgogi, all just tastes like home-made. The service was top notch, the hostess was very cheerful and welcoming. The restaurant was clean and the decor was super elegant and classic. Highly recommended!!!"
    },
    {
        "id": 144,
        "text": "One of my favorite places to eat in Old City. Great food, great service. I love the Korean fried chicken and spicy pork bowl. My go to's every time."
    },
    {
        "id": 145,
        "text": "Modern twist on classic Korean food.\n\nThis isn't your traditional Korean fare. Definitely a modern interpretation with hints on the old school, and it truly works.\n\nThe owner is a super nice guy, who came out both times we visited to greet our table and check in.\n\nThe style of the inside is quite modern with beautiful high ceilings.\n\nThe menu is small, but for all the right reasons. It's an old school Korean mindset, short menu but execute well. A bit privy if you're used to Korean dishes but worth it based on the flavors and quality used.\n\nI will say it was a bit disappointing that you have to pay for bonchon but it's understandable.\n\nIf you're looking for \"classic\" traditional Korean flavors this may not be your spot, but it's definitely good food.\n\nGet the army stew. Such a normally simple dish that was elevated and modernized.\n\nI will for sure continue to go back"
    },
    {
        "id": 146,
        "text": "Place and l'ovation gives out a very fancy but yet cozy vibe for a romantic date or a casual meeting with friends and family. The food is very nicely plated, the service here is very friendly which gives out a homing and very comfortable vibe. The location of the restaurant is very close to many places likewise to the independence hall as well as a very nice view of the Delaware river.  I would definitely recommend this place to anyone who is looking for a  cozy restaurant. \nOne bad thing is that there's a limited street parking therefore might cause a little inconvenience however, it is definitely worth a try."
    },
    {
        "id": 147,
        "text": "Ok where to begin.  Ordered a voucher through Travelzoo for 4 people.  Entrees up to $23 were included.  Of course, the galbi is $24, and instead of allowing us to pay the $1 difference, they refused to honor it.  So, the voucher was really pretty useless, and the cost of just ordering the entrees and appetizers at menu price was the same as the \"deal\".  Very underhanded. I understand they are trying to attract new customers, but this is incredibly shady. Voiced our displeasure to the owner, and he just smiled and said \"so sorry\". Owner ended up refunding the cost of the voucher to us, so we picked up our belongings and left quickly.\n\nAlso, charging for kimchee? Really? Being Korean American, I find this completely ridiculous and laughable.  Words cannot describe how disappointed we were with this place.  Make the short trip up to Fifth Street in Olney and grab some real Korean food, not this new age, hipster b.s."
    },
    {
        "id": 148,
        "text": "My husband was craving Korean food so we wandered into this place. Bottom line: solidly average, ok. Not great, not bad.  \n\nWe started with the Korean fried chicken starter. This is usually my favorite and I was looking forward to trying it here but it was pretty meh. \n \nI had the beef bulgogi with purple rice (a combo of black and white rice ) which comes with 4 banchan (unfortunately not of your choice): pickled radish, pickled eggplant, green bean salad and cucumbers. Of everything I tried I have to say that the pickled eggplant was my favorite (random, I know). Delightfully sweet with a tang. The bulgogi was ok, and pretty good value for money (I did enjoy my leftovers later). \n\nMy husband tried the paella (pork and chorizo, there are other options). I honestly was not expecting to see something like that on the menu, a creative twist which tasted pretty good...very greasy and more reminiscent of jollof rice rather than traditional paella but good. \n\nThe service left a lot to be desired (and why I feel like I can't give more than 3 stars). We came at a reasonably slow time. (there were only 2 other tables occupied when we came in) but still seemed understaffed. Took a while for someone to seat us, we just waited awkwardly at the door. Took a while for a server to bring water and to refill throughout the meal (we had to call someone over and ask a few times)...just inattentive. And the server forgot part of my order originally...I know things happen and the 2 servers there seemed very pleasant but all the stuff together kind of just left me a little salty."
    },
    {
        "id": 149,
        "text": "Our Entrees was hot, fresh, well seasoned and delicious. Staff was very professional and friendly."
    },
    {
        "id": 150,
        "text": "I've had a lot of Soft Tofu Stew (Soon Dubu Jigae) in my lifetime. This restaurant has the best...the absolute best. Out of this world! \n\nI highly recommend their Seafood Green Onion Pancake and Sweet Chili Korean Fried Chicken"
    },
    {
        "id": 151,
        "text": "Short but sweet. If you like Southgate, this is better, slightly cheaper, and BYOB. So go,and order everything. It was all delicious"
    },
    {
        "id": 152,
        "text": "This is a great place to go on date nights! The atmosphere is nice and this restaurant has great food options. It is not the most authentic korean restaurant and is more catered toward the locals in the old city area. \n\nI went here twice and I must recommend the ddukbokki which they call \"chilli rice gnocci\" and the seafood panacake.  For a main dish, the stone bowls/beef bowls are decent and the soondubu is also good.  I would mostly come here for the tasty appetizers, atmosphere, and BYOB experience."
    },
    {
        "id": 153,
        "text": "Got the Tofu Stew w kimchi pork which was awesome but the fried chicken disappointed not being more crispy or crunchy.  So yes to Stew and no to chicken. They included endless banchan. The place has a byob policy which worked for my friend getting beer next door."
    },
    {
        "id": 154,
        "text": "Tried this spot for the first time last night and it was great! Everyone was happy with their food. I got the bibimbap w/ tofu which was a warm bowl of deliciousness. Really fair prices too. BYOB is always a plus and they were nice about letting us stay for awhile after we finished our dinner and not rushing us out. Cute place and would recommend!!"
    },
    {
        "id": 155,
        "text": "Yeah, this service at this place was terrible. The staff was extremely rude, passive aggressive, and just plain awful, I dont know how these servers got their jobs they didnt seem properly trained at all. Could not enjoy the food because of this and now its only left me with bad memories. Maybe the next customer will have better luck, either way I hope to see a change soon."
    },
    {
        "id": 156,
        "text": "Vibes: small, unassuming, modern, casual-but-on-the-nicer-side BYOB; good for dates or small groups \n\nTasting notes:\n-Hong cho: topped with mint leaves; pomegranate flavor is subtle but not overwhelmed by tanginess of the vinegar\n-Korean fried chicken: nuggets of hot, tender meat encased in that very satisfyingly crunchy exterior that is not too thick or overly flour-y; gochujang-honey coating gives just a bit of a spicy kick and stickness\n-Galbi bourguignon bowl: fall-off-the-bone spoon-tender short rib meat with enough fattiness to add a lovely umami flavor to the rice; microgreens add more to the visual presentation than texture/taste\n-Spicy pork in stone bowl: pleasantly surprised by large, thinly sliced pieces of perfectly cooked pork among fresh bell pepper slices and browned onions; loved the crispy chips of rice that came off the stone bowl surface \n\nOther thoughts:\n-Food menu is short and focused and makes Korean cuisine accessible to those unfamiliar with common Korean dishes while staying very authentic\n-Will have to bring some soju or light beer for my next visit!\n-The few staff are very friendly and attentive"
    },
    {
        "id": 157,
        "text": "We came here (party of 5) at around 6pm on a Saturday without a reservation and were seated promptly. I ordered a beef bulgolgi rice bowl and \"rice gnocchi\" (aka ddeokbukki lol). Both were absolutely delicious! Service was also prompt and helpful.\n\nUnfortunately, this place does not provide complimentary ban chan (unlike most Korean restaurants), so I'm docking a star for that -- otherwise, definitely 5 stars."
    },
    {
        "id": 158,
        "text": "Had a great dinner last night!  I love Bibimbap!  Great service, great food!    And affordable!!"
    },
    {
        "id": 159,
        "text": "This place was so good. I 100% will come back again. I actually tried this place because my sister got me a voucher for two people. It was so good, I actually went back a couple times since then"
    },
    {
        "id": 160,
        "text": "Buk Chon is located in Center City and was just what we needed after a long day of sightseeing. We got to the restaurant at 9:30 pm on a Saturday just in time for last call for orders (about 9:45) and tried the Spicy Pork Buns, Kimchi Paella with Pork/Chorizo, and the Fire Chicken (original spicy), all of which we would recommend! The entrees are so big that we could have been full with just 1 rather than 2 but the food was so good we were happy to take leftovers back home. The Kimchi Paella was our favorite as it was such a unique fusion and the crispy rice on the sides that result from the stone bowl can't be beat. Spice levels were not super high, but we were okay with it since the food itself was all piping hot in temperature. Prices are also very reasonable especially for how delicious and big portioned the food was!"
    },
    {
        "id": 161,
        "text": "After really craving Korean food through all of quarantine, a trip to Philly and this restaurant really satisfied me. Everyone working was very polite, friendly, and helpful. The food was delicious and i was blown away by the japchae! They were even so kind as to give me a free drink for my birthday! I would definitely go again and can't wait for the next time i'm in Philly."
    },
    {
        "id": 162,
        "text": "Buk Chon has the best Korean food anywhere near center city. Every dish was perfect. Oh, and the happy hour is stellar."
    },
    {
        "id": 163,
        "text": "This was such a pleasant find on a weekend night, and I only have good things to say. The service was excellent, the vibe was hip, and both the kimchi-pork soft tofu stew and the seafood soft tofu stew we got were amazing. Personally I liked the kimchi-pork version better. They also have a high health score, which is why we decided to try out this place in the first place. Will definitely come back to try other dishes."
    },
    {
        "id": 164,
        "text": "Atmosphere: Nice and clean interior with a darker ambience. This is a good spot for date nights or gatherings with friends. We visited pre-COVID lockdowns. \n\nService: Our waiter was very friendly and attentive! She was happy to give us recommendations of her favorite dishes.\n\nFood: We ordered the rib eye beef bibimbap and seafood soft tofu soup (soondubu-jjigae). Though the food was decent, it was not particularly flavorful - the soft tofu soup was not really spicy and a bit bland, while the beef in the bibimbap was not notably outstanding. We also did not feel completely full by the end of our meal. If you are looking for good Korean food, there are probably better options elsewhere that are more filling and not as overpriced. \n\nOverall: Although the atmosphere and service was nice, we did not think the food was entirely worth the money. This is a nice spot for hanging out with friends and trying Korean food, but we were hoping for more flavor in the dishes!"
    },
    {
        "id": 165,
        "text": "So so good! The staff was super friendly and the food was came out sizzling hot. Almost felt like someone's home cooking. Fried chicken was super crispy- we ate it so quickly I forgot to take picture. Banchan was all very fresh tasting too. Will definitely be back ASAP to try the stews and Galbi that I was eyeing at the next table over. Byob is fun too!  cheers to Buk Chon!"
    },
    {
        "id": 166,
        "text": "Everything was delicious! I loved the Pear Korean punch and my husband loved the cinnamon Korean punch. The Korean fried chicken bites were delicious, and so are the glass noodles with beef bulgogi. We came in from NYC yesterday, just to enjoy Philly for the weekend, but if this place was near us, it would be one of our regulars!"
    },
    {
        "id": 167,
        "text": "My husband and I are forever looking for a good Korean restaurant in the city and FINALLY we found one!!! We came here for lunch and was not disappointed. I got the spicy pork lunch special that came with rice and a banchan for $9.99. My husband loves jap chae so he ordered the beef jap chae. Is definitely one of the best jap chae I had tried so far. Everyone should try this place if you love Korean food."
    },
    {
        "id": 168,
        "text": "This place is a delicious Korean BBQ spot in old city. While there are tables to dine outside (very cute setup) we have done takeout a number of time. I swear the Japchae noodles are still steaming by the time we get our order home. I would recommend for a great takeout or if you're feeling adventurous it's BYOB with a decent amount of outdoor dining."
    },
    {
        "id": 169,
        "text": "Fricking awesome flavorgasms. Our mouths were in extacy. Pork Buns, Spicy Pork Bowl and Short Ribs were all \n\nThe owner was super friendly and loved to please and the servers were super sweet and friendly. A+. Wish they were open for breakfast."
    },
    {
        "id": 170,
        "text": "I have been here twice and both times the food and service have been incredible. The Korean fried chicken is perfectly covered in the soy garlic sauce and the right amount of crispy. The bulgogi comes in a large hot platter with loads of delicious veggies. The meat is sliced so delicately and so flavorful. I do not come here without ordering it. It comes in such a large portion I always share it with my significant other. I cannot wait to come back when I am in Philly again."
    },
    {
        "id": 171,
        "text": "Best new Korean quick stop for lunch. Love the short menu.\nI was surprised at the speed and quality of the food here.\nThere are many vegetarian options; the green onion pancake and crispy sweet potato and japchae to name a few. Everything is clean and crispy for you to hear the crunch.\nI will come back with a bigger crowd."
    },
    {
        "id": 172,
        "text": "Pleasant experience! Staff are all so nice, and the ambience is great. We got:\n\n-Kimchi pajeon (green onion pancake): deliciously crunchy, but flavor was meh. Will try the seafood version next time\n-Shrimp fries - love! Comes with 4 jumbo shrimp and a delectable spicy red pepper paste/mayo dipping sauce\n-Assorted banchan (small side dishes): good, but never seen a Korean restaurant charge for banchan\n-Galbi Jeem rice bowl - the best, melt-in-your-mouth beef brisket\n-Bibimbap - yummy! Would order again.\n\n2 beautiful, clean bathrooms downstairs"
    },
    {
        "id": 173,
        "text": "Checked out this place for dinner on a Friday night and we were seated right away. The ambiance is cute and cozy, plus it's in Old City, one of my fave parts of Philly. We started off with the \"chili rice gnocchi\" otherwise known as ddukbokki (I had to check the Korean text next to the name to confirm it was the same thing). It was nice and spicy but I'm not used to my ddukbokki being topped with mozzarella cheese. Then we ordered the japchae with beef which was pretty good. The two dishes were appetizers and priced accordingly but the portion sizes were smaller than expected. Then we split the stone pot bibimbap with beef, which was solid, exactly what I expected. Overall I enjoyed the meal but did leave with ample space for dessert (not complaining), I would come back to try some of the other menu items."
    },
    {
        "id": 174,
        "text": "Okay-ish! Definitely worth a try- the pork buns were nice , but the fried chicken was missing that spicy finish- I found it too sweet. The pork hot stone was decent. Overall great vibe and ambience but the food wasn't spectacular. Worth a visit, but I doubt I'll be coming back."
    },
    {
        "id": 175,
        "text": "Sorry. Not much authentic about this food. NH has better Korean. Huge disappointment. Hot, but the flavor is not there. Even kimchi is not the best. I was starving at 9pm, otherwise would have walked out."
    },
    {
        "id": 176,
        "text": "Arrived for a late dinner. Enjoyed the pork buns app. Great flavor.  The only thing I wish is that I could have ordered a bulgogi bowl but no go.  The  BIBIMBAP bowl was tasty and lots of flavor though. Great presentation on each of the dishes.\n\nNice decor and the place was clean. Service was good.\n\nOverall a pleasant experience."
    },
    {
        "id": 177,
        "text": "Great food great atmosphere great service friendly staff clean tables and bathrooms what more can you ask for. Fire chicken with cheese was my choice and it was soo good and my partner got bibimbap with rib eye and she loved it. Will certainly be back."
    },
    {
        "id": 178,
        "text": "I'm between a 4 and a 5 -- I enjoyed what I get, but I feel like there are a couple things that would take this to 5 stars for me.\n\nFor one, finally a Korean restaurant in Old City. Thank you!! It's easy enough to find a vegetarian option, and my omnivore pals are happy too. \n\nOf my complaints, is I feel like the place is in-between a casual and a nicer sit-down ... I would like them to lean toward the latter, because I love a sit-down lunch (think Farmacia vs. a sandwich place, with Farmacia being the nicer). There's also a strange sexist poster up that is just weird in the bad way and makes me uncomfortable, and I hope they take that down eventually."
    },
    {
        "id": 179,
        "text": "Miss in-person dining. Visited the restaurant with my friends. The restaurant did a good job enforcing social distancing. We ordered the Banchan sampler, bibimbap and seafood pancake. Loved everything we ordered, especially the sampler and bibimbap. Our server was super nice and accommodating. FYI, I like the restaurant's hand sanitizer, didn't dry out my hands."
    },
    {
        "id": 180,
        "text": "Came here as a request from my mom to check out a Korean restaurant in Philadelphia! From looking at different reviews, we decided to go here.\n\nFirst off - ambiance. It is a very small restaurant, however, you can't tell because of the super high ceilings and chandelier, which makes the room look larger than what it is. Definitely a cozy spot, would not be ideal for large groups, but I'm sure the restaurant can accommodate.\n\nSecondly, the food. Love that main entrees come with banchan! Ordered a bunch of appetizers like the Korean fried chicken, tteok bboki (not shown), and seafood japchae. These were all very good, truly appetizer size lol so keep that in mind. M brother got the Korean fried rice, while my mom and I shared the bulgogi. The fried rice was good, considered mild but def on the spicier side. Bulgogi was also good, however wish it had more of the marinade. \n\nFinally, BYOB! Enough said lol.\n\nWould recommend for a nice lunch/dinner with a friend!"
    },
    {
        "id": 181,
        "text": "Overrated. Came here for dinner with a group. The food here is good, but not that much better than your average Korean restaurant, and yet it is so much pricier. Unlike most Korean restaurants, you don't get any kimchi or banchan either, which you must pay extra for here. This place is BYO though, so my friend was able to run across the street and grab some soju, which they provided shot glasses for. In a flash of genius, I ordered a drink to use as a mixer, forget what it was called but it was basically Calpico.\n\nI got the pork bibimbap and it was such a small portion, my bowl was only half full with just a small \"pie chart\" section of meat. They could have at least put more rice in the bowl since that's such a cheap ingredient. Should have gotten the spicy pork bowl instead for the same price. At least the flavor was good.\n\nOne thing that was a very off-putting to me was how they weirdly whitewashed all of the names of these very typical Korean dishes, like calling tteokbokki \"chili rice gnocchi\" or calling kimchi fried rice \"paella\" or adding \"bourgignon\" to their galbi. It wasn't like they were serving some novel fusion food, the only Spanish thing about the paella is that it contains chorizo. I wonder if it's an attempt at making their food sound more European to seem fancier, and that's frankly kinda sad, especially since it seems to be Korean-owned. \n\nOverall, I would eat here again if it were convenient, but I wouldn't intentionally make a trip back just for this place. It's overpriced for what it is."
    },
    {
        "id": 182,
        "text": "Came to this cute resto in Old City for a late bday celebration. Ordered pork buns, japchae, spicy chicken with cheese, galbi and soup. I think the food is good overall, but it doesn't have that \"original/traditional\" Korean cuisine flavor that I am used to. The galbi we were craving for was the thin sliced and has a sweet flavor. The one we received was short beef, the thick ones and has the flavor of a chinese peppersteak sauce. \nJapchae could use more seasonings, the fire chicken was perfect, pork buns were good, soup was good."
    },
    {
        "id": 183,
        "text": "Really great service and quick. The food was tasty! We had the mung beans pancake, tofu & kimchi, and bibimbap. All very good but not as spicy as we were expecting."
    },
    {
        "id": 184,
        "text": "The delivery through DoorDash was seamless and the food came hot! Ordered the Spicy Pork Bun, Spicy Pork Bowl, and Honey Soy Korean Fried Chicken. The fried chicken was crunchy and flavorful. My favorite part of the meal was the Spicy Pork Bun. The grilled pork was well marinated and blended well with the glazed asian bun. The Spicy Pork Bowl was tasty but I wish it came with more rice. I was pleasantly surprised with the whole experience and will order from them again!"
    },
    {
        "id": 185,
        "text": "Delivery was seamless and on time.  The food was still hot, which was great!\n\nOur order was  very basic.  The basics set a good foundation for something great.  Some of these restaurants get so caught up in dolling stuff up that the basics are completely missed.  But Chon is not one of them.\n\nThe Korean Fried Chicken is boneless...so no need to eat around the bones.  You can just jump right in on the goods.  The sauce was generously placed on these wings.  No wing left uncovered.  Crunchy and flavorful!  The only thing wrong with these wings is the fact that we didn't order more \n\nBut these spicy buns!!! Not too spicy at all, but the perfect amount of kick.  The pork was tender and not too fatty.  A lot of times I find these buns to be filled with more fat then actual meat and that wasn't the case here.  The meat was bursting with different flavors!  Those damn crispy but soft and fluffy buns just put my pallet on cloud nine.  Wowzers!  I'll be thinking about them for quite some time that's for sure.\n\nDo yourself a favor and get your hands on these beauties!"
    },
    {
        "id": 186,
        "text": "It's an interesting fusion menu here. The decor inside is cool. \n\nJustin is waiting on us, he's nice and attentive and quick. \n\nThey are good about spacing people apart inside this narrow space. \n\nTheir pear punch comes out of a can, the kind I buy at the Korean market. It has the pear sediment found in the cans. We heard him crack open a can for my drink. It tastes like the can too, super sweet and filled with high fructose sugars. Settled back to water. \n\nWe started off with the chili rice gnocchi, the banchan sampler came with our Fire chicken with cheese and a chicken bibimbap with gochujang chili sauce.\n\nThe radishes are a little too sweet for me. The kimchi is good and fresh. The corn, carrots and edamame is tasty. It has some sesame oil in there, with your love.\n\nThe chili rice gnocchi is different, nice and cheesy. There's also Ramen noodles. It's nice and chewy and ewwey and tasty. It's good and spicy too. The fish cakes are soft and yummy. Just wrap the cheese around the spoon like a spool to get it into your mouth. \n\nThe chicken bibimbap has a nice mix of veggies: bean sprouts, carrots, kale, edamame, pea pods, red peppers. The gochujang comes in a plastic ramekin. I asked for a side of sesame for my bibimbap. It's all good. \n\nThe fire chicken with cheese had big saucy red spicy chicken in it. It's tasty. \n\nMy favorite item was definitely the chili rice gnocchi was my jam here. Food was all tasty.\n\nYou get a bottle of hand sanitizer to use with the bill."
    },
    {
        "id": 187,
        "text": "Found this place impromptu while visiting Philly and it did not disappoint! Small family-owned shop. Apparently there is no typical pit-style Korean bbq in Philly unfortunately but this place did well.\n\nSoft tofu stew, pancake, and spicy pork on stone bowl. Everything was high quality. Check this place out for sure if you're looking for Korean cuisine in Philly!"
    },
    {
        "id": 188,
        "text": "The food was alright, but the restaurant felt like Korean food for non-Koreans rather than something more authentic. The menu options were quite limited and it felt like their dishes lacked the more authentic spice and flavior."
    },
    {
        "id": 189,
        "text": "Came by last night at 9:30pm because I had just gotten out of a movie and some other restaurants seemed like they were closed, closing down, or crappy bar food. I was staying nearby on Chestnut so this wasn't too arduous of a walk.\n\nIt's a small restaurant, sort of blink and you'll miss it, but they had a sandwich board out and once inside you're pleasantly surprised at the clean cozy furnishings. I was greeted with a super friendly seat yourself, even though I was the last diner served for the night. Tables of people nearby were cheery with good discussions, a more raucous soju type table toward the back. Good vibe for solo dining or groups or couples! \n\nI asked my server what his favorite was and he recommended the bulgogi I though he said the bibimbap was most popular. No kidding, the safety of bibimbap ha. \n\nI ordered the banchan sampler and the bulgogi rice bowl. It came super quick, and it was so good. Like really excellent food, the quality was great.\n\nI'd characterize this as others have: beginner Korean. Sort of like, hipster fusion bar meets Korean food, but the right way to be 75% Korean restaurant expectation plus 25% contemporary hip restaurant. \n\nThe least expensive meal for me this week and arguably the best, the location is great and I will come again, particularly if I'm staying nearby but if it's the right time I'll trek over from center city (or grab a ride) too. \n\nReally, happy/pleased/surprised. Not overhyped to me, worth it. \n\nThey closed up while I was there but didn't rush me out, I worked in the service industry before and sort of rushed myself out rather than make people wait. Hope you can make it!"
    },
    {
        "id": 190,
        "text": "Buk Chon serves up delicious traditional Korean cuisine in Philly's Old Town. We just got delivery so can't comment on the dine-in experience. But the food hit the spot. The spicy pork was scrumptious, the fire chicken with cheese had a wonderful savory sauce, and the budae stew warmed the spirit. The banchan sides were also a highlight, as usual. Portion sizes were larger that I expected, and we all left full with some leftovers. Overall a tasty meal great for any Korean food lovers - or new initiates!"
    },
    {
        "id": 191,
        "text": "Wow! The food tasted so amazing. Even though I grew up with my grandma who is an amazing cook, this came pretty close to her cooking. The galbi was so juicy and fall off the bone tender and the whole vibe of that place really made it an experience. Would for sure recommend this as a first date option"
    },
    {
        "id": 192,
        "text": "Amazing Korean food! We ordered and shared the spicy pork buns for appetizer, prime rib bibimbop, and spicy pork skillet and they all were AMAZING! We also got the grape Korean punch which had chunks of grapes in it and I enjoyed it way more than I thought. The kimchi and Korean chili sauce and garlic soy were also amazing. We were so happy and satisfied with our meal. The server was so friendly and knowledgeable and had amazing customer service. She made sure we got everything we wanted and needed and even gave us suggestions of things to do (and not do) on our trip. We will definitely be back."
    },
    {
        "id": 193,
        "text": "Amazing bibimbap with ribeye! Probably the best I've had. The pork buns were also really good. Very cute little place, and the staff was very nice. Would be great for a date."
    },
    {
        "id": 194,
        "text": "Very disappointed with the food that I get here. It was pretty much the fast food Korean with added price of a restaurant. Service was good though"
    },
    {
        "id": 195,
        "text": "I tried Buk Chon recently as they have limited outdoor patio dining open. I really enjoyed their take on some Korean classics!\n\nThe japchae was recommended to my by a friend, and it was definitely something special. They somehow got a smokey charred flavor into the noodles which elevated this normally humble dish. I also got their Korean fried chicken appetizer. This was tasty and had a nice sweet and spicy sauce.\n\nFriends got the kimchi fried rice and banchan sampler (since you don't get banchan included with your meal). These also tasted really good and fresh! The fried rice was light but still flavorful, and the banchan looked absolutely beautiful.\n\nIn terms of safety, our food was served in to-go containers and came with disposable utensils. The owners wore masks. The menu was set on a stand nearby so we didn't need to touch it or flip through it. I felt very safe eating here."
    },
    {
        "id": 196,
        "text": "Was looking forward to having the spicy tebboki but all of their dishes we ordered were too sweet. Only the rib eye beef was fine."
    },
    {
        "id": 197,
        "text": "3.5 i didnt know they edit their menu for covid. They didnt have too much to choose from but me and my bf got a bibimbap. I like the variety of diff veggies. Not ur traditional bibimbap but it tasted great!! Sat us outside. Wish they offered drinks."
    },
    {
        "id": 198,
        "text": "I really enjoyed my dinner at Buk Chon! It's byob and has a very traditional Korean menu. But the nice thing about the menu is that it's not too intense or overwhelming. It just has all the classic Korean dishes. \n\nMy friend and I came pretty early at around 5:30 on Saturday and didn't have reservations. At that time, there were several tables available but as it got later, the majority of tables filled up. We ordered the Korean fried chicken (with chilli sauce), the bimbimbop with beef and the tofu stew. Overall, the dishes were not too spicy. To me, it was all just pretty mild spice, so if you're looking for super spicy, it wasn't that. \n\nThe KFC was really good, especially for being boneless! I usually like bone-in wings and think boneless can sometimes be dry, but the boneless KFC here was really good! I also enjoyed the bimbimbop and stew. Both were well made, authentic dishes!"
    },
    {
        "id": 199,
        "text": "The food here is wonderful. It's BYOB but a nice liquor store is around the corner. The service was really nice and polite. I loved the menu (the actual design of the menu) every bite was delicious."
    },
    {
        "id": 200,
        "text": "I'm so spoiled by all of the amazing restaurants here in Philly, and this place does not disappoint. 1. BYOB. 2. Delcious and afffordabledd ishes. I always spring for the fire chicken which is fire in more than one may. You can get it traditional spicy or extra spicy, beware of the latter. It comes with a side of rice and tastes just as good for leftovers the next day. My wife, the vegetarian, opted for the tofu biminbap bowl which she swears by...the best part being how the rice continues to get crispy and cook in the bowl as the meal goes on. I defintely recommend coming here."
    },
    {
        "id": 201,
        "text": "I love this place.  Friends of ours ordered from them when we opened our Jiu-jitsu school down the street and I couldn't stop thinking about the food so for my wife's birthday we ordered 2 honey soy chicken and 2 sweet chili chicken the other day and they were both amazing! The people working there are incredibly friendly and welcoming and the indoor seating looks very nice. Looking forwards to eating there again soon!"
    },
    {
        "id": 202,
        "text": "First off...don't go here expecting authentic Korean. It's a different take. \n\nThat said it is really good food. I recommend trying it and think most people will love it. \n\nSmall restaurant but very nicely decorated and clean. \n\nOnly tried three items on the menu so we will have to come back and try more, which we will!\n\nCame for lunch during the week and it was pretty quiet. \n\nHad the Korean fried chicken, japchae with bulgogi , and the galbi bourginione. \n\nThe Korean fried chicken was really good. Super crunchy and nicely seasoned with a yummy sweet chili sauce. \n\nJapchae was a little different than others I've had but good. It was a little more Chinese than Korean in flavor profile. Really nicely cooked noodles, with good veggies and a yummy beef topping. Only thing i felt it needed was a little sweetness...but after adding a lil Dollop of the sweet chili sauce from the chicken it was perfect. \n\nFinally the galbi bourginione. This was delicious! Not galbi like I've had in any Korean restaurant before. The chef clearly has some French training. This was like a French bourginione with melt in your mouth, unctuous short rib instead of braised chuck.  The beef was fall apart tender, gooey and wonderful. Nice mushrooms, onions and a little asparagus. Excellent dish. \n\nService was solid and the chef even came out to check on us and make sure we enjoyed which is a plus. \n\nOne small negative is that the Bonchon is all a la carte . That isn't appropriate at a Korean place. It should be free with the meal. \n\nA little more sweetness on the japchae and some complimentary Bonchon would make it five star and worthy of high praise. \n\nGood place overall for sure."
    },
    {
        "id": 203,
        "text": "This is a wonderful place and it is not in the heart of China town.  The food was excellent.  I highly recommend this place forever to try."
    },
    {
        "id": 204,
        "text": "My boyfriend and I came here for a general date, and when we got there I was thankful that we made a reservation because the wait was pretty horrendous. The space itself is quite modern, but the food definitely tasted like a neighborhood diner in suburban Seoul. The jeyuk and bulgogi were impressively well marinated and cooked, which I can't say about all Korean iterations in the non-Cheltenham areas of the city. The japchae was actually annoyingly delicious, but there wasn't enough of it and I felt like for the price, they could have at least gave some more noodles.\n\nI was a little annoyed that they didn't do the traditional Korean way with free side dishes because who eats a meal without kimchi? That's like a meal with no rice. I GET it, I just don't think it was the best decision. I digress.\n\nThe green tea ice cream is NOT matcha, just a heads up. Think Chinese green tea when you get bubble tea. In any case, I enjoyed my time here and although the service crew was greener than grass in mid-July, I would definitely come back."
    },
    {
        "id": 205,
        "text": "The staff was super nice! The decor of the back of the room looked a little creepy like the inside of a catacomb or something but I didn't really mind. The thing that made me give 3 stars is the food was really bland and didn't taste like traditional Korean food. I got the spicy pork bowl, fried chicken, bugolgi  all of which had no flavor. I was surprised because of the high ratings on this restaurant but oh well learned my lesson not fo trust Yelp reviews that much."
    },
    {
        "id": 206,
        "text": "We found this place while visiting Philadelphia.   The service was very nice we got here around 12.30. There was only 1 customer after we seated. The restaurant started to pack!  Food was great we ordered bibimbup with spicy pork and tofu soup.   They both are over expectation."
    },
    {
        "id": 207,
        "text": "Philadelphia has an awesome food scene, and this restaurant is definitely one of them. I enjoyed both of its food and cool vibes. The food was more like a creative(fusion) Korean food, which I found it absolutely delicious. Customer service was also superb and the place was so clean and neat.\n\nLocated in Old City Philadelphia(the area is so so so beautiful!!!), it is a good spot to enjoy the rich culture of Philadelphia along with good foods:) Nearby there is a wine/spirit shop where you can buy drinks at reasonable price. So lovely an area full with rich traditions combined with modern innovative vibes."
    },
    {
        "id": 208,
        "text": "tl;dr behind the punk-modern aesthetic and Westernized-menu, this Old City BYOB  serves large platters of solid Korean fare\n\nEnter into a narrow, low-ceilinged hallway with dark wooden flooring. Two-seater tables are spaced evenly along the white subway-tiled wall and one side, while clear tubes of incandescent bulbs dangle above the staff prep area on the other. This corridor opens up into a large, cubical room. Tastefully melted candles and graffiti-style art decorate cubbies within the vast exposed brick walls, while an ornate metal chandelier hangs from the high, pressed-tin ceiling. A rust-red cushioned booth loops around the room, with a four-seater table pressed into each corner. Acoustic Korean music plays unobtrusively in the background. Take the steps down into the industrial basement to find the clean, unisex washrooms.\n\nDuring our visit this weekend, my partner and I opted for the Korean Fried Chicken (with Honey-soy), Tteok-bokki (stir-fried rice cakes), and Spicy Pork Skillet. The boneless, popcorn chicken-style KFC sported a light, crispy breading. The sauce itself was sweet, but not overwhelmingly so. Although the nuggets were heavily sauced, they remained surprisingly crispy. The tteok bokki (described on the menu as \"gnocchi\") consisted of rice cakes, ramen noodles, and fish-sauce tofu, doused in a ketchup-y sweet-and-spicy sauce then sprinkled with mozzarella. I enjoyed the different textures and found the stringy cheese to be the highlight. However, the flavors became progressively one-dimensional as we ate our way through the large platter. The pork skillet had a large mound of meat, topped with a chili oil sauce. Unlike the tteok bokki chili sauce, this one was more umami and thicker in consistency. The spice pleasantly lingered on the tongue, rather than being overwhelmingly forward. The bonchon felt higher quality than peer restaurants. My favorite was the pickled eggplant. Nonetheless, I found it moderately offputting that they only come free if you order a skillet (and, even then, you receive a random 4 of the 6 possible options).\n\nService was memorably friendly and appropriately attentive. The restaurant was around half-capacity when we arrived but was full by the time we finished. The atmosphere and menu descriptions originally had me expecting Korean-American fusion cuisine, but the dishes were surprisingly authentic. The large-sized portions took me from ravenous to pleasantly full. At $52 (after tax and tip), Buk Chon definitely scales to Old City prices -- this is partially offset by their BYO policy. Although not every dish was a hit, this spot cooks up some solid Korean eats (something, for which, Philly is severely lacking). Buk Chon is definitely worthy of a return visit."
    },
    {
        "id": 209,
        "text": "Let me first start that I'm tough to please when it comes to asian fusion as it's usually subpar and expensive from my experience. However, I give every restaurant a chance to prove me wrong and Buk Chon did not! \n\nFirst of all, ban chan (korean starter dishes) should always be free. It is ridiculous that'll it cost $3-6 for something that is free in most korean restaurants. I got it anyway to at least try it. The ban chan tasted to sweet and I probably won't be ordering it again.\n\nThe entree dishes and soups are decent. However, I still noticed that the entrees were overly sweet. The bulgogi was cooked well but I'm looking for more depth in korean fusion instead of what I got. Overall, the food was lackluster and I probably will not go back anytime soon."
    },
    {
        "id": 210,
        "text": "If you're craving korean food in Philly with a hip ambiance,  this is the place for you!\n\nI really appreciated the decor and interior (perfect for date nights) and the small touches, like the higher end disposable chopsticks (no splinters for me!) \n\nAlthough they have renamed traditional korean foods into more Americanized terms (dduk=rice gnocchi), I still found the food to be very traditional tasting. The banchan were light and refreshing, the japchae was a cut above other japchae I've eaten, with a smoky flavor. \n\nI thought the staff was very considerate, attentive to filling our waters, okay with modifying the dishes (I asked for no pork in my kimchi fried rice), and generally very nice. \n\nOne note- the kimchi fried rice is a little spicier than you might imagine, so be cautious! Other than that, I'm very happy with this new find and will be back soon!"
    },
    {
        "id": 211,
        "text": "Was craving Korean food, so we ordered some takeout from Buk Chon, as the reviews looked promising. \n\nWe ordered our usual go-to dishes, a soft tofu stew and the Jap-Chae. The order came with banchan, packed in three condiment sauce cups, one of the saddest looking and most disappointing banchan I've ever had.\n\nThe tofu stew and the Jap-Chae were standard. The tofu stew could use a little more spice though."
    },
    {
        "id": 212,
        "text": "Haven't been to Pennsylvania in a long time much less in Philadelphia. We looked at three restaurants before finally landing here. And the second we walked in the atmosphere was wonderful, the staff was friendly and warm, and when we got our food it was absolutely delicious!"
    },
    {
        "id": 213,
        "text": "My partner and I decided to try a new restaurant tonight and she chose Buk Chon. Great decision. The restaurant is modern, cozy, and has a very chill ambience. Great service. We tried the Korean fried chicken, bibimbap w/shrimp , spicy pork bowl, and hibiscus tea. Everything was fresh and delicious. The spice of the pork bowl was perfect. This was for sure some of the best food I've had since I've lived in Philly."
    },
    {
        "id": 214,
        "text": "We dined here and have no regrets!  I didn't realize it was BYOB but the server gave us a menu for the bar next door so we could go grab drinks there and bring them over. He also gave us directions to a shop selling wine and beer. It was quicker and easier to just go next door :)\n\nThere is outdoor dining but we opted for indoor since they were taking all the recommended COVID precautions. The service was excellent - very helpful in answering questions and making recommendations. The Spicy Pork Buns are fantastic. We started with those and also got a green onion pancake. Beware - you might fill up on these things!  The quantity of food with our main courses was large - we all took leftovers home (even my mom and I as we were sharing the prime rib skillet). If you order extra spicy - know that it's VERY spicy - make you sweat kinda spicy...lol!  But very yummy!"
    },
    {
        "id": 215,
        "text": "Love it . Great place to grab a delightful bite to eat. Came here with my wife and son and we all thoroughly enjoy the flavors. They present the korean flavor in a pretty solid way. Awesome decor and peaceful vibe. Wait staff comes when necessary which create a smooth dining experience. Plus BYOB can't go wrong . Gave a 5 star because where we are from in NJ Korean restaurant do not cater to American diner's ..enjoy your visit"
    },
    {
        "id": 216,
        "text": "Truly shocked at how this place has raving reviews. The food is all at best mediocre (everything was super sweet), it does not taste authentically Korean, and I was appalled at their restroom sign.\n\nThe only thing we enjoyed here was the fried chicken appetizer and it's not that hard for fried chicken to taste good. The stew I ordered tasted under-seasoned and too sweet all at the same time. \n\nThe restaurant was a 3 star until I went to the bathroom. The bathroom sign suggests a \"man\" figure peeking in to a bathroom stall that a \"woman\" figure is using. If it's humor they aimed for they miserably failed. Way to promote crime."
    },
    {
        "id": 217,
        "text": "First time here in old city and loved the food. Soft tofu stew was the exact thing I wanted in the cold weather. Piping hot, super soft fresh tofu and veggies and Super delicious ...slurp slurp! Also tried the Shrimp Kimchi Paella that was really flavorful too. Korean Pear Punch was so refreshing. Great place and good service. Lovely ambiance. I will come back again to try their green onion pancakes as they looked really good in pics."
    },
    {
        "id": 218,
        "text": "Great place! I was warned that Philly doesn't have the best korean food but this place was so yummy! I was born in Korea and grew up in Los Angeles, so I know a decent korean place when I try it. Everything we tried was yummy. We had bibimbap, kimchi fried rice, spicy rice cake, and bulgogi. If you are looking for good korean food I would highly recommend this place. Only thing I was surprised by was that they charge you for banchan (small dishes) as korean restaurant usually give them out for free (and free unlimited refills). We had to try it so we got the banchan tasting plate and everything was delicious! You won't be disappointed."
    },
    {
        "id": 219,
        "text": "Really, really great food! First, it's BYOB but there is a liquor store right nearby, so pretty easy to pop over there and grab some alcoholic beverages if that's your vibe. The restaurant was pleasantly busy but not overcrowded, so calling ahead is probably a good idea (we did so). We shared a couple of dishes at the table (mung bean pancakes and chili rice gnocchi) and both were delicious, although the chili rice gnocchi was out of this world. The sauce was spicy but not overly so, and it was just delicious.\n\nFor my entree, I asked our server to help me decide between the rib eye bulgogi and the fire chicken, and he recommended the former because it was my first time at the restaurant. In hindsight, I think he recommended the bulgogi because it wasn't super spicy like the chicken, and I'm definitely annoyed at myself for following his advice. It was very tasty, for sure, but I think the fire chicken would have been even better and more up my alley. So, when I go next time, I'm definitely going to grab the spicy chicken.\n\nMaybe the only negative about this place is that I did feel like the server was kind of absent for most of the meal. He didn't do a great job of refilling our water and our card sat there for a long while before he picked it up. Granted, the food was good enough that we'll definitely be back, but I would have preferred a little more attentiveness.\n\nAnyway, in general, big thumbs up for this place!"
    },
    {
        "id": 220,
        "text": "My credit card was charged with higher amount of tip. \n\nFood was okay. Original Korean flavor.\n\nIt was 6/20 Sunday and I was charged $51 on my discover card \nNo need to cancel the whole transaction. \nI was just upset because I wasn't sure if it was a mistake or the server charged more on purpose.\nWhen will you call the cc company and change the amount?"
    },
    {
        "id": 221,
        "text": "Ordered delivery from Buk Chon and it was absolutely DELICIOUS. The army stew was incredibly tasty and authentic, and the spicy pork was out of this world. Cannot wait to try more dishes, so far this is my favorite Korean spot in Philly. Great price as well for everything!"
    },
    {
        "id": 222,
        "text": "I just got takeout from here for the first time.  Easily the best korean food I've had in Philly.  I had some difficulty understanding the menu, and I believe the owner got on the phone with me and was super helpful, polite, and welcoming to me.  I highly recommend this place, the ribeye bulgogi is absolutely superb and the Kim chi paella is among the best I've ever had.  One recommendation: I think for the price, they could probably make the shrimp in the paella like the larger ones.  Just my preference, but I'd still get it anytime I want Korean food.  Give them a shot!"
    },
    {
        "id": 223,
        "text": "This place was a disappointment.\n\nI had high expectations and initially walking in I thought the food would meet that expectation because the decor is very nice. There was no one else there when me and my friend arrived.\n\nThe food is was very lackluster, including the korean fried wings, and the soondubu was also really lacking authentic flavor. For the price, the food was not worth it.\n\nService: Attentive, somewhat quick.\nParking: Can be tough. Street Metered Parking.\nFood: Not worth it. Meh. \nWould I come back here? No. I wouldn't recommend it either."
    },
    {
        "id": 224,
        "text": "Stumbled in here on a Monday after being surprised that another restaurant was closed and this was nearby. I didn't have high expectations and overall I was not impressed. \n\nLet's start off with the good the chicken appetizer was probably worth 4/5 stars for being boneless chicken. They were cut in little nugget sizes, fried nice and crispy, and the sauce was not too salty but needed more spice. \n\nFor my meal I got the bibimbap with beef. Presentation was nice but the flavor was just lacking. Thankfully they give you a whole bottle of the gochujang sauce so I added plenty to get by. The sauce itself was too sweet and needed a lot more of a kick."
    },
    {
        "id": 225,
        "text": "Amazing!!! Loved all the food and great service!  We loved the sizzling plates and bowls, definitely a new favorite spot"
    },
    {
        "id": 226,
        "text": "Grabbed a weeknight dinner here as I had seen good reviews for this place and as a fan of Korean food, and an even bigger fan of BYOBs, it was high on my list. We grabbed a bottle of wine at a store down the street. It was a weeknight so it was quiet, We spent 2 hours here just chatting and enjoying our food/bottle of wine. We decided to share a few appetizers as our meal since the entrees lacked many pescatarian options for my partner. The service was good - and overall the food was tasty. I really liked the Korean Fried Chicken and the bonchon. My husband loved the chili rice gnocchi- I thought it was an interesting take on a Italian/Korean dish, but I found it a little too spicy to have more than a few bites. The japchae was so-so as the seafood included seemed to be low quality frozen stuff. I would skip the seafood next time and just eat the tasty noodles. The check was well priced, especially for the area. I would come back and spend another weeknight here - it's a good spot for a leisurely chill date ;)"
    }
]