[
    {
        "id": 1,
        "text": "This place is fantastic!  Delicious, simple, healthy. Literally could not ask for anything more, especially at under $10! Beef is my favorite but I could also go for the chicken. If you haven't been here and you are still reading this review, stop what you are doing and go right now."
    },
    {
        "id": 2,
        "text": "I called in an order for a chicken dish, and it was hot and ready 10 minutes later when I arrived.  The owner was very friendly and made some conversation.  The food was hot and tasty.  The ingredients were made well, with good flavor and texture.  I got chicken and a coke and the total was roughly $10, and I was stuffed.  I would definitely go back there again."
    },
    {
        "id": 3,
        "text": "The menu isn't extensive but great to go to if you're craving a classic bibimbap.  I would recommend the extra dollar for the stone bowl.  The man who runs the shop is sweet and makes sure you have a good dine in experience.   Also, the location is close to the Magic Gardens."
    },
    {
        "id": 4,
        "text": "Solid rice and fresh vegetables. Pricey for what you get, although understandable given that the location is on South St. Also try the panjeon (Korean pancake) and yukgaejang (beef stew) on a cold winter day. Small restaurant, seems like most people take their food to go. Very friendly staff."
    },
    {
        "id": 5,
        "text": "I ordered from BAP using UberEats, and enjoyed it. The food was warm and delicious, and there was a nice ratio of meat and vegetables to rice. I liked their kimchi as well, which they did manage to keep at a cooler temperature than the bibimbap."
    },
    {
        "id": 6,
        "text": "Little disappointed considering all the stellar reviews.\n\nThe veggie bibimbap was delicious but the yukgaejang was just ok, and a tiny portion despite being labeled as 16 oz. Also, it didn't come with rice which I thought was weird, and they charged me $2 for a small bowl of white rice, so the $4.95 yukgaejang became a $6.95 yukjgaejang. The pa-jeon was just ok too. \n\nI guess Philly has a pretty weak Korean food scene in general, but I wanted this place to be a little better. If it was next door I'd probably hit it up every now and then, but the problem is that we're not that close to here, and its just not good enough to warrant going very far for it. \n\nInside only seats six."
    },
    {
        "id": 7,
        "text": "Fresh, delicious, and satisfying. Perfect dinner to pick up on the way home from work.\n\nDon't tell my mom, but it's better than the bibimbap I grew up eating :O"
    },
    {
        "id": 8,
        "text": "I will be eating here every time I go to Philly in the future.\nIt's a little place - primarily take out, i think.  just two people in the kitchen prepping and cooking and waiting tables / tending register.\nthe bibimbap is great - super fresh, flavorful, spicy (if you like it spicy- or not if you tell them not to make it spicy), filling without being a gut buster.\nif only every meal could be this satisfying and wholesome...."
    },
    {
        "id": 9,
        "text": "Great bibimbap! Fresh veggies, great flavor and very reasonable. The owners are very nice as well. This is our favorite bibimbap in the city!"
    },
    {
        "id": 10,
        "text": "BAP is a quaint hole-in-the-wall thats great to pop in for bibimbap or to grab take out. The menu is short and sweet (no frills), but the food hits the spot!\n\nYou walk up to the front and order; there's no true waitstaff. It seemed like only one man was running the place when we came in, but considering that, we didn't wait very long at all for our food. \n\nMy dolsot bibimbap came out delightfully sizzling. I thought the flavor was excellent, and the egg was the perfect amount of gooey. I finished the entire bowl (something I've never managed before) and was just the right amount of full.\nFor $11, I'll definitely be going back!"
    },
    {
        "id": 11,
        "text": "Gripped a veggie bibimbap, gotta say it was tasty, I'll come again, but I don't think I'll bring friends because I don't have any"
    },
    {
        "id": 12,
        "text": "Mostly rice, very little meet. Dol sot pot was not hot enough to crisp the rice."
    },
    {
        "id": 13,
        "text": "I LOVE THIS PLACE. I would eat lunch here twice a week if I could. As it is I go out of my way to come here. The tofu bibimbap is my go to but the menu is so healthy, tasty, filling and affordable!! The owner is so sweet and there are 5 small tables (no server) for eating in. So convenient. Go here often :)"
    },
    {
        "id": 14,
        "text": "Really cute place that is run by a husband and wife team. The Bibimbap in a stone pot was delicious and fairly priced. The portion size was solid and I left feeling completely satisfied. I agree that this is a hidden gem and worth going to, especially if you live in the area. Also, I like supporting nice small businesses like these. The owners were very friendly and nice and other than the Bibimbap, my wife really liked the Ginger Cinnamon Tea. \n\nOf note, they take Credit Cards. I think the yelp reviews previously had said cash only. \n\n4+ for the food, extra star for kindness."
    },
    {
        "id": 15,
        "text": "Came here on a Tuesday at 8:40 w/my SO. We ate in and ordered the chicken bibimbap, the dolsot beef bibimbap, and the homemade ginger cinnamon tea.  \n\nThe good:\n- The chicken was moist and tender and the beef was seasoned perfectly. Both had awesome flavor and were generously portioned. \n- Great veggies in the bibimbap (and all very fresh): cucumber, red cabbage, broccoli, zucchini, bean sprouts, etc. \n- Perfectly cooked runny egg =]\n- The owner/cook is incredibly sweet!!\n\nThe less good: \n- The rice to meat/veggie ratio wasn't great. They should either give less rice or give more veggies & meat\n- The ginger cinnamon tea was a bit bland. It could have benefitted from a bit of sugar. \n- Not the best place to eat in (it seems like people go more for take out). It's sort of bleak and depressing..."
    },
    {
        "id": 16,
        "text": "Stopped in for lunch around noon on a Saturday. I expected it to be busy, but there was only one other couple there. We both got bibimbap, I got tofu, he got beef. He also tried shrimp pancakes and kimchi. Both of us enjoyed our stone bowls. My only complaint is that it was spicy, which some people may not love, but I enjoyed it. One thing that was noted is that the beef is scarce, but the portion overall was good. He also liked both other dishes, declaring the kimchi the best ever. In addition, we both got the ginger cinnamon tea that is made in house. While I liked that it was not sweet, he would have preferred a lift sweetness. This is a great spot with excellent service and good food."
    },
    {
        "id": 17,
        "text": "Great bibimbap! Fresh veggies, great flavor and very reasonable. The owners are very nice as well. This is our favorite bibimbap in the city! Truly a hidden gem."
    },
    {
        "id": 18,
        "text": "I am always on the lookout for good Korean food in the USA, and this hole one the wall\nrestaurant serves good, non-fussy, fresh, and healthy food."
    },
    {
        "id": 19,
        "text": "Uh I don't understand why there is such a craze for this place. When I went, the restaurant was empty, which is fine with me since the food should have come out faster. But it still took 20 minutes. With that said, my bibimbap came out cold. Like not cold because it's meant to be served cold, but cold as in the food was already cold when it got to our table. I don't know how you can really go wrong with bibimbap but this place does not deserve 4.5 star. The owner was nice so I feel bad for giving this a bad review, but the food is not that great. Won't be going back again."
    },
    {
        "id": 20,
        "text": "A bare-boned place, so don't expect a lot of ambiance, that being said....I don't need ambiance as long as the food is good. BAP has a nice short menu and the bibimbap was wonderfully prepared and delicious. \nI will be coming back for more!\nI also saw they added pajeon (korean savory pancake) to the menu, and i'll definitely be trying that on my next visit.\nthe price is great too - compare it to Rice & Mix on Walnut (also a favorite of mine) and i think BAP can hold its own...price is more affordable too!\nThe proprietor is also a very friendly man, courteous and helpful too. The portions are large - so there was no mistaking it would keep you sated."
    },
    {
        "id": 21,
        "text": "The best 'hole in the wall' places keep it simple and do a few things well - this guy does exactly that.  There's not a lot about bibimbap to screw up, and a lot of it hinges on fresh crisp vegetables and your gochujang/kochujang.  This guy makes a bangin' gochujang and everything is done exactly how it should be.  I had a chicken bibimbap, but the protein you pick really doesn't impact the dish very much, honestly.\n\nIt's not particularly traditional, but it does have the basic spirit of bibimbap:  take a bunch of leftover vegetables and turn it into something new.  Mine had fresh broccoli, carrots, cucumbers and sprouts - none of them seemed to be dressed or pickled.  Honestly, no flavor was lost by that - the kochujang seasons it perfectly.\n\nI'll certainly be back."
    },
    {
        "id": 22,
        "text": "I wanted to love this place. I've passed by for years while wandering South Street, always keeping in mind that there's a cute, convenient little place that solely sells bibimbap. Finally took the plunge one day and went to order the 'bap. \n\nI've had my fair share of Korean rice in stone pots that have warmed my soul and whet my appetite. This came to me in a large aluminum bowl to accentuate the size of the meal. I wasn't completely wowed even knowing full well the guy prepared it just there and then. Good assortment of veggies, rice, meat but definitely echo some of the other reviewers here - it just wasn't enough. Typically bibimbap makes me keel over from sheer amazingness; quality and quantity and delicious. This gave me more of an: it's alright, feels sufficient. Lots of options for similar prices on South Street and surrounding area but if you want 'bap quick and easy, it can be an easy fix for you."
    },
    {
        "id": 23,
        "text": "Very small and casual. Counter walk up with sit down and take out options. Fast, kind service. If you are looking for solid, quick, cheap bibimbap, this is the place for you!"
    },
    {
        "id": 24,
        "text": "This place is super cute and homey! Really good food and super fast! Will definitely order from here again!"
    },
    {
        "id": 25,
        "text": "I created an account just to write this. \n\nThis place is terrific. The gentleman who runs it is very nice, and its modest appearance belies the quality of food on offer.\n\nThe menu is quite small, but the bibimbap is excellent. $8 gets you a whole meal of fresh vegetables, quality meat (or tofu), and just the right amount of heat. There is no heavy-handed dousing of sauce all over the vegetables, and you can finish a meal without feeling like a hot mess. I've sampled almost the whole menu, and each time the experience is the same - a full stomach, great taste, the freshest ingredients, quick service, and a kind proprietor. I'm not sure what else you could ask for. Highly, highly recommended."
    },
    {
        "id": 26,
        "text": "This restaurant is a neighborhood gem. You can get really delicious and healthy food fast here. The owners are also super sweet. It's a perfect place for takeout."
    },
    {
        "id": 27,
        "text": "I no longer live an Philly and this might be the place I miss most.  Everything on the menu is delicious, authentic and consistent.  The atmosphere for a hole in the wall on South Street is perfectly fitting.  I always enjoyed the classical music, tasteful decor and the friendly service that makes one truly feel welcome.  I can't wait to come back next time I'm in Philly.  Thanks for all the great meals!"
    },
    {
        "id": 28,
        "text": "I came here right before closing one night. I lived right outside of Koreatown in LA for about a year so I think I might be a bit critical. The food here was okay. I definitely think it's overpriced for what you get. I had the chicken bibimbap and still felt hungry afterwards. \n\nCustomer service was a 10/10. Super friendly people!"
    },
    {
        "id": 29,
        "text": "Very delicious, fresh, fast and a good price! The menu is small, but the flavor is not. I got the vegetable bibimbap and my husband got the beef. We also got a small kimchi (nice and crunchy) and a hot ginger cinnamon tea. Everything was great!"
    },
    {
        "id": 30,
        "text": "Absolutely delicious little mom and pop joint. Prices were a tad high for the amount of food but still worth it. Try the cinnamon ginger iced tea."
    },
    {
        "id": 31,
        "text": "I've been meaning to come here for the longest time and I'm so glad I finally did! It's a hole in the wall and the menu is very minimal, so you know that they've perfected every item. I got the beef bap and the sauce is so good, they have a bottle of sauce if you'd like to add more. You can dine in or take out. The inside is a cute little spot and the man taking orders was very sweet. As you can see I killed the bowl."
    },
    {
        "id": 32,
        "text": "Cute little Korean couple serving authentic Korean bibimbap. As someone who grew up eating bibimbap, I can say it taste just like my mom's. I will definitely be going back! Great food, great portion, great price. I highly recommend this place!"
    },
    {
        "id": 33,
        "text": "Very nice korean bibimbap on the go. \nIt's a small menu so it's great for people that wanna come and look at a simple menu in front of ur face and go.\nI do like the japchae, but it was half the box. And do they mean by \"vegetable\" japchae because there wasn't any meat.\nBut in my opinion, you get what you pay for the beef bibimbap.\nThe vegetables and rice did not even fill up half of the height of the take out bento box. The marinated beef was good though.\n\nI was full but it's not enough for a male tummy FYI."
    },
    {
        "id": 34,
        "text": "It isn't the best bibimbap in Philly, but it is a decent deal and a great quick lunch or dinner if you are in the area. The owners are very nice and the food comes out hot if you get the hotpot bibimbap. The bowl isnt really a stone bowl like how I have usually had it, which was disappointing. I enjoy Giwa and Tampopo more for my hotpot bibimbap needs"
    },
    {
        "id": 35,
        "text": "I was a little sad to know that my local Chinese takeout spot was no longer there.... But am thrilled to welcome a Korean mixed rice bowl takeout!!! I heard there were going to be other new additions to the menu and I can not wait. I got the beef bibimbap and there were all different kinds of vegetables: red cabbage, bean sprouts, carrots, broccoli, mushrooms, zucchini, and cucumbers. I picked beef which tasted like bulgogi (Korea. Style sweet/soy marinated beef) and it came with a perfectly over easy egg on top. The red sauce that was on the side was perfectly portioned (even though the guy gave me extra) i could see it being a little spicy for people who can't handle the heat so just be cautious and taste before you mix!!!  For $5 it is definitely worth it. I'll be back again for sure!!!"
    },
    {
        "id": 36,
        "text": "If you like things healthy, authentic and naturally flavorful, this is your place. I highly recommend the chicken bibimbap and cinnamon ginger tea. I don't detect added sugar anywhere, just clean fresh eats.\n\nI would rate this as my personal favorite bibimbap I've ever had in the US. I've had it all up and down the east coast, mainly in the DC/NoVa area where I'm from."
    },
    {
        "id": 37,
        "text": "Ahh what can I say?  BAP is truly a  hidden gem on South Street.  The food is absolutely delicious and satisfying.  They provide the perfect portion for such a reasonable price.  The sauce they serve is out of this world and keeps me coming back for more.  The owner is the sweetest man-- always friendly and serves with a smile.  I visit BAP every Thursday (sometimes more)!  My favorite, quick, take out meal!  Keep it up BAP, you rock!"
    },
    {
        "id": 38,
        "text": "I love this place. I come here probably twice a month. Quick, easy, healthy (relatively) and cheap (once again, relatively)."
    },
    {
        "id": 39,
        "text": "Great bibimbap--fresh ingredients, well seasoned.  Plus I can walk to it from my house!  My partner and I both had the tofu bibimbap and beef soup.  Delicious!"
    },
    {
        "id": 40,
        "text": "BAP!! My cousin and I got a beef bibimbap!! The taste was very scrumptious! The vegetables are definitely fresh. Every time I took a bite, a crunch could be heard! Nom nom nom! For the meat, it's seasoned properly and the portion ratio was just right. The reason I'm giving it three stars is because it wasn't warm at all! Beef was room temperature! Kind of felt like I was eating leftovers that wasn't microwaved! Maybe it was because we came the last twenty minutes, who knows.  We also got the pancake! It was so crispy, which I like! \n\nCustomer service! The owner was extremely nice for letting us come in, even though it was closing in 20 minutes! He kindly let us try his homemade tea! He's a really humble guy!! \n\nI'd come back again to try a different type of bibimbap though. Hopefully it'll be warm next time!"
    },
    {
        "id": 41,
        "text": "Great little spot with a super friendly owner. \n\nBeef Bimbebap in a Dolsot:\nGreat spice, great flavor, and great texture.  The rice is creamy on top with crispy rice on the bottom. Veggies were nice and crisp too. Beef was tender. The egg on top speaks for itself. The only thing this dish needed was a touch of soy sauce/salt which I added at home and made it 10x more flavorful."
    },
    {
        "id": 42,
        "text": "BAP is one of my neighborhood favorites. The place is run by an older Korean couple and they are two of the nicest people you will meet. Major points for a family owned spot with kind people and good service.\n\nThere's not much to say really: it's exactly what you'd expect Bibimbap to be. The menu is small. It's basically Bibimbap and then Kimchi with some specials that change from time to time. The only negative, but not enough to take off a point, is that the portion sizes are quite small for what you pay. I always order extra meat and it still doesn't fill me up. I'm not even a big eater. The only thing I'd recommend is go elsewhere if you're starving. I'm not sure this will satisfy you fully.\n\nPoints for: Service, neighborhood place, BYOB (I think? I've never eaten there. Always takeout).\nNegatives: Portion size"
    },
    {
        "id": 43,
        "text": "BAP is awesome! Really great food, fresh ingredients, and the owners are very nice (they gave us a free pajeon). If you have a little time, it's a great stop before going to the Kimmel Center. \n\nMy only comment is that I wish the bibimbap was a bit warmer. But it didn't ruin my experience at all."
    },
    {
        "id": 44,
        "text": "Love their bibimbap, especially in the restaurant with the stone bowl. Their kimchi is also delicious and the chef is always friendly."
    },
    {
        "id": 45,
        "text": "BAP is as good as it gets for a hole in the wall bibimbap shop..... the decor is charming and warm, the owner is welcoming, and the food is delicious and fresh.  Lots of tender chicken and vegetables and a perfectly runny egg in the chicken bibimbap... the kimchi is nicely funky and moderately hot... I love the spicy ginger cinnamon beverage... service is quick and friendly.  I wish it were open later and on Sundays, that's my only complaint."
    },
    {
        "id": 46,
        "text": "I'm breaking a personal rule here by writing a review after a single visit.  But--what can I say?-- it was a terrible, horrible, no-good meal.  My fellow Yelpers deserve to know!\n\nI had the pajeon (vegetable pancake) and it was disastrous.  Now maybe you can fault me and say that when I go to a place called \"Bap,\" I should order the namesake bibimbap.  Ok, that's fair.  \n\nOn the other hand, if you can't adequately prepare a dish, don't offer it on your menu!  \n\nThis pajeon, a sort of egg+vegetable concoction, was tasteless, utterly without taste!  I couldn't even taste the vegetables that I could actually see in the pancake!  There also appeared to be something similar to cornmeal in the pancake.  \n\nIt was like eating fried construction paper. \n\nEven though I only spent/wasted a little over $5 on this meal, I left the restaurant hungry, disappointed, sad, and livid.  \n\nNot the way that you want to feel when you leave a restaurant.  \n\nNever again, BAP, never again"
    },
    {
        "id": 47,
        "text": "We trekked down to this hole in the wall after seeing the first reviews on Yelp and it didn't disappoint!  There is no quality place in Center City to get Korean food and it made me really sad.  Bi Bim Bap is so delicious and BAP makes a standard traditional version with all the pickled veggies you could want.  The portion of meat on the dish was a little small for my protein-focused boyfriend so maybe it would be good if they offered a double meat option?  The cinnamon tea was soooo good- I never thought about cinnamon tea before and I'm not sure why it doesn't exist in more places.  Anytime I need some Korean comfort food I will definitely head down to BAP.  It is a little hard to come from afar though because they have very limited seating!  Great for takeout though."
    },
    {
        "id": 48,
        "text": "Awesome little place, they do a great job focusing on a few classic items. The kimchi was some of the best I've had in CC, service was fast and friendly and the portions were satisfying. Great stuff!"
    },
    {
        "id": 49,
        "text": "Really good service, amazing food with fresh and yummy ingredients, and fast delivery. I love the mushrooms in the bimbibap, and the numerous variety of veggies. Cheap, friendly, and awesome, I love this place!"
    },
    {
        "id": 50,
        "text": "A small, mom and pop type restaurant, this is primarily a takeout place, but it has a few small tables where you can sit and enjoy a meal.\nThe menu is quite simple - bimibap made with your choice of beef, chicken, tofu, etc. Ordered the beef and was not disappointed! The dish was prepared quickly - fresh ingredients, great taste. Don't miss out on the vegetable pancakes while you're there."
    },
    {
        "id": 51,
        "text": "Fresh ingredients, lean meat, good size portion, great service, super nice owners...ideal bibimbap aka beefinbop aka bimbimbap"
    },
    {
        "id": 52,
        "text": "Awesome food for excellent price , authentic Korean. Only wish that there was more sauce in the bowl. Will be coming back for sure!!"
    },
    {
        "id": 53,
        "text": "This was a great little spot to get bibimbap. It was fast fresh and very friendly. No nonsense. you go in you order the people are very nice, you get your food and all is good. The food is very very fresh, there is just enough chili sauce, and it is a good amount of food. I would greatly recommend trying this place out for sure."
    },
    {
        "id": 54,
        "text": "Yummy! Short and sweet menu, which I actually love. It's basically a \"pick your protein\" kinda deal. Quick service. It's just one store front wide and not very deep... there are 12 seats in the joint. So don't bring the whole family. But for you and a friend or two... this is perfect. I had the special, which was a rice noodle dish, but the standard order is a rice bowl. Nice little, straightforward joint."
    },
    {
        "id": 55,
        "text": "Truly an awesome little place. I've only done take out and delivery, but I love it. It's my go-to spot. Try to come like once a week now. Super fast, fresh and tasty. It has that comforting Asian flavor and texture without being oily and leaving you feeling gross like some other Asian food (mostly Chinese...). Everyone should definitely give it a try. My only recommendation would be for them to start offering brown rice. Otherwise it's perfect."
    },
    {
        "id": 56,
        "text": "TALK ABOUT A HIDDEN GEM! I can't believe I didn't discover it sooner, but I'm glad I found it when I did! This place is literally the best, most authentic korean food I've had thus far in philadelphia. They offer only a limited menu of bibimbap (with various proteins), pajeon (scallion pancake), and yuk gae jang (beef stew), but they do it right! I think it's advertised as a take-out joint, but the actual restaurant is a hole in a wall spot on south st that seats about 8-10 people, max. I saw the glowing reviews and though skeptical, decided to bike down here with a friend for dinner and was not disappointed. The pajeon was smaller than I imagined, but delicious and surprisingly filling - certainly enough to hold you over until the main dish. I love traditional bibimbap, and BAP does it SO SO well. I always get the classic marinated beef as my protein, and this particular version comes with soybean, carrots, cucumbers, mushroom, cabbage, a gooey egg, and broccoli! I would HIGHLY recommend paying the extra dollar for the dolsot option to get that crunchy rice on the bottom for more flavor! Love this place and will definitely be back whenever I need my korean food fix! Maybe I'll try the yuk gae jang next time!\n\nTIP: bring cash if you can!"
    },
    {
        "id": 57,
        "text": "Although I read yelp reviews often, I've been holding out on writing any of my own. I finally made an account today just so I can give this place a 5-star rating. The friendly owner and tasty food warmed my cold, cynical heart today. \n\nMy friend and I ordered the Korean savory pancake and the vegetable bimbimbap. The vegetables were fresh and crispy, and the ingredients and flavors were well-balanced. Great little spot for a quick, casual bite to eat. \n\nWhat makes this place 5-star worthy was the owner, who was unbelievably accommodating, generous, and friendly. The place has a neighborhood feel that makes it a very welcome addition on South Street. I'll definitely be back!"
    },
    {
        "id": 58,
        "text": "Delicious and authentic! I paid the dollar extra for the stone bowl, and it was worth it: bibimbap almost like I had in Seoul. Only 3 differences: (1) It was larger than the portions I had in Korea, (2) The egg was cooked, not runny or raw, and (3) I had to ask for the (hot) sauce. The homemade tea was good too. The place itself is tiny, and the owner incredibly nice. I would return in a heartbeat."
    },
    {
        "id": 59,
        "text": "Owner is very friendly, food is great and is made quick. I'm a regular here and love this place. Highly recommend for quick good food."
    },
    {
        "id": 60,
        "text": "Excellent place to eat\nOne the thing that I love about this place is that services was on point . \n\nThe menu is small but it is just right , how time do you go some places new and just stare at the menu and get what you normally get everywhere . You see what you and order and it comes out right away.\nLove it will be back later in the week"
    },
    {
        "id": 61,
        "text": "This is now my favorite place. Third trip since it opened in early December and it's turning into a habit. Healthy, flavorful, food is $5 a bowl and does a decent job filling you up.  For the ravenous, bring a friend and split 3 between you.  Probably the best quality food for the buck in the city."
    },
    {
        "id": 62,
        "text": "Friendly chef owner, good food, very fair prices, this is now one of my go-to places. I highly recommend it!"
    },
    {
        "id": 63,
        "text": "Being Korean, I love traditional bibimbap, and BAP does it SO SO well. I LOVE the marinated beef and this version comes with a ton of veggies: broccoli. carrots, mushroom, cabbage, an egg of course, and soybeans! I would highly suggest paying an extra buck for that crunchy rice on the bottom! Prices are super cheap and the quality is amazing, food delicious and healthful! Love this place and will definitely be in my Korean food fix rotation."
    },
    {
        "id": 64,
        "text": "Delicious food! The dolsot is excellent and came out sizzling hot. Great for a cold winter's day. Very spicy. Egg was made to perfection! Great place for folks with lactose intolerance/dairy allergies."
    },
    {
        "id": 65,
        "text": "Order delivered was incorrect. I ordered 2 beef but the one that is delivered is beef and the other one was a noodle with rice. And I am not a fan of noodle and rice in a meal.They changed the order without informing me"
    },
    {
        "id": 66,
        "text": "Their bibimbap and their sides were awesome. They had seasonal kimchi - cucumber kimchi to be exact! It was deliciouss just like the cucumber kimchi I had in Korea. Their pajeong (scallion pancake) was also REALLY good albeit a bit different from the ones in Korea. I like this place a lot. Simple interior, set menu, good stuff."
    },
    {
        "id": 67,
        "text": "I absolutely love this place! The menu is pretty short, sweet, and straight to the point. My boyfriend and I usually order the chicken and beef bibimbap along with a side of kimchi. It's both delicious and inexpensive, I'm surprised that this place isn't packed every time I visit. The owner/chef is a wonderful, talented and kind soul. Give this man your money!"
    },
    {
        "id": 68,
        "text": "Just stopped here after walking past it for the past month. The tofu bibimbap is seriously so good and comforting. The owner is so nice and gracious and made it hot style for us since it was snowing. I can't even explain how good the cinnamon and ginger tea is! I will definitely back there very very soon!"
    },
    {
        "id": 69,
        "text": "I'm SO glad this opened up in my neighborhood! It's a tasty option for those of you missing your korean comfort food. I just hope they start offering a full korean menu! As a SF korean transplant, I miss my mom's cooking and it's so nice to have this nearby. nice so I don't have to go up to North Philly if I don't feel like making the trek."
    },
    {
        "id": 70,
        "text": "BAP has a delicious meal for anyone on looking for lunch/dinner on South Street. This small shop makes a mean bibimbap, fresh Korean style vegetables and meat over rice, sweet/spicy gochujang sauce topped with a fried egg. I always get the \"dolsot\" style bibimbap, served in a fired up stone bowl which adds another dimension of heat and flavor. Especially if you've never tried Korean food, this is a good place to start. The owner is friendly, and glad they offer order online for when I'm on the go."
    },
    {
        "id": 71,
        "text": "Excellent place to get a cheap authentic bibimbap dish on South Street. You can tell the owner really cares about and stands by his product. My food was ready quickly and delicious. it is a small place, but cozy and well decorated. Good for a quick lunch or dinner. Will definitely be back soon."
    },
    {
        "id": 72,
        "text": "Note: I did takeout (Ubereats). Ordered the beef bowl, but the beef was disappointingly under-marinated - have definitely had better. Also paid an extra $1 for the dolsot (stone pot) style, which produces some crispy rice on the parts of the dish that are supposed to rest in a hot stone bowl for awhile. However, none of that was present in my order either. \n\nVegetable pancake was also pretty bland. Total came out to nearly ~$20 just for this lunch w/o delivery costs. Could definitely use some improvements."
    },
    {
        "id": 73,
        "text": "It isn't easy to find Korean in CC, and the options are so few that we haven't had any bibimbap in....wow, can't even remember! So when I noticed BAP's signage while walking home after grocery shopping, I made a mental note to try them asap since their opening special of $5 bibimbap is awesome!\n\nYou can't beat a cheap meal, and especially one that's prepared with obviously fresh vegetables! My husband picked up our dinner right before I got off from work, but it's so cold outside we had to reheat them - thankfully the microwave didn't ruin anything. He got the beef and I opted just for the vegetables, both of which came with an egg. The variety of veggies is great, but most importantly they are clearly fresh, not frozen or canned, and it makes a huge difference with bibimbap. The sauces were good, but I felt like the veggie one lacked a little bit on flavors. Spicy level was minimal when you mixed everything together, so I ended up adding more for myself. We will certainly be back for more yummy, healthy, and quick takeout from this super cute spot!"
    },
    {
        "id": 74,
        "text": "I love this family run Korean restaurant. Super cozy and low key, affordable healthy eats.  Chicken rice bowl was delicious, with sautéed vegetables on the side, a gooey egg, some spiciness.  One of my favorite \"off-the-beaten-path\" Philly food treasures!"
    },
    {
        "id": 75,
        "text": "I am at peace; the food has a calming effect at the end of the day. Loved it thoroughly."
    },
    {
        "id": 76,
        "text": "It was my first time eating Korean in the States. I went here based on all the great reviews about this place. they are correct, I hidden gem in downtown Philly. The food is fresh and very good. Your best option is to go as there are only 8 chairs for sit down meals. Great place nice, friendly couple run this restaurant. Even the simple interior has something special. Loved the chairs. I will be back"
    },
    {
        "id": 77,
        "text": "Super fast, fresh, friendly service, and most importantly, tasty!!  A real hidden gem.  I'm definitely coming back."
    },
    {
        "id": 78,
        "text": "Oh my! Simple, to the point, what more do you need? Just bibimbap and that's it! Delicious and definitely Korean style. Had the real stuff in Seoul and it's pretty spot on(make sure to get the stone pot)"
    },
    {
        "id": 79,
        "text": "This place serves only a few options of very simple Korean fare, so that's great for folks like me who encounter decision paralysis. They offer bibimbap (well flavored, slightly spicy rice dish with julienned veggies) with your optional protein (chicken, beef, tofu). They also have like two sides and a special. Easy. I ordered the special which was jap chae and my bf ordered the beef bibimbap. Both were solid and filling but nothing mind blowing. But considering the value and that Bap doesn't face much competition in Center City Korean cuisine, I'd definitely return."
    },
    {
        "id": 80,
        "text": "This place is incredibly good, inexpensive, and has great customer service. I'll be a frequent customer!"
    },
    {
        "id": 81,
        "text": "One of my favorite spots for a quick meal. 4 different bowls to choose from along with a few other options. I usually go with the chicken or beef bowl and it's always delicious! Fresh ingredients and perfect portion size for a reasonable price. Service is always fast and friendly. I usually eat in but I know they do a lot of take out. Definitely check it out! :)"
    },
    {
        "id": 82,
        "text": "Outstanding meal with an amazing owner caring over you. The Hot Stone Bitmaps were delicious and the Japche was a great addition. Small dining room but very cozy and great price for dinner. We will be back often."
    },
    {
        "id": 83,
        "text": "I live around the corner from this place it is my go to spot when I want something quick, healthy, and delicious.\n\nMy girlfriend loves their kimchi. Almost as much as she loves my kimchi. You know what I mean? ;-)"
    },
    {
        "id": 84,
        "text": "good price and good food. I hope you would come to eat bibimbap. Nice place to eat inside and take the food out either."
    },
    {
        "id": 85,
        "text": "This place was amazing! The owner makes his own kimchi and spikes his soy sauce with magic. It was so delicious. We had the beef bow,  three bowls of kimchi (it was that good!) and the vegetable pancake. Super nice owner. Will definitely come back."
    },
    {
        "id": 86,
        "text": "I keep coming back again and again on my lunch break, alone and with coworkers. \n\nIt's a tiny little spot and it seems to just be a husband and wife behind the scenes, but the bibimbap bowls they churn out are perfection.  Have fun mixing together the elegantly arranged bowl they place in front of you and enjoy the spicy, gooey, flavorful bowl of comfort food."
    },
    {
        "id": 87,
        "text": "Simply the best, most convenient authentic korean bap.  Getting that quality and that quantity, when ordering was as easy as ordering a coffee (only faster), really blows me away.  I'm addicted!"
    },
    {
        "id": 88,
        "text": "This is another one of my absolute favorite spots in the city. This is genuine Korean food with an old world flare. I felt like I was in a Korean household being served food straight from the family pot. The service was fantastic, and the older couple serving the food to me seemed to own the place. They were humble and so sweet, and took the time to talk to me when I asked them about their decorations (all handmade by them). The service was incredibly on point and quick, and because this adorable place only could host a few people at a time, there was a fantastic little atmosphere about us as we ate! Thank you!"
    },
    {
        "id": 89,
        "text": "Phenomenal food, I cannot believe how much I fell in love with such a small, hole-in-the-wall place. The food is such authentic Korean, and yes - the menu is limited - but that's what makes it awesome. They know what they do (REALLY) well, and that's what they sell.  I got the chicken bibimbap and my husband got the beef version. The flavor, freshness and quality was AMAZING. And I disagree with the other reviewer about portion size - our bowls came with a ton of rice and veggies - enough that I couldn't finish it all and regretfully had to leave some behind. This place is honestly one of my favorite places I've ever eaten, and I definitely plan to come back."
    },
    {
        "id": 90,
        "text": "For those of you that don't know what bibimbap is: It's a Korean dish composed of seasoned vegetables and Korean marinated meat (or tofu) over a bed of rice. Then you mix it all up with gochujang (Korean chili pepper paste) and enjoy!\n\nNow my reivew: Sometimes I'm just jonesing for some Korean food and this place always hits the spot. The owner is very nice and always accommodating. They have decent sized portions and the vegetables are always fresh and well seasoned. Definitely one of my go tos when I want bibimbap. It's also extremely quick and healthy so I never feel guilty after eating here. Everyone should give this place a try!"
    },
    {
        "id": 91,
        "text": "This place is cute and unassuming. Stop in if you're hungry for a humble and affordable Korean meal. You can't really argue with a large bowl of veggies, rice, and your choice of meat topped with a fried egg for only $8.\n\nI mixed my bowl around to coat everything in the hot chili sauce (be careful if you're not used to it!) and had a great time.\n\nOrder their cold cinnamon tea to quell the fire in your mouth or to just have a tasty accompaniment to the meal. \n\nI came here starving and in need of an energy boost and left happy."
    },
    {
        "id": 92,
        "text": "BAP is a cute little hole in the wall place that I wouldn't have known about if I hadn't stumbled by it while hungry at 4pm. Service was quick, since I was the only one there, and the prices are pretty low, but I was disappointed to receive the smallest portion of bibim bap I've ever had. Despite the fact that the beef bibim bap costs $2 more than the vegetable version, there was very little meat in the dish. The food was ok, but I prefer Giwa, and it didn't come with any sides. The rice also comes pre-coated in spicy sauce, which I didn't mind but may be a problem for people who prefer their food totally mild or want to customize the spice level. Altogether a perfectly fine Korean joint, but next time I'll probably walk the extra few blocks to go to Giwa."
    },
    {
        "id": 93,
        "text": "Pricey for the measly portions you get (~$9 for a bibimbap bowl). We ordered takeout and there was barely any rice let alone vegetables. It was a sad little bowl with limp veggies and a clump of rice the size of a petite woman's fist. For the record, yes, I have actually measured the sizes of various petite women's fists and come up with a credible, scientific average. \n\nAll wisecracking aside, If you're searching for a filling meal, then do not order takeout here. Maybe the sit-in offers a more satiating, abundant experience. Unfortunately, I was sorely let down by the scant delivery of this joint."
    },
    {
        "id": 94,
        "text": "i was very much looking forward to a korean place closeby and i love super simple menus - i was also happy that the chinese takeout that always got orders wrong was replaced\n\ni have had both the beef and the chicken to go\n\ni would say that the sauce is nice and punchy but i wish there were a little more of it and that it had a good dose of sesame oil and at least the beef version should have a sprinkling of sesame seeds on top\n\nboth the beef and chicken could have been more seasoned and i wish there was a small side of kimchi\n\nbut given that the veggie portion (which is actually more important than the meat in a dish like this) was quite extensive and done well, i would definitely suggest this for vegetarian friends (veggie or tofu)\n\nthe old man is super friendly and fast, give them a try, i hope they last\n\ncash only"
    },
    {
        "id": 95,
        "text": "I love this place. U get a nice meal (I always take away) that feelsssss good after u eat! Fresh and clean and healthy (I get chicken or tofu/brown rice bimibap). The owners are so nice. One day about a year ago my baby was small and I walked there hungry but forgot my wallet (postpartum brain). The man didn't know me from a can of paint, but entrusted that I would return to pay when I could! So I went home with a warm meal, warm baby and returned like a week later to pay up. Delicious, reliable, cheap and healthy! ThAnk u BAP"
    },
    {
        "id": 96,
        "text": "It was so good ~~ also he is kind...explain ...i order chicken bibimbap and soup which is so good not spicy though..i order to go pancake and japchae ..it is so good to eat for one person ...cuz some place are big dish I can't eat myself ..this place is so great"
    },
    {
        "id": 97,
        "text": "So we found this place via Yelp. (Thanks)\nIt didn't disappoint. \n\nIt's a \"one man\" kitchen cooking authentic bibimbap with a few sides. Not a big menu but makes it easy to decide. \n\nThe ginger cinnamon tea is good, but beware. If you don't like cinnamon you won't like this. It has a really strong flavor.  \n\nThe beef stone pot bibimbap was hot all the way to the end. Super tasty. Very filling. You may not want to share! It's that good. \n\nSmall dining area. Seats 12. \n\nFinal thoughts. Give them a shot."
    },
    {
        "id": 98,
        "text": "Very comforting homecooked flavor. Liked it so much my first time I brought a friend, and now she loves it too. Don't put too much red sauce if you're not a fan of heat, though...."
    },
    {
        "id": 99,
        "text": "Amazing. What more do you need in a restaurant than good bap and homemade kimchi? What more do you need in life? Yes, the menu is small, but the place is called BAP for a reason. Sheesh. I'm confident that there's something to please every palate and with rice being naturally gluten-free, those with Celiac's or a general fear of grainy goodness will find something to enjoy.\n\nDefinitely cozy with seating for perhaps 12, but the atmosphere and decor are nice (not sterile or uncomfortable like a cheap Americanized Chinese restaurant. Yes, I realize that this is a Korean restaurant, but did you know that bright fluorescent lights are traditional in some parts of Korea?). I never felt cramped and this ended up being a lovely date spot. Just be ready for the very present but enjoyable heat of the kimchi or you'll embarrass yourself. \n\nHot tip: try the homemade cinnamon tea."
    },
    {
        "id": 100,
        "text": "Delicious, clean, comfortable and fast. The menu has like 10 things on it. I think they're all gluten-free."
    },
    {
        "id": 101,
        "text": "Solid meal - but definitely pricey for the proportions. For a little less than 10 dollars, you get a classic bibimbap meal - but I was ravenous and got a portion that was much smaller than I was expecting. The food was good - fresh vegetables, tender meat, and perfectly cooked rice. Expect to pay more for less here though."
    },
    {
        "id": 102,
        "text": "Great food. Simple service - great owners and staff. Super cozy. Dont expect anything fancy. My boyfriend and I order take out there and the manager is always so friendly. I highly recommend this place!"
    },
    {
        "id": 103,
        "text": "The bibimbap is delicious whether it's chicken or tofu. The mix of veggies, spicy sauce, protein, and rice is interesting and refreshing without being overly filling. Worth stopping by if on South Street."
    },
    {
        "id": 104,
        "text": "I LOVE this place! A co worker of mine told me about this place and I can't seem to stop eating here. It's a cute small place, don't let that fool you! The husband and wife who run this place are so sweet and make the best food! I usually get the veggie with egg and it's delicious! If you get a chance to come here, please do! It is worth your time!"
    },
    {
        "id": 105,
        "text": "This is a cute, small Korean place in Philly. I got the beef dolsot bibimbap. Everything came mixed together and the food came out very fast even though they make it on the spot. My boyfriend told me it's traditional for it to be served in a stone bowl, although I'm not really sure why they charge a dollar extra for it, but as long as the food still tastes good, I'm okay with it. Be careful if you do decide to go with the bowl because it is hot when they first serve it, so make sure you don't touch the bowl itself! It was my first time trying bibimbap and I was not left disappointed. I would definitely come here again if I'm craving Korean food in Philly because there doesn't seem to be many Korean places down there that I know of."
    },
    {
        "id": 106,
        "text": "Best Bimbimbap I've had since living in Korea. Great atmosphere; authentic vibe. Excellent Korean pancakes!"
    },
    {
        "id": 107,
        "text": "Charming little shop w/ limited menu but delicious food. Seats about 8; so mostly take- out.\n\nWhy only3 stars? My beef bibimbap was very good, but was lacking the red cabbage & broccoli as pictured. Also for $8.95+ tax(the most expensive thing)I expected a bigger portion. It was satisfying taste wise, but didn't really fill me up.\nPerhaps I'm spoiled living in an area where there are a lot of Korean restaurants. I can get a bulgogi lunch box for $5.99(no tax) @Maat Zip; although the beef @ Bap is much better.\n\nDefinitely worth trying, but personally I can't see becoming a regular. Would try it again."
    },
    {
        "id": 108,
        "text": "My wife and I had an awesome dinner at BAP last night. Definetly one of our favorite take out places in the neighborhood."
    },
    {
        "id": 109,
        "text": "I lived in Korea and always have high expectations when it comes to Korean food. This place is perfect for a quick lunch/dinner on the go and the bibimbap is good. The price is a bit high considering the atmosphere and location but this is still my go-to spot for a Korean in Philly. Been here twice and always had beef bibimbap in a hot pot. I would recommend this place!"
    },
    {
        "id": 110,
        "text": "Greatest place ever! I get the dolsot bibimbop. It is delicious, sizzling, spicy, tender goodness. Coupled with the Korean Spicy paste makes it even better.\n\nFrances, the owner, is a super nice, hardworking guy. I really like him. He even brought over some sample pickled radish for me to try - it was delicious.\n\nDefinitely support this great, delicious place!!"
    },
    {
        "id": 111,
        "text": "Had this twice now since the opening at the start of December.  Great for quick takeout, but also has about six seats inside.  Very comfortable atmosphere and friendly, professional service.  Time from order to ready to take out is about 5-7 minutes and at $5 each, the price is really fantastic.\n\nI've had both chicken and beef so far (both were outstanding).  My girlfriend is a vegan and loved the tofu with no egg.  The tofu is grilled and seasoned very well.  The veggies and and sauces make each dish really hard to slow down on when consuming.  Spice level might be a bit high for some without any tolerance for flavor, but then why are you eating food to begin with?"
    },
    {
        "id": 112,
        "text": "I've been told I have nice BAPs. I have no idea what that means.\n\nBooty And Pecs?\nBum And Posture?\nB*lls And P**is?\n\nWho knows.\n\nBut anyway. This is the only Korean food I've had in Philly and I liked it. A lot. Especially the price.\n\nI ordered Yuk Gae Jang as I always do.\n\nThis YGJ was nothing like anything else I've had - in fact idk if it was even YGJ to be honest lol - but at this price who is complaining. Five dollars or so. It was just like really delicious beef soup and I pretty much finished the whole thing despite not being that hungry. Lovely service too.\n\nSpeaking of lovely service, want to check out my BAPs?"
    },
    {
        "id": 113,
        "text": "I agree with all of the positive reviews! This is a take-out Korean place, conveniently located, that serves perfectly good Bibimbap at low prices. I finally don't have to spend an hour and a half or more going to Giwa or up to like Elkins park when I crave Korean. If you know what I'm talking about, this is the place for you! \n\nYour food will be prepared by a very nice man who will have it served in a matter of minutes. I've had chicken, vegetable and tofu, they've all been good. The egg has been nicely fried.\n\nIt is very bare bones but that's actually nice, because you get wooden chopsticks instead of the difficult-to-use metal ones found at most sit-down Korean places, so that's fine with me."
    },
    {
        "id": 114,
        "text": "There's a lot to like about this tiny Korean kitchen on South Street. The simple menu, fair prices, and the fact that there just aren't a whole lot of Korean spots in South Philly. \n\nI really want to give BAP four stars but I can't just yet. I love bibimbap and the beef bibimbap here was alright. The beef was good, flavorful and tender. I've never seen broccoli in bibimbap before, which was fine. I just wish the portions were a little bigger; I was still hungry afterwards. And I think more veggies would've made it better. I'd like to come back to try the japchae and I would give the bibimbap another chance."
    },
    {
        "id": 115,
        "text": "I had a delicious chicken bibimbap and sat here for an hour enjoying a Yeti Imperial Stout (purchased at Food and Friends at Spruce and 20th) with it. This place deserves to be WAY more popular. It is Tuesday night and there have only been two other customers. This is the genuine article and the owner is super nice - I just can't believe I am here by myself!  Next time I will bring a friend even if I have to drag one off the street!  The spice was just right, the serving size was just right, and the stone bowl kept everything warm to the end."
    },
    {
        "id": 116,
        "text": "Great to-go spot. Very reasonable and friendly service. \n\nThe veggie bowl is balanced and delicious. I would highly recommend this place!"
    },
    {
        "id": 117,
        "text": "Small, clean, mom&pop run joint. The tiny restaurant can seat maybe 10 people, so they cater toward takeout. Food comes out quickly. FYI - closed on Sundays.\n\nTheir regular bibimbap is $7.95 to $9.95 (veggie v. meats). If you want it in a hot stone pot (dolsot bibimbap), its $1 extra. Perks of dolsot - the stone pot crisps up the bottom of the rice which adds a great texture. However, the hot stone pot cooled quickly and I didn't feel like I got enough of a crisp on my rice. Of note, it comes pre-mixed with the sauce, which I wasn't expecting. Meanwhile, if you order the regular it does not come pre-mixed so the vegetables/meat are separated and you can decide how much hot sauce you want to mix in. For this reason, I'd probably get the regular next time.\n\nMy boyfriend and I ordered the chicken dolsot bibimbap and the vegetable dolsot bibimbap. Not the best bibimbap I've ever had. Since it came pre-mixed, it's very similar to spicy fried rice, especially since I didn't get enough crispy rice. They all come topped with an over-easy egg, the yolk of which makes a great sauce. For $9.95 and $10.95 it was a bit pricey, since the portions are not very large. We also ordered the seafood pancake, which was delicious, but again a bit pricey since it didn't taste like it was made from scratch.\n\nOverall, lovely little spot. My boyfriend and I enjoyed it for a quick weekday lunch date, but I don't think I'd go out of my way again to return."
    },
    {
        "id": 118,
        "text": "Delicious food! Only wish that the portions were slightly larger and that there was more meat in the bibimbaps. Would go again."
    },
    {
        "id": 119,
        "text": "I lived right around the corner and you can't imagine how excited I was to have a place like BAP pop up! I went here every week and was never disappointed. Great prices and great food. Lots of variety and on point consistency. He kept it simple and does simple really well. Keep on, Boss man! I moved to Raleigh and came back to Philly just to take a bite out of that good ole nostalgia."
    },
    {
        "id": 120,
        "text": "Korean food at its best. Great food. They have very less options but they have mastered the ones that they have. We have BiBimbap Dolshot chicken and the beaf soup and the cardamom tea. The bibimbap is awesome. The soup is also nice. They had a small cozy ambience with light music playing. They cook and serve themselves, they are really friendly people. The last thing is all of these comes with very little pinch on the pocket - the food is pretty much reasonably priced. A must try for all if you are in South street."
    },
    {
        "id": 121,
        "text": "I shouldn't write this.\n\nI should be selfish and keep this little cookery & it's kind owner all to myself.\n\nBut that would be unfair to him, and I suppose you eating reading humans.\n\nGet it while you can though.  This guy cooks as if for his own family.  He is so happy to have you try his food.  Best Beef soup & BimiBap & Korean tea I've ever had.   \n\nAs in life, esp new food joints, all good things come to an end, enjoy while you can."
    },
    {
        "id": 122,
        "text": "Are you one of those people who have a hard time deciding what to order? If you're new to Korean food and want to get a staple - Bap is the place for you. No more flipping through the endless menu debating on three different things. Bap has one main entrée - bibimbap. You can choose your protein or simply just veg it out. We ordered the chicken and beef bibimbap. The owner was very nice, the food came out quickly, and the seating area was well maintained. \nWhile I enjoyed my meal, it wasn't outstanding. The veggies and beef were just okay. Unfortunately, I think they were overpowered by the sauce - which was a notch spicier than I wanted. I also think that $9 for beef bibimbap is a little high for the amount of food I received. Overall, I would say give them a shot if you're in the area."
    },
    {
        "id": 123,
        "text": "Gamsa Hamnida!\n\nThis tiny place serves up a mean bibimbap - so tasty! Just the right ratios of foods in the bowl, it was the perfect stop right after the bus ride in from NY. Great value, too.\n\nI would have liked my bibimbap a little hotter though - we were the last customers but it would have been nice to throw it in the pan one more time to make sure its piping."
    },
    {
        "id": 124,
        "text": "This is a great, low frills bibimbap spot w a few focused additional offerings. \n\nTheir prices are on point, while the meat is cooked to order and their veggies are marinated / cooked rather than salad like, like at other fast food Korean spots in center city.  Additionally, eggs are perfectly runny to aid in mixing and gelling of all the ingredients in the bowl. \n\nTip - if you're afraid of heat, ask for the sauce on the side."
    },
    {
        "id": 125,
        "text": "I noticed this spot a while ago because I love bibimbap and finally had a chance to try it out. I asked the person taking my order which was more popular, beef or chicken...he said chicken so I ordered that to go. He was done making the food in about five minutes which was impressive. There was a variety of fresh, cooked veggies (broccoli, carrots, cabbage, mushrooms, cucumbers and probably some others I'm forgetting like assorted greens),  the spicy red, Korean Gochujang sauce, a fried egg, chicken and sticky white rice (I love that kind of rice!). I thought the chicken could have had a bit more flavor but enjoyed the veggies accompanying it although I wish there were more of them. I want to try the beef next time!"
    },
    {
        "id": 126,
        "text": "Super cute little hole in the wall! It can only seat a handful of people but it's super worth it. I ate there when only the husband of the owner duo was working. It's inspiring seeing how hard working he was. He ran the whole thing---granted there were only 5 customers including my boyfriend and me----but was still super attentive and kind. \n\nI ordered the beef bibimbap. It was very delicious and looked gorgeous. The portion could have been slightly bigger, but then it would have given you the super stuffed feeling. It was the right portion size. It's pretty decent priced. I also had the ginger cinnamon tea which came in a nice home-y mug, and it was warm-in-my-belly nice. If you're looking for a decent Korean place and want to support small businesses with hardworkers, give BAP a try."
    },
    {
        "id": 127,
        "text": "Myself and a friend had no idea what to expect coming here as the menu doesn't give away too much. However, we chose our meat, hoped for the best and weren't disappointed.\nTo be honest, I had no clue what half of the stuff in the bowl was... but it was delicious.\nGreat service too by the sweet old man who owns it and runs the shop. Would recommend it if you wanna try something new!"
    },
    {
        "id": 128,
        "text": "Got the beef bibim bap as take out, just as described by others. A great refreshing (and relatively cheap) lunch! Bean sprouts, julienned carrots, marinated/pickled? spinach (or something like it), broccoli, and other veggies with a sunny side up egg on top! lots of rice too. hot sauce mercifully put in the corner (you can ask for it on the side). Beef very flavorful and tender. Definitely would come back here again!"
    },
    {
        "id": 129,
        "text": "It's one of the limited options in center city to get bibimbap but rather leaves me disappointed. I live really close by and really what to love this place but I don't. I don't go often anymore. \n\nThe food is slightly above average. Portion is on the smaller side for the price you pay. The upside is that the service is always friendly and quick. It's a family owned hole in the wall type of place. Mostly time I was the only one there when I showed up and the owners would cook the food right there, mostly just mixing up the pre-made ingredients. \n\nMostly a takeout place. They only have two or three tables. Not much space to sit."
    },
    {
        "id": 130,
        "text": "I walked by this place a few weeks back and I knew I needed to try it. I love me some Bibimbap and this place did not disappoint! I definitely found a new goto take out place.\n\nEverything - from the beef, to the veggies, to the fried egg on top - was well-seasoned and fresh. The veggies (cucumbers, broccoli and carrots) were definitely not frozen because they still a nice crispness to them. My only complaint is that they could have added some more meat; but then again, I am a die-hard carnivore!"
    },
    {
        "id": 131,
        "text": "This is a Great lunch spot. They focus on Bim Bim Bap and do it very well. It's an intimate space, You will probably end up speaking with the owner, chefs, fellow luncheon-ers."
    },
    {
        "id": 132,
        "text": "Unassuming and quiet. Only a handful of menu items, but they're all perfectly executed.\n\nThis bibimbap is the perfect food to get if you want to feel healthy but still taste something amazing. \n\nI really like the reserved atmosphere of their tiny restaurant."
    },
    {
        "id": 133,
        "text": "You could easily miss this place but I was looking for Asian cuisine and this looked promising, judging by the pictures. It's basically a hole in the wall with understated décor of flowers and plants. The older gentleman who works alone in the kitchen greeted me and took my order. He was very kind. I ordered the vegetable bibimbap and it was surprisingly delicious. Everything tasted fresh and I liked the ingredients he used. I'm so glad I found a Korean restaurant in center city because let's be honest, the choices are slim. The prices here are reasonable considering you're in the city. Definitely coming back here and I highly recommend for anyone who's craving Korean in a casual spot. Tables are limited though, but if you live in the city you can always get take-out!"
    },
    {
        "id": 134,
        "text": "Fantastic Korean Bibimbap just around the corner from my office. I have no idea how I've never been here before, and I'm glad I finally stopped by because the food was fantastic. I got my beef bowl to go, and not only did it come out super quickly, but I got to watch the owner put everything together and it's all fresh! \n\nThe food was to die for! If you like Korean and I'll definitely be getting lunch here again, I actually might get it again today! getting hungry as I write this. I also tried their house made Ginger Cinnamon tea. It was good, and not extremely flavor packed, yet still very enjoyable."
    },
    {
        "id": 135,
        "text": "Stay clear! I got the chicken and it was grey!! Veggies were soggy the egg was too runny.  I got it to go so didn't realize until I got home and I don't live close by.  When I bit into it the chicken tasted old and made my stomach turn and the veggies tasted like they were drowned in butter.  Waste of money!!"
    },
    {
        "id": 136,
        "text": "Well priced, and perfectly portioned, this is a Bibimbap spot you don't want to miss. The aluminum bowls are the perfect size and shape too. I highly recommend this hole-in-the-wall spot."
    },
    {
        "id": 137,
        "text": "This place is fantastic. While we waited for our food, it was clear looking around they take great pride and joy in their establishment. We got the beef bibimbap in a stone bowl. It was humbly presented to the table still sizzling. The kimchi is complex, spicy and sweet and we poured the whole thing in the bowl. Shrimp Pancake was also om nom nom gone, much like a latke with shrimp embedded within. The house ginger cinnamon tea was also a delight, unsweetened, a little spicy, crisp and refreshing. Will be back first chance we get!"
    },
    {
        "id": 138,
        "text": "Bap is run by a very friendly elderly couple that, coupled with the cozy decor, really make it feel like we're in someone's home.\n\nThe wood floors and tables are a dark wood and the warm lighting is dim. There's no music playing and it's often empty. In sum, this makes for a great place on a cold winter day to grab hot soup or dolsot bibimbap.\n\nPrices are reasonable and you'll see from my photos that I got a filling dolsot tofu bibimbap and traditional ginger cinnamon tea.\n\nI'd come back again for a casual meal and suggest you do the same."
    },
    {
        "id": 139,
        "text": "3.5\n\nI am a japchae fiend.  I can eat gallons of that stuff if it's in front of me. I was excited that this popular and well-reviewed place was close to my office.  It's a tiny place, so they purposefully only offer a few signature dishes, all under $10.\n\nI finally had a chance to pop in and ordered the japchae with anticipation. I think it was just under $9, a bit pricy in my opinion for a vegetarian japchae with a small scoop of rice. It didn't have that much flavor, to be honest.\n\nFriendly gentleman who took my order, cooked and rang me up."
    },
    {
        "id": 140,
        "text": "Dolsot bibimbap, served up with everything mixed already.\n\nSo easy, sizzling, and delicious"
    },
    {
        "id": 141,
        "text": "Super simple mom & pop spot. Unassuming decor. Friendly greeting. Delicious food. \nTwo big thumbs up!"
    },
    {
        "id": 142,
        "text": "I wish I could just keep this place on the down-low, but since I also want the couple who own the restaurant to get the support they deserve. Having moved to a few blocks away from this spot, I finally got to visit the place more frequently.\n\nI always came here for the \"bulgogi bibimbap\", \"japchae\" and \"yukgaejang\", all of which are of amazing homemade quality and come out of the kitchen quite fast. Every time we finish our meal, the owner always asked if everything was okay, with utmost modesty, making us feel like we were actually having dinner at our grandparents'.\n\nThat being said, if you want to eat something homey, a quiet place run by kind people, this is your spot."
    },
    {
        "id": 143,
        "text": "Great authentic Korean food! This place deserves more business. The homemade ginger cinnamon tea is great as well (just not sweet)! Cheap too."
    },
    {
        "id": 144,
        "text": "Only been once, but because I'm new to the area I'm off to explore other establishments. The vibe of Bap, the name and the gentleman cooking were all perfect. It was just the end result of the food. It tasted like a dish I could reproduce at home. It lacked cohesion - one should not rely on the sauce to do this. It's as if an ingredient was missing, some old ancestry secret to make the dish perfect. If I lived on that block, sure it would be a local thing, but I don't - so Ciao Bello!"
    },
    {
        "id": 145,
        "text": "I tried this restaurant because of the Yelp reviews.  The manager/Owner was quite pleasant.  Unfortunately, the food wasn't.  I tried the Shrimp pancake that was just OK.  While the beef soup was bland.  I won't return."
    },
    {
        "id": 146,
        "text": "On one of the coldest evenings of the year, I found myself hungry and on South Street.  Fortunately I knew right where to head...the tiny Korean hole-in-the-wall called Bibimbap...or for short BAP.  Inside it was bright and warm and the friendly owner had Yukaejang - a spicy beef soup - cooking.  Of course I ordered it to warm up.  I then followed it with a tasty Dolsot Chicken Bibimbap with extra Gochujang sauce.  A cup of hot ginger/cinnamon tea completed the meal.  BAP is the kind of little café you can find on the back streets of Seoul or Pusan.  I'm glad we have it in Philadelphia!"
    },
    {
        "id": 147,
        "text": "Vegetarian Spicy tofu stew was delicious.  Kimchee as well.  I ate everything.  The cooks were so thoughtful, and it is very much like eating in someone's kitchen.  Realized there is likely fish sauce in the stew and also anchovy in the kimchi but I let it go."
    },
    {
        "id": 148,
        "text": "DELICIOUS! This is my absolute favorite neighborhood spot. The food never disappoints, and the owners are extremely kind and gracious. I highly highly  recommend!!"
    },
    {
        "id": 149,
        "text": "This amazing find on south street is worth a try. Small Korean eatery run by a husband and wife, with close to 7 menu items there not too many ways it can go wrong. The hot stone bowls are healthy and delicious. We tried the shrimp pancake and the japchae, also yummy. Portion size is slightly small but it makes up in the taste. Slightly expensive, but it's worth the taste. Do try this place next time you are in the mood for some good Korean bowls."
    },
    {
        "id": 150,
        "text": "Look, I don't leave reviews on Yelp, but my boyfriend is from a korean family and we've been on the hunt for the best korean food in philly for a while now. This place has our hearts. \n\nJust a married couple with a small menu, but flavors that pack a PUNCH. Some of the most authentic Korean food we've had in Philly and easily the cheapest too! \n\nGreat hospitality, great food. We're regulars."
    },
    {
        "id": 151,
        "text": "Sorry but we were very disappointed in this place. We came there off of a Yelp recommendation but found the food to like taste and the portions to be small. I've had better bulgogi and smaller cities. The place is small which we liked and the staff were friendly but the food did not seem fresh and was not desirable we both have to beef bulgogi."
    },
    {
        "id": 152,
        "text": "OOOO BAP. I love restaurants that only make 1 thing, but they make it right. Bibimbap is one of my favorite things in the world. With that said, you can choose a vegetarian, tofu, chicken, or beef version here. I like mine extra spicy, so I always get extra sauce on the side.\n\nSo why not 5 stars?\n\nMy wannabe Korean roots tell me that this should be served in a hot stone bowl if I am eating in ( FYI: only 6 seats in this establishment) . I love to here that sizzle of the rice cooking. However, cute old korean men cook it in a hot-stone in the kitchen and reassemble it in an alternative bowl. So, this was a disappointment. However, the flavors are all there.\n\nSometimes, they also have a beef bone soup for 5 dollars.  Don't forget to get some cinnamon ginger tea too!"
    },
    {
        "id": 153,
        "text": "3.5 stars (3 stars for food, 4 stars for price, service) \n\nBAP is a no frills traditional Korean food establishment that has been doing takeout this pandemic. The menu is just a few items long and largely consists of different types of bibimbap, all under $10. Ordering was really effortless -- I called ahead with my order for a vegetable and chicken bibimbap and it was ready within 15 minutes. Pickup was also easy and done at a window in the front of the store with a really nice elderly man who I assume is one of the owners. I was pleasantly surprised to find that they gave us free coffee packets which I have since used (I love me some Vietnamese iced coffee). \n\nThe food itself was okay. With the price point, the speed of service, and the no frills menu, I assume the bibimbap is meant to compete with other fast food options, and as a result it should be critiqued as such. Within this category of food, BAP provides a light, healthy, and balanced alternative, which I appreciated. However I think the portion size of the vegetable one was a little small and the flavor slightly bland. You'd do better with spending that extra dollar for additional tofu or meat. Overall, though, it was fine for a $9 bibimbap if you're looking for it. If I lived in the area I could see myself going back if I needed a quick healthy meal and wanted to support a small local business."
    },
    {
        "id": 154,
        "text": "Wonderful food and a great chef and owner.\n\nI eat here several times a week.\n\nYou cannot go wrong with the beff bowl."
    },
    {
        "id": 155,
        "text": "Got the chicken Bibimbap and it was delicious. Fresh veggies, nice sauce, perfectly fried egg. Was large enough that I was quite full by the time I was done and very tasty. It was also a very clean restaurant!"
    },
    {
        "id": 156,
        "text": "No frills, no non-sense...just simple good food.\n\nOrdered the tofu bowl. Came out really fast, all the ingredients seemed fresh and it was a good size portion. The sauce was the best part. It had a small kick so if you aren't a fan of a little spice ask for it on the side and if you like it a lot they have bottles on all the tables.\n\nOwner was extremely nice and I walked in with him and presumed wife cutting fresh vegetables in the kitchen which gave it a very genuine wholesome vibe."
    },
    {
        "id": 157,
        "text": "What a great little spot on South St. I never even knew this place existed! Their menu is simple (veggie, chicken, beef, tofu). Prices range from $7-$9 depending on the protein you choose.  I got a veggie bibimbap and it was delicious.  They give you plenty of rice and a whole assortment of veggies.  The fried egg is the star of course. The sauce is what makes the dish. It's spicy just the way i love it!"
    },
    {
        "id": 158,
        "text": "Asian food is my least favorite type of food, mostly because I require some sort of dairy product at almost every meal (preferably cheese). But I was in the mood for spicy Asian and this was DELICIOUS! I had the tofu bibimbap and the scallion pancake. The bibimbap was full of fresh, deliciously seasoned veggies and perfectly cooked tofu. The scallion pancake was hot, savory, and full of scallions, shredded carrots, and possibly some other vegetable. I couldn't eat meat this time, but I will definitely be back for the chicken bibimbap and the spicy beef soup. The man (possibly owner?) was so sweet and friendly. I loved it!"
    },
    {
        "id": 159,
        "text": "Bibimbap is located in a good traffic area. I was the only one there on a Friday at noon which I immediately was concerned about. The place seems to be owned and operated by a middle aged couple. I ordered the Beef Bibimbap and Shrimp pancake. The beef dish was nice and colorful and contained rice with beef, an undercooked egg and assorted fresh vegetables and pickled vegetables, it was good but I would say a bit pricey for the portion. I was served by the husband who was also the cook and the server. When I needed something I would walk over and gaze into the kitchen to get their attention. The shrimp pancake was their special for the day, so I ordered it and it was short of seasoning but a dipping sauce was provided so it made it a little better. It's a little spot that you would go to if every where else was busy and you could not wait. The service was quick, but the. again I was the only customer. I probably would not be back and rather travel to Hmart for more quality Korean food."
    },
    {
        "id": 160,
        "text": "This take out Korean place is lovely ! Delicious food, lovely service and good value. They have everyday special and I would highly recommend. It might not be the most beaustiful exterior or interior and small menu but the food is gorgeous and the service is perfect."
    },
    {
        "id": 161,
        "text": "Simple, delicious, authentic, healthy bibimbap. This is how bibimbap is made in Korean homes."
    },
    {
        "id": 162,
        "text": "This is a small, simple and cute hole-in-the-wall. The owners are nice and kind, you can tell the restaurant is run a family initiative. Food is great. Environment is (and feels) clean. If you are want to try something different without having to pay a lot in town (Philly is city full of Pizza corners, Cheesesteaks, and Chinese Food), come here. You won't regret it."
    },
    {
        "id": 163,
        "text": "I loved my bibimbap and it stayed hot the whole time, rice got nice and crispy in the bottom. The man working was very kind"
    },
    {
        "id": 164,
        "text": "Relly.. I was expecting better food. For $9.5, I got japchae that's not even a full box. Pretty flavorless comparing to the normal Korean food, and there's  absolutely no meat in it..... so disappointed.... maybe the bibimbap is better?? \nThey have limited seating and yes you can pay with credit card."
    },
    {
        "id": 165,
        "text": "Great, fresh bibimbap. The owner is incredibly friendly and kind. I will definitely be back soon!"
    },
    {
        "id": 166,
        "text": "Cute little hole in the wall on South Street, delicious and affordable albeit limited seating. Not to fret, there is the option for takeout and its just as good! Dare I say this is better than Hmart? For under 10 dollars I am not sure there is a better alternative for bibimbap in Philadelphia. Would definitely recommend!"
    },
    {
        "id": 167,
        "text": "Came across this place during our visit from NJ. We were craving korean food so why not? The place is a bit hidden with the rest of the stores so it may be hard for others to spot it. It's located upstairs and I really enjoyed the window view from the seats! We ordered the octopus stone bibim + mushroom tofu soup (medium). The octopus stone bibimbap was good. The side dishes were honestly too salty so didnt really touch them. It was super hot that day so i advise them to get an AC because customers are most likely going to be sweating while eating spicy hot food. Other than that, not bad!"
    },
    {
        "id": 168,
        "text": "I bimbimbap that was already mixed, loved the flavor i just added a little bit of soy sauce because i like salty thing but I highly recommended."
    },
    {
        "id": 169,
        "text": "The place is very very small and cute. The service is pretty quick. The food was good. All of this cost a little over $34 and it was pretty filling for two people. The soup was very meaty and great. \n\nThe menu is limited but that's great if you are  indecisive. It's definitely better than the ones down town but around the same price. The bibimbap stone pot was very good and fresh!"
    },
    {
        "id": 170,
        "text": "I stopped BAP one random walk to Whole Foods because it looked like a nice little joint with a good review rating. \nWhat I found was that this place was a nice little mom and pop joint where there was a sense of simple foods but in a contemporary area.\nI've had my fare share of korean food while in philly, Los Angeles, New York and houston.\nHonestly speaking. . . It is a standard price for korean food. A little higher than other joints. In all I spent over 15 dollars for a bowl of beef bibimpop and veggie pancake.\nFirst the pancake. I didn't like that it was very eggy compared to all that I have tried. It lacked crispness and it lacked. . . Flavor. It was as if it was reheated, although I'm not sure. It wasn't hot and it wasn't crunchy and it wasn't tasty.\nAs for my bibimpop I wasn't impressed. It was very standard for 11 bucks. The veggies were assorted and it tastes exactly what it looks like, if you want the crispy bowl it jacks up to 12 bucks. I've been to many joints and I would say this caters to the not so asian crowd."
    },
    {
        "id": 171,
        "text": "Very tasty bibimbap in a cozy one man shop - the ingredients are well prepared. The process is a bit confusing because you're not sure if you just sit down or walk to the register but I always recommend going up to order and he will serve you. The beef bibimbap was very satisfying and delicious. Perfect for when you don't want to eat anything heavy but still want substance."
    },
    {
        "id": 172,
        "text": "Great place for healthy take-out food. The bibimbap has great ingredients, great taste without being over-salted or over condimented. This feels like Korean home-made food."
    },
    {
        "id": 173,
        "text": "BAP is great home Korean cooking. The owner is courteous and kind. I'm partial to the vegetable and tofu bibimbap, which always contains a fresh array of veggies with a perfectly cooked egg on top. If I lived closer, I'd be here more often. The cinnamon tea is also delicious! Eat here!"
    },
    {
        "id": 174,
        "text": "Great place for a quick stop for some good bibimbap!\nI had the beef bibimbap. It tasted good! The egg was a little overdone and it was a bit cold (not served in a hot stone bowl) but overall, it was delicious and at $8, it's awesome for the price!\nThe service is very friendly!\nFood is fast, cheap, and delicious.\nI will definitely be back!"
    },
    {
        "id": 175,
        "text": "This is bibimbap like my Korean grandma makes it. I highly recommend. Excellent food. I also had the yukaejang and that was yummy too."
    },
    {
        "id": 176,
        "text": "Do you know how hard it is to find decently priced Dolsot Bibimbap?! Why does this city insist on $16 rice and vegetables with the possibility of meat? BAP, you are truly a gift from heaven for a girl trying to survive. From the sleek, barebones menu to the presentation, to giving me the option to add as much gochujang as I want at my table, to taking credit cards, I am so happy this place exists. Now, it was pretty empty when I went, but it seems like they are surviving from Uber Eats. \n\nMy -only- critique is that dolsot bibimbap is better with a raw egg rather than pre-fried, so I'm going to try that special request next time I stop by. Other than that, the staff is very friendly, the atmoshpere is pretty cozy, and the food comes pretty fast. \n\nBut I would recommend you skip on the pajeon: it's not that great and it's all about the stone rice bowl burning your mouth for an hour."
    },
    {
        "id": 177,
        "text": "This place has a great Yelp reviews, but after having dinner here I would not give it four-star at all.  We ordered the Daily specials of Shrimp Pancake and Japchae. The Pancake served with six tiny slices at $6.95  was pretty pricy and could not really taste any shrimp inside. Japchae does not have any protein and it was priced at $9.95. The rest of the party ordered Beef Bibimap, and it was decent. \nOverall, the food here was over-prices for what they served."
    },
    {
        "id": 178,
        "text": "Pretty good. 4 stars because this was my first time having bibimbap. But I have become a fan."
    },
    {
        "id": 179,
        "text": "This place offers a simplistic and straight to the point Korean bibimbap experience. The food is fantastic, prices super reasonable and service very fast. And the best part may just be the owners who may be the most pleasant people in the city. Highly recommend checking out BAP."
    },
    {
        "id": 180,
        "text": "I am especially appreciative of restaurants and small businesses for still providing us delicious food even during this crazy time. Ordering by phone was quick and easy, and the contact-free payment + pickup with the owner was smooth and friendly. We were hungry after a day of shopping, and BAP hit the spot! Ordered a beef and tofu bibimbap. The veggies were fresh and diverse, the sauce tucked away in a corner of the takeout container, and the protein well cooked and tasty. I liked the pickled cucumbers provided as well! I do wish there were more vegetables/protein to balance out the hefty portion of rice. Otherwise, grateful to BAP for a nice home-y meal in these trying times :)"
    },
    {
        "id": 181,
        "text": "Good flavor. The shredded beef soup had no beef in it, just onions and leek in a tasty broth. The beef mains was really light on beef as well. Chicken mains wasn't as light but still not that much. It seems like they're trying to keep their prices low by using less meat but I'd rather pay more and enjoy the flavor they bring."
    },
    {
        "id": 182,
        "text": "A perfect, intimate place to get a bite of authentic Korean food! I came on a weekday evening for dinner. There are many people ordering takeout, but I sat in an ordered the dolsot (stone pot) chicken bibimbap. The menu is simple, and specializes in bibimbap, as the name indicates. The ingredients are all so fresh and there is the perfect amount of sauce pre mixed in. The owner, Francis, is so gracious and I am excited to come back."
    },
    {
        "id": 183,
        "text": "This place has a great Yelp reviews, but after having dinner here I would not give it four-star at all.  We ordered the Daily specials of Shrimp Pancake and Japchae. The Pancake served with six tiny slices at $6.95  was pretty pricy and could not really taste any shrimp inside. Japchae does not have any protein and it was priced at $9.95. The rest of the party ordered Beef Bibimap, and it was decent."
    },
    {
        "id": 184,
        "text": "Yummy yummy in my tummy. Bibimbap so delicious, give me more chances to eat these dishes. Veggie, tofu, chicken or beef; dang these bowls good beyond belief. The veggie pancake is worth a taste, get over there and try it, make haste."
    },
    {
        "id": 185,
        "text": "Kudos for being open in the snow. This is my second time here. I pass it by on my way home from work and frequently tell myself that getting takeout is not a good idea. I've only had the beef bibimbap and it leaves we very satisfied. The food is made fresh and full of flavor. I would like to try the japache next time. Craving some beef after shoveling my car. The owner is super friendly and it's so nice to have this place a block away from my house."
    },
    {
        "id": 186,
        "text": "My fav Bibimbap in the city! I never had bibimbap before coming to this place, and now I'm hooked. They don't have a lot of choices on the menu, but the items they do have will not disappoint. Never too busy, great food."
    },
    {
        "id": 187,
        "text": "Small, lowkey place to get a good Korean meal for a reasonable price. Very clean place as well. With so many unhealthy/cheesesteak options around on South Street, we really appreciated all the veggies and the kind staff!"
    },
    {
        "id": 188,
        "text": "Great hole in the wall on South Street. A few dollars to expensive for my chicken meal, but it was still very flavorful: sweet, tangy, and spicy (the bowl was missing some crunch, however). Good combo. Chicken meat was processed, so that was a shame. And there probably wasn't enough sauce. But as I was thinking--this is a little overpriced and lacking in a few areas--I had gobbled it all down. Actually delicious, even though it could be a bit cheaper."
    },
    {
        "id": 189,
        "text": "Not great, not bad.  I ordered the beef dolsot bimbimbap.  Skip the dolsot if you are expecting the rice to get crispy - it doesn't.  Small portion, light on the meat, but it tasted okay.  We ate in, but I think due to this damn covid thing, we didn't get any banchan.\nIf I came back here, I would probably go for just the veggie bimbimbap - a better value for the money."
    },
    {
        "id": 190,
        "text": "Nice quaint little hole in the wall for the basic Bibimbap or jap chae. Extremely small menu but overall quality was okay. Portion size it was filling not over the top but enough to be full. \n\nPrice was moderate. Shrimp pancake, beef Bibimbap and soondobu soup was about $36 for the two of us. \n\nNormally the Bibimbap is separate and I would mix it myself but in this case they mixed it for me before I got it...so it'll get an average rating..."
    },
    {
        "id": 191,
        "text": "Was in the area and checked Yelp for some good eats. Came across this place. I didn't even know there was a bibimbap specialty place nearby.\n\nI kind of like the concept of a stand alone bibimbap place. The dining area of the restaurant isn't currently open, so you can call in an order or walk up. I walked up and ordered and received my food relatively quickly.\n\nI ordered the dolsot bibimbap with beef. I didn't know how the dolsot bibimbap was made without the stone bowl, which usually cooks the rice while your eating, so you can a nice crust around your rice towards the end of your meal. Basically the dolsot bibimbap to go was mimicking that experience with frying the ingredients before serving. At first, I thought the portion size was a bit small, but after eating it, I was surprised how filling it was. The gochujang or hot sauce was mixed in. The food was cooked well and it tasted great. It had a good amount of spice.\n\nThe only compaint I had about this place was that it's a bit pricey for my specific order. It was close to $14 for a relatively small rice dish. Maybe next time I may order a dish without the dolsot ($1) and beef ($3) upgrade and see how it is. The vegetable bibimbap seems decently priced at $8.95."
    },
    {
        "id": 192,
        "text": "I really, really wanted to like BAP, but at the end of the day, even the small hole-in-the wall, owned by elderly couple with small decorations and limited menu could not rescue the establishment from a 4-star review.\n\nThe biggest disappointment for BAP is the food, which is tragic. I love Korean food, and I fancy Bibimbap and korean pancakes. However, both versions at BAP were just a few notes short. The pancakes were dry and thick and fairly bland. The bibimbap, granted we got the regular version (non hot pot), was served almost at cool-room temperature without any close attention to how the flavors and texture coexisted with each other. The Japchae (noodle) was the greatest disappointment as it was served with a larger and too generous portion of white rice without any other sustenance. \n\nObjectively, the food was underwhelming, but if you take in the whole picture, the small and unassuming quaint place settings, you'd have a good time.\n\nFood: 2-3 stars\nAmbiance: 4 stars\nService: 3 stars\nPrice: 3 stars"
    },
    {
        "id": 193,
        "text": "Pro:  A simple answer to the complex question of \"where can I get good Korean food?\". BAP's modest menu boasts options that will satisfy even the most calibrated Korean-centric tastebuds. Both the Chicken Bibimbap and the Japchae will stick to your ribs. Delicious!!!\n\nCon:  Finding parking on South St. is a less-than-amazing adventure. Also, BAP has a total of 12 seats in the entire establishment. Bring a friend, maybe two. But that's about it. Anything past that, it's too close for comfort to your neighbors. \n\nBottom Line:  The food is worth the tight squeeze to get there!"
    },
    {
        "id": 194,
        "text": "Tldr; Homey Korean food with a limited menu. If you want bibimbap cheaply, this is for you!\n\nThis place only serves bibimbap, pajeon, a soup, and japchae. Truly bare bones menu, with no banchan (side dishes) served. Additionally, there's limited seating -- maybe like 15 people tops? \n\nBut what they make, they make well and cheaply! My stone bowl beef bibimbap set me back ~$8-9, and it was delicious. \n\nThis bibimbap is a little different from others in that the spicy red sauce that usually comes on the side is actually premixed in stone bowl bibimbap. This means it's a little spicier than normal bibimbap. The regular (non stone bowl) bibimbap has plain rice. \n\nOverall, I'm pleased with the service (the elderly couple that run this place seem so cute!) and I'll be back again. Credit cards are accepted."
    },
    {
        "id": 195,
        "text": "So expensive for what it is! I am surprised at all the high star reviews. I got the beef bibimbop and was disappointed at the quantity and the quality. I got take out and the portion was small. The ingredients didn't even fill to the brim and they even skimped on the rice. \n\nThe dish just tasted \"too homemade\" to me but NOT homemade in a good way. It tasted \"homemade\" like it was made by a cook that had only okay culinary skills (not homemade like your grandma's cooking). It lacked flavor and presentation. The rice was too sticky. The veggies looked limpy and tasted boring (blocky stir-fried cucumbers pieces, carrots not meticulously julienned, spinach just boiled but not seasoned). The beef pieces weren't even restaurant quality, not tender at all. The gochujang was the same stuff you can buy from the Korean super market with sesame seeds sprinkled on top. I could probably make the same at home fairly easily using only oil, salt, and sesame seeds as seasoning and no advanced marinades, special sauces, or knife skills.\n\nIt didn't taste terrible, but it was underwhelming compared to bibimbop I've had at other Korean restaurants. I don't know about you but I eat out to experience dishes I cannot recreate (or would take significant effort to recreate) at home. For what you get, they should just charge $6 for a plain boxed lunch, not $10!\n\nThe cinnamon iced tea is also nothing to rave about. It just tastes like weak homemade generic green tea with cinnamon dumped in. The cinnamon doesn't even compliment the tea! $3 a bottle, too! In case you were wondering, unsweetened. Unsweetened cinnamon tastes disgusting/pointless, at least sweeten your damn tea.\n\nI feel like this place is trying too hard to have that specialty/gourmet mom-and-pop feel, marketed towards boogie hipster patrons but the quality/creativity is just not there. I feel super ripped off!\n\nDon't come here because it \"looks cute\" or because you like \"hole in the wall\" restaurants. Usually hole in the wall restaurants serve brilliant food but this one is not one of them. \n\nP.S. I put a photo of the food on my Facebook (like I always do with restaurant foods) and my foodie Korean friend said \"This is from BAP? Oh man ouch...\" I feel ashamed. For once no one was jealous of my food pic because it didn't look that good."
    },
    {
        "id": 196,
        "text": "Love this place. Great food, exceptional service, clean little restaurant. I can't recommend it highly enough"
    },
    {
        "id": 197,
        "text": "Got this during COVID takeout season. Clean, fast, and healthy. With a varied blend of vegetables, choice if meat, egg and sauce with rice for the bibimbap, the dish is a solid go to for something light and refreshing. The only minus is that the portion is not terribly hefty for the price point but given the pandemic, definitely willing to support local businesses. Would recommend though if in the area and are in the mood for a casual lunch!"
    },
    {
        "id": 198,
        "text": "Great place with incredible genuine food and a hard working man running the place. I highly recommend coming here for the best Korean food and supporting this family."
    },
    {
        "id": 199,
        "text": "NOTE: I would rate this place 3.5 stars but Yelp doesn't give 0.5 stars.\n\nThis place is a very small restaurant with very limited menus, but as an one-time customer, there were definitely enough choices to choose from. I got the vegetable bibimbap. The food came very quickly and even though at first glance, it looked very little, it was actually quite filling. There was a good ratio of vegetable to rice and the sauce was definitely a good kick of flavour. The staff was very nice. \n\nThe only downside was that it was pretty expensive for just one bowl of rice. I know it was a bit cheaper than other places that serve bibimbap by around ~$1-2 but there were no side dishes served at this place, which I thought made the price not as worth it even if it was cheaper by a bit.\n\nHowever, if you want a quick bite, this place is the one for you."
    },
    {
        "id": 200,
        "text": "Very cute little spot run by a hardworking old man with authentic beep n bop with good gochujang sauce."
    },
    {
        "id": 201,
        "text": "BOTTOM LINE: eat here! Short menu with reliable reliable tasty Korean staple dishes. The owner is so nice and thoughtful and I'm so glad we are close enough to eat here at least once a week! A total understated find for south street area Asian food!"
    },
    {
        "id": 202,
        "text": "I can't express my love for this place enough. I hadn't had much bibimbap before I moved to Philly in 2016 and lived across the street from here for two years. I initially saw the place was highly rated so I went to check it out and what's not to like? Rice, choice of protein, veggies, fried egg, etc... it's a healthy and complete meal. Since I've left Philly, I haven't found bibimbap anywhere else in the US that's been as good. It's genuinely exceptional, whether you opt for the stone pot (dolsot) or not. \n\nBut the real kicker here isn't just the amazing food- it's the man behind it all. Francis is special- he's a great chef but an even better person. By running this restaurant, he's helped put his daughter through college and grad school, and supported his family altogether. I'm so happy to see all his hard work paying off! After over 3 years of not seeing each other once I moved, he remembered me as soon as I walked in today. \n\nBottom line- if you're looking for the best bibimbap on the east coast, look no further than here. And if you love great food made by great people, this is the place for you. To Francis (if you see this), keep being a role model my friend!"
    },
    {
        "id": 203,
        "text": "I go there at least once a week when I crave Korean food! Bi-Bim-Bap has always been one of my favorite Korean food and I'm so happy that this place is near by where I live. Service is really quick and the owners are very kind! Mainly the food is very good. I tried their chicken and beef bi-bim-bap and they are amazing! I also had their yuk gae jang, seafood pancakes, and jap chae and they are all good! Highly recommended! Def a hidden gem!"
    },
    {
        "id": 204,
        "text": "Great food, great service. Simple and accessible menu. The specialty is in mixed rice dishes."
    },
    {
        "id": 205,
        "text": "I picked up tofu bibimbop to go, and it was pretty good! Very healthy, good sauce. I would say half the dish was rice, so I would have preferred additional veggies. Apart from that, it was tasty! I wish they had spicy pork bibimbop! They take credit cards now too."
    },
    {
        "id": 206,
        "text": "I received a great big bowl filled with fresh vegetables, spicy sauce, and a perfect over easy egg. Extraordinarily quick service, under three minutes to get my order. It's a great place for a quick healthy bite."
    },
    {
        "id": 207,
        "text": "I'm originally from Los Angeles, so I am accustomed​ to eating amazing Korean food from K-town. \n\nThis place hits the spot whenever I am craving for bibimbap​! I always order the chicken bibimbap​​ on a stone plate; it's just too good! It's a mom and pop shop, so the owners are always there whenever I come in, and they are honestly the nicest people ever! I always order the same thing, so whenever I walk in, they already know what I want! That's what I call some loyal customer service. \n\nI 100% recommend trying this place out if you're in the mood for bibimbap!​​"
    },
    {
        "id": 208,
        "text": "Visited BAP for.the first time, as I love this dish and usually get it from another restaurant. I had high hopes based on the reviews. Here is the verdict-gross. The chicken didn't resemble chicken and the vegetables were bland. The best way to describe the chicken would be slimy....almost like it came from a can. Maybe the food used to be good and the quality has declined. Don't know. Couldn't even eat it."
    }
]